{"id":"25JnLB7bCaiYJ","title":"Tech News","displayTitle":"Tech News","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":61,"items":[{"title":"DeepSeek ‘punctures’ tech spending plans, and what analysts are saying","url":"https://techcrunch.com/2025/01/27/deepseek-punctures-tech-spending-plans-and-what-analysts-are-saying/","date":1737975583,"author":"Manish Singh","guid":159,"unread":true,"content":"<p>Chinese AI firm DeepSeek has emerged as a potential challenger to U.S. AI leaders, demonstrating breakthrough models that claim to offer performance comparable to leading chatbots at a fraction of the cost. The company’s mobile app, released in early January, has also topped iPhone charts across major markets including the U.S., UK, and China. Founded […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":424,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"TalkTalk investigating data breach after hacker claims theft of customer data","url":"https://techcrunch.com/2025/01/27/talktalk-investigating-data-breach-after-hacker-claims-theft-of-customer-data/","date":1737970733,"author":"Carly Page","guid":158,"unread":true,"content":"<p>A hacker claims to be selling the data of 18.8 million TalkTalk customers, but the telecoms giant says this figure is ‘significantly overstated’</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":211,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Internet-Connected 'Smart' Products for Babies Suddenly Start Charging Subscription Fees","url":"https://slashdot.org/story/25/01/27/0455205/internet-connected-smart-products-for-babies-suddenly-start-charging-subscription-fees?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737966840,"author":"EditorDavid","guid":239,"unread":true,"content":"The EFF has complained that in general \"smart\" products for babies \"collect a ton of information about you and your baby on an ongoing basis\". (For this year's \"worst in privacy\" product at CES they chose a $1,200 baby bassinet equipped with a camera, a microphone, and a radar sensor...) \n\nBut today the Washington Post reported on a $1,700 bassinet that surprised the mother of a one-month-old when it \"abruptly demanded money for a feature she relied on to soothe her baby to sleep.\"\n\nThe internet-connected bassinet... reliably comforted her 1-month-old — just as it had her first child — until it started charging $20 a month for some abilities, including one that keeps the bassinet's motion and sounds at one level all night. The level-lock feature previously was available without a fee. \"It all felt really intrusive — like they went into our bedroom and clawed back this feature that we've been depending on....\" When the Snoo's maker, Happiest Baby, introduced a premium subscription for some of the bassinet's most popular features in July, owners filed dozens of complaints to the Federal Trade Commission and the Better Business Bureau, coordinated review bombs and vented on social media — saying the company took advantage of their desperation for sleep to bait-and-switch them... \n\nHappiest Baby isn't the only baby gear company that has rolled out a subscription. In 2023, makers of the Miku baby monitor, which retails for up to $400, elicited similar fury from parents when it introduced a $10 monthly subscription for most features. A growing number of internet-connected products have lost software support or functionality after purchase in recent years, such as Spotify's Car Thing — a $90 Bluetooth streaming device that the company announced in May it plans to discontinue — and Levi's $350 smart jacket, which let users control their phones by swiping sensors on its sleeve... \n\nSeventeen consumer protection and tech advocacy groups cited Happiest Baby and Car Thing in a letter urging the FTC to create guidelines that ensure products retain core functionality without the imposition of fees that did not exist when the items were originally bought. \n\nThe Times notes that the bassinets are often resold, so the subscription fees are partly to cover the costs of supporting new owners, according to Happiest Baby's vice president for marketing and communications. But the article three additional perspectives:\n\n\"This new technology is actually allowing manufacturers to change the way the status quo has been for decades, which is that once you buy something, you own it and you can do whatever you want. Right now, consumers have no trust that what they're buying is actually going to keep working.\" — Lucas Gutterman, who leads the Public Interest Research Group's \"Design to Last\" campaign.\n \"It's a shame to be beholden to companies' goodwill, to require that they make good decisions about which settings to put behind a paywall. That doesn't feel good, and you can't always trust that, and there's no guarantee that next week Happiest Baby isn't going to announce that all of the features are behind a paywall.\" — Elizabeth Chamberlain, sustainability director at iFixit.\n\"It's no longer just an out-and-out purchase of something. It's a continuous rental, and people don't know that.\" — Natasha Tusikov, an associate professor at York University","contentLength":3400,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Should Big Tech Plug Its Data Centers Directly Into Power Plants?","url":"https://hardware.slashdot.org/story/25/01/27/0539219/should-big-tech-plug-its-data-centers-directly-into-power-plants?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737957360,"author":"EditorDavid","guid":238,"unread":true,"content":"\"Looking for a quick fix for their fast-growing electricity diets, tech giants are increasingly looking to strike deals with power plant owners to plug in directly,\" reports the Associated Press, \"avoiding a potentially longer and more expensive process of hooking into a fraying electric grid that serves everyone else.\" (It can take up to four years to connect a data center to the grid, one data center trade group says in the article — years longer than it takes to build a new data center.) \n\nBut the idea of bypassing the grid is \"raising questions over whether diverting power to higher-paying customers will leave enough for others and whether it's fair to excuse big power users from paying for the grid.\"\n\nFront and center is the data center that Amazon's cloud computing subsidiary, Amazon Web Services, is building next to the Susquehanna nuclear plant in eastern Pennsylvania. The arrangement between the plant's owners and AWS — called a \"behind the meter\" connection — is the first such to come before the Federal Energy Regulatory Commission. For now, FERC has rejected a deal that could eventually send 960 megawatts — about 40% of the plant's capacity — to the data center. That's enough to power more than a half-million homes... [But the FERC's 2-1 rejection \"was procedural. Recent comments by commissioners suggest they weren't ready to decide how to regulate such a novel matter without more study.\"] \n\nIn theory, the AWS deal would let Susquehanna sell power for more than they get by selling into the grid... The profit potential is one that other nuclear plant operators, in particular, are embracing after years of financial distress and frustration with how they are paid in the broader electricity markets. Many say they have been forced to compete in some markets against a flood of cheap natural gas as well as state-subsidized solar and wind energy. Power plant owners also say the arrangement benefits the wider public, by bypassing the costly buildout of long power lines and leaving more transmission capacity on the grid for everyone else... \n\nMonitoring Analytics, the market watchdog in the mid-Atlantic grid, wrote in a filing to FERC that the impact would be \"extreme\" if the Susquehanna-AWS model were extended to all nuclear power plants in the territory. Energy prices would increase significantly and there's no explanation for how rising demand for power will be met even before big power plants drop out of the supply mix, it said.","contentLength":2487,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The 'Super Bowl for Nerds': Scenes from the Microsoft Excel World Championship","url":"https://tech.slashdot.org/story/25/01/27/0355223/the-super-bowl-for-nerds-scenes-from-the-microsoft-excel-world-championship?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737950280,"author":"EditorDavid","guid":237,"unread":true,"content":"At December's \"Microsoft Excel World Championship\" in Las Vegas, \"finance professionals fluent in spreadsheets were treated like minor celebrities,\" writes the New York Times, \"as they gathered to solve devilishly complex Excel puzzles in front of an audience of about 400 people, and more watching an ESPN3 livestream.\" \n\nThe Times notes that \"many fans find out about the Excel championship through ESPN's annual obscure sports showcase, where it is sandwiched between competitions like speed chess and the World Dog Surfing Championships.\" But the contest's organizer envisions tournaments with \"more spectators, bigger sponsors and a million-dollar prize\" — even though this year's prize was $5,000 and a pro wrestling-style championship belt.\n\nThe format for the finals was a mock-up of World of Warcraft, an online role-playing game. It required the 12 men (this particular nerdfest was mostly a guy thing) to design Excel formulas for tracking 20 avatars and their vital signs... To prepare, [competitor Diarmuid] Early adjusted the width of his Excel columns with the precision of a point guard lining up a 3-point shot. [Andrew] Ngai queued up a YouTube compilation of \"focus music\". After an announcer kicked off the 40-minute event — \"Five, four, three, two, one, and Excel!\" — the 12 players leaned over their keyboards and began plugging in formulas. One example: \"=CountChar (Lower (D5),\"W\")\" allowed one competitor, Michael Jarman, to figure out how many times the letter \"W\" appeared in a spreadsheet. \n\n\nZDNet points out that there's a seven-hour livestream of the event that's \"worth checking out for the opening theme song alone.\" \n\nThe New York Times closes their article with a quote from super-fan Erik Oehm, a software developer from San Francisco who called the event \"the Super Bowl for Excel nerds\". Oehm watched excitedly from the front row as this year's winner — Michael Jarman — finally raised the championship belt overhead while someone dumped glitter on him. And then he said... \n\n\"You'd never see this with Google Sheets. You'd never get this level of passion.\"","contentLength":2105,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Another Undersea Cable Damaged in Baltic Sea. Criminal Sabotage Investigation Launched","url":"https://tech.slashdot.org/story/25/01/27/0140243/another-undersea-cable-damaged-in-baltic-sea-criminal-sabotage-investigation-launched?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737942420,"author":"EditorDavid","guid":236,"unread":true,"content":"\"An underwater data cable between Sweden and Latvia was damaged early on Sunday,\" reports the Financial Times, \"in at least the fourth episode of potential sabotage in the Baltic Sea that has caused concern in Nato about the vulnerability of critical infrastructure...\"\n\n\tCriminal investigations have started in Latvia and Sweden, and a ship has been seized as part of the probes, according to Swedish prosecutors, who did not identify the vessel. Previous incidents have been linked to Russian and Chinese ships... \n\n\tThe latest incident comes as the three Baltic states are preparing to disconnect their electricity systems from the former Soviet network in early February and integrate themselves into the continental European grid, with some fearing further potential disruption ahead of that. Estonia, Latvia and Lithuania have joined the EU and Nato since regaining their independence after their forced annexation by the Soviet Union, and see their switch to the European electricity system as their final integration into the west. KÄ(TM)stutis Budrys, Lithuania's foreign minister, said navigation rules in the Baltic Sea needed to be reviewed \"especially when it comes to the use of anchors\" and added there were now so many incidents that there was little chance they could all be accidents. \n\n\tRepair of data cables has tended to take much less time than that for gas or electricity connections, and the Latvian state radio and television centre said it had found alternative routes for its communications.","contentLength":1519,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Microsoft Announces Open-Source DocumentDB NoSQL Database","url":"https://www.phoronix.com/news/Microsoft-OpenSource-DocumentDB","date":1737942060,"author":"Michael Larabel","guid":655,"unread":true,"content":"<article>In a blog post dated for this past Thursday but only being made public on Sunday night, Microsoft issued an announcement open-sourcing their new NoSQL database... Where it gets weirder is that it's named DocumentDB. Amazon also has a database offering named DocumentDB albeit proprietary...</article>","contentLength":290,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.14 To Switch From SHA1 To SHA512 For Module Signing By Default","url":"https://www.phoronix.com/news/Linux-6.14-Modules","date":1737941251,"author":"Michael Larabel","guid":654,"unread":true,"content":"<article>While many Linux distribution vendor kernels are already using SHA-512 for signing modules by default rather than the default SHA-1,  the upstream Linux 6.14 kernel is also now switching the default over to using SHA-512 for better security...</article>","contentLength":243,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A New Bid for TikTok from Perplexity AI Would Give the US Government a 50% Stake","url":"https://tech.slashdot.org/story/25/01/26/2316243/a-new-bid-for-tiktok-from-perplexity-ai-would-give-the-us-government-a-50-stake?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737936240,"author":"EditorDavid","guid":235,"unread":true,"content":"An anonymous reader shared this report from the Associated Press:\n\n Perplexity AI has presented a new proposal to TikTok's parent company that would allow the U.S. government to own up to 50% of a new entity that merges Perplexity with TikTok's U.S. business, according to a person familiar with the matter... The new proposal would allow the U.S. government to own up to half of that new structure once it makes an initial public offering of at least $300 billion, said the person, who was not authorized to speak about the proposal. The person said Perplexity's proposal was revised based off of feedback from the Trump administration. If the plan is successful, the shares owned by the government would not have voting power, the person said. The government also would not get a seat on the new company's board. \n\nUnder the plan, ByteDance would not have to completely cut ties with TikTok, a favorable outcome for its investors. But it would have to allow a \"full U.S. board control,\" the person said. \n\nUnder the proposal, the China-based tech company would contribute TikTok's U.S. business without the proprietary algorithm that fuels what users see on the app, according to a document seen by the Associated Press.","contentLength":1222,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Biometrics, Windmills, and VHS tapes: The Winners of 'Rest of World' International Tech Photo Contest","url":"https://tech.slashdot.org/story/25/01/26/231212/biometrics-windmills-and-vhs-tapes-the-winners-of-rest-of-world-international-tech-photo-contest?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737932640,"author":"EditorDavid","guid":234,"unread":true,"content":"Since launching in 2020, the nonprofit site RestofWorld.org has been covering tech news from 100 countries. And they've just announced the winners in their 2024 international photography contest. \n\n\"From Cape Verde to Bhutan, we received 227 entries from over 45 countries around the world, featuring everything from sprawling mines to biometric facial scans.\"\n\nLike last year, the majority of the entries in our 2024 photography contest captured on-the-ground realities of how technology is transforming lives in every corner of the world. We received submissions from over 45 countries, showcasing a stunning variety of perspectives on the intersection of technology and daily life. \n\nBeyond striking visuals, the photographs tell us stories of how tech plays a role in local communities, from iris-scanning payment systems inside refugee camps to EV battery-powered music gatherings. The 227 entries we received from contestants — including from Mongolia, the Philippines, Argentina, and Jordan — not only celebrate these stories but reaffirm our commitment at Rest of World to challenge stereotypes about how people use technology in their daily lives. \n\nAn \"honorable mention\" photo shows immigrants from Africa arriving on the Italian island of Lampedusa after a perilous boat journey. (\"Upon their arrival, these refugees borrowed a smartphone from a bystander and started a video call to let their relatives know they survived the journey.\") And the top photo shows a U.S. Customs and Border Protection agent using a cellphone to collect facial scans from migrants entering the country from Mexico. (\"After they make the crossing into the U.S., migrants are subjected to further data collection, including DNA samples.\") \n\nBiometric data collection was a recurring theme. A photo from Jordan shows a Syrian boy paying for groceries with an iris scanner at a supermarket \"run jointly by the World Food Programme and the U.N. High Commissioner for Refugees.\" Eye-scanning technology is being used there \"to ensure people use only their own credit and not borrowed or stolen cards. After having their iris scanned, Syrian refugees living in the camp can make use of services such as health care and shopping, using just their eyes.\" \n\nAnother recurring theme was energy. There's a lovely \"honorable mention\" photo from the Philippines showing two young people on a beach playing basketball \"under the towering blades of the windmills in Bangu... Renewable energy has transformed this community, cutting household expenses and powering opportunities once thought to be out of reach.\" The third-place photo shows six children in a distant tent in \"a mountainous, subarctic forest\" in Mongolia\" — all gathered around a laptop \"to watch a documentary about a Norwegian reindeer herder\" who had visited their region. (\"Modern technology such as solar panels, car batteries, and the occasional Wi-Fi connection allows these families to stay connected with the world.\") One photo shows a young boy carrying a solar panel down from the roof in a remote village in Jharkhand, India. \n\nAnother photo documents the largest salt flat in Argentina, part of the so-called \"lithium triangle\" with parts of Chile and Bolivia. A salt miner says \"They started looking for lithium there in 2010. We made them stop; it was hurting the environment and affecting the water. But now they are back and I am afraid. Everything we have could be lost.\" \n\nAnd a photo from Nigeria shows two people wearing traditional African attire but adorned with \"goggles crafted from repurposed VHS tapes\". RestofWorld says the goggles \"represent how individuals and communities reclaim and reinterpret technology for art, commentary, and resilience. This practice reflects a community's ability to find new life in what others might discard, highlighting a deep relationship with both old and new technologies.\"","contentLength":3883,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Perplexity submits a new bid for TikTok","url":"https://techcrunch.com/2025/01/26/perplexity-submits-a-new-bid-for-tiktok/","date":1737929763,"author":"Anthony Ha","guid":157,"unread":true,"content":"<p>Perplexity AI has submitted a revised proposal to merge with TikTok, in an arrangement that would give the U.S. government up to 50 percent ownership of the new entity. The Associated Press first reported on the new proposal. A source with knowledge of the bid confirmed to TechCrunch that the AP’s reporting is accurate. The […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":396,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Bad Week for Unoccupied Waymo Cars: One Hit in Fatal Collision, One Vandalized by Mob","url":"https://tech.slashdot.org/story/25/01/26/2150209/bad-week-for-unoccupied-waymo-cars-one-hit-in-fatal-collision-one-vandalized-by-mob?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737928320,"author":"EditorDavid","guid":233,"unread":true,"content":"For the first time in America, an empty self-driving car has been involved in a fatal collision. But it was \"hit from behind by a speeding car that was going about 98 miles per hour,\" a local news site reports, citing comments from Waymo. (\"Two other victims were taken to the hospital with life-threatening injuries. A dog also died in the crash, according to the San Francisco Fire Department.\") \n\nWaymo's self-driving car \"is not being blamed,\" notes NBC Bay Area. Instead the Waymo car was one of six vehicles \"struck when a fast-moving vehicle slammed into a line of cars stopped at a traffic light...\"\n\n\n The National Highway Traffic Safety Administration requires self-driving car companies, like Waymo, to report each time their vehicles are involved in an accident, regardless of whether the autonomous vehicle was at fault. According to NHTSA, which began collecting such data in July 2021, Waymo's driverless vehicles have been involved in about 30 different collisions resulting in some type of injury. Waymo, however, has noted that nearly all those crashes, like Sunday's collision, were the fault of other cars driven by humans. While NHTSA's crash data doesn't note whether self-driving vehicles may have been to blame, Waymo has previously noted that it only expects to pay out insurance liability claims for two previous collisions involving its driverless vehicles that resulted in injuries. \n\n\nIn December, Waymo touted the findings of its latest safety analysis, which determined its fleet of driverless cars continue to outperform human drivers across major safety metrics. The report, authored by Waymo and its partners at the Swiss Reinsurance Company, reviewed insurance claim data to explore how often human drivers and autonomous vehicles are found to be liable in car collisions. According to the study, Waymo's self-driving vehicles faced about 90% fewer insurance claims relating to property damage and bodily injuries compared to human drivers... The company's fleet of autonomous vehicles have traveled more than 33 million miles and have provided more than five million rides across San Francisco, Los Angeles, Phoenix and Austin... \n\nIn California, there are more than 30 companies currently permitted by the DMV to test driverless cars on the open road. While most are still required to have safety drivers sitting in the front seat who can take over when needed, Waymo remains the only fleet of robotaxis in California to move past the state's testing phase to, now, regularly offer paid rides to passengers. \n\nTheir article adds that while Sunday's collision marks the first fatal crash involving a driverless car, \"it was nearly seven years ago when another autonomous vehicle was involved in a deadly collision with a pedestrian in Tempe, Arizona, though that self-driving car had a human safety driver behind the wheel. The accident, which occurred in March 2018, involved an autonomous car from Uber, which sold off its self-driving division two years later to a competitor.\" \n\nIn other news, an unoccupied Waymo vehicle was attacked by a mob in Los Angeles last night, according to local news reports. \"Video footage of the incident appears to show the vehicle being stripped of its door, windows shattered, and its Jaguar emblems removed. The license plate was also damaged, and the extent of the vandalism required the vehicle to be towed from the scene.\" \nThe Los Angeles Times reminds its readers that \"Last year, a crowd in San Francisco's Chinatown surrounded a Waymo car, vandalized it and then set it ablaze...\"","contentLength":3561,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ARCTIC Freezer 4U-M Cooler For Ampere Altra 4U Servers/Workstations","url":"https://www.phoronix.com/review/arctic-freezer-4u-m-ampere","date":1737927967,"author":"Michael Larabel","guid":653,"unread":true,"content":"<article>For those looking for a heatsink fan to cool a custom build of an Ampere Altra / Altra Max server or workstation, the ARCTIC Freezer 4U-M ends up being a very potent option that offers similar performance to more expensive Ampere Altra heatsinks while providing similar performance.</article>","contentLength":282,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Spacecoin and the Space Business","url":"https://hackernoon.com/spacecoin-and-the-space-business?source=rss","date":1737927656,"author":"M-Marvin Ken","guid":281,"unread":true,"content":"<article>Spacecoin has launched its first satellite into space and the spacecoin token could be used to pay for internet and mobile payments. Challenging many centralized internet providers in this space. Also, Spacecoin’s airdrops will literally be air dropped.</article>","contentLength":255,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ditch the Blog: 5 Signs It's Not Worth It for Your Business","url":"https://hackernoon.com/ditch-the-blog-5-signs-its-not-worth-it-for-your-business?source=rss","date":1737925202,"author":"Valeriya Mingova","guid":280,"unread":true,"content":"<p>A corporate blog can become the voice of your brand and an effective communication channel. Or it can cause headaches, consume tons of time and budget, and yield zero results. Here are five reasons why you might not need a corporate blog after all.</p><p>Running a blog takes a lot of time. A corporate blog with content published several times a week requires at least one dedicated editor-content manager-coordinator who chases everyone down and pushes them to share material. And let’s face it—nobody wants to share material; they simply don’t have the time for an additional task.</p><p>\\\nUnlike one-off projects, a blog demands constant attention and regular updates. Employees who hold valuable information would need to dedicate 2 to 5 hours to a single piece of content (gathering information, searching for project data, getting approvals). If you’re not ready to invest that kind of work time from your key staff, don’t bother starting a blog. Haphazard and unpredictable blogging won’t yield results.</p><h2>Reason 2: No Way to Measure Effectiveness</h2><p>To determine whether a blog meets its objectives, you need to clearly define goals and the metrics to track.</p><p>\\\nAn in-depth analysis of each published post will reveal whether the topic resonates with readers, whether the content and format engage them, and whether it ultimately drives purchases. This means tracking metrics such as:</p><ul><li>Scroll depth (how many people view the entire post),</li><li>Completion rates (how many readers carefully read the post to the end),</li><li>Bounce rates (visitors who leave within 10–15 seconds),</li><li>Audience loyalty (positive comments or shares).</li></ul><p>\\\nThese metrics collectively indicate the strength of the connection between the reader and the blog (and, by extension, the brand).</p><p>\\n If you don’t have analytics in place, clear goals, or someone to monitor these, don’t even start.</p><h2>Reason 3: Nobody Can Write</h2><p>Finding an experienced copywriter who writes well and understands business is a real challenge. If they can also analyze performance and handle edits without frustration, they’re a rare gem.</p><p>\\\nSuch rare gems often burn out, change jobs, or demand higher pay. Then you’re back to square one. And if the blog goes dormant while you search for replacements, it’s better not to start at all.</p><h2>Reason 4: No Understanding of Your Target Audience</h2><p>Without clear answers to the questions, “Why will people read this?” and “What problems should the blog solve?” it’s impossible to create relevant, engaging content that keeps readers coming back.</p><p>\\\nIf you’re starting a corporate blog “just because” or “because the competition has one,” don’t bother.</p><h2>Reason 5: Lack of Unique Content</h2><p>A good blog needs to feel \"alive,\" with content that sparks interest and doesn’t give the impression that everyone is writing about the same thing.</p><p>\\\nOf course, most topics you could address have already been covered on various platforms. Absolute originality in every post is tough to achieve, but you can find your unique approach.</p><p>\\\nBy the way, content uniqueness is a top priority for search engines too. So, this factor will also affect your blog’s ability to attract traffic.</p><h3>Tip 1: Treat Your Blog as a Platform for Experiments</h3><p>Instead of the traditional content strategy focused on SEO and promoting products and services, use the blog as a space for testing hypotheses. Each post can be more than just an article—it can be an experiment to test new ideas.</p><p>\\\nSome businesses may focus on publishing lead-generating materials, while others may use the blog to share knowledge and experiences.</p><h3>Tip 2: Think of the Blog as a Dynamic Product, Not a Static Resource</h3><p>Instead of treating the blog as a digital library that’s periodically updated, transform it into a dynamic resource. Content can take the form of micro-stories, reports, or emotional testimonials (yes, you know what we’re hinting at).</p><p>\\\nTitle: <em>Step 3: How We’re Improving Customer Service — A Live Update</em></p><p>\\\n“We often talk about the importance of customer service, but this time, we decided to show you the updates in real-time. Today, we’re launching a new feature: an interactive chat for quick assistance. Initial feedback has already prompted changes—yesterday we received 35 messages, 8 of which included suggestions we’ve started implementing on the fly. Stay tuned—next week, we’ll share where these first steps take us. We’d love your thoughts and ideas; after all, this is our project together.”</p><h3>Tip 3: A Blog Can Serve Both External and Internal Audiences</h3><p>A blog is a platform for building brand awareness—not just among customers, but also internally to strengthen corporate connections.</p><p>Involvement in creating blog content can act as a reward or non-monetary motivation: employees who write articles on behalf of the company position themselves as experts and develop their personal brands. In such cases, employees are likely to take the initiative themselves, and content from motivated authors is always more engaging and lively.</p><p>\\\nA blog can also attract potential hires. Use the platform to talk about life at the company, growth opportunities through \"success stories\" told in the first person, and the advantages of working in a professional team. Let the blog work for both sales and employer branding.</p><h3>Tip 4: Use the Blog as a Feedback Tool, Not Just for Promotion</h3><p>Make it a space for open dialogue with your audience. Use the blog to discuss challenges, share mistakes, and gather ideas from readers. This approach fosters two-way communication.</p>","contentLength":5520,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"DeepSeek gets Silicon Valley talking","url":"https://techcrunch.com/2025/01/26/deepseek-gets-silicon-valley-talking/","date":1737924577,"author":"Anthony Ha","guid":156,"unread":true,"content":"<p>Since Chinese AI company DeepSeek released an open version of its reasoning model R1 at the beginning of this week, many in the tech industry have been making grand pronouncements about what the company achieved, and what it means for the state of AI. Venture capitalist Marc Andreessen, for example, posted that DeepSeek is “one […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":400,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Cory Doctorow Asks: Can Interoperability End 'Enshittification' and Fix Social Media?","url":"https://tech.slashdot.org/story/25/01/26/2043253/cory-doctorow-asks-can-interoperability-end-enshittification-and-fix-social-media?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737924360,"author":"EditorDavid","guid":232,"unread":true,"content":"This weekend Cory Doctorow delved into \"the two factors that make services terrible: captive users, and no constraints.\"\n\n\nIf your users can't leave, and if you face no consequences for making them miserable (not solely their departure to a competitor, but also fines, criminal charges, worker revolts, and guerrilla warfare with interoperators), then you have the means, motive and opportunity to turn your service into a giant pile of shit... Every economy is forever a-crawl with parasites and monsters like these, but they don't get to burrow into the system and colonize it until policymakers create rips they can pass through. \n\nDoctorow argues that \"more and more critics are coming to understand that lock-in is the root of the problem, and that anti-lock-in measures like interoperability can address it.\"\n\nEven more important than market discipline is government discipline, in the form of regulation. If Zuckerberg feared fines for privacy violations, or moderation failures, or illegal anticompetitive mergers, or fraudulent advertising systems that rip off publishers and advertisers, or other forms of fraud (like the \"pivot to video\"), he would treat his users better. But Facebook's rise to power took place during the second half of the neoliberal era, when the last shreds of regulatory muscle that survived the Reagan revolution were being devoured... But it's worse than that, because Zuckerberg and other tech monopolists figured out how to harness \"IP\" law to get the government to shut down third-party technology that might help users resist enshittification... [Doctorow says this is \"why companies are so desperate to get you to use their apps rather than the open web\"] IP law is why you can't make an alternative client that blocks algorithmic recommendations. IP law is why you can't leave Facebook for a new service and run a scraper that imports your waiting Facebook messages into a different inbox. IP law is why you can't scrape Facebook to catalog the paid political disinformation the company allows on the platform...\n \nBut then Doctorow argues that \"Legacy social media is at a turning point,\" citing as \"a credible threat\" new systems built on open standards like Mastodon (built on Activitypub) and Bluesky (built on Atproto):\n\nI believe strongly in improving the Fediverse, and I believe in adding the long-overdue federation to Bluesky. That's because my goal isn't the success of the Fediverse — it's the defeat of enshtitification. My answer to \"why spend money fixing Bluesky?\" is \"why leave 20 million people at risk of enshittification when we could not only make them safe, but also create the toolchain to allow many, many organizations to operate a whole federation of Bluesky servers?\" If you care about a better internet — and not just the Fediverse — then you should share this goal, too... Mastodon has one feature that Bluesky sorely lacks — the federation that imposes antienshittificatory discipline on companies and offers an enshittification fire-exit for users if the discipline fails. It's long past time that someone copied that feature over to Bluesky. \nDoctorow argues that federated and \"federatable\" social media \"disciplines enshittifiers\" by freeing social media's captive audiences. \n\"Any user can go to any server at any time and stay in touch with everyone else.\"","contentLength":3342,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Silicon Valley Is In the Midst of an Ideological Battle That Nobody is Talking About","url":"https://hackernoon.com/silicon-valley-is-in-the-midst-of-an-ideological-battle-that-nobody-is-talking-about?source=rss","date":1737918007,"author":"Juan C. Guerrero","guid":279,"unread":true,"content":"<p><strong>There's a war happening in Silicon Valley.</strong> Not the kind with missiles and tanks, but one that will determine whether your children grow up in a world of digital freedom or algorithmic chains. </p><p>\\\nThe stakes couldn't be higher, and the battle lines couldn't be clearer.</p><p>\\\nOn one side stand the  - the Ross Ulbrichts, the Edward Snowdens, the Julian Assanges. Men who sacrificed everything to expose the truth, who chose principles over profit, liberty over comfort. These aren't your typical tech bros with their kombucha taps and meditation pods. These are digital warriors who looked at the machine and said: \"No more.\"</p><p>\\\nOn the other, tech's  - the Bill Gates and George Soros types who preach about saving humanity while building the very systems that enslave it. They fly private jets to climate summits. They build walls around their homes while advocating for open borders. They talk about misinformation while spreading their own narratives through bought-and-paid-for media outlets.</p><h2>The Battle Lines Are Drawn</h2><p>In 2021, Mark Zuckerberg was the perfect example of Silicon Valley's postmodern puppet - a hoodie-wearing technocrat who bent to every government censorship demand. Each congressional hearing brought a new apology, each media outcry a new algorithm tweak. The pattern was clear: bow, scrape, repeat.</p><p>\\\n<strong>Fast forward to his recent Joe Rogan appearance:</strong> a muscled, jiu-jitsu trained CEO talking about personal sovereignty and free speech. The transformation wasn't just physical - it was philosophical. The old Zuck would have dodged and weaved. The new one speaks about freedom with the clarity of someone who's finally woken up.</p><p>\\\n<strong>The pendulum of history swung back. Hard.</strong></p><p>\\\nWhen Elon Musk took over Twitter (now X), he didn't just buy a social media platform - he sparked a revolution. Community notes replaced fact-checkers. Open algorithms replaced shadow bans. </p><p>\\\nSuddenly, the tech elite had to choose: stand for freedom or cling to control. There was no middle ground left.</p><p>It's no coincidence that tech's freedom fighters share an intellectual lineage. From Ross Ulbricht's love of Austrian economics to Elon Musk's embrace of first principles thinking, there's a direct line to thinkers who championed individual liberty over collective control. </p><p>\\\nThese aren't just random beliefs - they're part of a coherent philosophical framework that values human agency over central planning.</p><p>Meanwhile, the Coward Class drew their inspiration from a different well - the postmodern philosophers who taught them that truth is relative and control is compassion. </p><p>\\\nThe same ideological subversion that gave us safe spaces and trigger warnings gave us content moderation and algorithmic suppression. It's no accident that the biggest advocates of censorship also tend to be the biggest fans of critical theory.</p><p>Then there are the fence-sitters like Zuckerberg. Once the poster child for tech censorship, he's now pivoting Meta toward free speech principles. Is this genuine reform or just another survival adaptation? The jury's still out.</p><p>\\\nBut here's what's clear: we're entering what philosopher Ken Wilber calls the \"integral age\" - a synthesis that transcends both traditional conservatism and postmodern relativism. This isn't about going backward. It's about going forward with clear eyes.</p><p>\\\nThe old categories don't work anymore. We're not returning to some mythical past - we're creating something new. Something that combines the best of traditional values with modern innovation and postmodern critique.</p><p>There's a reason Zuckerberg's transformation included getting physically stronger. Silicon Valley's postmodern era wasn't just ideologically weak - it was physically soft. Compare the soy-faced grins of tech's social justice warriors with the determined looks of its freedom fighters.</p><p>\\\n<strong>This isn't toxic masculinity.</strong> It's the kind of masculinity that made men willing to risk everything for what they believed in. The kind that puts Ross Ulbricht in prison while others profit from far worse crimes. The kind that has Julian Assange fighting extradition while war criminals walk free.</p><p>\\\nIt's about having the courage to stand up. To say no. To risk everything for what you believe in. In an age of moral relativism and corporate compliance, that's become a revolutionary act.</p><h2>The Future Is Not Guaranteed</h2><p>As the pendulum swings toward digital freedom, the old guard won't go quietly. They'll wrap their control systems in the language of safety, sustainability, and social responsibility. They'll try to make heroes look like villains. They'll use every trick in their postmodern playbook to maintain their grip on power.</p><p>\\\nBut here's the truth: <strong>history remembers its heroes. It forgets its cowards.</strong> And right now, in Silicon Valley, everyone's choosing which side they'll be on.</p><p>\\\nThe Great Digital Awakening isn't just another tech trend. It's a battle for the soul of the internet. And ultimately, for the future of human freedom itself.</p><p>\\\nThe choice is yours. The time is now. <strong>Which side of history will you be on?</strong></p>","contentLength":5022,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Playwright: My First Steps With the Browser Automation Tool","url":"https://hackernoon.com/playwright-my-first-steps-with-the-browser-automation-tool?source=rss","date":1737918003,"author":"Nicolas Fränkel","guid":278,"unread":true,"content":"<p>In my previous company, I developed a batch job that tracked metrics across social media, such as Twitter, LinkedIn, Mastodon, Bluesky, Reddit, etc. Then I realized I could duplicate it for my own \"persona.\" The problem is that some media don't provide an HTTP API for the metrics I want. Here are <a href=\"https://www.linkedin.com/dashboard/\">the metrics</a> I want on LinkedIn:</p><p>\\\nI searched for a long time but found no API access for the metrics above. I scraped the metrics manually every morning for a long time and finally decided to automate this tedious task. Here's what I learned.</p><p>The job is in Python, so I want to stay in the same tech stack. After a quick research, I found <a href=\"https://playwright.dev/\">Playwright</a>, a browser automation tool with a couple of language APIs, including Python. Playwright's primary use case is end-to-end testing, but it can also manage the browser outside a testing context.</p><p>\\\nI'm using Poetry to manage dependencies. Installing Playwright is as easy as:</p><p>\\\nAt this point, Playwright is ready to use. It offers two distinct APIs, one  and one . Because of my use-case, the first flavor is more than enough.</p><p>I like to approach development incrementally.</p><p>\\\nHere's an excerpt of the API:</p><p>\\\nIt translates into the following code:</p><pre><code>from playwright.sync_api import Browser, Locator, Page, sync_playwright\n\n\nwith (sync_playwright() as pw):                                                        #1\n    browser: Browser = pw.chromium.launch()                                            #2\n    page: Page = browser.new_page()                                                    #3\n    page.goto('https://www.linkedin.com/login')                                        #4\n    page.locator('#username').press_sequentially(getenv('LINKEDIN_USERNAME'))          #5\n    page.locator('#password').press_sequentially(getenv('LINKEDIN_PASSWORD'))          #5\n    page.locator('button[type=submit]').press('Enter')                                 #6\n    page.goto('https://www.linkedin.com/dashboard/')                                   #4\n    metrics_container: Locator = page.locator('.pcd-analytic-view-items-container')\n    metrics: List[Locator] = metrics_container.locator('p.text-body-large-bold').all() #7\n    impressions = atoi(metrics[0].inner_text())                                        #8\n    # Get other metrics\n    browser.close()                                                                    #9\n</code></pre><ol><li><p>Launch a browser instance. Multiple browser types are available; I chose Chromium on a whim. Note that you should have installed the specific browser previously, , <code>playwright install --with-deps chromium</code>.</p><p>\\\nBy default, the browser opens ; it doesn't show up. I'd advise running it visibly at the beginning for easier debugging: .</p></li><li><p>Open a new browser window.</p></li><li><p>Navigate to a new location.</p></li><li><p>Locate specified input fields and fill them in with my credentials.</p></li><li><p>Locate the specified button and press it.</p></li><li><p>Locate  specified elements.</p></li><li><p>Get the inner text of the first element.</p></li><li><p>Close the browser to clean up.</p></li></ol><p>The above worked as expected. The only downside is that I received an email from LinkedIn every time I ran the script:</p><blockquote><p>\\\n  You've successfully activated Remember me on a new device . Learn more on how Remember me works on a device.</p></blockquote><p>\\\nI also met <a href=\"https://github.com/fabienvauchelles\">Fabien Vauchelles</a> at the <a href=\"https://2024.javacro.hr/\">JavaCro</a> conference. He specializes in web scraping and told me that most people in this field leverage browser profiles. Indeed, if you log in to LinkedIn, you'll get an authentication token stored as cookies, and you won't need to authenticate it again before it expires. Fortunately, Playwright offers such a feature with its <code>launch_persistent_context</code> method.</p><p>\\\nWe can replace the above  with the following:</p><pre><code>with sync_playwright() as pw:\n    playwright_profile_dir = f'{Path.home()}/.social-metrics/playwright-profile'\n    context: BrowserContext = pw.chromium.launch_persistent_context(playwright_profile_dir) #1\n    try:                                                                               #2\n        page: Page = context.new_page()                                                #3\n        page.goto('https://www.linkedin.com/dashboard/')                               #4\n        if 'session_redirect' in page.url:                                             #4\n            page.locator('#username').press_sequentially(getenv('LINKEDIN_USERNAME'))\n            page.locator('#password').press_sequentially(getenv('LINKEDIN_PASSWORD'))\n            page.locator('button[type=submit]').press('Enter')\n            page.goto('https://www.linkedin.com/dashboard/')\n        metrics_container: Locator = page.locator('.pcd-analytic-view-items-container')\n        # Same as in the previous snippet\n    except Exception as e:                                                             #2\n        logger.error(f'Could not fetch metrics: {e}')\n    finally:                                                                           #5\n        context.close()\n</code></pre><ol><li><p>Playwright will store the profile in the specified folder and reuse it across runs.</p></li><li><p>Improve exception handling.</p></li><li><p>The  can also open pages.</p></li><li><p>We try to navigate to the dashboard. LinkedIn will redirect us to the login page if we are not authenticated; we can then authenticate.</p></li><li><p>Close the context whatever the outcome.</p></li></ol><p>At this point, we need only to authenticate with both credentials the first time. On subsequent runs, it depends.</p><p>I was surprised to see that the code above didn't work reliably. It worked on the first run and sometimes on subsequent ones. Because I'm storing the browser profile across runs, when I need to authenticate, LinkedIn only asks for the password, not the login! Because the code tries to enter the login, it fails in this case. The fix is pretty straightforward:</p><pre><code>username_field = page.locator('#username')\nif username_field.is_visible():\n    username_field.press_sequentially(getenv('LINKEDIN_USERNAME'))\npage.locator('#password').press_sequentially(getenv('LINKEDIN_PASSWORD'))\n</code></pre><p>Though I'm no expert in Python, I managed to achieve what I wanted with Playwright. I preferred to use the sync API because it makes the code slightly easier to reason about, and I don't have any performance requirements. I only used the basic features offered by Playwright. Playwright allows recording videos in the context of tests, which is very useful when a test fails during the execution of a CI pipeline.</p><p><em>Originally published on <a href=\"https://blog.frankel.ch/first-steps-playwright/\">A Java Geek</a> on January 19th, 2024</em></p>","contentLength":6334,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Why Reid Hoffman feels optimistic about our AI future","url":"https://techcrunch.com/2025/01/26/why-reid-hoffman-feels-optimistic-about-our-ai-future/","date":1737917679,"author":"Anthony Ha","guid":155,"unread":true,"content":"<p>In Reid Hoffman’s new book Superagency: What Could Possibly Go Right With Our AI Future, the LinkedIn co-founder makes the case that AI can extend human agency — giving us more knowledge, better jobs, and improved lives — rather than reducing it. That doesn’t mean he’s ignoring the technology’s potential downsides. In fact, Hoffman (who […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":419,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"California's Battery Plant Fire Sparks Call for Investigation, New Regulations","url":"https://hardware.slashdot.org/story/25/01/26/1841249/californias-battery-plant-fire-sparks-call-for-investigation-new-regulations?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737916980,"author":"EditorDavid","guid":231,"unread":true,"content":"Earlier this month a major fire erupted at a California battery plant. But several factors contributed to its rapid spread, the fire district's chief told the Los Angeles Times:\nA fire suppression system that is part of every battery rack at the plant failed and led to a chain reaction of batteries catching on fire, he said at a news conference last week. Then, a broken camera system in the plant and superheated gases made it challenging for firefighters to intervene. Once the fire began spreading, firefighters were not able to use water, because doing so can trigger a violent chemical reaction in lithium-ion batteries, potentially causing more to ignite or explode. \nThe county's Board of Supervisors has now requested that the plant remain offline until an investigation is completed. A county supervisor told the newspaper \"What we're doing with this technology is way ahead of government regulations and ahead of the industry's ability to control it.\" \n\nAnd plans for a new battery storage site nearby are now being questioned, with an online petition to halt all new battery-storage facilities in the county drawing over 3,200 signatures.\n\nThe fire earlier this month was the fourth at Moss Landing since 2019, and the third at buildings owned by Texas-based Vistra Energy... Already, the fire has prompted calls for additional safety regulations around battery storage, and more local control over where storage sites are located... \nCalifornia Assemblymember Dawn Addis (D-Morro Bay) has introduced Assembly Bill 303 — the Battery Energy Safety &amp; Accountability Act — which would require local engagement in the permitting process for battery or energy storage facilities, and establish a buffer to keep such sites a set distance away from sensitive areas like schools, hospitals and natural habitats... Gov. Gavin Newsom, a fierce advocate of clean energy, agrees an investigation is needed to determine the fire's cause and supports taking steps to make Moss Landing and similar facilities safer, his spokesperson Daniel Villaseñor said in a statement. Addis and two other state legislators sent a letter to the California Public Utilities Commission Thursday requesting an investigation. \n\n\"The Moss Landing facility has represented a pivotal piece of our state's energy future, however this disastrous fire has undermined the public's trust in utility scale lithium-ion battery energy storage systems,\" states the letter. \"If we are to ensure California moves its climate and energy goals forward, we must demonstrate a steadfast commitment to safety...\" \n\ninitial testing from the U.S. Environmental Protection Agency ruled that the levels of toxic gases released by the batteries, including hydrogen fluoride, did not pose a threat to public health during the fire. [The EPA says their monitoring \"showed concentrations of particulate matter to be consistent with the air quality index throughout the Monterey Bay and San Francisco Bay regions, with no measurements exceeding the moderate air quality level... In addition to EPA's monitoring, Vistra Energy brought in a third-party environmental consultant with air monitoring expertise, right after the fire started\"] \n\nStill, many residents remain on edge about potential long-term impacts on the nearby communities of Watsonville, Castroville, Salinas and the ecologically sensitive Elkhorn Slough estuary.","contentLength":3385,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Navigating AI Integration in Retail: The Change Management Compass","url":"https://hackernoon.com/navigating-ai-integration-in-retail-the-change-management-compass?source=rss","date":1737911732,"author":"James Effarah","guid":277,"unread":true,"content":"<h2>The Growing Role of AI in Retail</h2><p>\\\nMoreover, AI is enhancing operational efficiency. For instance, <a href=\"https://www.netguru.com/blog/ai-based-demand-forecasting\">AI algorithms predict demand more accurately</a>, <strong>helping retailers manage inventory levels and reduce waste</strong>. Machine learning models forecast trends, ensuring that <strong>stores stock the right products</strong> at the right times. In logistics, AI optimizes delivery routes, cutting costs and improving delivery speed, which is vital in an era where consumer expectations for quick shipping are high.</p><p>\\\n<strong>Customer service is another area where AI is making strides</strong>. Retailers use <a href=\"https://hackernoon.com/an-introduction-to-ai-powered-chatbots-h41r3ulc\">AI-powered chatbots</a> to handle routine inquiries, offering instant support and freeing human agents for more complex interactions. This not only improves customer satisfaction but also reduces operational expenses.</p><p>\\\nAs <a href=\"https://www.algolia.com/blog/ai/how-ai-can-benefit-the-retail-industry\">AI's role in retail</a> continues to grow, understanding its application and strategic integration becomes crucial. The <strong>AI Implementation Compass</strong>, discussed in the next section, offers a structured approach to navigating these technological advancements effectively.</p><p>The <a href=\"https://www.sciencedirect.com/science/article/pii/S0148296325000219/pdf\">AI Implementation Compass</a> is a strategic tool designed to aid retail organizations in successfully integrating artificial intelligence into their value chains. Picture it as a guiding framework helping retailers navigate the often-turbulent journey of . At its core, the compass identifies key elements crucial for managing change.</p><p>\\\nIn simple terms, it breaks down the integration process into manageable parts. It considers factors across various levels: from individual roles within a company, to departmental functions, all the way up to the larger organizational network. Each level has unique challenges, and the compass shines a light on these, providing clear directions on how to address them. For example, while aligning AI technologies with your existing systems, you may encounter technical hitches or resistance from staff unfamiliar with AI. The compass guides you in setting up training sessions or aligning workflows to ensure seamless integration.</p><p>\\\nMoreover, it underscores the importance of balancing technical advancement with human aspects. It’s not just about introducing new algorithms or data analytics; it’s about preparing your team and infrastructure for a transformative shift. Think of it as blending the art of change management with the science of AI. By following the compass, retail organizations can streamline AI adoption, minimizing disruption while maximizing operational benefits.</p><h2>Micro-Level Challenges in AI Adoption</h2><p>Navigating the <strong>integration of artificial intelligence within retail</strong> involves <strong>untangling intricate human dynamics</strong> at the micro-level—an aspect often overshadowed by high-level strategies. At this foundational level, employees’ apprehension and skill deficiencies represent significant hurdles. <strong>Imagine an employee who's accustomed to decades-old manual inventory practices suddenly asked to engage with an AI-driven system forecasting stock requirements</strong>. The anxiety stems not just from learning a new tool but also from .</p><p>\\\n<strong>Recognizing these human elements requires empathy and structured intervention</strong>. Retailers must first identify the knowledge gaps. Conducting skills assessments provides a clear map of where employees stand versus where they need to be. Training programs, tailored to bridge these gaps, should be interactive and iterative, allowing employees to ease into new systems comfortably, ensuring they’re equipped with the necessary <a href=\"https://hackernoon.com/why-arent-we-teaching-ai-ethics-in-schools\">AI literacy</a>.</p><p>\\\nMoreover, creating forums for discussions can combat resistance. Consider implementing regular workshops where employees can voice concerns and suggest improvements. This helps in making them stakeholders in the change rather than reluctant participants. Realigning organizational culture to emphasize learning and growth over immediate compliance nurtures an environment of innovation and reduces friction.</p><p>\\\nSupporting employees through these micro-level challenges doesn't just ensure smoother AI integration; it builds a culture primed for adaptation, where employees feel valued and informed, ready to navigate AI's evolving landscape.</p><h2>Meso-Level Dynamics: Bridging Departments</h2><p>The meso-level dynamics of  involve navigating the intricate web of inter-departmental relationships. Successful implementation hinges on seamless collaboration among various departments, such as marketing, sales, and logistics. <a href=\"https://hackernoon.com/from-resistance-to-resilience-change-management-for-first-timers-in-digital-transformation\">Each of these sectors often operates in silos</a>, contributing to communication barriers that can stall AI deployment. For instance, the marketing team might focus on AI tools for customer analytics, while logistics prioritize supply chain optimization. Without proper communication, these departments may miss opportunities for synergistic innovations that maximize AI's potential.</p><p>\\\nTo overcome these challenges, fostering a culture of cross-departmental collaboration and communication is paramount. Regular inter-departmental meetings and workshops can serve as platforms for knowledge exchange, allowing teams to understand different perspectives and align their . For example, sales and marketing departments might collaborate on a unified <a href=\"https://intervision.com/blog-explore-how-ai-driven-solutions-enhance-customer-engagement/\">AI-driven customer engagement strategy</a>, drawing from both customer insights and sales data.</p><p>\\\nFurthermore, <strong>appointing a project manager</strong> who understands the language and needs of each department can aid in <a href=\"https://www.raconteur.net/technology/ai-in-business-translating-ambitions-into-action\">translating AI objectives into actionable plans</a> that respect existing workflows yet encourage cross-functional efforts. This central figure can facilitate a shared vision, ensuring that AI tools are integrated in a manner that respects and enhances each department's unique contribution to the retail value chain.</p><h2>Macro Environmental Influences</h2><p><strong>Retailers diving into the world of artificial intelligence</strong> face powerful macro environmental influences. A landscape shaped by currents of market trends, regulatory pressures, and competitive dynamics presents both opportunities and challenges. Start with market trends: <strong>consumers are rapidly embracing technology, demanding personalized experiences</strong>. This evolution pushes retailers to meet these expectations through AI, which can analyze consumer data and predict buying habits. Companies that fail to innovate risk losing relevance.</p><p>\\\nSimultaneously, regulatory frameworks impose critical boundaries. Governments worldwide are scrambling to set rules that ensure ethical AI use, addressing concerns around data privacy and algorithmic transparency. In retail, this means balancing innovation with compliance—a tightrope act that requires vigilance and adaptability.</p><p>\\\nCompetition further intensifies the urgency. With heavyweights like Amazon or Alibaba aggressively leveraging AI, others must keep pace or risk obsolescence. These giants use AI to enhance logistics, customer service, and inventory management, setting a high bar for industry standards.</p><p>\\\nLayered over these factors is the global economic climate, influencing investment capacities and technological advancements. As economic conditions fluctuate, resource allocation toward AI projects can wax and wane, impacting the pace and scale of integration.</p><p>In this intricate web, retailers must skillfully navigate macro influences to effectively integrate AI, ensuring they remain competitive, compliant, and consumer-centric in today's market.</p><h2>Socio-Technical Systems Theory: A New Lens</h2><p>The <strong>integration of artificial intelligence (AI)</strong> into the  is intricately challenging, intertwining technology's mechanical precision with the unpredictability of human behavior. This delicate balance is where socio-technical systems theory offers considerable insights. By perceiving AI implementation through both technical and social lenses, retailers can better navigate this complex landscape.</p><p>\\\nTechnical elements might focus on hardware, software, and data frameworks vital for AI deployment. However, the real magic, and often the most daunting challenges, lie within the social dimension. Employees, for instance, may feel threatened by AI-enhanced tools fearing job redundancy, or overwhelmed by the intricacies of new systems. Sociotechnical systems theory suggests that successful AI integration is dependent not only on the robustness of these technological components but also on addressing the human aspects involved in this transition.</p><p>\\\nIn practical terms, this could mean actively involving frontline employees in AI training programs or creating open forums to express concerns and suggestions about the technology. Retailers might observe more cohesive adoption by reconfiguring team structures to foster collaboration between tech-savvy staff and those with domain expertise, ensuring that AI solutions are informed by practical, day-to-day retail operations. Ultimately, treating AI integration as a socio-technical challenge moves the organization beyond mere installation, toward holistic adoption that respects the human elements intertwined with technological advancements.</p><h2>Leavitt’s Diamond Model in AI Implementation</h2><p><a href=\"https://www.accipio.com/eleadership/change-management/leavitts-diamond/\">Leavitt's Diamond Model</a> offers a structured way to dissect the complexities of  by focusing on four core dimensions: structure, technology, tasks, and people. This model is instrumental because it forces us to consider how these elements interact and impact each other when <a href=\"https://medium.com/@anirudh-manthaa/8-ways-artificial-intelligence-is-disrupting-the-retail-industry-0eef1ce39b3f\">AI disrupts retail operations</a>.</p><p>\\\nLet's start with structure. Retailers must assess their organizational frameworks to see how AI tools fit or demand adjustments. It might mean redefining roles or creating new departments that focus on AI oversight, ensuring the chain of command is equipped to handle AI-driven insights.</p><p>\\\nOn the technology front, AI isn't just another digital tool—it's transformative. For successful integration, retailers must ensure their existing tech infrastructure is compatible with AI systems. This often involves upgrading legacy systems, which can be costly and time-consuming but crucial for seamless operations.</p><p><strong>The people element is perhaps the most sensitive</strong>. Employees must be trained and reassured about AI's role. This involves communication strategies to mitigate fear of job loss and highlight AI's potential to improve job satisfaction through automation of mundane tasks.</p><p>\\\nConsidering these dimensions using  allows retailers to foresee potential bottlenecks and align AI integration with their strategic objectives, creating a smoother transition into AI-driven retail ecosystems.</p><h2>Case Studies of Successful AI Integration</h2><p><strong>Retailers who master AI integration</strong> often leverage the <strong>AI Implementation Compass</strong> to guide them through the intricacies of this technological transition. Successful narratives emerge from companies like Walmart and Stitch Fix, offering a blueprint for others to follow. <strong>At Walmart, harnessing AI to optimize supply chain operations has minimized stock discrepancies and improved inventory management</strong>. This technological shift wasn't abrupt; it involved a coherent strategy that aligned technological upgrades with task redefinitions and staff training, a move inspired by components of  from the previous section.</p><p>\\\nIn contrast, Stitch Fix has redefined customer engagement through . By deploying complex algorithms to understand consumer preferences, they revolutionized their task structures to align with new technological capabilities. This adaptation not only enhanced customer satisfaction but also reshaped their workforce, creating roles geared towards data analysis and algorithm training.</p><p>\\\nThese companies exemplify how understanding and navigating the socio-technical systems can lead to successful AI adoption. They illustrate the importance of connecting technological innovations with clear task modifications and human resource alignment, emphasizing collaboration between technical experts and retail managers. Consequently, these case studies reinforce that profound comprehension of structural and people dynamics is crucial in bridging traditional retail methodologies with progressive AI capabilities.</p><h2>Future Trends and the Evolution of AI in Retail</h2><p>Managing change during  requires a nuanced approach that aligns technology with human elements. At the heart of this process lies the AI implementation compass—a strategic framework guiding organizations through complex transitions. This tool is crucial for aligning technological advancements with organizational goals and employee capabilities.</p><p>\\\nA key aspect of <strong>successful AI integration</strong> is understanding the socio-technical dynamics at play. Organizations must <strong>address how AI impacts the existing workflow</strong> and employee roles. For instance, implementing AI-driven inventory systems can streamline stocking processes but may require retraining staff to interact with new interfaces. Open communication is vital, ensuring all stakeholders understand AI's benefits and potential disruptions.</p><p>\\\nMoreover, dismantling silos across departments fosters collaborative environments essential for AI success. When marketing, operations, and IT teams work cohesively, they better anticipate challenges and allocate resources efficiently. Training programs tailored to diverse learning styles can ease transitions, ensuring employees feel valued and prepared.</p><p>\\\nExternally, staying attuned to market forces and customer expectations is imperative. Retailers must adapt AI solutions that not only enhance operational efficiency but also elevate customer experiences, such as personalized shopping recommendations. This alignment ensures that AI integration is not an isolated initiative but a comprehensive strategy propelling retailers toward sustainable growth.</p><h2>Expert Perspectives on Navigating AI Implementation</h2><p>Incorporating AI into retail is not merely a technological shift, but a strategic reimagining of the retail ecosystem. Insights from experts like Jeandri Robertson highlight the importance of aligning AI initiatives with responsible marketing. Robertson emphasizes understanding digital ecosystems to promote sustainable practices. For instance, when retailers integrate AI in customer service, it’s crucial they do so with a strong ethical framework to safeguard customer data and privacy.</p><p>\\\n<a href=\"https://profiles.canterbury.ac.nz/Elsamari-Botha\">Elsamari Botha</a> insists on the <strong>importance of clear digital strategies when adopting AI</strong>. She asserts that retailers must first define what they aim to achieve with AI. From personalizing shopping experiences to optimizing supply chains, a well-defined strategy directs the successful integration of technology without losing sight of business goals. Botha draws on her extensive experience, noting that businesses often falter when they adopt technology without a comprehensive understanding of its potential and limitations.</p><p><a href=\"https://masteringsap.com/experts/dr-kim-oosthuizen/\">Kim Oosthuizen</a> emphasizes the need for a supportive organizational culture. Engaging with AI requires adaptability from all levels of a business, from executives to frontline employees. Oosthuizen, drawing from her experience at SAP, advocates for internal education programs to help employees understand and .</p><p>\\\nThus, integrating  demands more than technical infrastructure. It requires a symbiotic blend of strategy, ethical considerations, and cultural adaptability, ensuring AI’s potential is fully realized while aligning with future trends in retail innovation.</p>","contentLength":15142,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Davos 2025 and the Truffle Hunt: Why AI Investments Are the New Arms Race 🏔","url":"https://hackernoon.com/davos-2025-and-the-truffle-hunt-why-ai-investments-are-the-new-arms-race?source=rss","date":1737911674,"author":"Denys Tsvaig","guid":276,"unread":true,"content":"<p>\\\nWEF in Davos is buzzing with massive AI figures 🤖: the U.S. is pouring colossal sums into AI (Stargate – $100B , Meta – $65B, Microsoft – $80B), and Trump, oddly enough, is everywhere in the news without even showing up 🤔. Meanwhile, Europe still lags behind. The only chance not to lose out entirely? Stop over-regulating and start boosting AI potential—fast.</p><p>One key takeaway from this “battle of titans” at the WEF—and across the globe—is that everything depends on  . I’m reminded of the tale of the truffle. We humans love chasing exclusivity. By reputation, the truffle is a super-rare mushroom hidden deep underground, but in reality, 80% of it is farmed. Truffles are not just about food. Why are they so expensive? Because we’re sold on the idea of scarcity and luxury. It’s a purely marketing-driven story—an emotional game that works. We pay extra, not merely for taste, but to feel like part of an elite.</p><h2><strong>Is it the same with AI and crypto?</strong></h2><p>AI, quantum computing, and cybersecurity in healthcare —these aren’t just technologies; they’re <strong>narratives about the future</strong> we’re urged to join. We “buy” these ideas for a sense of belonging. Like truffles: for a few lines of “code” and a sprinkle of “super-algorithm,” we’re willing to pay high prices—financially and in reputation. The noise, the billions, the global “hunters” with their “trained pigs and dogs” (startups and VC funds)—it all makes you wonder: <strong>Is this another well-crafted strategy</strong> by those who invest first and shape our perception? Because, just like with truffles, victory isn’t just about innovation; it’s about how you spin the story.</p><p>\\\nAt DeHealth we keep pushing forward on our super-app, focusing on AI in healthcare—one of the critical sectors where AI can (and must) deliver real benefits, from rapid diagnostics to robust patient data protection.</p><p>Instead of an aggressive expansion, we only see a few big names. SAP is one of the few European corporations making a strong appearance (and sure Mistral&nbsp;&nbsp;and Photoroom). Those are the kinds of stories that truly reshape global perception.</p><h2><strong>AI and Hope in Stormy Times</strong></h2><p>At “AI House Davos,” there’s a phrase on the wall:</p><blockquote><p>“Lern im Missgeschicke hoffen, denk des Sturms bei heiterer Zeit” \\n </p><p>“Learn to hope in despair, remember the storm when the weather is fair.”</p></blockquote><p>\\\nWhat if we apply this motto not just to tech but to the world at large? In healthcare, AI is shaking up everything—from remote monitoring to genomics-level diagnostics 🧬. Maybe this is the “storm” we need to prepare for in advance. The same goes for cybersecurity: before it turns into a worldwide “epidemic,” we must build collective defenses.</p><p>We should all ask ourselves: <strong>Is this another beautiful myth being sold to us, or is it our real chance to shape the future?</strong> Perhaps the truth lies somewhere in the middle, as usual. As a cyber-war expert, I always try to think critically and fact-check. Let me know your thoughts in the comments —I’d love to hear your opinion. One fact stands firm: if we want to be in the game, we must learn to tell our story right—Europe included.</p><p>In the end, whether we’re selling the future of medicine, groundbreaking tech, or rare delicacies, it all boils down to one question: <strong>What legend are we creating?</strong> 💡</p>","contentLength":3338,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A Guide on How to Make the Best Decisions Under the Worst Circumstances","url":"https://hackernoon.com/a-guide-on-how-to-make-the-best-decisions-under-the-worst-circumstances?source=rss","date":1737910803,"author":"Vinita Bansal","guid":275,"unread":true,"content":"<p>When making decisions under suboptimal conditions—the situation is not in our favor, we have incomplete details or there’s an issue that requires urgent attention—most of us tend to screw up.</p><p>\\\nWe overreact, hurry, and let our biases get in the way of good decision-making. We assume given the conditions and constraints under which we are operating, this is the best we can do.</p><p>\\\nHowever, our best, most of the time, is not good enough because we blame it on our circumstances and fail to learn from our mistakes instead of taking responsibility for our actions.</p><p>\\\nThis creates a vicious cycle of stress and anxiety every time we are faced with a difficult situation—negative emotions from past failures, fear of not meeting expectations again, and not knowing how to make a better decision this time leading to bad choices with terrible results.</p><p>\\\nThe ability to make good decisions under stress is highly valued because it’s rare to see it in action. It’s a super skill that gets your attention, makes you stand out, and builds credibility at work.</p><blockquote><p>Let us not become victims of a crippling reasoning pattern. If we want to improve our decision-making and critical thinking, we must recognize our mental biases and be willing to overcome them. Let us avoid creating arguments to confirm pre-existing beliefs at all costs and invest in a ‘sunk cost fallacy.’</p></blockquote><p>\\\nUse these five steps to make the best possible decision under difficult conditions:</p><p>When you are running against time or the situation demands that you move fast, you may start panicking. That panic not only reflects in your tone of voice and body language but even the way you think.</p><p>\\\n<em>We don’t have an entire day.</em></p><p>\\\nHurrying, especially when the circumstances are not in your favor or the situation appears out of control leads to poor choices and bad decisions.</p><p>\\\nSlowing down may seem counterintuitive in such moments, but that’s exactly what you need to do. Pausing and taking a deep breath clears the mental fog required to make good decisions. It lowers stress and anxiety that clouds your thinking and compromises your judgment.</p><blockquote><p>Between stimulus and response there is a space. In that space is our power to choose our response. In our response lies our growth and our freedom.</p></blockquote><p>\\\nAsk these questions when you feel the need to hurry into a decision:</p><ol><li><p>What am I feeling right now?</p></li><li><p>Is my decision driven by a rational thought process, or am I reacting impulsively to strong emotions of fear, stress, or anxiety?</p></li><li><p>In what ways can external pressures influence my choice?</p></li><li><p>What would happen if I took more time to decide?</p></li><li><p>Have I considered all possible alternatives? What might I be overlooking?</p></li><li><p>What are my priorities in this situation and how does my decision align with those priorities?</p></li></ol><p>\\\nDon’t lead with the first thought that comes to mind. Slow down. Use the pause to reflect on choices, clarify your understanding, and validate your assumptions.</p><p>The biggest mistake we make when making decisions under tough situations is assuming we need to have all the answers. Not knowing something hurts our ego. Coming up with the decision all by ourselves then becomes a matter of pride and self-esteem.</p><p>\\\nWe don’t ask questions, seek alternative perspectives, or invite disagreements because doing so undermines our authority and judgment.</p><p>\\\nBut good decisions aren’t made in silos or by relying on the knowledge and experience of one person. Utilizing the collective wisdom of the group helps us overcome our biases and explore options that we would otherwise not consider.</p><blockquote><p>Questioning helps people gain perspective and understand the perspectives of others. As they see issues and problems from different points of view, they gain an appreciation for their complexity—and also expand the range of possible solutions.</p></blockquote><p>\\\nMake more informed and thoughtful decisions by asking the right questions:</p><ol><li>How do others feel about different options?</li><li>What other alternatives have we not yet considered?</li><li>What potential risks do others see with each choice?</li><li>What could go wrong? What could go right? How likely are these outcomes?</li><li>If others were to pick one option, which one would they choose and why?</li></ol><p>\\\nThe art of decision-making requires the art of questioning. Make better decisions under the worst circumstances by finding the right answers, not trying to be right.</p><h3>Consider Second-Order Effects</h3><p>While making decisions, how often do we optimize for long-term gain at the cost of short-term pain? A good process for making decisions requires second-order thinking which unravels the implications of our decisions by thinking about its consequences in the future.</p><p>\\\nIt’s tempting to give in to good outcomes with small upsides that are easily accessible and visible to us without weighing in on the potentially large downside of these decisions in the future.</p><p>\\\nOur experiences and beliefs also limit our ability to go beyond the natural and seek hard truths by asking difficult questions, exploring unknown territories, and doubting what may seem like an obvious choice.</p><blockquote><p>Failing to consider second- and third-order consequences is the cause of a lot of painfully bad decisions, and it is especially deadly when the first inferior option confirms your own biases. Never seize on the first available option, no matter how good it seems, before you’ve asked questions and explored.</p></blockquote><p>\\\nSecond-order thinking as a mental model requires going out of our comfort zone and stepping into the unknown. It requires analyzing the potential impact of our decision in the future by asking these questions:</p><ul><li>How can I make decisions with positive outcomes compounded in the future?</li><li>Is this decision attractive only because it has an immediate effect (first-order consequence) positive?</li><li>What can be the potential downside of this decision and its effect later?</li></ul><p>\\\nGoing beyond intuition and seeking unconventional solutions by applying second-order thinking philosophy is what separates great thinkers from the ordinary who outperform others and achieve greater success.</p><p>The science of behavioral economics tells us that once we have made a decision, even an illogical one, we tend to cling to it. We believe a certain line of thinking is right, and filter out dissenting information while seeking information that confirms our original point of view. </p><p>\\\nPsychologists call this confirmation bias.</p><p>\\\nThis bias is so deeply seated in our unconscious thinking that even our illogical reasoning sounds entirely rational to us. We operate with a biased filtered worldview missing critical pieces of information and stamp it with “logic-based reasoning.”</p><p>\\\nAnother bias that impacts decision-making is relying solely on our instincts.</p><p>\\\nIn his classic , Daniel Kahneman, a psychologist and economist notable for his work on the psychology of judgment and decision-making stresses on the fact that our gut instinct can fail us when we apply familiar patterns of experience to unrelated circumstances or situations.</p><p>\\\nWe make quick decisions based on our past experience which is a key source of noise and bias. He asks us to resist premature intuition and says “Intuition should not be banned, but it should be informed, disciplined, and delayed.”</p><p>\\\nTo catch yourself, ask these questions:</p><ul><li>Am I relying solely on my intuition to make this decision? What data supports my thinking?</li><li>How am I sure this data is not biased?</li><li>What other dissenting pieces of information have I considered?</li><li>What do others have to say about this decision?</li></ul><p>\\\nCombine your intuitive reasoning with scientific knowledge and data. Ask others for disconfirming opinions and pieces of evidence to enable you to see both sides of the argument and not only the one that appeals to you.</p><h3>Apply the Five Whys Technique</h3><p>Finally, you can’t improve your decision-making skills without implementing a feedback loop in your process.</p><p>\\\nDespite your best efforts, not all decisions will turn out right—unexpected situations, wrong assumptions, and lack of complete information may lead to undesired results with other negative consequences.</p><p>\\\nThe experience is nothing but emotionally draining and can leave you in a state of denial—attaching superficial causes for not getting the desired results or speeding through analysis without any significant conclusions.</p><p>\\\nShift from obvious and superficial reasons to the underlying root cause. Dig in, draw connections, identify and learn from your past, ask questions, and only accept an answer that clarifies what you did wrong and what action could have prevented the mistake from happening:</p><ul><li>Why did you make the mistake?</li><li>Was the mistake avoidable or unavoidable?</li><li>What does this mistake teach you about yourself?</li></ul><p>\\\nA powerful technique to go from a superficial understanding of your mistake to the underlying root cause is to use the “five whys” technique designed by Sakichi Toyoda who used it within the Toyota Motor Corporation during the evolution of its manufacturing methodologies.</p><p>\\\nAsk why the mistake occurred and use the answer as the premise for the next question repeating this whole process five times to dig deeper into the actual cause of the issue. By repeating “why” five times, the nature of the problem and its solution becomes clear.</p><p>\\\nQ: Why did the fix we deployed end up breaking a downstream system that was dependent on our data?</p><p>A: We changed an API contract and missed notifying the downstream system of the change.</p><p>A: We were not aware that their team was using this API contract.</p><p>\\\nQ: Why were we not aware of them using our API?</p><p>A: We maintain a document listing all dependent downstream systems and contracts. This service was not listed in the document.</p><p>\\\nQ: Why was this service not part of the document?</p><p>A: This service recently went live and the document was not updated to include it. So, we missed notifying them.</p><p>\\\nQ: Why was the document not updated?</p><p>A: We don’t have a process in place to ensure such changes are captured. Relying on manual processes is faulty.</p><p>\\\nThis example clearly demonstrates that the actual problem is quite different from the answer to the first question.</p><p>\\\nWithout digging deeper, we might stop at the first answer that comes to our mind—hardly the answer we need to solve the problem and prevent it from occurring again.&nbsp;</p><p>\\\nFive  is a general guideline. You can stop at three or go all the way till seven ; whatever gets you the answer you need to understand your mistake better.</p><blockquote><p>Five Whys is a powerful organizational technique. Coupled with working in small batches, it provides the foundation a company needs to respond quickly to problems as they appear, without overinvesting or overengineering.</p></blockquote><p>\\\nBecoming a good decision-maker requires turning every mistake into a learning lesson—show curiosity to understand what you’re doing wrong and what you can do to improve.</p><ol><li><p>Learning to make good decisions, especially when circumstances are not in your favor, is a skill that can help you get others' attention and make you stand out at work.</p></li><li><p>Speeding through a decision may appear right when faced with a time crunch, but hurrying only leads to decisions that you may regret in the long run. Slowing down and pausing, even for a brief moment, can create the space necessary to think clearly and make more objective decisions.</p></li><li><p>When tasked with a decision, you may refuse to ask questions with the worry that not knowing something may hurt your reputation and damage your credibility. Not asking questions limits your perspective which makes you more prone to bad decisions. Good decision-making involves finding the right answers, not knowing all the answers by yourself.</p></li><li><p>Instant gratification feels good which makes you more likely to choose an option with short term rewards without fully understanding the impact of your decision in the long run. Don’t make a decision without considering its future implications. The best decision is the one with positive results compounded in the future.</p></li><li><p>Confirmation bias combined with faulty intuition is a deadly combination. It makes you reject evidence that contradicts your opinion and double down on the choice that matches your intuition. Intuition is valuable, but intuition without logical reasoning can lead to biased decisions.</p></li><li><p>Learning to make good decisions isn’t a one-time process. It involves a lifetime of learning, experience, and practice. When your decision doesn’t work out as expected, use the five-whys technique to dig deeper into the root cause, and use the knowledge to prevent such mistakes from happening again.</p></li></ol><p>\\\nThis story was previously published&nbsp;<a href=\"https://www.techtello.com/how-to-make-the-best-decision-under-the-worst-circumstances/\">here.</a>&nbsp;Follow me on&nbsp;<a href=\"https://www.linkedin.com/in/sagivini/?ref=hackernoon.com\">LinkedIn</a>&nbsp;or here for more stories.</p>","contentLength":12557,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How We Studied the Effects of Different Exoskeleton Controllers on Gait Patterns","url":"https://hackernoon.com/how-we-studied-the-effects-of-different-exoskeleton-controllers-on-gait-patterns?source=rss","date":1737908102,"author":"Exoself Technology Research","guid":274,"unread":true,"content":"<p>(1) Mohammad Shushtari, Department of Mechanical and Mechatronics Engineering, University of Waterloo (smshushtari@uwaterloo.ca);</p><p>(2) Julia Foellmer, Mechanics and Ocean Engineering Department, Hamburg University of Technology (julia.foellmer@tuhh.de);</p><p>(3) Sanjay Krishna Gouda, Department of Mechanical and Mechatronics Engineering, University of Waterloo and Toronto Rehabilitation Institute (KITE), University Health Network (arash.arami@uwaterloo.ca).</p><p>NSERC Discovery under Grant RGPIN-2018-4850, the Tri-Agency Institutional Programs Secretariat (TIPS): New Frontiers in Research Fund (NFRF)–Exploration under Grants 2018-1698, 2022-620, John R. Evans Leaders Fund Canadian Foundation for Innovation, Ontario Research Fund (ORF).</p><p>\\\n<strong>• Conflict of interest/Competing interests</strong></p><p>No competing or conflict of interests.</p><p>Contact A.A. for code and other materials.</p><p>M.S. and A.A. designed the experiment. M.S. designed the AMTC and TBC controllers and implemented them on the Indego exoskeleton along with the HTC controller. M.S. and J.F. performed the experiment. M.S. analyzed and visualized the data. M.S. and A.A. interpreted the results and prepared the manuscript. All authors provided critical feedback on the manuscript.</p><p>\\\n\\\nFig. A1A illustrates the modifications made to the hip reference trajectory (∆rhip) during the MBTC block. These modifications occur after the HTC block and before the TBC block, as depicted in (Fig. 10), across ultra-slow, slow, and moderate walking speeds. Similarly, Fig. A1B showcases the adaptation of the Fourier coefficients (θ) and their convergence pattern during the MBTC block at ultra-slow walking. The Fourier coefficients begin to adapt as soon as that block starts. It takes approximately 20 seconds for them to converge, and they subsequently exhibit minor oscillations around their converged values until the treadmill speed is switched to the slow speed. This change in treadmill speed induces new walking conditions, resulting in distinct gait patterns. Consequently, the Fourier coefficients converge toward a new set of steadystate values. A similar pattern emerges when the treadmill is switched to the moderate speed. Pearson correlation between the vertical Ground Reaction Forces during each of the HTC, MBTC, and TBC blocks and natural walking with no exoskeleton is plotted for each stride in Fig. A1C. According to the graph, the GRF patterns resemble the GRF in natural walking at slow and moderate walking speeds. In ultra-slow speed, however, the correlation slightly decreases in all three blocks. Finally, Fig. A1D shows the computed stride length. As expected, in all three blocks, the stride length increases with the increase in treadmill speed.</p><p>To identify which controller led to a gait closer to natural walking, we analyzed the spatiotemporal parameters of gait (obtained using GaitUp Sensors) in TBC, HTC, and AMTC and compared them to those of each participant’s natural walking with no exoskeleton. Moreover, we analyzed the correlation of recorded ground reaction torques in the case of each controller with natural walking.</p><h3>B.1 Gait Spatiotemporal Parameters</h3><p>\\\n\\\nFig. B2A shows the maximum heel clearance in natural walking condition (with no exoskeleton) and during exoskeleton walking at each of the TBC, HTC, and AMTC blocks at ultra-slow, slow, and moderate speeds. Natural walking has the greatest heel clearance, which is expected as the addition of the exoskeleton weight makes it harder for the participant to lift their foot to their convenient level. Among the three controllers, AMTC has a heel clearance closer to that of natural walking, indicating that maintaining the desired heel clearance is easier for the participant in the case of this controller. Similarly, Fig. B2B compares the minimum toe clearance, showing that at all walking speeds, natural walking with no exoskeleton has the lowest minimum toe clearance. The HTC controller demonstrates lower toe clearance than the TBC and AMTC at all speeds. However, these differences are not statistically significant unless during moderate walking, where the HTC has led to a 21.3%±18.2 and 12.2%±9.3 decrease in minimum toe clearance compared to the AMTC and TBC, respectively (Friedman: p &lt;0.001, Wilcoxon signed rank: pHT C,AMT C &lt;0.007, pHT C,T BC &lt;0.003).</p><p>\\\nRegarding the stance percentage, as depicted in Fig. B2C, AMTC exhibits the closest behavior to natural walking at all speeds. In all cases, TBC has a smaller stance percentage compared to natural walking. During ultra-slow and slow-speed walking, HTC has the smallest stance percentage. In moderate-speed walking, however, HTC has the highest stance percentage. Finally, Fig. B2D illustrates the stride length for each of the controllers at the three experimented walking speeds. The stride length generally increases with the increase in treadmill speed. At each individual speed, however, natural walking appears to have the smallest stride length on average, mostly compared to the TBC, which has the highest stride length (Friedman: p &lt;0.05, Wilcoxon signed rank: p &lt;0.01 for all speeds).</p><h3>B.2 Ground Reaction Force</h3><p>\\\n\\\nFig. B3A shows the Pearson correlation of the vertical ground reaction force between walking with each of the controllers and natural walking without the exoskeleton. At all speeds, TBC exhibits the most different vertical GRF compared to the other controllers (Friedman: pUltra-slow &lt;0.02, pSlow &lt; 0.001, and pModerate &lt; 0.016; Wilcoxon signed rank: p &lt;0.01 for all speeds). In contrast to the TBC, HTC and AMTC led to more natural vertical GRF profiles with Pearson correlations greater than 96% at all speeds. The same observation stands for the GRFs in lateral (Fig. B3B) and longitudinal (Fig. B3C) directions, where TBC shows the least natural GRF profile while HTC and AMTC demonstrate closer to natural walking GRF with Pearson correlations greater than 82.2% and 91.5% in lateral and longitudinal directions, respectively (Friedman: p &lt;0.003; Wilcoxon signed rank: p &lt;0.004 for all cases).</p><p>[1] Dupont, P.E., Nelson, B.J., Goldfarb, M., Hannaford, B., Menciassi, A., O’Malley, M.K., Simaan, N., Valdastri, P., Yang, G.-Z.: A decade retrospective of medical robotics research from 2010 to 2020. Science Robotics 6 (2021)</p><p>\\\n[2] Duschau-Wicke, A., Zitzewitz, J.V., Caprez, A., Lunenburger, L., Riener, R.: Path control: a method for patient-cooperative robot-aided gait rehabilitation. IEEE Transactions on Neural Systems and Rehabilitation Engineering 18, 38–48 (2009)</p><p>\\\n[3] Bryan, G.M., Franks, P.W., Song, S., Reyes, R., O’Donovan, M.P., Gregorczyk, K.N., Collins, S.H.: Optimized hip-knee-ankle exoskeleton assistance reduces the metabolic cost of walking with worn loads. Journal of Neuroengineering and Rehabilitation 18, 1–13 (2021)</p><p>\\\n[4] Franks, P.W., Bryan, G.M., Martin, R.M., Reyes, R., Lakmazaheri, A.C., Collins, S.H.: Comparing optimized exoskeleton assistance of the hip, knee, and ankle in single and multi-joint configurations. Wearable Technologies 2, 16 (2021)</p><p>\\\n[5] Durandau, G., Rampeltshammer, W.F., Kooij, H., Sartori, M.: Neuromechanical model-based adaptive control of bilateral ankle exoskeletons: biological joint torque and electromyogram reduction across walking conditions. IEEE Transactions on Robotics 38, 1380–1394 (2022)</p><p>\\\n[6] Poggensee, K.L., Collins, S.H.: How adaptation, training, and customization contribute to benefits from exoskeleton assistance. Science Robotics 6 (2021)</p><p>\\\n[7] Nuckols, R.W., Lee, S., Swaminathan, K., Orzel, D., Howe, R.D., Walsh, C.J.: Individualization of exosuit assistance based on measured muscle dynamics during versatile walking. Science robotics 6 (2021)</p><p>\\\n[8] Lee, U.H., Shetty, V.S., Franks, P.W., Tan, J., Evangelopoulos, G., Ha, S., Rouse, E.J.: User preference optimization for control of ankle exoskeletons using sample efficient active learning. Science Robotics 8 (2023)</p><p>\\\n[9] Postol, N., Lamond, S., Galloway, M., Palazzi, K., Bivard, A., Spratt, N.J., Marquez, J.: The metabolic cost of exercising with a robotic exoskeleton: A comparison of healthy and neurologically impaired people. IEEE Transactions on Neural Systems and Rehabilitation Engineering 28, 3031–3039 (2020)</p><p>\\\n[10] Witte, K.A., Fiers, P., Sheets-Singer, A.L., Collins, S.H.: Improving the energy economy of human running with powered and unpowered ankle exoskeleton assistance. Science Robotics 5 (2020)</p><p>\\\n[11] Zhu, F., Kern, M., Fowkes, E., Afzal, T., Contreras-Vidal, J.-L., Francisco, G.E.,Chang, S.-H.: Effects of an exoskeleton-assisted gait training on post-stroke lowerlimb muscle coordination. Journal of Neural Engineering 18, 046039 (2021)</p><p>\\\n[12] Ku¸cuktabak, E.B., Wen, Y., Kim, S.J., Short, M., Ludvig, D., Hargrove, L., Perreault, E., Lynch, K., Pons, J.: Haptic transparency and interaction force control for a lower-limb exoskeleton. IEEE Transactions on Robotics (2024)</p><p>\\\n[13] Eva, M.M., Grizzle, J.W.: Feedback control design for robust comfortable sit-tostand motions of 3d lower-limb exoskeletons. IEEE Access 9, 122–161 (2020)</p><p>\\\n[14] Masengo, G., Zhang, X., Dong, R., , A.B.A., Hamza, K., Mudaheranwa, E.: Lower limb exoskeleton robot and its cooperative control: A review, trends, and challenges for future research. Frontiers in Neurorobotics 16, 1–25 (2023)</p><p>\\\n[15] Ingraham, K.A., Remy, C.D., Rouse, E.J.: The role of user preference in the customized control of robotic exoskeletons. Science robotics 7 (2022)</p><p>\\\n[16] Pinto-Fernandez, D., Diego, T., Carmen Sanchez-Villamanan, M., Aller, F., Mombaur, K., Conti, R., Vitiello, N., Moreno, J.C., Pons, J.L.: Performance evaluation of lower limb exoskeletons: A systematic review. IEEE Transactions on Neural Systems and Rehabilitation Engineering 28, 1573–1583 (2020)</p><p>\\\n[17] Slade, P., Kochenderfer, M.J., Delp, S.L., Collins, S.H.: Personalizing exoskeleton assistance while walking in the real world. Nature 610, 277–282 (2022)</p><p>\\\n[18] Medina, J.R., Lorenz, T., Hirche, S.: Synthesizing anticipatory haptic assistance considering human behavior uncertainty. IEEE Transactions on Robotics 31, 180– 190 (2015)</p><p>\\\n[19] Martinez, A., Lawson, B., Durrough, C., Goldfarb, M.: A velocity-field-based controller for assisting leg movement during walking with a bilateral hip and knee lower limb exoskeleton. IEEE Transactions on Robotics 35, 307–316 (2018)</p><p>\\\n[20] Shushtari, M., Nasiri, R., Arami, A.: Online reference trajectory adaptation: A personalized control strategy for lower limb exoskeletons. IEEE Robotics and Automation Letters 7, 128–134 (2021)</p><p>\\\n[21] Asl, H.J., Yamashita, M., Narikiyo, T., Kawanishi, M.: Field-based assist-asneeded control schemes for rehabilitation robots. IEEE/ASME Transactions on Mechatronics 25, 2100–2111 (2020)</p><p>\\\n[22] Dominijanni, G., Pinheiro, D.L., Pollina, L., Orset, B., Gini, M., Anselmino, E., Pierella, C., Olivier, J., Shokur, S., Micera, S.: Human motor augmentation with an extra robotic arm without functional interference. Science Robotics 8 (2023)</p><p>\\\n[23] Losey, D.P., Mcdonald, C.G., Battaglia, E., O’Malley, M.: A review of intent detection, arbitration, and communication aspects of shared control for physical human-robot interaction. Applied Mechanics Reviews 70 (2018) https://doi.org/ 10.1115/1.4039145</p><p>\\\n[24] Jackson, R.W., Collins, S.H.: Heuristic-based ankle exoskeleton control for coadaptive assistance of human locomotion. IEEE Transactions on Neural Systems and Rehabilitation Engineering 27, 2059–2069 (2019)</p><p>\\\n[25] Banala, S.K., Agrawal, S.K., Scholz, J.P.: Active leg exoskeleton (alex) for gait rehabilitation of motor-impaired patients. In: 2007 IEEE 10th International Conference on Rehabilitation Robotics, pp. 401–407 (2007). 2007 IEEE 10th International Conference on Rehabilitation Robotics</p><p>\\\n[26] Dinovitzer, H., Shushtari, M., Arami, A.: Feedforward control of lower limb exoskeletons: which torque profile should we use? IEEE Robotics and Automation Letters (2023)</p><p>\\\n[27] Dinovitzer, H., Shushtari, M., Arami, A.: Accurate real-time joint torque estimation for dynamic prediction of human locomotion. IEEE Transactions on Biomedical Engineering 70, 2289–2297 (2023)</p><p>\\\n[28] Shushtari, M., Dinovitzer, H., Weng, J., Arami, A.: Ultra-robust estimation of gait phase. IEEE Transactions on Neural Systems and Rehabilitation Engineering 30, 2793–2801 (2022)</p><p>\\\n[29] Shushtari, M., Arami, A.: Human–exoskeleton interaction force estimation in indego exoskeleton. Robotics 12, 66 (2023)</p><p>\\\n[30] Carroll, K., Kennedy, R., Koutoulas, V., Bui, M., Kraan, C.: Validation of shoeworn gait up physilog® 5 wearable inertial sensors in adolescents. Gait &amp; Posture 91, 19–25 (2022)</p><p>\\\n[31] Schwameder, H., Andress, M., Graf, E., Strutzenberger, G.: Validation of an imu-system (gait-up) to identify gait parameters in normal and induced limping walking conditions. In: ISBS-conference Proceedings Archive (2015)</p><p>\\\n[32] Pedotti, A., Krishnan, V.V., Stark, L.: Optimization of muscle-force sequencing in human locomotion. Mathematical Biosciences 38, 57–76 (1978)</p><p>\\\n[33] Crowninshield, R.D., Brand, R.A.: A physiologically based criterion of muscle force prediction in locomotion. Journal of Biomechanics 14, 793–801 (1981)</p><p>\\\n[34] Lieber, R.L., Roberts, T.J., Blemker, S.S., Lee, S.S.M., Herzog, W.: Skeletal muscle mechanics, energetics and plasticity. Journal of Neuroengineering and Rehabilitation 14, 1–16 (2017)</p>","contentLength":13328,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Free Energy Principle and the Simulation Hypothesis","url":"https://hackernoon.com/the-free-energy-principle-and-the-simulation-hypothesis?source=rss","date":1737907843,"author":"Laszlo Fazekas","guid":273,"unread":true,"content":"<p>\\\nOnce, my little son asked me why people fear the dark. I told him that our brains constantly dream, even when we’re awake. When awake, this dream is in sync with the outside world we perceive (what we see, hear, etc.). When it’s dark, visual stimuli disappear, and our brains start filling the void.</p><p>\\\nAnd why does it fill it with scary things? Perhaps there’s an evolutionary reason for this. If we assume there are frightening things in the dark, we become more cautious. Better safe than sorry.</p><p>\\\nWhen I explained this to my son, I didn’t know that it was an existing theory with a name: the&nbsp;<a href=\"https://en.wikipedia.org/wiki/Free_energy_principle\">Free Energy Principle</a>.</p><p>\\\nAccording to the Free Energy Principle, our brain is fundamentally a prediction machine. Its most important function is to anticipate the future. The evolutionary reason for this is quite obvious: if you can predict a predator's attack, you can escape in time; if you can't, you die.</p><p>\\\nArtem Kirsanov made an excellent video about the Free Energy Principle. For anyone interested in delving deeper into the topic, it’s highly recommended to watch it:</p><p>According to the theory, every human brain contains an abstract model of reality (a world model) that it uses to make predictions. The brain continuously fine-tunes these predictions based on incoming stimuli from the environment, and this is how our perception of reality is constructed.</p><p>\\\nArtem illustrates this with an example involving a tiger in his video. If we see yellow and black stripes in the distance, our brain can generate several predictions. It could be a person wearing a tiger-striped shirt, a toy tiger lost by a child, or even a real tiger. The brain, therefore, has multiple theories about how to interpret the sensory input. This \"uncertainty\" is referred to in the theory as free energy, and the brain's goal is to minimize this free energy—essentially reducing the chance of being surprised as much as possible.</p><p>\\\nAs more information comes in from the environment, the number of possible theories decreases. For example, if we see the tiger pattern moving, the toy tiger theory can be ruled out, leaving us with either a person or a real tiger. If we’re in a park, it’s most likely a person walking through the bushes. If we’re on a safari, however, it’s far more likely to be a real tiger.</p><p>\\\nAccording to the Free Energy Principle, perceiving reality is not a passive process. The reality we experience is something we project rather than merely perceive. The perceived reality largely originates from within, while sensory input from the environment serves to fine-tune this internal concept.</p><p>\\\nThere’s an idea that has been on my mind for a long time: what would happen if we removed sensory input from the process and connected brains directly to each other?</p><p>\\\nImagine four people lying in isolation tanks, completely shutting out all external stimuli. Their brains are connected via advanced BCI (Brain-Computer Interface) systems. It’s far from certain that this could ever be achieved, and it’s obviously not trivial from a technological standpoint, but let’s entertain the thought experiment.</p><p>\\\nAt the moment of connection, without any external stimuli, the state would likely be quite chaotic (with a very high level of free energy). However, since each brain would be working to reduce this free energy, an equilibrium state would eventually be reached, and the four brains would synchronize. What would it feel like to experience this equilibrium state?</p><p>\\\nWe have experienced what it’s like when our brain generates \"reality\" without sensory input based on its world model. This happens when we dream. But what would it be like if four people were to dream the same dream simultaneously?</p><p>\\\nSince four brains would be working simultaneously to minimize surprises (reduce free energy), this shared dream would likely feel much more real than traditional dreams—perhaps so real that it would be entirely indistinguishable from external reality.</p><p>\\\nWhen we think about fully immersive virtual reality, we often assume it will require immense computational power, as simulating the physical world is an incredibly complex task. However, it’s quite possible that simply connecting people’s brains directly could be enough—the brain might handle the rest on its own.</p><blockquote><p><strong>To create the true metaverse, we don’t need supercomputers capable of perfectly simulating the physical world—what we need are wires connecting brains.</strong></p></blockquote><p>\\\nHow human brains could be \"wired together\" is, of course, a very difficult question to answer. The most likely candidate for this would be some form of BCI (Brain-Computer Interface), such as Neuralink, where electrodes detect neural activity and stimulate neurons. Other possibilities include magnetic field-activated nanoparticles or light (I wrote an <a href=\"https://hackernoon.com/neuralink-openwater-darpa-n3-and-our-future-matrix-style-immersive-vr\">entire article</a> on this topic a few years ago), but something entirely unconventional could also emerge—for instance, direct biological connections using specialized fungi.</p><p>\\\nImagine if people spent the majority of their lives in fully immersive VR—it could drastically reduce humanity's consumption and environmental impact. In a world where resource usage is minimized and existing resources are optimally distributed, there would be no scarcity, no inequality, wars would lose their purpose, and there would be no need to exploit nature.</p><p>\\\nFor those interested in exploring this topic further, you can read a full article about it here:</p><p>\\\nThe question arises: if the fake reality created by connecting brains is completely indistinguishable from “real reality”, isn’t it possible that we’re already living in such a fake reality? Yes, yes—this brings us to the good old Simulation Hypothesis.</p><p>\\\nSeveral studies have explored how we might prove if we are indeed living in a simulation. Without exception, these theories focus on identifying the limits of the computer running the simulation. They propose experiments designed to push the simulating computer into calculations it cannot perform.</p><p>\\\nBut what if there is no computer? What if the simulation runs directly on our brains? In such a case, it would be impossible to prove we are living in a simulation because no matter what experiment we conduct, we would always receive results that align with our expectations and confirm that our world is not a simulation.</p><p>\\\nBut if we are indeed living in a simulation, who created it? This is another common question related to the Simulation Hypothesis. However, there’s a very simple answer to this: perhaps we have always existed in this interconnected state, as a single mind, and the real illusion is that we are separate individuals.</p><p>\\\nThis idea is the focus of my recent article on the <a href=\"https://hackernoon.com/is-the-universe-capable-of-thinking-according-to-sabine-hossenfelder-maybe\">Thinking Universe</a>. For those interested in exploring the topic further, I delve into this concept in detail there.</p><p>\\\nThe Free Energy Principle is a fascinating theory from the perspectives of neuroscience and artificial intelligence. However, the most exciting aspect is that it allows us to understand our brain’s functioning deeply enough to potentially \"hack\" it. <strong>Such a technology would surpass all others, as it wouldn’t just solve problems—it would enable us to create entirely new realities for ourselves where those problems don’t even exist!</strong></p>","contentLength":7260,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The HackerNoon Newsletter: HackerNoon Decoded: The Polls that Defined 2024 (1/26/2025)","url":"https://hackernoon.com/1-26-2025-newsletter?source=rss","date":1737907588,"author":"Noonification","guid":272,"unread":true,"content":"<p>🪐 What’s happening in tech today, January 26, 2025?</p><p>By <a href=\"https://hackernoon.com/u/hackernooncontests\">@hackernooncontests</a> [ 4 Min read ] Join the Spacecoin Writing Contest, today! Win from a 15,000 USDT prize pool by writing on decentralized internet, space tech, blockchain use cases  more.  <a href=\"https://hackernoon.com/win-your-share-of-15000-usdt-in-the-spacecoin-writing-contest-by-spacecoin-and-hackernoon\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/decoded\">@decoded</a> [ 7 Min read ] Discover HackerNoon Decoded: the top stories, writers, and trends that defined 2024. Celebrate the readers and writers who shaped our community! <a href=\"https://hackernoon.com/welcome-to-hackernoon-decoded-the-best-of-2024\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/decoded\">@decoded</a> [ 3 Min read ] Step aside Pitbull, theres a new Mr. Worldwide. Check out the top 10 countries where HackerNoon is the most active! <a href=\"https://hackernoon.com/hackernoon-coded-the-top-10-countries-where-hackernoon-is-the-most-active\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/maken8\">@maken8</a> [ 3 Min read ] Donald Trump has already withdrawn $500m from his memecoin $TRUMP. <a href=\"https://hackernoon.com/donald-trump-executes-the-ultimate-crypto-rug-pull\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/cybershivank\">@cybershivank</a> [ 8 Min read ] Learn how to turn your Raspberry Pi into a secure personal cloud server with Open Media Vault, giving you full control over your storage and privacy. <a href=\"https://hackernoon.com/why-pay-for-the-cloud-build-your-own-with-raspberry-pi-and-open-media-vault\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/axotion\">@axotion</a> [ 11 Min read ] A long time ago, I had to create a scalable system that could be capable of handling hundreds of simultaneous connections at not very high cost. <a href=\"https://hackernoon.com/how-i-solved-the-websocket-scaling-problem-without-breaking-the-bank\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/decoded\">@decoded</a> [ 5 Min read ] See which HackerNoon 2024 polls were the community favorites and received the most votes. The top 10 voters are included. <a href=\"https://hackernoon.com/hackernoon-decoded-the-polls-that-defined-2024\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/2077research\">@2077research</a> [ 59 Min read ] Learn how EIP-7251 increases maximum effective balance (MaxEB) for Ethereum validators and its impact on staking, rewards, and the Ethereum network. <a href=\"https://hackernoon.com/eip-7251-raising-maximum-effective-balance-for-validators\">Read More.</a></p><p>🧑‍💻 What happened in your world this week?</p><p>We hope you enjoy this worth of free reading material. Feel free to forward this email to a nerdy friend who'll love you for it.See you on Planet Internet! With love, \n The HackerNoon Team ✌️</p>","contentLength":1669,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"HackerNoon Decoded 2024: Celebrating Our Futurism Community!","url":"https://hackernoon.com/hackernoon-decoded-2024-celebrating-our-futurism-community?source=rss","date":1737907202,"author":"HackerNoon Decoded","guid":271,"unread":true,"content":"<h3>You Saw Trends Before They Became Reality</h3><p>\\\nWe were promised flying cars, but all we got was you… glued to Futurism stories.</p><p>\\\nNo joke! If Futurism was your top tech category, you're part of the  who share the same passion.</p><p>:::tip\nDive into Your HackerNoon 2024 Decoded—Explore Your Data On Your Profile Page Now!</p><h2>Most Read Futurism Stories</h2><p><strong>Here are the top 10 Futurism stories that had us all saying, ‘wait, is this even real?’ in 2024:</strong></p><p><strong>These readers couldn't get enough of Futurism content:</strong></p><p><strong>These prolific writers shaped our content landscape:</strong></p><p>We want to take a moment to thank you for your continued support and for choosing HackerNoon as your go-to platform for all things tech. Your engagement, feedback, and passion for sharing knowledge have helped make HackerNoon what it is today. We're grateful to have you as part of this incredible community, and we can’t wait to see what you’ll achieve with us in 2025 and beyond! \\n </p><p>:::tip\nDive into Your HackerNoon 2024 Decoded—Explore Your Data On Your Profile Page Now!</p><p>\\\nHappy HackerNoon Decoded!</p>","contentLength":1053,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"2025 will likely be another brutal year of failed startups, data suggests","url":"https://techcrunch.com/2025/01/26/2025-will-likely-be-another-brutal-year-of-failed-startups-data-suggests/","date":1737907200,"author":"Mary Ann Azevedo","guid":154,"unread":true,"content":"<p>More startups shut down in 2024 than the year prior and a high volume of startup failures will continue, data from multiple sources.</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":195,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How We Measure the Impact of Exoskeletons on the Body","url":"https://hackernoon.com/how-we-measure-the-impact-of-exoskeletons-on-the-body?source=rss","date":1737906303,"author":"Exoself Technology Research","guid":270,"unread":true,"content":"<p>(1) Mohammad Shushtari, Department of Mechanical and Mechatronics Engineering, University of Waterloo (smshushtari@uwaterloo.ca);</p><p>(2) Julia Foellmer, Mechanics and Ocean Engineering Department, Hamburg University of Technology (julia.foellmer@tuhh.de);</p><p>(3) Sanjay Krishna Gouda, Department of Mechanical and Mechatronics Engineering, University of Waterloo and Toronto Rehabilitation Institute (KITE), University Health Network (arash.arami@uwaterloo.ca).</p><h3>5.4.1 Ground Reaction Force</h3><p>Force plates are utilized to measure the ground reaction forces (GRF) in the vertical, lateral, and longitudinal directions. Heel strike events are detected using the vertical GRF, enabling the segmentation of collected data into individual strides. The recorded GRF during no exoskeleton walking is temporally normalized and averaged based on the gait phase as</p><p>The EMG data was bandpass filtered, with cutoff frequencies of 5 and 500 Hz. The signal was then full-wave rectified and its envelope was computed by applying a moving average with a window of 100 ms. Each EMG signal is normalized by its respective maximum voluntary contraction (MVC), computed for each muscle as the maximum measured contraction during walking on the treadmill (maximum across with and without the exoskeleton walking). The average muscle effort [32, 33] is computed for each muscle at each stride as</p><p>The human-exoskeleton interaction torque is estimated based on Eq. 1, given by</p><p>\\\nThe mean absolute interaction torque is then calculated for each joint as:</p><p>VO2 is computed for each breath. To normalize the VO2 measurements across participants, the average VO2 during treadmill walking with no exoskeleton at each speed v is computed as:</p><h3>5.4.5 Human-Exoskeleton Interaction Portrait (IP) Analysis</h3><p>\\\nAfter normalizing ∆τ and ∆µ across participants and walking speeds, we investigate their variation with respect to each other. Fig. 1 illustrates the possible outcomes:</p><p>\\\n<strong>• Disagreement Increase (∆τ &gt; 0 , ∆µ &gt; 0)</strong> This condition is associated with an increase in both the total interaction torque and the total muscular effort, indicating that switching from controller c1 to controller c2 has led to an elevation of human muscular effort. Consequently, their contribution to motion has increased. This, however, has resulted in a higher total interaction torque with the exoskeleton, implying that the applied torques by the exoskeleton are not aligned with the user’s desired motion. As a result, the user needs to exert additional effort to correct the motion while contending against the applied torques from the exoskeleton. Thus, the increased interaction indicates a lack of harmony between the user’s intentions and the assistance delivered by the exoskeleton.</p><p>\\\n<strong>• Disagreement Decrease (∆τ &lt; 0 , ∆µ &lt; 0)</strong> If controller c2 demonstrates improved consistency compared to c1 with the user’s desired motion, the user will experience less resistance from the exoskeleton. This reduced discordance between the exoskeleton and the user’s intended movements results in decreased total muscular effort and overall exertion by the user. Additionally, achieving a further reduction in disagreement between the human and exoskeleton can lead to one of the two next scenarios.</p><p>\\\n<strong>• Human Yields Control to Robot (∆τ &gt; 0 , ∆µ &lt; 0)</strong> With the continued reduction in human-user interaction, a user may consider relinquishing motion control to the exoskeleton. This implies that the user will no longer actively contribute to the movement and will essentially deactivate their muscles, resulting in a decrease in overall muscular effort. Consequently, the exoskeleton must generate the necessary torque to facilitate the movement of both the exoskeleton and the passive dynamics of the human body. The increase in human-exoskeleton interaction torques, in this scenario, is not due to conflicts between the exoskeleton’s motion and the user’s desired motion but rather because the exoskeleton is effectively carrying the user’s body.</p><p>\\\n<strong>• Human Takes Control (∆τ &lt; 0 , ∆µ &gt; 0)</strong> In a contrasting scenario, the user may actively participate in the motion, resulting in an increased level of muscular effort. Consequently, the total interaction torque between the user and the exoskeleton may decrease. This reduction occurs because the human and exoskeleton motions are synchronized in time and consistent in space, creating a harmonious alignment between the two.</p><p>\\\nWe conducted the aforementioned analysis at various speeds for the TBC→HTC, TBC→AMTC, and HTC→AMTC cases. We also performed a stride-wise analysis for the TBC→HTC and TBC→AMTC scenarios, which involves computing changes of total interaction force and muscle effort at each stride during the HTC and AMTC controllers as</p><p>\\\nwhere c ∈ {HTC, MBTC}. These calculations allowed us to analyze the precise changes in interaction force and muscular effort for each stride during the HTC and AMTC controllers in relation to the TBC controller.</p><h3>5.4.6 Statistical Analysis</h3><p>To identify statistical differences, we initially employed a Friedman test with a significance level of 0.05 to test group-level differences. Following the Friedman test, we conducted pairwise comparisons, between the blocks, using the Wilcoxon signed-rank test. To account for multiple comparisons between the three blocks, we applied the Bonferroni correction.</p>","contentLength":5380,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Europe Made More Electricity from Solar Than Coal In 2024","url":"https://hardware.slashdot.org/story/25/01/25/0119258/europe-made-more-electricity-from-solar-than-coal-in-2024?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737905640,"author":"EditorDavid","guid":228,"unread":true,"content":"Long-time Slashdot reader AmiMoJo shared this report from the Guardian:\nMore electricity was made from sunshine than coal in the EU last year, a report has found, in what analysts called a \"milestone\" for the clean energy transition. Solar panels generated 11% of the EU's electricity in 2024, while coal-burning power plants generated 10%, according to data from climate thinktank Ember... \n\nCoal-burning in the EU power sector peaked in 2003 and has fallen by 68% since then. At the same time, clean sources of electricity have boomed. Wind and solar energy rose to 29% of EU electricity generation in 2024, while hydropower and nuclear energy continued to rebound from the 2022 lows... \n\nThe report found the share of coal fell in 16 of the 17 countries that still used it in 2024. It said the fuel has become \"marginal or absent\" in most systems. Germany and Poland, the two countries that burn most of the EU's coal, were among those where there was a shift to cleaner sources of energy. The share of coal in Germany's electricity grid fell 17% year-on-year, while in Poland it dropped8%, the report found.\n \nFossil gas also fell for the fifth year in a row, declining in 14 of the 26 countries, according to the article, and now accounting for just 16% of the electricity mix. \n\n\"The findings come despite a small increase in electricity demand after two years of steep decline brought on by Russia's full-scale invasion of Ukraine.\"","contentLength":1439,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AMD Squeezes In More RDNA4 Changes For Linux 6.14 - Enables Cleaner Shader On GFX12","url":"https://www.phoronix.com/news/AMDGPU-More-GFX12-Linux-6.14","date":1737905108,"author":"Michael Larabel","guid":652,"unread":true,"content":"<article>While the main feature pull of new and updated kernel graphics/accelerator drivers were merged already for the ongoing Linux 6.14 merge window, an additional set of AMDGPU changes were sent out this week for squeezing into this next kernel release...</article>","contentLength":250,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Just How Many Robots Can One Person Control at Once?","url":"https://spectrum.ieee.org/darpa-robot","date":1737900003,"author":"Michelle Hampson","guid":96,"unread":true,"content":"<p>A DARPA project overturns longstanding assumptions </p>","contentLength":51,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTY2OTkzMC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc1OTQwODEzNH0.qNbYE2RR9k_cPwEibfDENekp0ofA_li3CMU8nHx_qds/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"New CIA Director Touts 'Low Confidence' Assessment About Covid Lab Leak Theory","url":"https://news.slashdot.org/story/25/01/26/0351245/new-cia-director-touts-low-confidence-assessment-about-covid-lab-leak-theory?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737894840,"author":"EditorDavid","guid":227,"unread":true,"content":"Slashdot reader DevNull127 writes: \"Every US intelligence agency still unanimously maintains that Covid-19 was not developed as a biological weapon,\" CNN reported today. \n\nBut what about the possibility of an accidental leak (rather than Covid-19 originating in wild animal meat from the Wuhan Market)? \"The agency has for years said it did not have enough information to determine which origin theory was more likely.\" \n\nCNN notes there's suddenly been a new announcement \"just days\" after the CIA's new director took the reins — former lawyer turned Republican House Representative John Ratcliffe. While the market-origin theory remains a possibility according to the CIA, CNN notes that Ratcliffe himself \"has long favored the theory that the pandemic originated from research being done in China and vowed in an interview published in Breitbart on Thursday that he would make the issue a Day 1 priority.\" \n\n\"We have low confidence in this judgement,\" the CIA says in the complete text of its announcement, \"and will continue to evaluate any available credible new intelligence reporting or open-source information that could change CIA's assessment.\" \n\n\nAfter speaking to a U.S. official, CNN added these details about the assessment:\nIt was not made based on new intelligence gathered by the US government — officials have long said such intelligence is unlikely to surface so many years later — and instead was reached after a review of existing information. \n\"CIA continues to assess that both research-related and natural origin scenarios of the COVID-19 pandemic remain plausible,\" a CIA spokesperson said in a statement Saturday. \n\nCNN adds that \"Many scientists believe the virus occurred naturally in animals and spread to humans in an outbreak at a market in Wuhan, China....\"","contentLength":1795,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux Patches Allow Sharing PTEs Between Processes - Can Mean Significant RAM Savings","url":"https://www.phoronix.com/news/Linux-Sharing-PTEs-Processes","date":1737893400,"author":"Michael Larabel","guid":651,"unread":true,"content":"<article>A set of patches being worked on by Oracle engineers allow for optionally sharing page table entries (PTEs) between processes. For some workloads this can equate to very significant memory savings...</article>","contentLength":199,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Mesa 25.0 Gets A New Vulkan Layer For Limiting The Amount Of Reported vRAM","url":"https://www.phoronix.com/news/Mesa-Vulkan-vRAM-Report-Limit","date":1737892160,"author":"Michael Larabel","guid":650,"unread":true,"content":"<article>A half-year-old merge request from Igalia's Karmjit Mahil has been merged for Mesa 25.0 that is a Vulkan layer allowing for optionally limiting the amount of video memory reported to games/applications...</article>","contentLength":204,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"New Sound Hardware Supported By The Linux 6.14 Kernel","url":"https://www.phoronix.com/news/Linux-6.14-New-Sound-Hardware","date":1737891646,"author":"Michael Larabel","guid":649,"unread":true,"content":"<article>Merged this week for the Linux 6.14 kernel were the various sound/audio driver updates. In addition to core API enhancements for better supporting the MIDI 2.0 specification, there is also support for some new audio hardware...</article>","contentLength":227,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.14 Adds ROCEv2 Support For The Alibaba Cloud","url":"https://www.phoronix.com/news/Linux-6.14-RDMA","date":1737890477,"author":"Michael Larabel","guid":648,"unread":true,"content":"<article>The RDMA subsystem updates have been merged for the Linux 6.14 kernel with a light set of changes overall and the most significant being support for the ROCEv2 protocol within the ERDMA driver...</article>","contentLength":195,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Operation Destabilize: 6 Key Takeaways for the Crypto Industry","url":"https://hackernoon.com/operation-destabilize-6-key-takeaways-for-the-crypto-industry?source=rss","date":1737890231,"author":"Lex Fisun","guid":269,"unread":true,"content":"<p>Following the news about&nbsp;, in which the UK’s National Crime Agency (NCA) disrupted two multi-billion Russian money laundering networks with links to drug trafficking, ransomware, and espionage and made 84 arrests, we have aimed to shed light on how these networks used crypto in their operations.</p><p>\\\n<em>As a reminder, the networks, Smart and TGR, facilitated the movement of criminally gained funds from one country to another using cryptocurrency transfers. Such crypto transactions were used both to launder money and to bypass Western sanctions against Russia.</em></p><p>As a result of the operation, the US Office of Foreign Assets Control (OFAC)&nbsp;&nbsp;five individuals and four entities associated with the criminal networks. The designation also included two crypto addresses used by two of the designated individuals. The addresses belonged to two Russian nationals, Elena Chirkinyan (Chirkinyan), the second-in-command within the TGR network, as well as Khadzhi Murat Dalgatovich Magomedov (Magomedov), a professional money launderer for Russian clients.</p><h2><strong>Sanctioned Crypto Addresses: Six Lessons Learned</strong></h2><h3><strong>1.&nbsp;USDT is #1 for laundering</strong></h3><p>Most laundering operations relied on Tether (USDT), a commonly used stablecoin that preserves the value of transfers. Given the volume of transactions, including numerous cash-to-crypto exchanges, Tether allowed criminals to minimize value loss across transfers.</p><h3><strong>2. 195M+ USDT laundered via Magomedov’s sanctioned wallet</strong></h3><p>The total value of cryptocurrency laundered through Magomedov’s sanctioned wallet exceeded USDT 195 million, as outlined in the Counterparty Report below. The laundering activity included interactions with a wide range of counterparties, but the wallet’s largest counterparty was a major centralized exchange.</p><p>\\\nSource: Gl Vision Protocol —&nbsp;<strong>3. 146K+ USDT laundered through Chirkinyan’s wallet</strong></p><h3><strong>3. 146K+ USDT laundered through Chirkinyan’s wallet</strong></h3><p>In contrast, the total value of cryptocurrency transacted through Chirkinyan’s wallet was much smaller, amounting to just over USDT 146,000. \\n </p><h3><strong>4. Addresses made direct deposits to CEXs, including both well-regulated ones and sanctioned Garantex</strong></h3><p>Both wallets’ top counterparties included addresses at top well-known and well-regulated crypto exchanges.</p><p>\\\nHowever, they also engaged in transactions with the Russian crypto exchange Garantex long after it&nbsp;&nbsp;in April 2022. For example, Chirkinyan’s wallet received deposits totaling over USD 22,000 from Garantex between June 2022 and February 2023. Additionally, an unsanctioned wallet transferred 1,295 USDT to Chirkinyan’s wallet and over USD 41,000 to Garantex in October 2024, demonstrating ongoing use of this sanctioned entity.</p><p>\\\nAs for the number of counterparties involved, Magomedov’s wallet interacted with a significantly greater number of exchanges and counterparties compared to Chirkinyan’s wallet, including activity with a high-risk wallet previously flagged as a reported hack. Chirkinyan’s transactions mostly culminated in deposits to a prominent centralized exchange.</p><p>\\\nConversely, Magomedov’s transactions involved multiple counterparties. Notably, Magomedov’s activity did not include numerous hops aimed at obfuscating the flow of funds, opting instead for direct deposits to CEX deposit wallets.</p><h3><strong>5. Wallets interacted with exchanges requiring partial KYC</strong></h3><p>Except for CEXs, wallets interacted with exchanges requiring KYC only partially, depending on the customer’s activity, such as where KYC would only be required for crypto transfers, but not fiat ones.</p><h3><strong>6. Chirkinyan’s wallet received crypto from a Cyprus-based gambling service</strong></h3><p>One wallet was receiving incoming crypto transfers from a gambling service domiciled in Cyprus, which processes all its transactions in crypto.</p><h2><strong>Sanctioned Crypto Addresses: Challenges for the Industry</strong></h2><p>While the two sanctioned wallets are unlikely to continue operating due to their identification by blockchain analytics providers and likely blacklisting by crypto exchanges, numerous connected wallets may continue transacting and being used by professional money launderers. These wallet networks pose ongoing risks. We recommend these wallets be placed under monitoring using a blockchain analytics provider to prevent exposure and ensure compliance.</p><p>\\\nEven without reusing the wallets spotted as part of the transactional activity linked to the two sanctioned wallets, criminal networks can easily create new crypto addresses. Depending on the type of wallet and the platform being used, creating a wallet can take anywhere from a few seconds to a few minutes. The process could be slower if it includes additional verification steps, such as Know Your Customer procedures, which are usually required by centralized exchanges for custodial wallets but are not often included for decentralized ones.</p><p>In summary, while sanctioning these wallets was a necessary step, Chirkinyan’s and Magomedov’s wallets are unlikely to be reused for money laundering purposes. However, placing these wallets under monitoring and including them on an internal blacklist are recommended steps for industry players, such as crypto exchanges, to prevent any future exposure and to remain compliant.</p><p>\\\nWe also recommend that the full extent of these wallets’ activity be investigated and understood using a blockchain analytics tool and that all other direct past counterparties of these wallets be placed on a watchlist.</p><p>\\\nAs a common theme of the wallets’ activity was exposure to Garantex even after the exchange was sanctioned, it is advised that crypto industry participants use blockchain analytics to identify and prevent such exposure in the future.</p><p>\\\nFinally, crypto wallets identified as having frequent high-value incoming and outgoing transactions with an unusually large number of counterparties should be considered as presenting a higher risk of money laundering.</p>","contentLength":5877,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ran Hammer on Orbs' Strategic Approach to Decentralized Finance","url":"https://hackernoon.com/ran-hammer-on-orbs-strategic-approach-to-decentralized-finance?source=rss","date":1737887403,"author":"Ishan Pandey","guid":268,"unread":true,"content":"<p>\\\nFew voices carry the depth of insight that Ran Hammer brings to the table. A former corporate lawyer turned crypto innovator, Hammer has witnessed the transformation of digital finance from its nascent stages. In this exclusive interview, he pulls back the curtain on Orbs' groundbreaking Layer 3 solutions, sharing a narrative that bridges traditional finance and the cutting edge of web3 technology.</p><p>\\\n Hi Ran Hammer, welcome to our series on \"Behind The Startup\". As someone who has worked in areas such as law and business development. What insights and experience from your background have been most valuable in driving Orbs' growth?</p><p>\\\n Hey Ishan, thanks for the question. My crypto origin story begins in 2015. Back then, I was a corporate lawyer working mostly with startups in Tel Aviv. One of my clients reached out and told me they had raised funds in Bitcoin—which was around $280 at the time.</p><p>\\\nNaturally, I had to ask, \"What is Bitcoin?\" That question started my journey down the rabbit hole. We ended up converting all their crowdfunding funds into BTC at $280, and that experience opened my eyes to the potential of crypto.</p><p>\\\nHonestly, when building in crypto generally, and in DeFi specifically, it's a huge advantage to understand how things work in \"the real world.\" We have this amazing technology that allows us to redesign legacy finance from scratch, but it really helps to also understand how traditional financial markets operate.</p><p>\\\nAt Orbs, our focus is on building real products that people actually use and that really generate positive revenue. It's funny, but this isn't always the standard in the industry right now, with a lot of DeFI based on unsustainable token emissions. Having a solid sense of how real businesses operate definitely gives us an edge.</p><p>\\\n Orbs positions itself as a Layer 3 solution for bringing CeFi-level execution to DeFi. Can you explain how Orbs technology stack achieves this without moving liquidity to a new chain, and what specific advantages this architecture offers over traditional solutions?</p><p>\\\n For sure, Orbs operates as a dPOS blockchain, but it doesn't hold its own assets on the chain itself. Instead, it functions as an abstraction or oracle chain that exists between EVM chains and the dApps that operate on them. Orbs has node operators, which we've dubbed Guardians, who run a decentralized compute layer that hosts Orbs L3 protocols, including dTWAP, dLIMIT, Liquidity Hub, and Perpetual Hub.</p><p>\\\nWhat sets Orbs apart is its ability to enable developers to implement much more complex logic than what can be achieved using smart contract platforms alone, all while staying fully decentralized. This opens up possibilities for sophisticated applications without sacrificing the core principles of decentralization. </p><p>\\\nThe most apparent benefit of this approach is the enhanced execution capabilities, bringing CeFi-level performance to DeFi. Orbs' architecture also integrates seamlessly into existing ecosystems without fracturing liquidity further across new chains. Additionally, our protocols are designed to eliminate counterparty risk: funds never leave a user's wallet until an order is fully executed across all our protocols. This ensures a higher degree of security and trust while balancing innovation and user protection, offering developers and users the best of both worlds.</p><p>\\\n The dLIMIT and dTWAP protocols are key innovations from Orbs. How are these advanced order types changing the game for on-chain trading, and can you break down these order types of beginners who are just starting out in crypto?</p><p>\\\n dLIMIT and dTWAP have truly transformed the landscape of on-chain trading, and their adoption by major DEXs like PancakeSwap, SushiSwap, and others highlights their value. Even UniSwap has built its own version of advanced orders, underscoring how essential these tools are for traders today.</p><p>\\\nA dLIMIT order allows users to buy or sell tokens at a specific price. Unlike traditional market orders, which execute immediately at the current price, dLIMIT orders ensure the user's desired price is met before execution. However, execution isn't guaranteed—it depends on the market price aligning with the order specifications. This gives traders more control, especially in volatile markets.</p><p>\\\ndTWAP (Decentralized Time-Weighted Average Price) is an algorithmic trading strategy designed to minimize the market impact of large orders. It does this by splitting the order into smaller chunks that execute incrementally over a predefined time frame. For example, instead of swapping a large sum all at once, which could significantly impact the pool price, dTWAP executes smaller portions systematically. This not only reduces slippage but also ensures better price stability, which is crucial for traders managing significant assets.</p><p>\\\nIn DeFi, these tools are particularly important because liquidity pools need time to rebalance. By enabling features like precise execution with dLIMIT and efficient distribution with dTWAP, while using fully decentralised architecture, Orbs empowers traders to interact with decentralized exchanges in a way that was previously only available in CeFi.</p><p>\\\n With Animoca Japan joining as validator nodes on the Orbs Network, what role do you see gaming and Web3 playing in the future of DeFi?</p><p>\\\n On behalf of the team at Orbs, we're very thankful to Animoca Japan for helping us secure our network by becoming a validator node for Orbs. It is a testament to the robustness of our Japanese Community that without it, it is unlikely we would have had the opportunity. Regarding gaming in Web3, I view things as everything on-chain eventually flows back to DeFi, and I will explain. Truly on-chain games require infrastructure that has been built since DeFi's inception. </p><p>\\\nWhen you have a game on-chain, the resulting outcome that we've seen from Axie Infinity to DeFi Kingdoms is that they require on-chain marketplaces for transacting in-game currency, collectibles, and other sorts of miscellaneous economies that form around the various ecosystems. For some games, you even have peer-to-peer lending, where resources are lent in exchange for yield that that player earns. It is thus in my view that DeFi and on-chain games are inseparable.</p><p>\\\n Looking ahead to 2025, what key developments do you anticipate in the DeFi space?</p><p>\\\n In general, I think there are three key components that will see development in 2025. Firstly, Abstraction, the UX of crypto remains very poor, from onboarding all the way to news users making their first swap on a DEX and interacting with a DeFi protocol. This remains a significant hurdle for the industry that is starting to see improvements. Secondly, aggregation, crypto liquidity remains fragmented across multiple chains, protocols, and on and off chain sources.</p><p>\\\nThere are now however multiple venues and even DEXs that are working to solve this and the technology will only improve as time goes on. Lastly, availability, simply just ensuring that we have the same options that we have in CeFi are also robustlessly available in DeFi wether it's liquidity, the same level experience of perpetual trading or advanced order types. On a more protocol level, intent-based architecture has the hallmarks of being a really really powerful tool that has a plethora of use cases from liquidity aggregation, to cross-chain swaps and bridging solutions. AI is also interesting and obviously super trendy right now, that can be implemented both as a way to abstract complexity away from users and eventually participating in markets.</p><p>\\\n The Liquidity Hub is designed to optimize DEX pricing through aggregated liquidity. Can you share some specific examples of how this has improved trading for web3 users?</p><p>\\\n Liquidity Hub (LH) solves significant pain points for traders. When a user goes to a DEX they have really no way of knowing if they're getting the best price possible. One could in theory check all of the different aggregators, cross-chain pools, and CeFi prices if available, but it's very time consuming and with price fluctuations it's nearly impossible to ensure that you get the best price available. When a user swaps on a DEX that has integrated LH, LH performs a dutch auction between all of the available routers, some of which that support cross-chain swaps as well as private liquidity in the form of market makers to truly ensure that they're getting one of if not the best price available.</p><p>\\\nIn this way, Liquidity Hub can be thought of as an intent based system that abstracts the complexity of needing to check all of the potentially hundreds of different venues to ensure that they've received a fair price. Lastly, due to the architecture of LH swaps that are routed through it are completely gassless which is an additional win for traders.</p><p>\\\n As someone deeply involved in both the legal and business aspects of blockchain, what regulatory developments do you foresee impacting DeFi in 2025, and how should web3 projects prepare?</p><p>\\\n Since our industry has been around, regulatory ambiguity has created a \"chilling effect,\" sidelining significant capital from entering the DeFi space. While it's difficult to predict the future with certainty, we are starting to see positive signals that this trend could change. For instance, U.S. President Donald Trump, has recently expressed strong pro-crypto sentiments, which could play a pivotal role in shaping a more favorable regulatory framework if his policies are implemented.</p><p>\\\nA clear and consistent regulatory environment in the U.S. would likely have a cascading effect, as many countries tend to follow America's lead when it comes to financial regulations. This clarity could unlock a wave of institutional capital for the blockchain industry, including DeFi, and spur innovation globally.</p><p>\\\nWeb3 projects should focus on building great products that genuinely bring value to their users. While it's essential to stay aware of evolving regulatory requirements and aim for compliance, the priority should always be on creating solutions that solve real problems and push the space forward. By focusing on innovation and user value, projects can position themselves for long-term success, no matter how the regulatory landscape evolves.</p><p>\\\nDon’t forget to like and share the story!</p><p>:::tip\n<strong>Vested Interest Disclosure:</strong>&nbsp;This author is an independent contributor publishing via our&nbsp;. HackerNoon has reviewed the report for quality, but the claims herein belong to the author. #DYOR</p>","contentLength":10489,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"FSF: Meta's License for Its Llama 3.1 AI Model 'is Not a Free Software License'","url":"https://news.slashdot.org/story/25/01/25/2311217/fsf-metas-license-for-its-llama-31-ai-model-is-not-a-free-software-license?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737880440,"author":"EditorDavid","guid":226,"unread":true,"content":"July saw the news that Meta had launched a powerful open-source AI model, Llama 3.1. \n\nBut the Free Software Foundation evaluated Llama 3.1's license agreement, and announced this week that \"this is not a free software license and you should not use it, nor any software released under it.\"\n\n\nNot only does it deny users their freedom, but it also purports to hand over powers to the licensors that should only be exercised through lawmaking by democratically-elected governments. \n\nMoreover, it has been applied by Meta to a machine-learning (ML) application, even though the license completely fails to address software freedom challenges inherent in such applications.... \n\nWe decided to review the Llama license because it is being applied to an ML application and model, while at the same time being presented by Meta as if it grants users a degree of software freedom. This is certainly not the case, and we want the free software community to have clarity on this.\n \n\nIn other news, the FSF also announced the winner of the logo contest for their big upcoming 40th anniversary celebration.","contentLength":1096,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The TechBeat: 9 Big Takeaways From Data Analytics This Year (1/26/2025)","url":"https://hackernoon.com/1-26-2025-techbeat?source=rss","date":1737875453,"author":"Techbeat","guid":267,"unread":true,"content":"<p>By <a href=\"https://hackernoon.com/u/decoded\">@decoded</a> [ 3 Min read ] \n Step aside Pitbull, there's a new Mr. Worldwide. Check out the top 10 countries where HackerNoon is the most active! <a href=\"https://hackernoon.com/hackernoon-coded-the-top-10-countries-where-hackernoon-is-the-most-active\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/2077research\">@2077research</a> [ 13 Min read ] \n Learn how EIP-7623 proposes adjustments to Ethereum calldata pricing that aim to make gas costs fairer and better reflect resource consumption by users. <a href=\"https://hackernoon.com/eip-7623-the-proposal-that-will-re-price-calldata-for-ethereum-transactions\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/aisweatshop\">@aisweatshop</a> [ 3 Min read ] \n AiSweat.Shop just bagged a game-changing grant and strategic support from the Arbitrum Foundation, setting the stage for a revolutionary leap in DeFi: DeAI-Fi. <a href=\"https://hackernoon.com/aisweatshop-secures-arbitrum-grant-to-build-federal-reserve-for-ai-agents\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/dadan\">@dadan</a> [ 4 Min read ] \n Interactive video is likely to take over conventional education, offering numerous benefits for students. Dadan.io empowers educators for this shift.  <a href=\"https://hackernoon.com/forget-books-and-physical-classes-the-future-of-learning-is-interactive-video\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/proflead\">@proflead</a> [ 4 Min read ] \n In this article, I’ll give you an easy-to-follow Obsidian tutorial to help you get started. We’ll talk about how to use Obsidian and its key features. <a href=\"https://hackernoon.com/obsidian-for-beginners-the-only-guide-youll-ever-need\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/brightdata\">@brightdata</a> [ 6 Min read ] \n Let's explore why SEO SERP data is now facing outages due to Google's new restrictions on web scraping. <a href=\"https://hackernoon.com/surviving-the-google-serp-data-crisis\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/obyte\">@obyte</a> [ 5 Min read ] \n There’s a whole crypto industry right now, built by people and companies from all around the world, and it’s likely bigger than you think. \n <a href=\"https://hackernoon.com/cryptos-$35-trillion-market-cap-is-impressivebut-the-real-moneys-hiding-in-plain-sight\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/yahiabsat\">@yahiabsat</a> [ 15 Min read ] \n Challenges like system customization, fragile GUIs, and authentication hurdles make full automation elusive.  <a href=\"https://hackernoon.com/2025-might-be-the-year-of-ai-agents-if-they-can-survive-enterprise-hell\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/scottdclary\">@scottdclary</a> [ 11 Min read ] \n Excellence isn't an event—it's a habit. Learn why every moment, big or small, matters and how consistency builds a lasting reputation for success. <a href=\"https://hackernoon.com/why-you-cant-afford-off-days\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/ishanpandey\">@ishanpandey</a> [ 7 Min read ] \n Top 5 promising crypto projects for 2025: EOS, My Neighbor Alice, Chainlink, Somnia, and Polygon. Analysis of their potential growth, features, and impact on bl <a href=\"https://hackernoon.com/these-5-crypto-projects-are-solid-bets-for-massive-growth-in-2025\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/juancguerrero\">@juancguerrero</a> [ 5 Min read ] \n Neuman wasn’t failing at traditional business; he was attempting something altogether different: bridging multiple planes of consciousness in an outdated system <a href=\"https://hackernoon.com/the-inconvenient-truth-about-adam-neumann-that-no-tech-journalist-will-tell-you\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/buzzpy\">@buzzpy</a> [ 13 Min read ] \n Let's build our own Machine Learning Model with Tensorflow, a Python library.  <a href=\"https://hackernoon.com/a-basic-knowledge-of-python-can-help-you-build-your-own-machine-learning-model\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/jonstojanjournalist\">@jonstojanjournalist</a> [ 5 Min read ] \n Hydra achieves 1M TPS on Cardano, showcasing unparalleled blockchain scalability in the Hydra Doom Tournament. A game-changer for DeFi and P2P applications. <a href=\"https://hackernoon.com/hydra-achieves-1-million-tps-validating-cardano-as-the-fastest-blockchain\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/harishk22\">@harishk22</a> [ 13 Min read ] \n Build a real-time chat app with Laravel Reverb, Sanctum, and Nuxt 3. Learn secure authentication, real-time updates, and modern chat features. <a href=\"https://hackernoon.com/here-are-the-frameworks-you-need-to-build-a-real-time-chat-app\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/samarthmshah\">@samarthmshah</a> [ 6 Min read ] \n The world is data-driven, and it has become a necessity to extract meaningful insights from unstructured data. <a href=\"https://hackernoon.com/9-big-takeaways-from-data-analytics-this-year\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/maken8\">@maken8</a> [ 5 Min read ] \n Enjoy 40 Bitcoin sayings from my Twitter feed, and thoughts on Bitcoin's role in improving our state professional protector groups. <a href=\"https://hackernoon.com/40-btc-sayings-in-280-characters-or-less\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/vinitabansal\">@vinitabansal</a> [ 11 Min read ] \n Manipulators are hard to spot because, with the intention to cheat and deceive, they use tricks that are meant to influence, exploit, and control you. <a href=\"https://hackernoon.com/master-manipulators-5-behaviors-to-watch-out-for\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/thomascherickal\">@thomascherickal</a> [ 11 Min read ] \n Jensen Hauang, Nvidia's CEO made a very controversial statement about quantum computing at CES 2025. This article tells you, with sources, why he was wrong. <a href=\"https://hackernoon.com/why-jensen-huang-is-completely-wrong-about-quantum-computing\">Read More.</a></p>","contentLength":3262,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Bill Gates Began the Altair BASIC Code in His Head While Hiking as a Teenager","url":"https://news.slashdot.org/story/25/01/26/0249204/bill-gates-began-the-altair-basic-code-in-his-head-while-hiking-as-a-teenager?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737867840,"author":"EditorDavid","guid":225,"unread":true,"content":"Friday Bill Gates shared an excerpt from his upcoming memoir Source Code: My Beginnings. Published in the Wall Street Journal, the excerpt includes pictures of young Bill Gates when he was 12 (dressed for a hike) and 14 (studying a teletype machine). \n\nGates remembers forming \"a sort of splinter group\" from the Boy Scouts when he was 13 with a group of boys who \"wanted more freedom and more risk\" and took long hikes around Seattle, travelling hundreds of miles together on hikes as long as \"seven days or more.\" (His favorite breakfast dish was Oscar Mayer Smokie Links.) But he also remembers another group of friends — Kent, Rick, and... Paul — who connected to a mainframe computer from a phone line at their private school. Both hiking and programming \"felt like an adventure... exploring new worlds, traveling to places even most adults couldn't reach.\" \n\nLike hiking, programming fit me because it allowed me to define my own measure of success, and it seemed limitless, not determined by how fast I could run or how far I could throw. The logic, focus and stamina needed to write long, complicated programs came naturally to me. Unlike in hiking, among that group of friends, I was the leader. \nWhen Gates' school got a (DEC) PDP-8 — which cost $8,500 — \"For a challenge, I decided I would try to write a version of the Basic programming language for the new computer...\" And Gates remembers a long hike where \"I silently honed my code\" for its formula evaluator:\n\n I slimmed it down more, like whittling little pieces off a stick to sharpen the point. What I made seemed efficient and pleasingly simple. It was by far the best code I had ever written... \nBy the time school started again in the fall, whoever had lent us the PDP-8 had reclaimed it. I never finished my Basic project. But the code I wrote on that hike, my formula evaluator — and its beauty — stayed with me. Three and a half years later, I was a sophomore in college not sure of my path in life when Paul Allen, one of my Lakeside friends, burst into my dorm room with news of a groundbreaking computer. I knew we could write a Basic language for it; we had a head start. \nGates typed his code from that hike, \"and with that planted the seed of what would become one of the world's largest companies and the beginning of a new industry.\" \n\nGates cites Richard Feynman's description of the excitement and pleasure of \"finding the thing out\" — the reward for \"all of the disciplined thinking and hard work.\" And he remembers his teenaged years as \"intensely driven by the love of what I was learning, accruing expertise just when it was needed: at the dawn of the personal computer.\"","contentLength":2674,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Shotcut 25.01 Open-Source Video Editor Brings New Features","url":"https://www.phoronix.com/news/Shotcut-25.01-Released","date":1737856152,"author":"Michael Larabel","guid":647,"unread":true,"content":"<article>The Shotcut open-source video editor is out with its first new release of 2025...</article>","contentLength":81,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Real estate firms pivot to energy development amid booming data center demand","url":"https://techcrunch.com/2025/01/25/amid-soaring-demand-for-data-centers-real-estate-companies-look-to-become-energy-developers/","date":1737851637,"author":"Connie Loizos","guid":153,"unread":true,"content":"<p>Brendan Wallace has a lot on his mind lately. Wallace is the co-founder of Fifth Wall Ventures, a nine-year-old proptech venture firm with $3.2 billion in assets under management. He’s also a homeowner in L.A., which continues to battle raging wildfires. While his place remains intact, many of his friends haven’t been so lucky.&nbsp; Wallace […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":412,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Trump administration reportedly negotiating an Oracle takeover of TikTok","url":"https://techcrunch.com/2025/01/25/trump-administration-reportedly-negotiating-an-oracle-takeover-of-tiktok/","date":1737845788,"author":"Anthony Ha","guid":152,"unread":true,"content":"<p>The Trump administration is negotiating a deal that would see Oracle take over TikTok alongside new U.S. investors, according to a report in NPR. Lawmakers passed a bill last year forcing Chinese parent company ByteDance to either sell TikTok or see it banned in the U.S. The app briefly went dark before the law took […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":386,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Will states lead the way on AI regulation?","url":"https://techcrunch.com/2025/01/25/will-states-lead-the-way-on-ai-regulation/","date":1737841034,"author":"Anthony Ha","guid":151,"unread":true,"content":"<p>Last year was a busy time for lawmakers and lobbyists concerned about AI — most notably in California, where Gavin Newsom signed 18 new AI laws while also vetoing high-profile AI legislation. And 2025 could see just as much activity, especially on the state level, according to Mark Weatherford. Weatherford has, in his words, seen […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":402,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How Gender and Race Labels Are Applied to NFT Data Analysis","url":"https://hackernoon.com/how-gender-and-race-labels-are-applied-to-nft-data-analysis?source=rss","date":1737837918,"author":"CryptoPunk Forum","guid":266,"unread":true,"content":"<p>(1) Howard Zhong, MIT CSAIL (howardzh@mit.edu);</p><p>(2) Mark Hamilton, MIT CSAIL, Microsoft (markth@mit.edu).</p><p>We describe the methods of analyzing the gender and race biases in the prices of NFTs. We first summarize our data collection process (Section 2.1 and 2.2) and then describe how we statistically quantify the gender and racial biases among different NFTs (Section 2.3). The steps are shown in Figure 2. More detailed description of methods and implementation can be found in the Appendix.</p><h3>2.1 Initial Data Collection</h3><p>Our dataset consists of NFTs transacted on OpenSea, which is the primary marketplace for NFTs on Ethereum. We query the OpenSea “v1/collections” endpoint at the end of November 2022 [15] to retrieve NFT metadata and last sale price. We choose 790 collections from the Kaggle Ethereum NFTs dataset [11] and NFTs from the top 30-day and all-time OpenSea volume leaderboard around November 2021. After the data collection process, we end up with ∼ 2.5 NFTs, each that have been transacted upon.</p><h3>2.2 Retrieving Race and Gender Labels</h3><p>Many NFT collections do not represent humans, and therefore cannot be directly studied through the lens of race and gender. We select collections that have metadata with the words “male” and “female” and end with a total of 44 such collections with gender labels representing different avatars. Statistics on these 44 collections with gender labels can be found in Table 6 in Appendix A.2.</p><p>\\\nAs far as we know, this is the first NFT dataset with gender labels across many collections. However, race labels often do not exist in the metadata, so we are limited to only CryptoPunks, Avastar, and Dynamic Duelers for collections with race labels.</p><p>To determine the statistical significance of the hypothesis that female NFTs are sold for less than male NFTs, we run both paired and unpaired one-sided Student’s t-tests [22].</p><p>\\\n<strong>Unpaired vs Paired t-test:</strong> For unpaired t-test, we compare the mean of all NFT sale prices for male versus for female. For paired t-test, we calculate t-statistics on the paired difference of male and female prices marked to the daily mean price and the weekly mean price of the NFT. The paired t-test is used to isolate the male versus female price difference by fixing price variation across time.</p><p>\\\n As t-test assume normality of the data, we apply a log transformation to address this. With rare NFTs worth significantly more than common NFTs, NFT price distributions tend to follow a power law distribution [14]. Inspired by how stock prices follow a log-normal distribution [1], we applied the same transformation and found the distribution of log of price to be more normal. We refer to running the t-test on the log of prices as log t-test.</p><p>\\\n Outliers may occur due to very high selling prices for rare NFTs or very low selling prices due to humans errors while listing. We address outliers using Winsorization [19], or trimming outliers past a certain percentile. We report results for 0.1%, 1%, 2.5%, and 5% percentiles.</p><p>\\\nThe approach described above is also used to compare the prices of light and dark CryptoPunks. We report results from combinations of different t-tests and outlier detection methods to show our conclusion remains consistent regardless of the way we conduct the statistical significance test. For the figures and statistics in this paper, unless otherwise stated, we remove outliers at the 2.5% percentile.</p>","contentLength":3418,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Absence of Gender Bias in NFT Prices Likely Reflects Balanced Investor Demographics","url":"https://hackernoon.com/absence-of-gender-bias-in-nft-prices-likely-reflects-balanced-investor-demographics?source=rss","date":1737837916,"author":"CryptoPunk Forum","guid":265,"unread":true,"content":"<p>(1) Howard Zhong, MIT CSAIL (howardzh@mit.edu);</p><p>(2) Mark Hamilton, MIT CSAIL, Microsoft (markth@mit.edu).</p><p>We seek to determine what mechanisms produce the different biases and why there exists racial bias but not gender bias in the prices of NFTs. Most NFTs in the market, especially those with gender and race attributes, represent avatars. These NFTs, especially expensive ones like CryptoPunks, can be used as profile picture, and thus people may prefer NFTs that look similar to themselves. We thus believe the demographics of NFT investors are the mechanisms that produce these biases.</p><p>\\\nAccording to a data by Statistica [2] [4], among the age group (18-34) with the largest interest in NFTs, men and women own NFTs fairly equally with 24% men and 21% women of total investor population. Thus, the fact we do not observe gender bias in NFT prices could be due to investors being roughly balanced across gender.</p><p>\\\nHowever, the distribution of NFT buyers may be skewed white, which explains the existence of racial bias. Using Google searches as a proxy on the amount of NFT investors in a region, in the past five years, we found that the term “NFT” was most searched in East Asia and North America and least searched in Africa and India. Thus, more lighter-skinned people are interested in NFTs compared to darker-skinned people and may be why lighter-skinned NFTs are more in demand. The full map of Google searches can be found in Figure 7 in Appendix A.3.</p>","contentLength":1464,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Unveiling Biases in NFT Pricing: Insights from CryptoPunks and Beyond","url":"https://hackernoon.com/unveiling-biases-in-nft-pricing-insights-from-cryptopunks-and-beyond?source=rss","date":1737837914,"author":"CryptoPunk Forum","guid":264,"unread":true,"content":"<p>(1) Howard Zhong, MIT CSAIL (howardzh@mit.edu);</p><p>(2) Mark Hamilton, MIT CSAIL, Microsoft (markth@mit.edu).</p><p>Non-Fungible Tokens (NFTs) are non-interchangeable assets, usually digital art, which are stored on the blockchain. Preliminary studies find that female and darker-skinned NFTs are valued less than their male and lighter-skinned counterparts. However, these studies analyze only the CryptoPunks collection. We test the statistical significance of race and gender biases in the prices of CryptoPunks and present the first study of gender bias in the broader NFT market. We find evidence of racial bias but not gender bias. Our work also introduces a dataset of gender-labeled NFT collections to advance the broader study of social equity in this emerging market.</p><p>Are darker-skinned Non-Fungible Tokens (NFTs) sold for less than lighter-skinned NFTs? Or, are female NFTs worth less than male NFTs? Egkolfopoulou and Gardner [8] raises diversity concerns by reporting preliminary results on price differences based on gender and race. Determining whether diversity issues are present in the early-stage NFT space is important to raise awareness and bring change.</p><p>\\\nNFTs are tokens on a blockchain to represent ownership of a unique item. While the item can range from music, videos, or tweets, it usually represents the ownership of art. NFT’s popularity has boomed since 2021 as the public became accustomed to the concept. We analyze NFTs stored on the Ethereum network [9]</p><p>\\\nAs NFTs are such a new concept, the dynamics of the NFT market has not been well studied. There has been previous work about NFT economics with focus on the trade networks [14], the predictability of NFT sales [14], and the risk and returns of NFT investments, [13]. Other topics of interest include how NFT art may change the dynamics of art markets [3], how NFTs can affect game development by making the art tradable [10], and how it can revolutionize digital ownership in different industries [16]. Among the studies, one specific collection that is most analyzed to represent the NFT market is CryptoPunks [12] [18] [6].</p><p>\\\nThe CryptoPunk collection is one of the most well-known NFT collections and consists of 10,000 avatars on the Ethereum blockchain created by Larva Labs in 2017. They are commonly credited for starting the NFT boom in 2021 [20]. As shown in Figure 1, CryptoPunks are avatars that can be used to represent oneself in the digital world and therefore are of interest when studying the NFT diversity problem.</p><p>\\\nWe are interested in whether racial bias or gender bias exists in the NFT art market. In the December 2021 Bloomberg article “Even in the Metaverse, Not All Identities Are Created Equal”, Egkolfopoulou and Gardner [8] examined graphs of sales prices of CryptoPunks over time across different genders and different races. They found that female avatars were sold for less than male avatars, and darker-skinned avatars were sold for less than lighter-skinned NFTs. However, their evidence for gender and racial biases is limited to visual inspection of CryptoPunk’s historical price graphs instead. Thus, we test the statistical significance of race and gender biases in the prices of CryptoPunks and present the first study investigating gender bias in the broader NFT market.</p><p>\\\nOur first goal is to analyze the gender and race biases of CryptoPunks rigorously through hypothesis testing. This will indicate whether price differences are significant enough to not be attributed to random chance. We find that darker-skinned CryptoPunks are sold for more than lighter-skinned CryptoPunks, but contrary to the analysis in [8], the difference in price for male and female CryptoPunks was not statistically significant.</p><p>\\\nOur second goal is to extend our analysis to other collections to determine whether there are gender biases for the broader NFT market. To that end, we analyze 44 NFT collections labeled with gender tags and apply a hypothesis test to each collection to determine if male-looking NFTs sell at higher prices than female-looking ones. Like in CryptoPunks, we conclude that the price difference in male and female is not statistically significant. Because of the lack of race labels, we were only able to find 3 collections to categorize between light and dark skinned NFTs, with analysis suggesting lighter-skinned NFTs are sold for more than darker-skinned NFTs.</p>","contentLength":4392,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Regional NFT Trends and Insights from 44 Avatar-Based Collections","url":"https://hackernoon.com/regional-nft-trends-and-insights-from-44-avatar-based-collections?source=rss","date":1737837912,"author":"CryptoPunk Forum","guid":263,"unread":true,"content":"<p>(1) Howard Zhong, MIT CSAIL (howardzh@mit.edu);</p><p>(2) Mark Hamilton, MIT CSAIL, Microsoft (markth@mit.edu).</p><p>The 44 collections that we sampled and analyzed are all NFTs representing avatars. In Table 6, month created, mean sale price, median sale price, 2.5% trim mean sale price, and total supply are listed.</p><h2>A.3 Google NFT Searches Map</h2><p>Below is a map of Google search data for the term “NFT” in the past 5 years (as of January 2023). Most searches occur in East Asia, North America, and Australia. Europe, South America, Middle East, and India roughly have the same amount of searches. Africa has the least number of searches.</p>","contentLength":626,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Lighter-Skinned NFTs Command Higher Prices in the Broader Market","url":"https://hackernoon.com/lighter-skinned-nfts-command-higher-prices-in-the-broader-market?source=rss","date":1737837910,"author":"CryptoPunk Forum","guid":262,"unread":true,"content":"<p>(1) Howard Zhong, MIT CSAIL (howardzh@mit.edu);</p><p>(2) Mark Hamilton, MIT CSAIL, Microsoft (markth@mit.edu).</p><p>We conduct similar analysis for gender and race bias across the NFT market. We found 44 collections with gender labels but only 3 with race labels.</p><p>\\\nFor the 44 NFT collections chosen as detailed in Section 2.2, we calculate p-values to determine whether male NFT prices are greater than female NFT prices. P-values are calculated from a paired log t-test marked to weekly mean with a outlier trim percentile of 2.5%. To satisfy preconditions of a t-test, we apply a log transformation to make prices follow a more normal distribution and remove outliers. We mark to weekly mean price, which is common for low transaction volume markets such as NFT markets [7]. From the analysis, we find no clear relationship between market cap and gender bias. However, we do demonstrate that male prices are not statistically significantly higher than female prices for the broader NFT market.</p><p>\\\nFigure 5 displays collections with male price statistically significantly (α = 0.05) higher than female price (right red dots), female price statistically significantly higher than male price (left red dots), and no statistically significant difference (black dots). There is no clear relationship between market cap and mean price difference across gender, but the figure does answer whether male NFTs are priced higher than female NFTs across the aggregate market.</p><p>\\\nFirst, the mean across all collections of the price difference of male and female NFTs is only 0.63%. Furthermore, at a significance level of α = 0.05, only 11 out of 44 collections have male NFTs valued more than female NFTs, whereas 7 collections have female NFTs valued more than male NFTs. Therefore, there is not enough evidence to conclude there is a statistically significant difference between male and female prices for the broader NFT market.</p><p>\\\nIn addition to CryptoPunks, we obtained race labels for the Avastar and Dynamic Duelers collections. From mean and median statistics in Table 4, we find that light-skinned NFTs on average tend to be sold for higher prices that darker-skinned counterpart. The result is less significant for Dynamic Duelers. For statistics in Table 4 and 5, we use outlier trim level of 2.5%.</p><p>\\\nWe also conduct hypothesis tests in Table 5 to determine the statistical significance of whether lighter-skinned NFTs are worth more than darker-skinned NFTs. With a majority of the p-values less than 0.2 and our conclusion from CryptoPunks, the results suggest lighter-skinned NFTs are worth more than darker-skinned NFTs, though not necessarily at a statistically significant level. Because this analysis is on a small subset of the entire NFT market, more data is required to generalize our conclusion to the entire NFT market.</p>","contentLength":2815,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Intel Media Driver 2024Q4 Released With Battlemage Video Encode","url":"https://www.phoronix.com/news/Intel-Media-Driver-2024Q4","date":1737836873,"author":"Michael Larabel","guid":646,"unread":true,"content":"<article>The Intel Media Driver 2024Q4 release was tagged this Saturday as the quarterly update to Intel's open-source Video Acceleration API (VA-API) driver for Linux systems...</article>","contentLength":169,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"OpenAI wants to take over your browser","url":"https://techcrunch.com/2025/01/25/openai-wants-to-take-over-your-browser/","date":1737828300,"author":"Cody Corrall","guid":150,"unread":true,"content":"<p>Welcome back to Week in Review. This week we’re diving into OpenAI’s newly released AI agent, called Operator. We also look at where TikTok stands after being resuscitated, whether it’s time to go back to Tumblr, and more! Let’s get into it. OpenAI launched a research preview of Operator, a general-purpose AI agent that can […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":402,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Paul McCartney calls on UK government to protect artists from AI","url":"https://techcrunch.com/2025/01/25/paul-mccartney-calls-on-uk-government-to-protect-artists-from-ai/","date":1737825527,"author":"Anthony Ha","guid":149,"unread":true,"content":"<p>Legendary musician Paul McCartney is warning against proposed changes to UK copyright law that would allow tech companies to freely train their models on online content unless the copyright holders actively opt out. In excerpts of an interview with the BBC, McCartney said the government needs to do more to protect musicians and other artists. […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":413,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ISD: A New Interactive Way For systemd Management","url":"https://www.phoronix.com/news/ISD-Interactive-Systemd","date":1737815313,"author":"Michael Larabel","guid":645,"unread":true,"content":"<article>ISD is a new open-source project aiming to provide a more \"Interactive SystemD\" for simplifying management of Linux systems with systemd...</article>","contentLength":139,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Experts Weigh in on $500B Stargate Project for AI","url":"https://spectrum.ieee.org/stargate","date":1737813603,"author":"Eliza Strickland","guid":95,"unread":true,"content":"<p>The Trump-announced initiative to build data centers will have big impacts</p>","contentLength":74,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTgwNDk3NS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc1MzUyNjUyNn0.zn1Tvmzpar7av_olM9Ej9Up6yFLrkWwVGvcD0CRKabA/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"Much Faster Suspend & Resume For Some Systems With Linux 6.14","url":"https://www.phoronix.com/news/Linux-6.14-ACPI","date":1737807540,"author":"Michael Larabel","guid":644,"unread":true,"content":"<article>Alongside the power management and thermal driver updates this week for the ongoing Linux 6.14 kernel cycle were also the ACPI updates. The ACPI pull request was worth calling out on its own thanks to a change that will allow for faster suspend and resume cycles on some systems with this new kernel...</article>","contentLength":302,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Intel THC, Wacom PCI Device & SteelSeries Arctis 9 Support Land In Linux 6.14","url":"https://www.phoronix.com/news/Linux-6.14-HID","date":1737806494,"author":"Michael Larabel","guid":643,"unread":true,"content":"<article>All of the Human Interface Device (HID) subsystem updates have been merged for the ongoing Linux 6.14 merge window...</article>","contentLength":117,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"SUSE's New \"Agama 11\" Installer Preps For SLES 16 Beta / openSUSE Leap 16","url":"https://www.phoronix.com/news/SUSE-Agama-11-Installer","date":1737805577,"author":"Michael Larabel","guid":642,"unread":true,"content":"<article>The SUSE/openSUSE Agama Installer is a modern web UI driven installer for the SUSE/openSUSE Linux distributions. It's modern, sports a cleaner UI and underlying architecture, and supports more features. The Agama 11 installer update was released this week in preparing for the upcoming SUSE Linux Enterprise Server 16 beta with this new installer as well as new openSUSE Leap 16 builds...</article>","contentLength":388,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.14 Drops EFI's Long Obsolete UGA Protocol","url":"https://www.phoronix.com/news/Linux-6.14-EFI","date":1737804951,"author":"Michael Larabel","guid":641,"unread":true,"content":"<article>The EFI updates have been merged for the Linux 6.14 kernel. The EFI updates this cycle aren't the most exciting but the kernel has finally bid farewell to the long obsolete UGA graphics protocol support...</article>","contentLength":205,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["tech"]}