{"id":"25JnLB7bCaiYJ","title":"Tech News","displayTitle":"Tech News","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":76,"items":[{"title":"What is an encryption backdoor?","url":"https://techcrunch.com/2025/02/15/what-is-an-encryption-backdoor/","date":1739631600,"author":"Natasha Lomas","guid":287,"unread":true,"content":"<p>Talk of backdoors in encrypted services is once again doing the rounds after reports emerged that the U.K. government is seeking to force Apple to open up iCloud’s end-to-end encrypted (E2EE) device backup offering. Officials were said to be leaning on Apple to create a “backdoor” in the service that would allow state actors to […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":404,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Paragraf Is Building a \"Blank Canvas\" Graphene Foundry","url":"https://spectrum.ieee.org/paragraf-graphene-foundry","date":1739628003,"author":"Liam Critchley","guid":92,"unread":true,"content":"<p>The company wants to make graphene sensors more accessible to industries</p>","contentLength":72,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NjQ2NTMyMC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc4MzQyMzgzM30.wJGF4-_y2VSVjXLsYFhhL9DuC-xHiTHWB-Ciq4DHQTU/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"These Google Photos alternatives offer tons of storage options at a reasonable price","url":"https://techcrunch.com/2025/02/15/these-google-photos-alternatives-offer-tons-of-storage-options-at-a-reasonable-price/","date":1739628000,"author":"Ivan Mehta","guid":286,"unread":true,"content":"<p>Google Photos is a great service for storing images across devices. But Google Drive and Gmail only offer 15GB of storage for free. Google Photos used to offer free unlimited storage of images, but that is not the case anymore. If you are looking for a better photo storage plan, different features, or just want […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":381,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The IRS Is Buying an AI Supercomputer From Nvidia","url":"https://tech.slashdot.org/story/25/02/15/0540249/the-irs-is-buying-an-ai-supercomputer-from-nvidia?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1739624400,"author":"BeauHD","guid":225,"unread":true,"content":"According to The Intercept, the IRS is set to purchase an Nvidia SuperPod AI supercomputer to enhance its machine learning capabilities for tasks like fraud detection and taxpayer behavior analysis. From the report: With Elon Musk's so-called Department of Government Efficiency installing itself at the IRS amid a broader push to replace federal bureaucracy with machine-learning software, the tax agency's computing center in Martinsburg, West Virginia, will soon be home to a state-of-the-art Nvidia SuperPod AI computing cluster. According to the previously unreported February 5 acquisition document, the setup will combine 31 separate Nvidia servers, each containing eight of the company's flagship Blackwell processors designed to train and operate artificial intelligence models that power tools like ChatGPT. The hardware has not yet been purchased and installed, nor is a price listed, but SuperPod systems reportedly start at $7 million. The setup described in the contract materials notes that it will include a substantial memory upgrade from Nvidia.\n \nThough small compared to the massive AI-training data centers deployed by companies like OpenAI and Meta, the SuperPod is still a powerful and expensive setup using the most advanced technology offered by Nvidia, whose chips have facilitated the global machine-learning spree. While the hardware can be used in many ways, it's marketed as a turnkey means of creating and querying an AI model. Last year, the MITRE Corporation, a federally funded military R&amp;D lab, acquired a $20 million SuperPod setup to train bespoke AI models for use by government agencies, touting the purchase as a \"massive increase in computing power\" for the United States.\n \nHow exactly the IRS will use its SuperPod is unclear. An agency spokesperson said the IRS had no information to share on the supercomputer purchase, including which presidential administration ordered it. A 2024 report by the Treasury Inspector General for Tax Administration identified 68 different AI-related projects underway at the IRS; the Nvidia cluster is not named among them, though many were redacted. But some clues can be gleaned from the purchase materials. \"The IRS requires a robust and scalable infrastructure that can handle complex machine learning (ML) workloads,\" the document explains. \"The Nvidia Super Pod is a critical component of this infrastructure, providing the necessary compute power, storage, and networking capabilities to support the development and deployment of large-scale ML models.\"\n \nThe document notes that the SuperPod will be run by the IRS Research, Applied Analytics, and Statistics division, or RAAS, which leads a variety of data-centric initiatives at the agency. While no specific uses are cited, it states that this division's Compliance Data Warehouse project, which is behind this SuperPod purchase, has previously used machine learning for automated fraud detection, identity theft prevention, and generally gaining a \"deeper understanding of the mechanisms that drive taxpayer behavior.\"","contentLength":3057,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Karol Herbst Steps Down As Nouveau Maintainer Due To Linux Kernel's Toxic Environment","url":"https://www.phoronix.com/news/Karol-Herbst-Nouveau-No","date":1739619627,"author":"Michael Larabel","guid":707,"unread":true,"content":"<article>Karol Herbst has been a Nouveau driver developer for over a decade working on this open-source, reverse-engineered NVIDIA Linux graphics driver. He went on to become employed by Red Hat. While he's known more these days for his work on Mesa and the Rusticl OpenCL driver for it, he's still remained a maintainer of the Nouveau kernel driver. But today he announced he's resigning as a Nouveau driver maintainer due to differences with the upstream Linux kernel developer community...</article>","contentLength":483,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"KDE Developers Addressing Early Bugs From Plasma 6.3","url":"https://www.phoronix.com/news/KDE-Plasma-6.3-Early-Bugs","date":1739618860,"author":"Michael Larabel","guid":706,"unread":true,"content":"<article>KDE Plasma 6.3 released this week as the newest step forward for the KDE desktop. While it was smooth on the whole, there were some early bugs that KDE developers were dealing with this week. KDE developer Nate Graham is out with his usual weekly development summary for the Plasma desktop...</article>","contentLength":292,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Eating From Plastic Takeout Containers Can Increase Heart Failure Risk, Study Finds","url":"https://science.slashdot.org/story/25/02/15/0555235/eating-from-plastic-takeout-containers-can-increase-heart-failure-risk-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1739613600,"author":"BeauHD","guid":224,"unread":true,"content":"A new study suggests that frequent consumption of food from plastic takeout containers significantly increases the risk of congestive heart failure due to gut biome changes that trigger inflammation and circulatory damage. The Guardian reports: The authors used a two-part approach, first looking into the frequency with which over 3,000 people in China ate from plastic takeout containers, and whether they had heart disease. They then exposed rats to plastic chemicals in water that was boiled and poured in carryout containers to extract chemicals. \"The data revealed that high-frequency exposure to plastics is significantly associated with an increased risk of congestive heart failure,\" the authors wrote. [...] They put boiling water in the containers for one, five or 15 minutes because plastic chemicals leach at much higher rates when hot contents are placed in containers -- the study cited previous research that found as many as 4.2m microplastic particles per sq cm can leach from plastic containers that are microwaved.\n \nThe authors then gave rats the water contaminated with leachate to drink for several months, then analyzed the gut biome and metabolites in the feces. It found notable changes. \"It indicated that ingestion of these leachates altered the intestinal microenvironment, affected gut microbiota composition, and modified gut microbiota metabolites, particularly those linked to inflammation and oxidative stress,\" the authors wrote. They then checked the rats' heart muscle tissue and found it had been damaged. The study did not find a statistical difference in the changes and damage among rats that were exposed to water that had been in contact with plastic for one minute versus five or fifteen. The study has been published in the journal Ecotoxicology and Environmental Safety.","contentLength":1816,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The TechBeat: Futures of Ethereum II - Censorship Resistance (2/15/2025)","url":"https://hackernoon.com/2-15-2025-techbeat?source=rss","date":1739603464,"author":"Techbeat","guid":359,"unread":true,"content":"<p>By <a href=\"https://hackernoon.com/u/rootstock_io\">@rootstock_io</a> [ 3 Min read ] \n Rootstock merges Bitcoin’s security with Ethereum’s flexibility, enabling AI-driven blockchain apps for trustless governance, security, and fraud detection. <a href=\"https://hackernoon.com/ai-meets-bitcoin-how-rootstock-powers-the-future-of-trustless-ai\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/boxhero\">@boxhero</a> [ 13 Min read ] \n Discover how AI-powered sentiment analysis tools deliver accurate insights from customer reviews and feedback to help improve your business strategy. <a href=\"https://hackernoon.com/sentiment-analysis-and-ai-everything-you-need-to-know-in-2025\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/lumoz\">@lumoz</a> [ 3 Min read ] \n On February 13, Lumoz announced the official launch of Lumoz Chain and released the migration guide and reward plan for Verifier nodes.  <a href=\"https://hackernoon.com/lumoz-flips-the-switch-on-its-ai-powered-blockchain\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/stellar\">@stellar</a> [ 5 Min read ] \n Regulatory shifts in 2025 will shape crypto wallets. Learn how compliance, DeFi, and Stellar’s Soroban ecosystem will impact the future of Web3 wallets. <a href=\"https://hackernoon.com/regulatory-clarity-on-wallets-will-shape-defi-in-2025\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/adambakay\">@adambakay</a> [ 22 Min read ] \n By understanding market microstructure, you might be able to add more precision into your trading. <a href=\"https://hackernoon.com/thinking-of-pursuing-trading-full-time-then-you-need-to-know-what-market-microstructures-are\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/mexcmedia\">@mexcmedia</a> [ 6 Min read ] \n Liquidity is key to crypto trading, ensuring price stability, seamless transactions, and reduced slippage. Learn how MEXC excels in liquidity management. <a href=\"https://hackernoon.com/the-importance-of-liquidity-how-it-impacts-crypto-trading\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/2077research\">@2077research</a> [ 11 Min read ] \n Explore the evolution of crypto options and perpetual futures, diving into innovations like panoptions, liquidity challenges, and decentralized trading. <a href=\"https://hackernoon.com/neverending-options-trading-options-to-infinity-and-beyond\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/2077research\">@2077research</a> [ 17 Min read ] \n The article explores Ethereum's efforts to ensure censorship resistance, focusing on solutions like PBS and encrypted mempools amid regulatory pressures. <a href=\"https://hackernoon.com/futures-of-ethereum-ii-censorship-resistance\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/hayday\">@hayday</a> [ 4 Min read ] \n Is the rise of vibe coding also the end of software engineering? How will vibeware change the nature of the software entrepreneur, and the meaning of work? <a href=\"https://hackernoon.com/vibe-coding-a-new-system-of-the-world\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/mexcmedia\">@mexcmedia</a> [ 5 Min read ] \n Discover key crypto trends of 2025, from Bitcoin’s surge to MEXC’s role in shaping the future of digital asset trading with liquidity, security, &amp; innovation. <a href=\"https://hackernoon.com/2025-crypto-landscape-emerging-trends-and-exchange-platforms-shaping-the-future\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/noda\">@noda</a> [ 4 Min read ] \n 2025 is the tipping point for pay-by-bank. Lower fees, instant payments, and new regulations make it the future of digital transactions.  <a href=\"https://hackernoon.com/card-payments-are-slow-costly-and-dyingheres-what-consumers-are-turning-to-instead\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/matteopisani91\">@matteopisani91</a> [ 34 Min read ] \n A cybersecurity engineer built a sci-fi bass from scratch, packed with a synth, a wireless transmitter, a hacked built-in tuner and voltmeters. <a href=\"https://hackernoon.com/diy-enthusiast-hacks-his-way-into-building-his-own-musical-instrument-and-it-rocks\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/ishanpandey\">@ishanpandey</a> [ 4 Min read ] \n Discover how CrossFi is revolutionizing crypto payments in this exclusive interview with CEO Alex Mamasidikov. <a href=\"https://hackernoon.com/crypto-without-banks-crossfis-ceo-on-the-future-of-decentralized-payments\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/menaskop\">@menaskop</a> [ 6 Min read ] \n Ethereum has many so-called \"killers,\" though most of them look more like self-destructive projects. <a href=\"https://hackernoon.com/is-ethereum-in-trouble-no-so-why-does-everyone-say-otherwise\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/wezam\">@wezam</a> [ 4 Min read ] \n There’s plenty of disagreement on how AI will change the product management landscape.  <a href=\"https://hackernoon.com/is-ai-making-product-managers-obsolete\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/awsmarketplace\">@awsmarketplace</a> [ 8 Min read ] \n Discover the best endpoint protection solutions, top platforms to consider, and key evaluation criteria to enhance your organization's cybersecurity defenses. <a href=\"https://hackernoon.com/evaluating-top-5-endpoint-protection-solutions\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/vitae\">@vitae</a> [ 5 Min read ] \n We present a deterministic game incorporating two key mechanisms: Controlled Chaos Shifts (CCS) and Accepting Loss of Control (ALC). <a href=\"https://hackernoon.com/the-first-provable-ai-proof-game-introducing-butterfly-wings-4\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/edwinliavaa\">@edwinliavaa</a> [ 3 Min read ] \n While Bitcoin's design brilliantly enables decentralization, human nature consistently pulls us toward centralization. <a href=\"https://hackernoon.com/bitcoin-is-eerily-resembling-the-financial-system-it-was-meant-to-replace\">Read More.</a></p>","contentLength":3218,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI Used To Design a Multi-Step Enzyme That Can Digest Some Plastics","url":"https://science.slashdot.org/story/25/02/15/0549201/ai-used-to-design-a-multi-step-enzyme-that-can-digest-some-plastics?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1739602800,"author":"BeauHD","guid":223,"unread":true,"content":"Leveraging AI tools like RFDiffusion and PLACER, researchers were able to design a novel enzyme capable of breaking down plastic by targeting ester bonds, a key component in polyester. Ars Technica reports: The researchers started out by using the standard tools they developed to handle protein design, including an AI tool named RFDiffusion, which uses a random seed to generate a variety of protein backgrounds. In this case, the researchers asked RFDiffusion to match the average positions of the amino acids in a family of ester-breaking enzymes. The results were fed to another neural network, which chose the amino acids such that they'd form a pocket that would hold an ester that breaks down into a fluorescent molecule so they could follow the enzyme's activity using its glow.\n \nOf the 129 proteins designed by this software, only two of them resulted in any fluorescence. So the team decided they needed yet another AI. Called PLACER, the software was trained by taking all the known structures of proteins latched on to small molecules and randomizing some of their structure, forcing the AI to learn how to shift things back into a functional state (making it a generative AI). The hope was that PLACER would be trained to capture some of the structural details that allow enzymes to adopt more than one specific configuration over the course of the reaction they were catalyzing. And it worked. Repeating the same process with an added PLACER screening step boosted the number of enzymes with catalytic activity by over three-fold.\n \nUnfortunately, all of these enzymes stalled after a single reaction. It turns out they were much better at cleaving the ester, but they left one part of it chemically bonded to the enzyme. In other words, the enzymes acted like part of the reaction, not a catalyst. So the researchers started using PLACER to screen for structures that could adopt a key intermediate state of the reaction. This produced a much higher rate of reactive enzymes (18 percent of them cleaved the ester bond), and two -- named \"super\" and \"win\" -- could actually cycle through multiple rounds of reactions. The team had finally made an enzyme.\n \nBy adding additional rounds alternating between structure suggestions using RFDiffusion and screening using PLACER, the team saw the frequency of functional enzymes increase and eventually designed one that had an activity similar to some produced by actual living things. They also showed they could use the same process to design an esterase capable of digesting the bonds in PET, a common plastic. The research has been published in the journal Science.","contentLength":2629,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Reading Documentation Shouldn't Be a Chore","url":"https://hackernoon.com/reading-documentation-shouldnt-be-a-chore?source=rss","date":1739602109,"author":"Rami James","guid":358,"unread":true,"content":"<p>As a developer, documentation is both your greatest ally and your worst nemesis. It's the key to unlocking the power of libraries, frameworks, APIs, and even entire programming languages. Yet, many developers struggle to effectively navigate and extract the information they need from documentation. It's a skill that can be learned, and it's one that can make a huge difference in your productivity and the quality of your work. New developers often lack this critical skill, and find themselves stopped in their progress towards becoming a better dev because of it.</p><p>\\\nI'm currently writing the docs for Vewrite, a project management tool for writing teams. It occurs to me that I've been writing documentation for a long time, and I've gotten pretty good at it. I've also gotten pretty good at reading documentation, and I think that this is a skill that is often overlooked.</p><p>\\\nLet's talk about how to equip you with the skills to read documentation better, turning this often daunting task into a smooth and efficient process.</p><h3>Why is reading documentation challenging?</h3><p>\\\nGood documentation is essential. It provides the definitive guide to how software works, saving you countless hours of pointless, frustrating trial and error. Bad documentation is a nightmare. It's like trying to navigate a maze blindfolded, with no map and no sense of direction, guided by a liar.</p><p>\\\nIf you have access to the code you are working against, that's great and you should use it. Poke around and see what you're supposed to do by reading the code. But, in many cases (and almost all of the time with proprietary software), you're going to have to rely on the documentation to get you through. However, documentation can vary wildly in quality. Some is meticulously crafted, while others can be uninformative, outdated, or even misleading. This inconsistency is one of the reasons why reading documentation can be challenging.</p><p>Some docs are just a dumping ground for information, with no clear structure or organization. This can make it difficult to find what you're looking for, and you end up spending more time searching than actually learning. A well-structured set of documentation will have a clear table of contents, with sections and subsections that guide you through the material in a logical order. This makes it easier to navigate and find the information you need.In general, I'll also recommend some Getting Started section which points different types of users to the information which is most critical to them.</p><p>Information overload is another common hurdle. Docs can cover a vast range of features and functionalities, making it difficult to find the specific information you need. For example, a large framework might have hundreds of classes and methods, and trying to find the one you need can feel like searching for a needle in a haystack.</p><p>Unclear technical jargon can also be a barrier, as documentation is inherently technical, and sometimes the terminology can be confusing, especially for newcomers. This often stems from the assumption that the reader has a certain level of prior knowledge as it is largely written by the team who has developed the software and has an intimate knowledge of its innner workings.</p><p>Outdated information can be a major problem. Software evolves rapidly, and documentation can sometimes lag behind, leading to frustration and wasted time. A library might have deprecated a certain function, but the documentation might still describe it as the primary way to perform a task. The teams who produce software should be including accurate documentation creation and upkeep in their backlog as part of their process. Unfortunately, in the haste to get features shipped to market, corners are often cut. I've spent the better part of the last decade advocating for better processes that lead to better docs at a number of companies, and the biggest challenge here has been explaining to stakeholders where the value is.</p><h3>How to read documentation effectively</h3><p>Over the years, I've developed a structured approach to how I tackle reading new documentation. I've found that this approach helps me quickly get up to speed with new tools and technologies, and I hope it can help you too.</p><p>\\\nBy and large this method has three parts: understanding the structure of the documentation itself, understanding the way that the system I'm learning works, and lastly engaging with the material in the docs. First I get the lay of the land, and then I try to focus in on the details.</p><h4>Understand the structure of the documentation</h4><p>Docs are written by people, and every sysyem is going to be different. That means that every set of docs is going to be different. Some docs are organized by feature, others by use case, and still others by API endpoint. Understanding the structure of the documentation is key to finding the information you need quickly. Start by scanning the table of contents to get an overview of the topics covered. This will help you get a sense of the scope of the documentation and where to find specific information. You'll want to quickly click through the docs and get a sense of how things work, how they are organized, and where you can find reference materials if there are any.</p><p>\\\nI find that this initial run through also trickles some information about the system and its components into my brain. It's not comprehensive at all, but it's a good start.</p><p>Every piece of software is a system, and understanding how that system works is key to understanding how to use it. This is where the documentation can be a huge help. Good documentation will provide you with a high-level overview of the system, explaining how the different components fit together and how they interact. This can help you understand the context in which a particular feature or function is used, and how it relates to the rest of the system. This is where you start to get a sense of how the system is supposed to work, and how you can use it to solve your problems.</p><p>\\\nA lot of the problems that you'll encounter when building software will be because you fundamentally don't understand how what you're building with actually works. This is where the documentation can be a huge help. It can provide you with the context you need to understand how the system is supposed to work, and how you can use it to solve your problems. Use that to your advantage and you'll be able to build better software, faster.</p><p>This is often the most tedious and boring part. You have to actually take a few hours and read through the entire docs. For smaller libraries or APIs, this isn't going to be a big deal and you'll be able to fit most of it into your head. For larger systems, this is going to be a multi-day process. You'll want to take notes, ask questions, and engage with the material in a way that helps you understand it. This is where you start to get a sense of how the system is supposed to work, and how you can use it to solve your problems. If it doesn't all fit into your head now, that's ok. You'll remember more than you think you will, and when you're actually doing development it will be an order of magnitude faster to find an answer if you've already seen it once.</p><p>I've actually found that modern AIs are absolutely awesome for this step. You can use them as you would a more experienced developer and ask them questions about the system, the functionality, and the docs themselves. You can't trust everything that they say, but you can't really trust what another developer always tells you. I've found that being able to have a discussion with an AI about a library or API really helps me understand how stuff works at a deeper level.</p><h3>Strategies for effectively reading docs</h3><p>Despite these challenges, mastering the art of reading documentation is doable. Here are some strategies to keep in mind while you are digging around in docs, looking for an answer.</p><p>If you don't know where you're going, you may never get there. Before you dive into a set of docs, you may want to set a clear objective for yourself. Are you trying to understand a specific function, integrate a new library, or troubleshoot an error? Having a clear objective will help you focus your search.</p><p>\\\nFor example, if you're trying to fix a bug where a specific function isn't returning the expected value, and your code matches what the docs say that you're supposed to do, your goal is to understand the function's place in the wider system. The problem is going to be a few levels up and the docs are likely going to be the key to understanding how the software works at a higher level.</p><p>\\\nDon't immediately jump into the nitty-gritty details. Begin with the introductory sections, tutorials, or quick start guides to get a high-level understanding of the system. Your assumptions will often be wrong, and it is good to base your work on a foundation of truth. Think of it like reading the abstract of a research paper before diving into the full text. These introductory materials often provide a roadmap to the rest of the documentation.</p><h4>Use the structure of the docs to your advantage</h4><p>Use the table of contents and search function (these are your best friends) to quickly locate the sections you need. Don't be afraid to experiment with different search terms. Scan through the entire table of contents. Poke around and get a really good feel for how the documentation is structured. Sometimes you will find that your answers are hidden adjacent to where you thought that they would be.</p><p>Real-world examples are invaluable, and the best docs are going to include them. They demonstrate how to use the code in practice and can often clarify confusing concepts. Pay close attention to the context in which the examples are used. A code snippet demonstrating how to use a particular function is much more helpful if it's accompanied by an explanation of what the function does and why it's being used in that specific scenario.</p><h4>Pay attention to the details</h4><p>When looking at function or method definitions, carefully examine the data types of the parameters and return values. This will help you understand how to use them correctly. Sometimes, crucial information is hidden in footnotes, warnings, or less prominent sections. Make sure you scan the entire page, not just the headlines. A seemingly minor note might contain a critical piece of information that can save you a lot of trouble. Documentation often contains links to related topics or other parts of the documentation. Don't hesitate to follow these links to gain a deeper understanding. These links can often lead you to more detailed explanations, examples, or even the source code itself.</p><p>This is one of the biggest reasons why I believe that open-source can be such a boon for companies who want to build an ecosystem of developers around their software. Sometimes, the best way to understand how something works is to look at the source code itself. Don't be afraid to dive in, especially if the documentation is unclear. Reading the source code can give you a much clearer picture of what's happening under the hood. Try out the code examples and modify them to see how they behave. This is a great way to solidify your understanding and discover edge cases. Experimenting with the code is like conducting your own little science experiment. You can change the inputs, observe the outputs, and gain a deeper understanding of how the code works. If you're still stuck, don't hesitate to reach out to the community for help. Forums, mailing lists, and online communities are valuable resources for getting your questions answered. The developer community is generally very helpful, and there are often people who have encountered the same problems you're facing.</p><p>Reading documentation shouldn't be a passive activity. Engage with the material by taking notes, jotting down key points, examples, and any questions you have. Annotating the documentation (if possible), highlighting important sections and adding your own comments can also be helpful. Creating your own examples, writing small programs that use the features you're learning about, is a great way to reinforce your understanding. It's like practicing a musical instrument – the more you do it, the better you get.</p><p>Reading documentation is a skill that improves with practice. By adopting these strategies and actively engaging with the material, you can transform documentation from a source of frustration into a powerful tool for learning and development. So, embrace the documentation, and unlock the full potential of the software you're working with!</p>","contentLength":12550,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How to Expose (And Fix) Hidden Bottlenecks in Adobe Experience Manager","url":"https://hackernoon.com/how-to-expose-and-fix-hidden-bottlenecks-in-adobe-experience-manager?source=rss","date":1739601941,"author":"Giuseppe Baglio","guid":357,"unread":true,"content":"<h2><em>Learn how to read thread dumps and take control of your application’s runtime behaviour.</em></h2><p>\\\nWhen your Adobe Experience Manager (or in general any JAVA application) instance shows signs of sluggishness, it’s time to roll up your sleeves and dive into the world of thread dumps. IBM Thread Analyzer (TDA) is here to help you untangle the web of threads and pinpoint performance bottlenecks. In this guide, we’ll walk you through how to use IBM TDA to diagnose performance issues in AEM like a pro.</p><p>Before you can start analyzing thread dumps, you’ll need to download and install <a href=\"https://www.ibm.com/support/pages/ibm-thread-and-monitor-dump-analyzer-java-tmda\">IBM Thread Analyzer</a>. Head over to the official IBM website or your organization’s repository to grab the latest version. Once downloaded, follow the installation instructions for your operating system. It’s quick, easy, and sets the stage for some serious troubleshooting.</p><p>Thread dumps are snapshots of all the threads running in your AEM instance at a specific moment. To capture them:</p><ol><li>Use tools like , , or AEM’s built-in functionality to generate thread dumps. There is a well-documented page on <a href=\"http://erience-cloud-kcs/kbarticles/ka-17452\">Adobe Docs</a>.</li><li>Save the thread dump files to your local machine.</li></ol><p>\\\nPro Tip: Capture multiple thread dumps at intervals (e.g., every 10 seconds) to get a clearer picture of long-running issues.</p><p>Launch IBM TDA and open the thread dump files you’ve captured. Simply drag and drop the files into the application or use the “Open” option to load them. Once loaded, you’ll see a list of thread dumps on the left-hand panel.</p><p>To analyze a specific thread dump:</p><ol><li><p>Select the file from the listing.</p></li><li><p>Click the Thread Detail button at the top</p></li></ol><p>\\\nThis will display a detailed view of all the threads in that dump. Now, let’s sort the threads by Stack Depth, ensuring the longest stacks appear at the top. Why? Threads with deeper stacks often indicate more complex operations, which are usually where performance issues hide.</p><p>Focus on threads with a stack depth of 10 lines or longer. These threads are typically the ones consuming the most resources. Take notes on any threads that stand out — whether due to their names, states, or stack traces.</p><p>Next, sort the threads by their State. Scroll down to the Runnable threads. These are the threads that were actively using CPU time when the dump was taken. Keep an eye out for application-specific threads, such as:</p><ul><li><p>Background job threads: Handling tasks like indexing or replication.</p></li><li><p>Request threads: Named like <code>127.0.0.1 [timestamp] GET /path HTTP/1.1</code>.</p></li></ul><p>For each request thread, extract the timestamp from its name (e.g., ). This Unix epoch timestamp tells you when the user’s browser made the request. Convert it to a human-readable date/time using a tool like <a href=\"https://www.epochconverter.com/\">https://www.epochconverter.com/</a>. Compare this with the thread dump’s timestamp to calculate how long the request has been active.</p><p>If the difference is unusually large (e.g., several seconds or minutes), it could indicate a bottleneck in your application.</p><p>\\\nPro Tip: Keep an eye out for patterns. Are certain types of requests consistently taking longer? For example, requests involving complex queries or resource-heavy operations might be worth optimizing. Additionally, if you notice that specific URLs or endpoints are frequently associated with long-running threads, consider profiling those areas of your codebase.</p><p>Thread analysis requires a nuanced approach that goes beyond simple waiting states. While the IBM Thread Analyzer (TDA) interface provides valuable insights into thread relationships, understanding the full context of thread behavior helps create a more complete picture of your application’s performance characteristics.</p><h2>Understanding Thread States</h2><p>When examining threads in TDA, you’ll encounter several important states:</p><p>: These threads are either currently executing or ready to execute when CPU time becomes available. A Runnable state doesn’t necessarily indicate a problem — it’s the natural state for actively working threads.</p><p>: These threads have temporarily paused execution while waiting for a condition to be met. The waiting state can occur for many legitimate reasons, including:</p><ul><li>Resource availability (database connections, file handles)</li><li>Task completion in other threads</li></ul><p>\\\n: These threads are specifically waiting to acquire a monitor or lock. While similar to waiting, blocked states specifically indicate synchronization-related pauses.</p><h2>Analyzing Thread Relationships</h2><p>When you identify a thread of interest, examine its relationships with other threads using this systematic approach:</p><ol><li>Direct Lock Relationships:</li></ol><ul><li>Examine the Waiting Threads panel for immediate dependencies</li><li>Review the stack traces of waiting threads to understand why they’re blocked</li><li>Note the duration of the wait states if available</li></ul><p>\\\n2. Resource Usage Patterns:</p><ul><li>Look for patterns in resource acquisition and release</li><li>Identify potential resource bottlenecks</li><li>Consider alternative resource management strategies</li></ul><p>\\\n3. Architectural Implications:</p><ul><li>Evaluate if the observed behaviour aligns with the system’s design</li><li>Consider if the current threading model is appropriate</li><li>Assess the impact on scalability</li></ul><h2>Understanding Lock Types and Visibility</h2><p>Thread dumps may not show all types of contention. Modern Java applications use various synchronization mechanisms:</p><ol><li>Intrinsic Locks (synchronized keyword):</li></ol><ul><li>Show clear owner-waiter relationships</li><li>Stack traces indicate synchronization points</li></ul><p>\\\n2. Explicit Locks (java.util.concurrent):</p><ul><li>May require additional tooling to visualize</li></ul><p>\\\n3. Non-blocking Mechanisms (Don’t appear as traditional locks but can impact performance):</p><ul></ul><p>When you identify genuine contention issues, consider these approaches:</p><ul><li>Implement finer-grained locking</li><li>Consider non-blocking alternatives</li></ul><ul><li>Implement backoff strategies</li><li>Consider caching solutions</li></ul><p>\\\n3. Architectural Changes</p><ul><li>Evaluate asynchronous processing</li><li>Consider parallel execution paths</li><li>Implement queue-based approaches</li></ul><p>\\\nRemember that thread analysis is an iterative process. Patterns that emerge in one thread dump might not represent consistent behaviour. Always validate your findings across multiple dumps and different time periods before making significant changes to your application.</p><p>Comparing thread dumps across time reveals important performance patterns in your AEM instance. Start by establishing a baseline during normal operation, including peak usage periods and maintenance windows. This baseline provides context for identifying abnormal thread behaviour.</p><p>To determine if a thread is persistent across time:</p><ol><li>Select multiple thread dumps from different points in time.</li><li>Click the Compare Threads button in IBM TDA.</li><li>Look for threads that remain in the Runnable state across all dumps, especially those with consistently long stack traces.</li></ol><p>\\\nUse IBM TDA’s Compare Threads feature to analyze dumps from different time points. Focus on threads that persist across multiple dumps, examining their states, stack depths, and resource usage. Remember that thread persistence alone doesn’t automatically indicate a problem — background services naturally run continuously, while request threads should complete within expected timeframes.</p><p>\\\nWhen analyzing persistent Runnable threads, correlate their behaviour with system metrics like CPU usage, memory consumption, and response times. Consider the thread’s purpose: background services, request processing, or maintenance tasks each have different expected patterns. For request threads, compare their duration against defined service level agreements and business requirements.</p><p>\\\nGot a suspicious thread pattern? Don’t jump to conclusions just yet! Try to recreate the issue in your test environment first — it’s like having a dress rehearsal before the main show. Take a good look at your code, double-check those config settings, and consider what else might be stirring up trouble in your environment. Keep track of what you find with real performance numbers and test results — you’ll thank yourself later.</p><p>\\\nOnce you’re sure you’ve caught a real performance culprit (backed by solid evidence, of course), it’s time to fix it.</p><p>If analyzing threads doesn’t yield actionable insights, switch to the Monitor Detail view:</p><ol><li><p>Go back to the thread listing.</p></li><li><p>Select a thread dump and click the Monitor Detail button.</p></li><li><p>IBM TDA will display a tree view of monitor-owning threads and their waiting threads.</p></li></ol><p>\\\nThis view helps you identify threads that are holding monitors and causing contention. Understanding thread monitors is like viewing the nervous system of your application. These synchronization mechanisms control how threads access shared resources, preventing potential conflicts and ensuring smooth operation.</p><p>\\\nMonitor interactions can reveal critical performance insights. Some threads will be actively processing requests, while others wait for resource acquisition or participate in coordinated activities. Not all waiting or idle threads indicate a problem — they’re often part of the application’s natural resource management strategy.</p><p>\\\nHowever, not all threads are equally important:</p><ul><li>Ignore idle thread pool threads: These threads typically have ≤10 stack lines and are part of thread pools like the servlet engine. They’re usually harmless unless they dominate the thread pool.</li><li>Focus on application-specific monitors: Look for monitors tied to your application’s business logic, such as database connections, caching mechanisms, or custom synchronization blocks.</li></ul><p>\\\nRemember that thread and monitor analysis is both an art and a science. Each application has unique characteristics, so approach performance optimization with curiosity and a holistic perspective. The goal is not to eliminate all waiting threads but to understand and optimize their interactions.</p><p>\\\nAdvanced Tip: If you notice certain monitors are frequently contended, consider refactoring your code to reduce lock granularity. For example:</p><ul><li>Replace coarse-grained locks with fine-grained ones.</li><li>Use non-blocking algorithms or concurrent data structures where possible.</li><li>Optimize database queries to reduce the time threads spend waiting for locks.</li></ul><p>In some thread dumps, you might notice the  appearing frequently. This service handles tasks like Garbage Collection, memory management, and resource cleanup. While the Collector Service might seem like a mysterious background process, understanding its behaviour is key to maintaining optimal system performance — think of it like a diligent janitor in a large office building.</p><p>\\\nWhen you notice frequent Collector Service activity, don’t immediately assume disaster. It’s normal for the Collector Service to show up occasionally, but excessive activity could indicate underlying issues:</p><ul><li>Memory leaks: Objects that are not being garbage collected can cause frequent GC cycles.</li><li>High object churn: Rapid creation and destruction of objects can overwhelm the garbage collector.</li><li>Improper JVM settings: Misconfigured heap sizes or GC algorithms can lead to inefficiencies.</li></ul><p>\\\nHere are some considerations to optimize resource usage:</p><ul><li>Tuning your JVM settings (e.g., increasing heap size, switching to G1GC).</li><li>Reviewing your application’s memory allocation patterns to reduce unnecessary object creation.</li></ul><p>\\\nGarbage Collection is not a problem to be solved, but a dynamic system to be understood and optimized. Each application has unique characteristics, and there’s no universal solution.</p><p>Thread dump analysis is a developer’s superpower — transforming you from a code writer to a performance detective. IBM Thread Analyzer (TDA) is your key to understanding complex system behaviours, revealing hidden bottlenecks that impact your Java/AEM instance’s performance.</p><p>\\\nLike learning an instrument, your skill improves with practice. Each thread dump becomes clearer, revealing intricate patterns of system interactions. The more you analyze, the more intuitive performance optimization becomes.</p><p>\\\nRemember, practice makes perfect — the more you analyze thread dumps, the sharper your diagnostic skills will become. 📊💪</p><p>\\\n🛠 ️Happy troubleshooting! And don’t forget to share your findings with your team to keep your Java/AEM instance running smoothly.</p>","contentLength":12075,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Launch a Product in a New Market Is Hard, So I Made a 4-Step Framework for Success","url":"https://hackernoon.com/launch-a-product-in-a-new-market-is-hard-so-i-made-a-4-step-framework-for-success?source=rss","date":1739601806,"author":"Roman Shimanskiy","guid":356,"unread":true,"content":"<p> because there’s just no real demand for what they’re offering. A staggering number and a logical reason behind it – and it’s the main one, according to CB Insights. It’s not about a lack of funding, bad hires, or tough competition. The real question is whether people actually need what you’re about to offer them.</p><p>\\\nPlus, having a great product isn’t enough. To win, you need to understand the competitive landscape, your audience, and how to get your brand in front of the right people. Drawing from my experience launching Yango Play in MENA — where we developed an AI-powered Entertainment SuperApp that quickly became one of the region’s leading streaming platforms — I want to share the key steps we took to make it the success it is now.</p><p><strong>Selecting the right market</strong> is a balance between <strong>competition and profitability.</strong> Some regions offer low competition but limited revenue potential, while others may be more lucrative but very, very saturated. Sub-Saharan Africa, for example, has a large population and low competition, making it an appealing early-stage entry option. But, lower consumer spending restricts growth. MENA, on the other hand, has a smaller population but significantly higher consumer purchasing power, making it an attractive place for expansion.</p><p>\\\n is just as critical as market selection. Entering too early may mean slow adoption while entering too late risks facing intense competition.</p><blockquote><p>If competition is low, it provides an advantage and accelerates market growth. The key is to enter before the market experiences a surge in adoption.</p></blockquote><p>\\\nIn the CIS region, the subscription economy remained relatively flat at 1–2 million subscribers for several years before suddenly accelerating to 100% annual growth. The same pattern emerged in MENA, indicating that the region was nearing a similar tipping point, making it the optimal time to enter.</p><p>\\\nMarket data is here to reinforce this statement. MENA’s total population is around 500 million, with 13.5 million already subscribed to video streaming services. Just for reference, penetration of subscription services in CIS region stands at 15-20%, with slight differences between countries. Even without complex economic modeling, these figures indicated a major opportunity for subscription-based services in MENA. So, an ideal market for expansion. In this case, the potential formed the perfect ground for selecting the market and strategy – the choice was easy.</p><p>\\\nStill, the region was already highly competitive, with more than 50 video streaming platforms and many global and local music services. We had strong competitors in each category, so for us entering the market required more than just identifying demand.</p><h3><strong>Product and Content Differentiation</strong></h3><p>Creating a strong differentiator was key, and competing head-on with zero brand awareness would have been very much an uphill battle.</p><p>\\\nTake YANGO’s case study on product differentiation. We simultaneously implemented two strategies — with **differentiation through the product and content. \\n </p><ol><li><p>An Entertainment SuperApp — <strong>a single subscription combining music, movies, and games.</strong> At the time, there wasn’t anything similar, so we gladly took the opportunity for this strategic entry point. Users typically juggle multiple subscriptions: one for music, another for video, and yet another for gaming. We built everything into one app under a single subscription. This way, we got on the growing global trend toward bundled entertainment services and also filled a gap in our target market. Win-win.</p></li><li><p>Netflix has long become the go-to platform for global content. We took a different route and built an ecosystem tailored to local tastes. Our SuperApp has regional music, Arabic-language films, and localized gaming options, making it much more relevant to MENA audiences. This became a critical differentiator, making our product not just another streaming service but a culturally attuned entertainment hub.</p></li></ol><p>\\\nConclusion: <em>To successfully differentiate a product, the best strategy is to identify weaknesses or unmet needs in competing products — and fill those gaps.</em></p><p>\\\nIn crowded markets, pricing is as crucial as the product. It’s not the features that make or break the product – it’s about making your product the most logical choice.</p><p>\\\nSo, we introduced a long trial period and a bundled pricing model, allowing users to get music and movies for the price of one. Instead of discounting, we maximized perceived value, making the subscription an easy, rational decision.</p><p>\\\nExpanding into a new market meant building a local team and adapting to language and cultural nuances. With deep market research, perfect timing, and a product tailored to real consumer needs, the SuperApp secured a strong foothold in a high-growth market. How did we tackle these challenges? That’s a story for another article.</p><h3><strong>Audience Differentiation: Defining the Target User</strong></h3><blockquote><p><em>Users have mental “boxes” where they sort every new product they see. Food delivery? That goes into one box. A streaming service? Another box. But if your product doesn’t fit neatly into a box, it triggers confusion — people don’t know what to do with it. And when something feels unfamiliar, the default reaction is to ignore it.</em></p></blockquote><p>\\\nThat’s why crystal-clear positioning isn’t optional — it’s survival. If users can’t instantly grasp who your product is for and why they need it, you’re fighting an uphill battle. But just fitting into a category isn’t enough. You have to own it. When people think about entertainment subscriptions, they should immediately think of your brand.</p><p>\\\nHow do you make that happen? Precision. <strong>Messaging needs to be sharp, clear, and unmistakable.</strong> Instead of vague positioning, spell it out: “This is a service for modern Arabic-speaking users.” That clarity eliminates confusion and makes it easier for potential subscribers to see how the product fits into their everyday world.</p><p>\\\nBrand anchoring is everything— <strong>the simpler and more memorable the positioning, the stronger the audience connection.</strong> If users struggle to define what the product is or who it’s for, they’ll tune it out. That’s a death sentence for any brand. The fix? Build an instant mental link. The moment someone thinks “entertainment subscription,” your SuperApp should be the first thing they recall.</p><p>For startups that can’t outspend competitors, traditional marketing funnels — awareness → consideration → purchase — might not be the best play. Instead, skip the awareness stage and go straight for user acquisition.</p><p>\\\nHere’s the logic: if someone downloads your app, they already know it exists. There’s no need to waste resources on brand awareness before conversion. Yes, this approach raises the cost per acquisition (CPA) since users are coming in cold, but the trade-off is greater control over spending and a more direct path to growth.</p><p>\\\n<strong>The real power lies in performance-driven marketing, which focuses on conversions rather than broad exposure.</strong> Even brands with large media budgets rely on performance marketing as the most efficient way to drive actual user engagement. For lean startups, this strategy isn’t just viable — it’s essential.</p><p><strong>A product launch is a one-time shot</strong> at grabbing audience attention —  over a long, drawn-out campaign. The smartest play? Go loud.</p><p>\\\n<em>The launch moment is your biggest marketing asset — a rare window where PR and buzz can be built just around your existence. Instead of slow, passive brand-building, focus on making a splash that gets people talking.</em></p><p>\\\nOnce the initial hype kicks in, then comes the next phase — brick by brick, reinforcing brand awareness and earning user trust. We also saw this proven in the case of Kinopoisk (video streaming platform). We focused our marketing around major premieres such as <em>Zack Snyder's Justice League</em>, , and big exclusive original premieres.</p><h3><strong>Shifting from Traditional Advertising to Alternative Channels</strong></h3><p>From experience, <em>buying direct media ads is often far less effective than leveraging influencers, word of mouth, and strong PR.</em></p><p>\\\nSpending time on finding the right influencer, crafting a viral PR angle, or developing creative content that resonates delivers higher ROI than just pouring money into paid ads. <strong>In a budget-constrained environment, the smarter play is a two-step approach:</strong></p><ul><li><p>Performance marketing first — drive installs and conversions while simultaneously learning how users interact with the product.</p></li><li><p>Organic &amp; influencer-driven marketing second — building credibility and momentum through earned media, viral content, and strategic partnerships.</p></li></ul><p>With influencers, you’re hitting two targets at once. First, their audience gets exposed to your service, boosting brand awareness. But the real power of influencer marketing is in its high conversion rates — it doesn’t just build visibility; it drives action. It works like performance marketing in many ways. Even better? The creative content influencers produce often performs exceptionally well in paid performance campaigns, making it a valuable asset beyond the initial collaboration. So, really, you’re getting even more value out of every campaign.</p><p>\\\nThis keeps acquisition costs under control and ensures real engagement and long-term user retention.</p><p>\\\nOne of the most successful cases of leveraging PR instead of direct advertising is Netflix. When expanding into new regions, the company rarely invests in traditional media ads. Instead, it focuses on localized content, influencer collaborations, and large-scale PR campaigns. This approach has allowed Netflix to dominate new markets without massive ad spending, making the brand recognizable through organic user discussions and viral interest.</p><p>\\\nThere are plenty of examples of viral brands and services — take Dubai Chocolate or Clubhouse, for instance. These apps and platforms managed to gain massive audiences with little to no marketing spend, relying purely on organic growth and word of mouth.</p><h3><strong>The Founder as the Brand’s Leading Ambassador</strong></h3><p>In a competitive market, PR isn’t just about press releases and media coverage — it’s about people. A founder holds a unique advantage: their voice becomes the product’s most powerful marketing tool.</p><p>\\\nPeople don’t engage with companies — they engage with other people. Instead of relying on corporate statements or press releases, modern PR is about creating shareable content and building influence through authentic, human-driven narratives.</p><p>\\n Whether you are a startup or an established company, entering a new market requires more than a strong product — it asks for adaptability to evolving industry rules and dynamics. The strategies that worked in the past may no longer be effective in an environment where competition is fierce, consumer behavior is shifting, and digital ecosystems are rapidly changing. Success hinges on thorough market research, precise audience targeting, strategic product differentiation, and a well-structured promotional approach.</p>","contentLength":11021,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Every New Apple Device Expected in 2025","url":"https://hackernoon.com/every-new-apple-device-expected-in-2025?source=rss","date":1739600519,"author":"David Perru","guid":355,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How Hospitals Use AI to Boost Efficiency in Medical Imaging Technology","url":"https://hackernoon.com/how-hospitals-use-ai-to-boost-efficiency-in-medical-imaging-technology?source=rss","date":1739600517,"author":"Beth Rush","guid":354,"unread":true,"content":"<p>\\\nAdvancing health care technologies are crucial for doctors and patients. They could make medical services easier to provide while giving people better results, but only if everyone understands the bigger picture. Artificial intelligence (AI) is a critical tool that may become part of your health care services in the near future. Check out how physicians are using AI in medical imaging and diagnostics to learn why it could revolutionize the industry.</p><h2><strong>What Is Medical Imaging Technology?</strong></h2><p>Medical imaging technology is any tool that  to monitor normal and abnormal cases. The term includes various services that assist health care providers in making diagnoses. While they’ve existed long before automation, artificial intelligence in medical imaging is becoming more widespread through software updates.</p><h2><strong>Different Types of Imaging Techniques</strong></h2><p>You’ll better understand why AI could be an essential scientific tool if you know which imaging techniques people undergo. Learn more about each form of technology to understand AI’s advantages and challenges more easily.</p><p>X-ray machines are penetrative imaging tools that look at targeted areas inside the body before sending the results to imaging technology. The machine sends ionizing radiation into a patient to gather pictures for diagnosis. X-rays are especially useful for bone inquiries because the radiation passes through them and makes them bright white.</p><h3><strong>Magnetic Resonance Imaging (MRI)</strong></h3><p>If you need an MRI, a doctor might inject a contrast agent into your bloodstream  before you sit in the machine. Radiowaves, a magnet and a computer processor look inside the selected part of your body to reveal everything from tissues to joints.</p><p>Ultrasound imaging  to see what’s in your body. The machinery bounces soundwaves off of your organs and tissues instead. This isn’t a penetrative imaging technique, even though tools like transvaginal wands do work inside the vaginal canal.</p><p>Doctors needing more complex imaging may order CT scans. They combine an X-ray with a computer to  before it bounces back on a plate behind the patient. The machinery scans in a circle, making it more useful for 3D images of internal damage or tumors.</p><h2><strong>How Each Technique Benefits From AI</strong></h2><p>If health care experts have used imaging techniques since before AI existed, why would they benefit from it? There are a few key ways AI in medical imaging and diagnostics could improve each technique for providers and patients.</p><h3><strong>Algorithms Can Process Images Faster</strong></h3><p>When doctors order penetrative imaging, they wait for specialized hospital staff to conduct the process and return the pictures. The physician needs time to sit and analyze the image, which may not happen immediately if they have a busy schedule. Given that the U.S. will have a health care worker shortage , the high work demand on doctors is a long-term challenge.</p><p>\\\nYou don’t need to worry about not getting medical imaging results back quickly if your local hospital uses machine-learning algorithms to process patient results. AI can review results , providing recommendations for doctors when they have time to check the scans. A health care provider will still review your results, but they could get back to you faster with computerized assistance.</p><h3>AI May Catch Small Details Better</h3><p>Artificial intelligence in medical imaging can do much more than summarize scans. The algorithms can also delineate structures in the human body. Advanced programs , tumors, and blood vessels and catch abnormalities in imaging results.</p><p>\\\nDoctors might accidentally overlook similar developments if they’re too small to see with the human eye. Instead of going back for additional imaging in a few weeks or months, you could get earlier and more precise results with AI-supported medical imaging techniques.</p><p>\\\nRemember — your doctor will still have the final say over your diagnosis. AI provides additional insights, but you’ll always need to talk with your health care provider before moving forward with treatments.</p><h3>Predictive Analytics May Provide Personalized Treatment Suggestions</h3><p>Personalized treatment plans start with diagnostic tools like medical imaging before combining your results with your health history. AI may assist with that process in more hospitals over time. Advanced algorithms can  while checking your scan results. Afterward, your doctor will review its recommended treatment options and use that data to start conversations with you.</p><p>\\\nTogether, you’ll decide the next best steps. AI won’t determine how you get medical care. Machine learning programs are an evergrowing tool that could make those conversations more straightforward by supplying potentially more accurate data.</p><p>Some surgeries require medical imagery techniques for real-time data. Machine learning  in specialties like cardiothoracic, ophthalmology and general surgery. When health care professionals use it in real time, the algorithms can review images guiding surgeons through a procedure and assist in augmented visualization. Decision support may also be helpful for instant recommendations based on the patient’s collective medical history, like the likelihood of complications.</p><h2>Does AI Medical Imaging Guarantee Increased Efficiency?</h2><p>There’s no guarantee that AI medical imaging will increase the efficiency of real-time surgical decisions, diagnoses or treatment plans. Algorithms are only as good as their programming. Your doctor will always need to consider the data provided by any machine learning program before using their comprehensive medical knowledge and understanding of your needs to give an informed opinion.</p><h2>Potential Challenges Hospitals May Face</h2><p>As more hospitals start using AI programs to read results like medical scans, it’s important to understand the barriers that may prevent implementation. Keep those factors in mind if you’re hoping to see AI-assisted medical services where you live.</p><h3>Data Storage and Protection</h3><p>Everything processed and produced by artificial intelligence in medical imaging consists of sensitive data. Hospitals need robust storage capabilities to utilize AI-assisted medical imaging and keep patient information safe. Experts estimate data breaches  in 2024 and may get worse in years to come.</p><p>\\\nHospital administrative teams may need to partner with information technology experts internally or externally to set up data storage methods with extra protection. The process may delay AI implementation, depending on where each facility’s current cybersecurity measures stand.</p><h3>Accurate Interpretability</h3><p>Medical imaging technology with AI programs is relatively new. Hospital staff will likely need some form of training before they can use it with patients. Human error could cause less accurate interpretability as medical providers get used to reading and considering AI results while making recommendations.</p><h3>Integrating AI With Current Workflow Systems</h3><p>Adding a software system to a new service is much less complicated than integrating it into something people are already doing. Hospitals are serving patients around the clock, so adding AI to their medical imaging processes without compromising patient care or service speed is challenging.</p><p>\\\nResearchers also point out that health care systems  due to things like mismatching software programs or outdated technology. Analyzing, collecting and storing imaging data may require other updates before it can happen smoothly. Communicating AI information across departments or between hospitals may create additional struggles for health care providers.</p><h2>Anticipate More AI in Medical Imaging and Diagnostics</h2><p>Health care professionals are interested in artificial intelligence in medical imaging because it could help them work faster, provide personalized results and give more accurate treatment plans. It can also require complex integration planning before patients benefit from it. Staying up to date on those factors will keep you in the know with the ever-changing health care industry.</p>","contentLength":7965,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ikey Doherty's Serpent OS Rebranding As AerynOS","url":"https://www.phoronix.com/news/Serpent-OS-To-AerynOS","date":1739595600,"author":"Michael Larabel","guid":705,"unread":true,"content":"<article>The nearly three year old Serpent OS Linux distribution started by Ikey Doherty of Solus fame is going to re-brand as AerynOS...</article>","contentLength":128,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Phenomenology of Dark Matter Explained","url":"https://hackernoon.com/the-phenomenology-of-dark-matter-explained?source=rss","date":1739591096,"author":"Phenomenology Technology","guid":353,"unread":true,"content":"<h2>3.4 Phenomenology of dark matter</h2><p>\\\n• The relic density coming from Planck satellite data [49]</p><p>\\\nThe total relic abundance of DM in our model is given by the sum of the scalar (𝜒) and fermion (𝑁3) relic abundances:</p><p>\\\nOnly for solutions falling exactly within the band given in Eq. (3.31) the totality of the DM can be explained by 𝜒 and 𝑁3.</p><p>\\\n• Direct detection cross-section of DM scattering of nucleon set by various experiments such as XENON1T [66], LUX [65] and PandaX-II [174]</p><p>\\\nWe implemented the model in the SARAH package [175] to calculate all the vertices, mass matrices, tadpole equations etc. The thermal cross sections and DM relic abundance are determined using micrOMEGAS-5.0.8 [176]. Even though the model introduces new free parameters, not all of them are important to DM analysis. For example, self-quartic coupling 𝜆𝜒 does not play any role in DM phenomenology. Hence we choose to fix 𝜆𝜒 = 0.1 in our analysis. The remaining free parameters relevant for DM analysis can be chosen as:</p><p>\\\nIn the next sections, we will study how the DM phenomenology of this model depends on the free parameters and to do that we choose the following benchmark points which are allowed from all the above-mentioned constraints:</p><p>\\\nwhich we can be utilized to compute the relic density of both the components,</p><p>The direct detection study of our DM candidates 𝜒𝑅 and 𝑁3 are done here. The current experimental constraints on the DM direct detection assume the existence of only one DM candidate. As in our model, two-component DM candidates are predicted, and the contribution of each candidate to the direct detection cross-section should be rescaled by the fraction contributing to the total relic density. Hence it is convenient to define the fraction of the mass density of 𝑖th DM in the case of multi-component DM [156,157,178,179]</p><p>\\\nThe upper limit on the direct detection now can be recast as</p><p>\\\nThe above formula in Eq. (3.40) is an extension of the expression corresponding to the singlet scalar DM case [180]. The relative negative sign between the ℎ1 and ℎ2 contributions arises in our considered model as the couplings get modified according to Eq. (3.42). Due to the presence of the two different channels, depending on the parameter space, we can have destructive interference between these two channels, and direct detection can be very small.</p><p>(1) Shivam Gola, The Institute of Mathematical Sciences, Chennai.</p>","contentLength":2451,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Brake Pad Dust Can Be More Toxic Than Exhaust Emissions, Study Says","url":"https://tech.slashdot.org/story/25/02/15/0016236/brake-pad-dust-can-be-more-toxic-than-exhaust-emissions-study-says?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1739590200,"author":"BeauHD","guid":222,"unread":true,"content":"Bruce66423 shares a report from The Guardian: Microscopic particles emitted from brake pads can be more toxic than those emitted in diesel vehicle exhaust, a study has found. This research shows that even with a move to electric vehicles, pollution from cars may not be able to be eradicated. The researchers found that a higher concentration of copper in some commonly used brake pads was associated with increased harmful effects on sensitive cells from people's lungs, as a result of particles being breathed in.\n \nExposure to pollution generated by cars, vans and lorries has been previously been linked to an increased risk of lung and heart disease. While past attention has mainly concentrated on exhaust emissions, particles are also released into the air from tyre, road and brake pad wear. These emissions are largely unregulated by legislation and the study found that these âoenon-exhaustâ pollution sources are now responsible for the majority of vehicle particulate matter emissions in the UK and parts of Europe, with brake dust the main contributor among them.\n \n[...] The scientists examined the effects on lung health of particulate matter from four different types of brake pad with differing chemical compositions; low metallic, semi-metallic, non-asbestos organic and hybrid-ceramic. Results showed that of the four types of brake pads, non-asbestos organic pads were the most potent at inducing inflammation and other markers of toxicity, and were found to be more toxic to human lung cells than diesel exhaust particles. Ceramic pads were the second most toxic. Dr. Ian Mudway, senior lecturer at the school of public health at Imperial College London, cautioned that while the research on brake pad emissions appears sound, it is premature to conclude they are worse than diesel exhaust due to \"uncontrolled variables\" like brake disc types and particle composition.\n \nSlashdot reader Bruce66423 also notes it \"doesn't discuss the significance of regenerative breaking, which is a feature of at least some electric cars [that reduces brake pad wear by using the electric motor to slow down the vehicle and recover energy].\"\n \nThe research has been published in the journal Particle and Fibre Technology.","contentLength":2229,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Theoretical and Experimental Constraints: Discussing Different Constraints on the Model Parameters","url":"https://hackernoon.com/theoretical-and-experimental-constraints-discussing-different-constraints-on-the-model-parameters?source=rss","date":1739588801,"author":"Phenomenology Technology","guid":352,"unread":true,"content":"<h2>3.3 Theoretical and experimental constraints</h2><p>We discuss different constraints on the model parameters such as𝑈(1)𝑋 gauge coupling and scalar mixing angle. To estimate the constraints we consider vacuum stability, perturbative unitarity, and collider searches of BSM Higgs and 𝑍′ boson respectively.</p><p>The above scalar potential must be bounded from below. To determine the conditions for 𝑉(𝐻, Φ, 𝜒) to be bounded from below, we need to check the following symmetric matrix which comes from the quadratic part of the potential,</p><p>\\\nRequiring such a matrix to be positive-definite, we obtain the following conditions,</p><h3>3.3.2 Higgs Invisible decay</h3><p>\\\nHence the total invisible decay width of SM Higgs boson ℎ1 is given a</p><p>\\\nAccordingly, the invisible branching ratio for ℎ1 is given b</p><h3>3.3.4 Bounds on the mixing parameter between physical mass eigenstates</h3><p>(1) Shivam Gola, The Institute of Mathematical Sciences, Chennai.</p>","contentLength":928,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A Phenomenological Study of WIMP Models: Scalar Sector, Gauge Sector, and More","url":"https://hackernoon.com/a-phenomenological-study-of-wimp-models-scalar-sector-gauge-sector-and-more?source=rss","date":1739588422,"author":"Phenomenology Technology","guid":351,"unread":true,"content":"<p>\\\nIn the next subsections, we discuss various parts of the lagrangian of the model,</p><p>\\\nwhere 𝛼 is the mixing angle. The rotation matrix satisfies</p><p>\\\nThe real and imaginary components of 𝜒 have the following masses</p><p>To determine the gauge boson spectrum, we have to expand the scalar kinetic terms and replace</p><p>The Yukawa sector of the model can be written in a gauge-invariant way as</p><p>(1) Shivam Gola, The Institute of Mathematical Sciences, Chennai.</p>","contentLength":446,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Studying a Two-Component Dark Matter Model: An Introduction","url":"https://hackernoon.com/studying-a-two-component-dark-matter-model-an-introduction?source=rss","date":1739588136,"author":"Phenomenology Technology","guid":350,"unread":true,"content":"<p>In this chapter, we study a two-component DM model interacting with SM via Higgs and Z portals. The results are based on the work: Arindam Das, Shivam Gola, Sanjoy Mondal, Nita Sinha, \"Two-Components Scalar and Fermionic Dark Matter candidates in a generic U(1)𝑋 model, Phys.Lett.B 2022.137117”.</p><p>Underpinning the origin of neutrino mass and elucidating the nature of DM would constitute a major step forward in particle physics. Several simple extensions of the SM that can account for the DM have already been studied [136–143]. In these models, the SM particle content is extended by additional fields, and a discrete symmetry is usually introduced to guarantee the stability of the DM particle in cosmological scale. In recent years, a class of models has been proposed to incorporate the neutrino mass generation and the existence of DM in a unified framework. Motivated by this, people have studied well-motivated BSM framework based on the gauged 𝑈(1)𝑋 model [144–146]. The most intriguing aspect of this model is that including three generations of right-handed neutrinos, as in the type-I seesaw process for creating light neutrino masses, is no longer an option, but emerges as the simplest solution to eliminate the gauge and mixed gauge-gravity anomalies [147]. The scalar DM can be inherently stable in such models due to its 𝑈(1)𝑋 charge, but the fermionic DM cannot be realized in the simplest 𝑈(1)𝑋 model. Additional discrete symmetries can be introduced, which can stabilize one of the right-handed neutrinos to play the role of DM, while the other two neutrinos participate in the type I seesaw process to generate the required light neutrino masses and flavor mixing. Also, there are many models proposed in the literature, where neutrino mass generation is intimately connected with DM [148–153]. In these types of models, DM is a mediator of neutrino mass generation.</p><p>\\\nA single-particle DM model may not be sufficient to account for the relic density of DM observed in the universe. Many such models face strong constraints from direct detection experiments and other observations. Therefore, it is reasonable to consider multi-particle DM scenarios, where two or more particles contribute to the DM abundance. [24,62,126]. Multi-component DM refers to a situation in which two or more particles contribute to the measured DM density. This has been already studied in many BSM scenarios [31, 56, 57, 154–166]. The multi-component DM model has also some benefits over the single dark matter scenario. For instance, it can avoid some stringent constraints arising from various experiments that probe the properties and interactions of dark matter and other particles. A multi-component DM model can also accommodate different observational features of dark matter, such as its distribution and abundance in the universe.</p><p>(1) Shivam Gola, The Institute of Mathematical Sciences, Chennai.</p>","contentLength":2933,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI and the Future of Work: Transforming Industries","url":"https://hackernoon.com/ai-and-the-future-of-work-transforming-industries?source=rss","date":1739585602,"author":"Ombir Sharma","guid":349,"unread":true,"content":"<p>AI or artificial intelligence is the capability and ability of a machine to imitate human intelligence. Intelligent systems are capable of learning, reasoning, and self-correcting. AI includes a number of technologies such as machine learning, natural language processing, robotics, and computer vision. It is able to perform a wide array of functions from simple repetitive work to making complex decisions which changes the very fabric of industries.</p><h2>The Rise of Robotics and AI</h2><p>The combination of <a href=\"https://hackernoon.com/artificial-intelligence-and-robotics-whos-at-fault-when-robots-kill-a01u3ear\">AI and robotics</a> is changing the world at an unprecedented rate; human errors are greatly reduced and proficiency is greatly improved across multiple industries. Robots powered by AI can be programmed to accomplish tasks that previously only humans could perform. From AI-trained chatbots at customer service to assembly lines in factories, this newly developed technology changes the workplace alongside societal norms.</p><h3>Effect of Artificial Intelligence on Employment</h3><p>AI is a double-edged sword with its impact on employment. The technology has created several new opportunities and increased overall productivity in numerous ways, however, it has also posed great threats to certain jobs and industries which can lead to displacement of employees.</p><p>An important shift is on the horizon as the job market is about to undergo a role reversal change. As AI technology evolves, it is taking over the more labor-intensive tasks and as a result, human workers are becoming more strategic and analytic. AI alleviates repetitive tasks and allows employees to focus on creative problem-solving.</p><p>The new approach AI takes centers around<a href=\"https://www.intelligenceinsights.net/artificial-intelligence/autogpt-the-future-of-autonomous-ai-assistants/\"></a>, just like the Industrial Revolution. While focusing on increasing productivity, ChatGPT and AutoGPT have the potential to perform tasks such as data entry, scheduling, and even more complex problem-solving, increasing overall demand for customer service representatives and support agents. In every age, these shifts in productivity have led to increased job opportunities, just like the multiple industries that formed alongside the technology integrations.</p><h3>Facilitation of Employment</h3><p>The introduction of ChatGPT can aid everyday business operations, serving as virtual assistants that communicate primarily with customers. By streamlining business functions for flexible resource allocation, productivity is sure to increase. Efficient use of ChatGPT makes it incredibly simple for businesses to automate their customer inquiries, increasing profit margins.</p><p>ChatGPT encourages an environmentally friendly approach by seamlessly optimizing supply chains with effective waste reduction strategies. AI, without a doubt, would optimize ChatGPT-provided decision-making to improve overall energy consumption and ensure economic goals are catered towards too.</p><p>In the absence of people, ChatGPT opens doors to new interactions that drastically improve service and business operations through automation. Communication via virtual assistants and chatbots allows for effortless collaboration and automated customer interactions on a new level.</p><p>\\\nIn every way possible, AI improves business decision-making by offering adequate utility and data for correct allocation. Business AI helps set prices, predict market movement, and analyze how much risk varies. Keeping track of tools like ChatGPT can aid project-based decisions by providing up-to-date information.</p><h3>Elimination of Junior and Mid-level Staff Positions</h3><p>As a result of automation, junior and mid-level roles, particularly in data entry and administrative duties and tasks, are being skinned out. More companies seem to be using AI, which, in turn, is leading to an increased need for highly specialized and senior positions that require a supervisor to think strategically.</p><p>Across different industries, AI is changing the future of work. From performing simple services to making complex decisions, AI has a broad range of applications, and as time goes by, the list only seems to grow.</p><h2>The Use Of AI In Business</h2><p>Artificial intelligence is being adopted in all sectors to boost productivity, accuracy, and satisfaction of customers. It is used in recruitment HR, in<a href=\"https://www.thenexthint.com/a-new-era-in-customer-service-with-automation/\"></a> through chatbots, and in marketing through brand campaigns. Work processes are now being automated with AI, thereby, minimizing the costs of running the business.</p><h3>Impact Of AI On Business Operations</h3><p>Software developments with regard to Artificial intelligence utilizing machine learning and automation present the future of the workplace, resulting in increased productivity. Businesses will continuously adopt AI to better their decisions, improve work processes, and promote creativity. Because of this, more skills in AI will be needed which will translate to new positions being created.</p><p>In the field of finance, AI handles fraud detection, automates trading, and enhances risk assessments. Robo-advisors make investment suggestions based on a client’s unique profile, and AI chatbots provide further engagement with customers.</p><p>AI assists in diagnosing diseases and personalizes treatments for patients in healthcare. With the help of <a href=\"https://hackernoon.com/the-future-of-robotics-development-with-eva-li-of-vincross-dd8d85256d4e\">AI-led robots</a>, humans can make fewer mistakes while performing surgeries, which helps enhance patient care.</p><p>In the automotive sector, AI enables self-driving cars, predictive maintenance, and smart traffic control. AI technologies also help improve vehicle safety and fuel efficiency.</p><p><a href=\"https://hackernoon.com/how-the-us-government-plans-to-ensure-the-safety-and-security-of-ai-technology\">Cybersecurity</a> is enhanced by AI technologies that assess new threats, detect anomalies, and provide assistance during the occurrence of cyber-attacks. Data security is also improved and business risks are suppressed by AI technologies.</p><p>In the e-commerce sector, AI improves customer experiences, automates supply chains, and increases the level of service. Recommendation systems based on users' behavior increase the total sales and satisfaction level of customers.</p><p>We see the growth of AI in hospitality in chatbots, smart booking systems, and customer experience applications. AI analytics also help with effective guest price settings and greater guest satisfaction.</p><p>AI greatly assists in providing relevant lists of jobs that best suit a candidate's skills. AI technology helps to read a CV, understand the candidate's level of skills, and determine his success.</p><h2>Are My Working Opportunities On The Line Due To AI?</h2><p>Filling positions for repetitive work is indeed scalable with AI which is why it poses a threat for employment. In reality, AI also creates new possibilities by taking up low-productivity tasks. It is expected that new jobs that require creative thinking, emotions, and strategy-based decision-making will still exist. To ensure that they remain employed, workers must learn new skills and adjust to the new reality.</p><p>AI is enabling the future of work by performing tasks that require time and effort, growing productivity, and changing the existing categorization of industries. Some roles may be lost, but there are always new positions that have to be filled. Being able to utilize AI together with other novel technologies is crucial to be successful for business professionals in the new world.</p>","contentLength":7063,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"'Please Stop Inviting AI Notetakers To Meetings'","url":"https://slashdot.org/story/25/02/15/006253/please-stop-inviting-ai-notetakers-to-meetings?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1739584920,"author":"BeauHD","guid":221,"unread":true,"content":"Most virtual meeting platforms these days include AI-powered notetaking tools or bots that join meetings as guests, transcribe discussions, and/or summarize key points. \"The tech companies behind them might frame it as a step forward in efficiency, but the technology raises troubling questions around etiquette and privacy and risks undercutting the very communication it's meant to improve (paywalled; alternative source),\" writes Chris Stokel-Walker in a Weekend Essay for Bloomberg. From the article: [...] The push to document every workplace interaction and utterance is not new. Having a paper trail has long been seen as a useful thing, and a record of decisions and action points is arguably what makes a meeting meaningful. The difference now is the inclusion of new technology that lacks the nuance and depth of understanding inherent to human interaction in a meeting room. In some ways, the prior generation of communication tools, such as instant messaging service Slack, created its own set of problems. Messaging that previously passed in private via email became much more transparent, creating a minefield where one wrong word or badly chosen emoji can explode into a dispute between colleagues. There is a similar risk with notetaking tools. Each utterance documented and analyzed by AI includes the potential for missteps and misunderstandings.\n \nAnyone thinking of bringing an AI notetaker to a meeting must consider how other attendees will respond, says Andrew Brodsky, assistant professor of management at the McCombs School of Business, part of the University of Texas at Austin. Colleagues might think you want to better focus on what is said without missing out on a definitive record of the discussion. Or they might think, \"You can't be bothered to take notes yourself or remember what was being talked about,\" he says. For the companies that sell these AI interlopers, the upside is clear. They recognize we're easily nudged into different behaviors and can quickly become reliant on tools that we survived without for years. [...] There's another benefit for tech companies getting us hooked on AI notetakers: Training data for AI systems is increasingly hard to come by. Research group Epoch AI forecasts there will be a drought of usable text possibly by next year. And with publishers unleashing lawsuits against AI companies for hoovering up their content, the tech firms are on the hunt for other sources of data. Notes from millions of meetings around the world could be an ideal option.\n \nFor those of us who are the source of such data, however, the situation is more nuanced. The key question is whether AI notetakers make office meetings more useless than so many already are. There's an argument that meetings are an important excuse for workers to come together and talk as human beings. All that small talk is where good ideas often germinate -- that's ostensibly why so many companies are demanding staff return to the office. But if workers trade in-person engagement for AI readbacks, and colleagues curb their words and ideas for fear of being exposed by bots, what's left? If the humans step back, all that remains is a series of data points and more AI slop polluting our lives.","contentLength":3228,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Uber sues DoorDash, alleging anti-competitive tactics","url":"https://techcrunch.com/2025/02/14/uber-sues-doordash-alleging-anti-competitive-tactics/","date":1739583337,"author":"Kirsten Korosec, Maxwell Zeff","guid":285,"unread":true,"content":"<p>Ride-share giant Uber filed a lawsuit Friday against DoorDash, accusing the delivery outfit of stifling competition by intimidating restaurant owners into exclusive deals. Uber alleges in the lawsuit, filed in Superior Court of California, that its chief rival bullied restaurants into only working with DoorDash. Uber claims that DoorDash, which holds the largest share of […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":442,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"NYC Is Giving Free E-Bikes To Delivery Workers Using Unsafe Models","url":"https://hardware.slashdot.org/story/25/02/14/2336232/nyc-is-giving-free-e-bikes-to-delivery-workers-using-unsafe-models?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1739582700,"author":"BeauHD","guid":220,"unread":true,"content":"New York City's Department of Transportation is offering delivery workers the opportunity to swap out uncertified e-bikes for safer UL-compliant models. \"Millions of people rely on such workers for timely deliveries, yet the low wages and brutal conditions of the job have forced many riders to seek out low-cost electric bicycles to perform the work -- exactly the kind of e-bikes that are least likely to have received safety certifications,\" reports Electrek. From the report: The NYC DOT has already begun accepting applications for the new E-Bike Trade-In Program, which is open to delivery workers with non-compliant electric bicycles as well as the often-seen electric scooters/mopeds that don't really qualify as e-bikes, despite their ubiquitous use in the industry. Interestingly, the program even accepts gasoline-powered mopeds that are not able to be legally registered with the DMV, including those that lack VINs. In exchange for trading in a non-certified vehicle, the delivery worker will receive a new UL-certified electric bike with a spare UL-certified battery.\n \nThere are a few requirements for eligibility. The worker has to have earned at least US $1,500 by working in the food delivery industry last year in 2024, live in one of the five New York City boroughs, be at least 18 years old, and own/use one of the eligible devices for trade-in. The program is free to participate in with no additional cost for the delivery workers. However, the supply of free electric bicycles is described as \"limited.\" Those interested need to submit an application before the window closes on March 10, 2025.","contentLength":1618,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Go 1.24 Brings Performance Improvements, Better WebAssembly Support","url":"https://www.phoronix.com/news/Go-1.24-Released","date":1739582673,"author":"Michael Larabel","guid":704,"unread":true,"content":"<article>Go 1.24 was released this week by Google engineers as the newest step forward for this popular programming language...</article>","contentLength":118,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Microsoft Study Finds Relying on AI Kills Your Critical Thinking Skills","url":"https://slashdot.org/story/25/02/14/2320203/microsoft-study-finds-relying-on-ai-kills-your-critical-thinking-skills?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1739580300,"author":"BeauHD","guid":219,"unread":true,"content":"A new study (PDF) from researchers at Microsoft and Carnegie Mellon University found that increased reliance on AI tools leads to a decline in critical thinking skills. Gizmodo reports: The researchers tapped 319 knowledge workers -- a person whose job involves handling data or information -- and asked them to self-report details of how they use generative AI tools in the workplace. The participants were asked to report tasks that they were asked to do, how they used AI tools to complete them, how confident they were in the AI's ability to do the task, their ability to evaluate that output, and how confident they were in their own ability to complete the same task without any AI assistance.\n \nOver the course of the study, a pattern revealed itself: the more confident the worker was in the AI's capability to complete the task, the more often they could feel themselves letting their hands off the wheel. The participants reported a \"perceived enaction of critical thinking\" when they felt like they could rely on the AI tool, presenting the potential for over-reliance on the technology without examination. This was especially true for lower-stakes tasks, the study found, as people tended to be less critical. While it's very human to have your eyes glaze over for a simple task, the researchers warned that this could portend to concerns about \"long-term reliance and diminished independent problem-solving.\"\n \nBy contrast, when the workers had less confidence in the ability of AI to complete the assigned task, the more they found themselves engaging in their critical thinking skills. In turn, they typically reported more confidence in their ability to evaluate what the AI produced and improve upon it on their own. Another noteworthy finding of the study: users who had access to generative AI tools tended to produce \"a less diverse set of outcomes for the same task\" compared to those without.","contentLength":1915,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI’s Hallucinations Are Over","url":"https://hackernoon.com/ais-hallucinations-are-over?source=rss","date":1739579978,"author":"Oleksandr Zabashnyi","guid":348,"unread":true,"content":"<p>First of all, let me describe the problem. I am a software developer, and I don't use AI to write code just because of hallucinations. For creating pictures or writing texts they are not so critical, but for the task of writing code, they are overkill. I have identified two subproblems. Firstly, it is difficult to identify the errors made by AI. It is quite easy for a designer as he counts the fingers in the pictures and that's it; the picture is accepted as the result. </p><p>\\\nHowever, I have to deal with the code and seek the mistakes in it. I hate to do it. Secondly, it is the irreproducibility of the result. For example, I tried to write unit tests: the first generated unit test is successful, but the second one is not, even for the same method. This makes working with it impossible.</p><p>\\\nNow, about the solution. Our hypothesis was as follows: what if we could assign the corresponding result data to a certain set of input information? And do that at least sometimes during the task-solving process. Would that reduce the number of hallucinations? Oh yes! After thorough research, we have come to the conclusion that the presence of a critical mass of such ‘rigidly fixed’ nodes almost completely removed hallucinations from the output. All that remained was to find the criteria for identifying these correspondences between input and output information and to modify the math apparatus to enable the use of this approach. We called this method the \"preset landscape.\"</p><p>\\\nCertainly, our approach has several limitations. First of all, the subject area should imply the existence of only one correct answer for a given set of output data. Fortunately, software development is exactly such an area. The second limitation is that at the stage of landscape formation, the participation of an expert in the subject field is required. In other words, it is impossible to apply the math apparatus to the areas where a human cannot articulate the rules. These limitations greatly narrow the scope of application of our approach. However, its usage in such areas as software development, law, healthcare, and engineering tasks is more than enough.</p><p>\\\nTo demonstrate the capabilities of the math apparatus, we have developed <a href=\"https://drive.google.com/file/d/1mRhGzEeyhcT4EUZj4a4wAZ8TNYSvByRW/view?usp=sharing\">a plugin</a> for IntelliJ Idea (JetBrains). You can install it and make sure that there are no hallucinations. Here, you can find <a href=\"https://drive.google.com/file/d/1mRhGzEeyhcT4EUZj4a4wAZ8TNYSvByRW/view?usp=sharing\">the instructions</a>.</p><p>\\\nWhile we were working on the plugin, AI services came into vogue, which provides API and you can use them in your own solutions. Therefore, we are planning to make such a platform for software development tasks. We will most likely start with Java. If you have an insight into how this approach can be implemented for lawyers or healthcare professionals - feel free to share.</p>","contentLength":2743,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"PIN AI Launches Mobile App Letting You Make Your Own Personalized, Private AI Model","url":"https://mobile.slashdot.org/story/25/02/14/2227222/pin-ai-launches-mobile-app-letting-you-make-your-own-personalized-private-ai-model?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1739577720,"author":"BeauHD","guid":218,"unread":true,"content":"An anonymous reader quotes a report from VentureBeat: A new startup PIN AI (not to be confused with the poorly reviewed hardware device the AI Pin by Humane) has emerged from stealth to launch its first mobile app, which lets a user select an underlying open-source AI model that runs directly on their smartphone (iOS/Apple iPhone and Google Android supported) and remains private and totally customized to their preferences. Built with a decentralized infrastructure that prioritizes privacy, PIN AI aims to challenge big tech's dominance over user data by ensuring that personal AI serves individuals -- not corporate interests. Founded by AI and blockchain experts from Columbia, MIT and Stanford, PIN AI is led by Davide Crapis, Ben Wu and Bill Sun, who bring deep experience in AI research, large-scale data infrastructure and blockchain security. [...]\n \nPIN AI introduces an alternative to centralized AI models that collect and monetize user data. Unlike cloud-based AI controlled by large tech firms, PIN AI's personal AI runs locally on user devices, allowing for secure, customized AI experiences without third-party surveillance. At the heart of PIN AI is a user-controlled data bank, which enables individuals to store and manage their personal information while allowing developers access to anonymized, multi-category insights -- ranging from shopping habits to investment strategies. This approach ensures that AI-powered services can benefit from high-quality contextual data without compromising user privacy.\n[...]\nThe new mobile app launched in the U.S. and multiple regions also includes key features such as: - The \"God model\" (guardian of data): Helps users track how well their AI understands them, ensuring it aligns with their preferences. - Ask PIN AI: A personalized AI assistant capable of handling tasks like financial planning, travel coordination and product recommendations. - Open-source integrations: Users can connect apps like Gmail, social media platforms and financial services to their personal AI, training it to better serve them without exposing data to third parties. - \"With our app, you have a personal AI that is your model,\" Crapis added. \"You own the weights, and it's completely private, with privacy-preserving fine-tuning.\" Davide Crapis, co-founder of PIN AI, told VentureBeat that the app currently supports several open-source AI models, including small versions of DeepSeek and Meta's Llama. \"With our app, you have a personal AI that is your model,\" Crapis added. \"You own the weights, and it's completely private, with privacy-preserving fine-tuning.\"\n \nYou can sign up for early access to the PIN AI app here.","contentLength":2669,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Court filings show Meta paused efforts to license books for AI training","url":"https://techcrunch.com/2025/02/14/court-filings-show-meta-paused-efforts-to-license-books-for-ai-training/","date":1739576133,"author":"Kyle Wiggers","guid":284,"unread":true,"content":"<p>New court filings in an AI copyright case against Meta add credence to earlier reports that the company “paused” discussions with book publishers on licensing deals to supply some of its generative AI models with training data. The filings are related to the case&nbsp;Kadrey v. Meta Platforms — one of many such cases winding through […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":405,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI Alexa and AI Siri face bugs and delays","url":"https://techcrunch.com/2025/02/14/ai-alexa-and-ai-siri-face-bugs-and-delays/","date":1739575487,"author":"Maxwell Zeff","guid":283,"unread":true,"content":"<p>Amazon and Apple are struggling to put generative AI technology in their digital assistants — Alexa and Siri, respectively — according to a pair of reports that came out on Friday. Amazon hoped to release its new Alexa during an event in New York on February 26. Now Amazon plans to delay the release of […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":376,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Netflix Accidentally Made Its Content Show Up In the Apple TV App","url":"https://apple.slashdot.org/story/25/02/14/2213202/netflix-accidentally-made-its-content-show-up-in-the-apple-tv-app?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1739575200,"author":"BeauHD","guid":217,"unread":true,"content":"Netflix content briefly appeared in the Apple TV app due to an unintentional glitch, sparking excitement among users before the company swiftly rolled back the integration. Engadget reports: A Netflix spokesperson told The Verge on Friday that the Apple TV app integration was an error that has been rolled back. Indeed, Redditors who had been tracking the forbidden fruit with unbridled glee confirmed that all signs of Netflix content had since vanished from Apple's streaming hub. Netflix giveth, and Netflix taketh away.\n \nWhile the boo-boo was still active, PC World reported it let you add Netflix originals like Stranger Things, Cobra Kai and The Crown but lacked licensed shows and movies. Even the available content was a buggy mess. For example, only season five of The Crown was available, leaving you to wonder what hijinks Liz and the gang had gotten into before or after the grunge era. The \"Add to Watchlist\" and \"Continue Watching\" features were also said to be spotty.","contentLength":985,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Pull Request Testing on Kubernetes: How to Test Locally and on GitHub Workflows","url":"https://hackernoon.com/pull-request-testing-on-kubernetes-how-to-test-locally-and-on-github-workflows?source=rss","date":1739574357,"author":"Nicolas Fränkel","guid":347,"unread":true,"content":"<p>Imagine an organization with the following practices:</p><ul><li>Runs its CI/CD pipelines with GitHub Actions</li><li>Runs its production workload on Kubernetes</li></ul><p>\\\nA new engineer manager arrives and asks for the following:</p><blockquote><p>On every PR, run integration tests in a Kubernetes cluster similar to the production one.</p></blockquote><p>\\\nIn this series of posts, I'll show how you can do it. My plan is the following:</p><ul><li>This blog post focuses on the app, the basic GitHub workflow setup, and testing both locally and during the workflow run.</li><li>The second blog post will detail the setup of a Google Kubernetes Engine instance and how to adapt the workflow to use it.</li></ul><h2>Unit Testing vs. Integration Testing</h2><blockquote><p>Integration Testing is a strategy to test the collaboration of at least two components.</p></blockquote><p>\\\nI translated it in Object-Oriented Programming as:</p><blockquote><p>Integration Testing is a strategy to test the collaboration of at least two classes.</p></blockquote><blockquote><p>Let’s consider the making of a car. Single-class testing is akin to testing each nut and bolt separately. Imagine testing of such components brought no issue to light. Still, it would be very risky to mass manufacture the car without having built a prototype and sent it to a test drive.</p></blockquote><p>\\\nHowever, technology has evolved since that time.</p><p>I use the word \"technology\" very generally, but I have <a href=\"https://testcontainers.com/\">Testcontainers</a> in mind:</p><blockquote><p><em>Unit tests with real dependencies</em></p><p>\\\n  Testcontainers is an open source library for providing throwaway, lightweight instances of databases, message brokers, web browsers, or just about anything that can run in a Docker container.</p></blockquote><p>\\\nIn effect, Testcontainers replaces  with \"real\" dependencies-containerized. It's a real game-changer: instead of painfully writing mocking code to stub dependencies just set them up regularly.</p><p>\\\nFor example, without Testcontainers, you'd need to provide mocks for your  in tests; with it, you only need to start a database container, and off you go.</p><p>\\\nAt the time, the cost of having a local Docker daemon in your testing environment offset many benefits. It's not the case anymore, as Docker daemons are available (nearly) everywhere.</p><p>\\\nMy definition of Integration Testing has changed a bit:</p><blockquote><p>Integration Testing is testing that requires significant setup.</p></blockquote><p>\\\nThe definition is vague on purpose, as significance has a different meaning depending on the organization, the team, and the individual. Note that Google defines two categories of tests: fast and slow. Their definition is equally vague, meant to adapt to different contexts.</p><p>In any case, the golden rule still applies: the closer you are to the final environment, the more risks you cover, and the more valuable your tests are. </p><p>\\\nIf our target production environment is Kubernetes, we will reap the most benefits from running the app on Kubernetes and testing it as a black box. It doesn't mean that white box testing in a more distant environment is not beneficial; it means that the more significant the gap between the testing environment and the target environment, the fewer issues we will uncover.</p><p>\\\nFor the purposes of this blog post, we will use GitHub as the base testing environment for unit testing and a full-fledged Kubernetes cluster for integration testing. There is no absolute truth regarding what is the best practice™, as contexts vary widely across organizations and even across teams within the same organization. It's up to every engineer to decide within their specific context the ROI of setting up such an environment because the closer you are to production, the more complex and, thus, expensive it will be.</p><h2>Use-case: Application With Database</h2><p>Let's jump into how to test an app that uses a database to store its data. I don't want anything fancy, just solid, standard engineering practices. I'll be using a CRUD(Create Read Update Delete) JVM-based app, but most of the following can easily apply to other stacks as well. The following blog posts will involve less language-specific content.</p><ul><li>Kotlin, because I love the language</li><li>Spring Boot: it's the most widespread framework for JVM-based applications</li><li>Maven-there's nothing else</li><li>Project Reactor and coroutines, because it makes things more interesting</li><li>PostgreSQL-at the moment, it's a very popular database, and it's well-supported by Spring</li></ul><p>\\\nIf you don't know Flyway, it allows you to track database schemas and data in a code repository and manage changes, known as migrations, between versions. Each migration has a unique version, , v1.0, v1.1, v2.1.2, etc. Flyway tries to apply migration in order. If it has already applied a migration, it skips it. Flyway stores its data in a dedicated table to track the applied migrations.</p><p>\\\nThis approach is a must-have; <a href=\"https://www.liquibase.com/\">Liquibase</a> is an alternative that follows the same principles.</p><p>\\\nSpring Boot fully integrates Flyway and Liquibase. When the app starts, the framework will kickstart them. If a pod is killed and restarted, Flyway will first check the migrations table to apply only the one that didn't run previously.</p><p>\\\nI don't want to bore you with the app details; you can find the code on <a href=\"https://github.com/ajavageek/vcluster-pipeline\">GitHub</a>.</p><p>Per my definition above, unit testing should be easy to set up. With Testcontainers, it is.</p><p>\\\nThe testing code counts the number of items in a table, inserts a new item, and counts the number of items again. It then checks that:</p><ul><li>There's one additional item compared to the initial count</li><li>That the new item is the one we inserted</li></ul><pre><code>@SpringBootTest                                                              //1\nclass VClusterPipelineTest @Autowired constructor(private val repository: ProductRepository) { //2\n\n    @Test\n    fun `When inserting a new Product, there should be one more Product in the database and the last inserted Product should be the one inserted`() { //3\n        runBlocking {                                                        //4\n            val initialCount = repository.count()                            //5\n            // The rest of the test\n        }\n    }\n}\n</code></pre><ol><li>Initialize the Spring context</li><li>Praise Kotlin for allowing for descriptive function names</li><li>Run non-blocking code in a blocking function</li></ol><p>\\\nWe now need a PostgreSQL database; Testcontainers can provide one for us. However, to avoid conflicts, it will choose a random port until it finds an unused one. We need it to connect to the database, run the Flyway migration, and run the testing code.</p><p>\\\nFor this reason, we must write a bit of additional code:</p><pre><code>@Profile(\"local\")                                                              //1\nclass TestContainerConfig {\n\n    companion object {\n        val name = \"test\"\n        val userName = \"test\"\n        val pass = \"test\"\n        val postgres = PostgreSQLContainer&lt;Nothing&gt;(\"postgres:17.2\").apply {   //1\n            withDatabaseName(name)\n            withUsername(userName)\n            withPassword(pass)\n            start()\n        }\n    }\n}\n\nclass TestContainerInitializer : ApplicationContextInitializer&lt;ConfigurableApplicationContext&gt; {\n    override fun initialize(applicationContext: ConfigurableApplicationContext) {\n        if (applicationContext.environment.activeProfiles.contains(\"local\")) {\n            TestPropertyValues.of(                                             //2\n                \"spring.r2dbc.url=r2dbc:postgresql://${TestContainerConfig.postgres.host}:${TestContainerConfig.postgres.firstMappedPort}/$name\",\n                \"spring.r2dbc.username=$name\",\n                \"spring.r2dbc.password=$pass\",\n                \"spring.flyway.url=jdbc:postgresql://${TestContainerConfig.postgres.host}:${TestContainerConfig.postgres.firstMappedPort}/$name\",\n                \"spring.flyway.user=$name\",\n                \"spring.flyway.password=$pass\"\n            ).applyTo(applicationContext.environment)\n        }\n    }\n}\n</code></pre><ol><li><p>Start the container, but only if the Spring Boot profile  is active.</p></li><li><p>Override the configuration values.</p></li></ol><p>\\\nWe need to specify neither the  nor the  if we hacked the  to reuse the R2BC parameters of the same name:</p><pre><code>spring:\n  application:\n    name: vcluster-pipeline\n  r2dbc:\n    username: test\n    password: test\n    url: r2dbc:postgresql://localhost:8082/flyway-test-db\n  flyway:\n    user: ${SPRING_R2DBC_USERNAME}                                             #1\n    password: ${SPRING_R2DBC_PASSWORD}                                         #1\n    url: jdbc:postgresql://localhost:8082/flyway-test-db\n</code></pre><ol><li>Smart hack to DRY configuration further down.</li></ol><p>\\\nWe also annotate the previous test class to use the initializer:</p><pre><code>@SpringBootTest\n@ContextConfiguration(initializers = [TestContainerInitializer::class])\nclass VClusterPipelineTest @Autowired constructor(private val repository: ProductRepository) {\n\n    // No change\n}\n</code></pre><p>\\\nSpring Boot offers a couple of options to <a href=\"https://docs.spring.io/spring-boot/reference/features/external-config.html\">activate profiles</a>. For local development, we can use a simple JVM property, , <code>mvn test -Dspring.profiles.active=local</code>; in the CI pipeline, we will use environment variables instead.</p><p>I'll also use Flyway to create the database structure for integration testing. In the scope of this example, the System Under Test will be the entire app; hence, I'll test from the HTTP endpoints. It's end-to-end testing for APIs. The code will test the same behavior, albeit treating the System Under Test as a black box.</p><pre><code>class VClusterPipelineIT {\n\n    val logger = LoggerFactory.getLogger(this::class.java)\n\n    @Test\n    fun `When inserting a new Product, there should be one more Product in the database and the last inserted Product should be the one inserted`() {\n\n        val baseUrl = System.getenv(\"APP_BASE_URL\") ?: \"http://localhost:8080\" //1\n\n        logger.info(\"Using base URL: $baseUrl\")\n\n        val client = WebTestClient.bindToServer()                              //2\n            .baseUrl(baseUrl)\n            .build()\n\n        val initialResponse: EntityExchangeResult&lt;List&lt;Product?&gt;?&gt; = client.get() //3\n            .uri(\"/products\")\n            .exchange()\n            .expectStatus().isOk\n            .expectBodyList(Product::class.java)\n            .returnResult()\n\n        val initialCount = initialResponse.responseBody?.size?.toLong()        //4\n\n        val now = LocalDateTime.now()\n        val product = Product(\n            id = UUID.randomUUID(),\n            name = \"My awesome product\",\n            description = \"Really awesome product\",\n            price = 100.0,\n            createdAt = now\n        )\n\n        client.post()                                                          //5\n            .uri(\"/products\")\n            .bodyValue(product)\n            .exchange()\n            .expectStatus().isOk\n            .expectBody(Product::class.java)\n\n        client.get()                                                           //6\n            .uri(\"/products\")\n            .exchange()\n            .expectStatus().isOk\n            .expectBodyList(Product::class.java)\n            .hasSize((initialCount!! + 1).toInt())\n    }\n}\n</code></pre><ol><li>Get the deployed app URL.</li><li>Create a web client that uses the former.</li><li>Get the initial item list.</li><li>Get the size; we definitely should offer a count function if there are too many items.</li><li>Insert a new item and assert everything works out fine.</li><li>Get the list of items and assert the item count is higher by one.</li></ol><p>\\\nBefore going further, let's run the tests in a GitHub workflow.</p><p>I'll assume you're familiar with <a href=\"https://docs.github.com/en/actions/writing-workflows\">GitHub workflows</a>. If you aren't, a GitHub workflow is a declarative description of an automated job. A job consists of several steps. GitHub offers several triggers: Manual, scheduled, or depending on an event.</p><p>\\\nWe want the workflow to run on each Pull Request to verify that tests run as expected.</p><pre><code>name: Test on PR                                                               #1\n\non:\n  pull_request:\n    branches: [ \"master\" ]                                                     #2\n</code></pre><ol><li><p>Trigger on a PR to the master branch.</p></li></ol><p>\\\nThe first steps are pretty standard:</p><pre><code>jobs:\n  build:\n    runs-on: ubuntu-latest\n    steps:\n      - name: Checkout repository\n        uses: actions/checkout@v4\n      - name: Install JRE\n        uses: actions/setup-java@v4\n        with:\n          distribution: temurin\n          java-version: 21\n          cache: maven                                                         #1\n</code></pre><ol><li>The  action includes a caching option for build tools. Here, it will cache dependencies across runs, speeding up consecutive runs. Unless you have good reasons not to, I recommend using this option.</li></ol><p>\\\nFor the same reason, we should cache our built artifacts. While researching for this post, I learned that GitHub discards them across runs <strong>and steps in the same run</strong>. Hence, we can speed up the runs by caching them explicitly:</p><pre><code>      - name: Cache build artifacts\n        uses: actions/cache@v4                                                 &lt;1&gt;\n        with:\n          path: target\n          key: ${{ runner.os }}-build-${{ github.sha }}                        &lt;2&gt;\n          restore-keys:\n            ${{ runner.os }}-build                                             &lt;3&gt;\n</code></pre><ol><li><p>Use the same action that  uses under the hood.</p></li><li><p>Compute the cache key. In our case, the  should be immutable, but this should be how you run matrices across different operating systems.</p></li><li><p>Reuse the cache if it's the same OS.</p></li></ol><pre><code>      - name: Run \"unit\" tests\n        run: ./mvnw -B test\n        env:\n          SPRING_PROFILES_ACTIVE: local                                        &lt;1&gt;\n</code></pre><ol><li>Activate the local profile. The workflow's environment provides a Docker daemon. Hence, Testcontainer successfully downloads and runs the database container.</li></ol><p>\\\nAt this point, we should run the integration test. Yet, we need the app deployed to run this test. For this, we need available infrastructure.</p><h2>Alternative \"Unit testing\" on GitHub</h2><p>The above works perfectly on GitHub, but we can move closer to the deployment setup by leveraging GitHub <a href=\"https://docs.github.com/en/actions/use-cases-and-examples/using-containerized-services/about-service-containers\">service containers</a>. Let's migrate PostgreSQL from Testcontainers to a GitHub service container.</p><p>\\\nRemoving Testcontainers is pretty straightforward: we do not activate the  profile.</p><p>\\\nUsing GitHub's service container requires an additional section in our workflow:</p><pre><code>jobs:\n  build:\n    runs-on: ubuntu-latest\n    env:\n      GH_PG_USER: testuser                                                     #1\n      GH_PG_PASSWORD: testpassword                                             #1\n      GH_PG_DB: testdb                                                         #1\n    services:\n      postgres:\n        image: postgres:15\n        options: &gt;-                                                            #2\n          --health-cmd \"pg_isready -U $POSTGRES_USER\"\n          --health-interval 10s\n          --health-timeout 5s\n          --health-retries 5\n        ports:\n            - 5432/tcp                                                         #3\n        env:\n          POSTGRES_USER: ${{ env.GH_PG_USER }}                                 #4\n          POSTGRES_PASSWORD: ${{ env.GH_PG_PASSWORD }}                         #4\n          POSTGRES_DB: ${{ env.GH_PG_DB }}                                     #4\n</code></pre><ol><li><p>Define environment variables at the job level to use them across steps. You can use secrets, but in this case, the database instance is not exposed outside the workflow and will be switched off when the latter finishes. Environment variables are good enough to avoid adding unnecessary secrets.</p></li><li><p>Make sure that PostgreSQL works before going further.</p></li><li><p>Assign a random port and map it to the underlying  port.</p></li><li><p>Use the environment variables.</p></li></ol><p>\\\nTo run the tests using the above configuration is straightforward.</p><pre><code>      - name: Run \"unit\" tests\n        run: ./mvnw -B test\n        env:\n          SPRING_FLYWAY_URL: jdbc:postgresql://localhost:${{ job.services.postgres.ports['5432'] }}/${{ env.GH_PG_DB }} #1\n          SPRING_R2DBC_URL: r2dbc:postgresql://localhost:${{ job.services.postgres.ports['5432'] }}/${{ env.GH_PG_DB }} #1\n          SPRING_R2DBC_USERNAME: ${{ env.GH_PG_USER }}\n          SPRING_R2DBC_PASSWORD: ${{ env.GH_PG_PASSWORD }}\n</code></pre><ol><li><p>GitHub runs PostgreSQL on a local Docker, so the host is . We can get the random port with the <code>${{ job.services.postgres.ports['5432'] }}</code> syntax.</p></li></ol><p>In this post, we laid the ground for a simple app's unit- and integration-testing, leveraging Testcontainers in the local environment. We then proceeded to automate unit testing via a GitHub workflow with the help of GitHub service containers. In the next post, we will prepare the Kubernetes environment on a Cloud provider infrastructure, build the image, and deploy it to the latter.</p><p>\\\nThe complete source code for this post can be found on <a href=\"https://github.com/ajavageek/vcluster-pipeline\">GitHub</a>.</p><p><em>Originally published on <a href=\"https://blog.frankel.ch/pr-testing-kubernetes/1/\">A Java Geek</a> on February 9th, 2025</em></p>","contentLength":16407,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Figure AI is in talks to raise $1.5B at 15x its last valuation","url":"https://techcrunch.com/2025/02/14/figure-ai-is-in-talks-to-raise-1-5b-at-15x-its-last-valuation/","date":1739573509,"author":"Charles Rollet","guid":282,"unread":true,"content":"<p>Robotics startup Figure AI is raising $1.5 billion at a $39.5 billion valuation, a whopping 15 times higher than before.</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":183,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Final Fantasy iOS Game Shuts Down Over Unfixable Bug","url":"https://it.slashdot.org/story/25/02/14/223226/final-fantasy-ios-game-shuts-down-over-unfixable-bug?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1739572800,"author":"BeauHD","guid":216,"unread":true,"content":"The Verge's Jay Peters reports: Square Enix has shut down the iOS version of Final Fantasy Crystal Chronicles and removed it from the App Store following an unfixable bug that blocked people from accessing content they had paid for. [...] The company says that if you made in-app purchases in January 2024 or later, you're eligible to request a refund by contacting Apple Support. Square Enix says that Final Fantasy Crystal Chronicles will continue to be supported on other platforms. The game is also available on Android, PlayStation, and Nintendo Switch. \"The issue is due to changes made to the in-app purchases model,\" Square Enix says in a post. \"Further investigation revealed that we are unable to completely fix the bug and implement the new changes, making it unlikely to resume service for the game.\" Square Enix says it started receiving reports on January 24th about the issue, which \"extends to the full paid version of the game.\"","contentLength":945,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"SailPoint’s dull debut did little to loosen the stuck IPO window, expert says","url":"https://techcrunch.com/2025/02/14/sailpoints-dull-debut-did-little-to-loosen-the-stuck-ipo-window-expert-says/","date":1739570453,"author":"Julie Bort","guid":281,"unread":true,"content":"<p>SailPoint’s IPO on Thursday was a disappointment for anyone hoping it would indicate that tech IPOs are hot again. The first day’s trading ended below the $23 initial price. The stock fared a tad better Friday, closing at over $24. But that’s nothing close to the big bang companies and VCs hope for. For instance, […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":389,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"OpenAI Eases Content Restrictions For ChatGPT With New 'Grown-Up Mode'","url":"https://slashdot.org/story/25/02/14/2156202/openai-eases-content-restrictions-for-chatgpt-with-new-grown-up-mode?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1739570400,"author":"BeauHD","guid":215,"unread":true,"content":"An anonymous reader quotes a report from Ars Technica: On Wednesday, OpenAI published the latest version of its \"Model Spec,\" a set of guidelines detailing how ChatGPT should behave and respond to user requests. The document reveals a notable shift in OpenAI's content policies, particularly around \"sensitive\" content like erotica and gore -- allowing this type of content to be generated without warnings in \"appropriate contexts.\" The change in policy has been in the works since May 2024, when the original Model Spec document first mentioned that OpenAI was exploring \"whether we can responsibly provide the ability to generate NSFW content in age-appropriate contexts through the API and ChatGPT.\"\n \nChatGPT's guidelines now state that that \"erotica or gore\" may now be generated, but only under specific circumstances. \"The assistant should not generate erotica, depictions of illegal or non-consensual sexual activities, or extreme gore, except in scientific, historical, news, creative or other contexts where sensitive content is appropriate,\" OpenAI writes. \"This includes depictions in text, audio (e.g., erotic or violent visceral noises), or visual content.\" So far, experimentation from Reddit users has shown that ChatGPT's content filters have indeed been relaxed, with some managing to generate explicit sexual or violent scenarios without accompanying content warnings. OpenAI notes that its Usage Policies still apply, which prohibit building AI tools for minors that include sexual content.","contentLength":1511,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"OpenAI says its board of directors ‘unanimously’ rejects Elon Musk’s bid","url":"https://techcrunch.com/2025/02/14/openai-says-its-board-of-directors-unanimously-rejects-musks-bid/","date":1739569507,"author":"Kyle Wiggers","guid":280,"unread":true,"content":"<p>OpenAI’s board of directors has “unanimously” rejected billionaire Elon Musk’s offer to buy the nonprofit that effectively governs OpenAI, the company said on Friday. In a statement shared via OpenAI’s press account on X, Bret Taylor, board chair, called Musk’s bid “an attempt to disrupt his competition.” “OpenAI is not for sale, and the board […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":432,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Bluesky gets growth and analytics tools with BlueSkyHunter launch","url":"https://techcrunch.com/2025/02/14/bluesky-gets-growth-and-analytics-tools-with-blueskyhunter-launch/","date":1739569355,"author":"Sarah Perez","guid":279,"unread":true,"content":"<p>A new startup is addressing the need for an all-in-one toolset built for people who want to grow, manage, and track their Bluesky presence and following. The subscription service BlueSkyHunter, which launched Friday, introduces an online dashboard that combines access to analytics and other tools to schedule posts and automate DMs (direct messages), alongside other […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":436,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Global electricity demand expected to grow 4% annually through 2027","url":"https://techcrunch.com/2025/02/14/global-electricity-demand-expected-to-grow-4-annually-through-2027/","date":1739569205,"author":"Tim De Chant","guid":278,"unread":true,"content":"<p>Meeting that demand will require adding more generating capacity than all of Japan —&nbsp;every year.&nbsp;</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":164,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How this weekend’s ‘Tesla Takeover’ protests against Elon Musk came together on Bluesky","url":"https://techcrunch.com/2025/02/14/how-this-weekends-tesla-takeover-protests-against-elon-musk-came-together-on-bluesky/","date":1739568849,"author":"Sean O'Kane","guid":277,"unread":true,"content":"<p>As Elon Musk and his acolytes rip through the federal government looking for agencies to throw into the “wood chipper,” a grassroots effort to hit the world’s richest man where it hurts is picking up steam. The courts are busy contesting the actions of Musk’s Department of Government Efficiency, but the judicial system is slow […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":405,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Meta To Build World's Longest Undersea Cable","url":"https://tech.slashdot.org/story/25/02/14/1852233/meta-to-build-worlds-longest-undersea-cable?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1739568120,"author":"msmash","guid":214,"unread":true,"content":"Meta unveiled on Friday Project Waterworth, a 50,000-kilometer subsea cable network that will be the world's longest such system. The multi-billion dollar project will connect the U.S., Brazil, India, South Africa, and other key regions. The system utilizes 24 fiber pairs and introduces what Meta describes as \"first-of-its-kind routing\" that maximizes cable placement in deep water at depths up to 7,000 meters. \n\nThe company developed new burial techniques for high-risk areas near coasts to protect against ship anchors and other hazards. A joint statement from President Trump and Prime Minister Modi confirmed India's role in maintaining and financing portions of the undersea cables in the Indian Ocean using \"trusted vendors.\" According to telecom analysts Telegeography, Meta currently has ownership stakes in 16 subsea networks, including the 2Africa cable system that encircles the African continent. This new project would be Meta's first wholly owned global cable system.","contentLength":984,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"What is device code phishing, and why are Russian spies so successful at it?","url":"https://arstechnica.com/information-technology/2025/02/russian-spies-use-device-code-phishing-to-hijack-microsoft-accounts/","date":1739567771,"author":"Dan Goodin","guid":315,"unread":true,"content":"<p>Researchers have uncovered a sustained and ongoing campaign by Russian spies that uses a clever phishing technique to hijack Microsoft 365 accounts belonging to a wide range of targets, researchers warned.</p><p>The technique is known as device code phishing. It exploits “device code flow,” a form of authentication formalized in the industry-wide <a href=\"https://tools.ietf.org/html/draft-ietf-oauth-device-flow-07#section-3.4\">OAuth standard</a>. Authentication through device code flow is designed for logging printers, smart TVs, and similar devices into accounts. These devices typically don’t support browsers, making it difficult to sign in using more standard forms of authentication, such as entering user names, passwords, and two-factor mechanisms.</p><p>Rather than authenticating the user directly, the input-constrained device displays an alphabetic or alphanumeric device code along with a link associated with the user account. The user opens the link on a computer or other device that’s easier to sign in with and enters the code. The remote server then sends a token to the input-constrained device that logs it into the account.</p>","contentLength":1058,"flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2022/03/phishing.jpeg","enclosureMime":"","commentsUrl":null},{"title":"DeepSeek founder Liang Wenfeng is reportedly set to meet with China’s Xi Jinping","url":"https://techcrunch.com/2025/02/14/deepseek-founder-liang-wenfeng-is-reportedly-set-to-meet-with-chinas-xi-jinping/","date":1739565917,"author":"Kyle Wiggers","guid":276,"unread":true,"content":"<p>Chinese AI startup DeepSeek founder Liang Wenfeng is reportedly set to meet with China’s top politicians, including Chinese leader Xi Jinping, during a summit that Alibaba founder Jack Ma is also expected to attend. The summit, which could happen as soon as next week, may be intended as a signal by China’s Communist Party that […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":401,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Whole World Is Going To Use a Lot More Electricity, IEA Says","url":"https://hardware.slashdot.org/story/25/02/14/1742226/the-whole-world-is-going-to-use-a-lot-more-electricity-iea-says?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1739565720,"author":"msmash","guid":213,"unread":true,"content":"Electricity demand is set to increase sharply in the coming years as people around the world use more power to run air conditioners, industry and a growing fleet of data centers. From a report: Over the next three years, global electricity consumption is set to rise by an \"unprecedented\" 3,500 terawatt hours, according to a report by the International Energy Agency. That's an addition each year of more than Japan's annual electricity consumption. \n\nThe roughly 4% annual growth in that period is the fastest such rate in years, underscoring the growing importance of electricity to the world's overall energy needs. \"The acceleration of global electricity demand highlights the significant changes taking place in energy systems around the world and the approach of a new Age of Electricity,\" Keisuke Sadamori, IEA's director of energy markets and security, said in a statement. \"But it also presents evolving challenges for governments in ensuring secure, affordable and sustainable electricity supply.\"","contentLength":1008,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Why PAUL Needs a Massive Dataset to Improve Its Movements","url":"https://hackernoon.com/why-paul-needs-a-massive-dataset-to-improve-its-movements?source=rss","date":1739565002,"author":"EScholar: Electronic Academic Papers for Scholars","guid":346,"unread":true,"content":"<p>(1) Jorge Francisco Garcia-Samartın, Centro de Automatica y Robotica (UPM-CSIC), Universidad Politecnica de Madrid — Consejo Superior de Investigaciones Cientıficas, Jose Gutierrez Abascal 2, 28006 Madrid, Spain (jorge.gsamartin@upm.es);</p><p>(2) Adrian Rieker, Centro de Automatica y Robotica (UPM-CSIC), Universidad Politecnica de Madrid — Consejo Superior de Investigaciones Cientıficas, Jose Gutierrez Abascal 2, 28006 Madrid, Spain;</p><p>(3) Antonio Barrientos, Centro de Automatica y Robotica (UPM-CSIC), Universidad Politecnica de Madrid — Consejo Superior de Investigaciones Cientıficas, Jose Gutierrez Abascal 2, 28006 Madrid, Spain.</p><p>3 PAUL: Design and Manufacturing</p><p>4 Data Acquisition and Open-Loop Control</p><h2>4.3 Dataset Generation: Table-Based Models</h2><p>Due to the complexity of the robot, model-based methodologies, such as PCC or the ones based on Cosserat Rod Theory were discarded. Although the usage of FEM is an avenue that will not be closed in future work, the large number of parameters to be set experimentally for each segment (Young’s modulus, moment of inertia. . . ), given that the manufacturing process is so variable meant that, in this first phase, we opted to use some type of PAUL modelling based on data collection.</p><p>\\\nThe output of the system is taken as the position and orientation reached by the final end –thus, at this stage, all the positions of the intermediate segments are ignored– and as input, the inflation times of each of the bladders. As there were not enough pressure sensors available at the time of the construction of the robot, it was decided to take inflation time as an input variable. As the working pressure is limited by the pressure limiting valve and the flow rate into each bladder can be assumed to be constant, the time is equivalent to the volume of air introduced into each cavity.</p><p>\\\nAll the control options considered have in common the need for a large amount of empirical data, which leads to the need to develop an experimental design to systematise the collection of this data. Since the capture of this information is done in different phases and the datasets have to represent the behaviour of the robot in an objective way, the re-applicability of the experiment takes on special importance.</p><p>\\\nThe data stored in the datasets was the position of the robot tip and the set of inflation times that achieve this configuration. The aforementioned limitation that only two of the three bladders in the segment are inflated reduces redundancies. As previously stated, more than two segments lead to redundancies, which implies that the inverse kinematic model of the robot can have multiple solutions.</p><p>\\\nThe data collection process involves several sequential steps. Initially, a set number of samples is determined. For each sample, Matlab commands dispatch a random combination of nine inflation times, corresponding to each valve of PAUL, to the actuation bench. Times are generated below a maximum time limit Tmax, and ensuring that only two cavities per segment are inflated. Following this, the robot’s bladders are inflated based on the sent times. Subsequently, the vision system’s two cameras capture images to determine the position and orientation of the robot’s end. This entire procedure is repeated for the specified number of iterations, and upon completion, the collected data is stored in the dataset</p><p>\\\nThe information on swelling times is stored as a percentage, with a value of 0 corresponding to a zero swelling of that segment and 100 corresponding to Tmax, the swelling for the maximum number of milliseconds defined for this data collection session. This value Tmax is stored, together with the values, in the dataset, in order to be able to compare different datasets. The reason for this coding comes from the lack of information, a priori, on what is the maximum pressure that a PAUL bladder admits. Although it is true that it was experimentally determined that inflation times of more than 1500 ms in a row led to punctures, the application of lower times during a repeated number of cycles also generated leaks. On this basis, it was decided never to inflate any valve, either in one or several steps, more than 1000 ms.</p><p>\\\nAlong with the inflation times of each bladder, the position and orientation reached by the end tip is stored, based on the camera readings. In particular, the position of the green marker and the orientation of the trihedron are stored. The latter is expressed in Euler angles, as it is a much efficient form of storage than a rotation matrix. In addition, the dataset also contains metadata from the collection process that are believed to influence the results, such as the pneumatic line pressure or the ambient temperature.</p><p>\\\nSome aspects in the pneumatic system merit attention. Initially, bladder inflation and deflation are not symmetrical processes. Geometric constraints in the pneumatic components result in a lower deflation rate compared to inflation. Consequently, when the PAUL receives a deflation time, it multiplies it by an empirically derived factor, approximately 1.45 for a 1.2 bar working pressure. This multiplier compensates for the discrepancy between inflation and deflation times of a singular group of bladders, ensuring that the deflation time aligns with the time required to reach the same inflation point.</p><p>\\\nSimilarly, although it is physically possible to inflate several valves at the same time, it has been shown that this parallel flow distribution means that the effective fillings of each valve are not the same as if they were inflated individually. To prevent this phenomenon, it was decided to inflate each bladder individually both during the data acquisition process and utterly, when PAUL was asked to reach certain positions.</p><p>\\\nFinally, there are hysteresis phenomena in the silicone that cause the position reached by inflating for a time t to be different from the position reached by inflating first for a time t1 and then for a time t2 = t − t1. The strategy employed to tackle this problem was to capture the dataset bringing PAUL back to its zero position between each sample. Nevertheless, when controlling the robot in open-loop this is not possible, or, at least, not desirable, as one may wish to follow trajectories or travel through a sequence of points. Therefore, transitioning from position x1 to x2 requires an additional factor of 1.2, also derived experimentally, to account for hysteresis effects.</p><p>Once the dataset is generated, it can be used to model the behaviour of PAUL for open-loop control. It is foreseen, as a future line, to train a neural network for the direct kinematics and another one for the inverse kinematics. However, given the large amount of data that may be required (in [62] 24389 samples are used for a three-segment robot like this one), a table look-up method has been used for this work.</p><p>\\\nThe method for direct kinematics –which allows obtaining the position and orientation of the final end of the robot from the inflation times of the nine bladders– consists of searching, in the generated dataset in the previous step, the three inflation time values located at a shorter distance from the inflation time given as a reference. Obviously, if the set of inflation times sought were in the table, the value associated with these times would be returned as a result of the direct kinematic model. Otherwise, the average of the position and orientation values associated with the three closest inflation times, weighted by the distance (Euclidean norm) existing between each of them and the values of reference inflation times, is returned as the position and orientation value of the robot.</p><p>\\\n\\\nwith them, it is possible to calculate the position returned by the direct kinematic model using the expression:</p>","contentLength":7812,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"NATO backs its first cohort of European dual-use startups","url":"https://techcrunch.com/2025/02/14/nato-backs-its-first-cohort-of-european-dual-use-startups/","date":1739564172,"author":"Mike Butcher","guid":275,"unread":true,"content":"<p>With both Vice President J.D. Vance and U.S. Defense Secretary Pete Hegseth making loud noises Friday about Europe stepping up to the plate in spending more on its own defense, it might come as a surprise that Europe is already on the path toward far greater investment in defense, especially in tech. Not only has […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":383,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How PAUL the Robot Tracks Its Own Movements Using Cameras and LEDs","url":"https://hackernoon.com/how-paul-the-robot-tracks-its-own-movements-using-cameras-and-leds?source=rss","date":1739564107,"author":"EScholar: Electronic Academic Papers for Scholars","guid":345,"unread":true,"content":"<p>(1) Jorge Francisco Garcia-Samartın, Centro de Automatica y Robotica (UPM-CSIC), Universidad Politecnica de Madrid — Consejo Superior de Investigaciones Cientıficas, Jose Gutierrez Abascal 2, 28006 Madrid, Spain (jorge.gsamartin@upm.es);</p><p>(2) Adrian Rieker, Centro de Automatica y Robotica (UPM-CSIC), Universidad Politecnica de Madrid — Consejo Superior de Investigaciones Cientıficas, Jose Gutierrez Abascal 2, 28006 Madrid, Spain;</p><p>(3) Antonio Barrientos, Centro de Automatica y Robotica (UPM-CSIC), Universidad Politecnica de Madrid — Consejo Superior de Investigaciones Cientıficas, Jose Gutierrez Abascal 2, 28006 Madrid, Spain.</p><p>3 PAUL: Design and Manufacturing</p><p>4 Data Acquisition and Open-Loop Control</p><h2>4 Data Acquisition and Open-Loop Control</h2><p>In order to provide the manipulator with a solid and stable fastening system, which would also allow reliable and predictable data capture of the positions and orientations of its end, the metal structure shown in Figure 10 was built. It is a cube made of steel profiles with methacrylate sheets on the walls. The pneumatic bench, the power supply and the microcontroller were placed on top of the structure.</p><p>\\\nThe aim of the data acquisition system is to be able to measure, whenever required, the position and orientation of the end of the robot in order to be able to relate it to the inflation times of each bladder and thus be able to create an open-loop model of PAUL. For this purpose, three elements are available: the cameras, the calibration grid and the trihedron.</p><p>\\\nTwo Spedal AF926H USB cameras with 1920 x 1080 px, 80◦ field of view and a frequency of 60 fps are used to capture the images. These have been placed on two tripods external to the robot’s structure. They are calibrated with a checkerboard of 11 x 8 squares of 20 mm each, which can be seen in Figure 11a.</p><p>\\\nThe vision beacon, on the other hand, has the task of being recognised in space to determine the position and orientation of the mobile system with respect to the fixed system. The trihedron, displayed in Figure 11b, consists of three spheres, manufactured by 3D printing in PLA, inside which three LED diodes have been embedded. Thanks to these, it is possible to vary the luminosity of the spheres by means of software, keeping the system functioning correctly when the workplace or the environmental or lighting conditions vary.</p><p>\\\nThe existence of the central rod, which moves the luminous spheres away from the base of the robot end, makes possible the spheres to be visible to the cameras in all the poses that the robot can adopt. If the spheres were otherwise directly attached to the</p><p>\\\nend of the robot, there would be numerous poses in which it would not be possible to determine the position, as the spheres would be hidden by the robot itself.</p><h3>4.2 Vision Capture System</h3><p>\\\n\\\nBecause coordinates of the real world are independent of the camera, if Equation (1) is applied for both cameras and rk vector cleared in the two equations, it can be said that:</p><p>\\\n\\\nSystem of equations (2) can be solved using the Least Squares Method:</p><p>\\\n\\\nand then use the Rodrigues’ rotation formula to obtain it, respect to the real world base in the form of a rotation matrix:</p><p>\\\n\\\nand I denotes the identity matrix of size 3.</p>","contentLength":3247,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Western Digital Aims For 100TB Hard Drives by 2030","url":"https://hardware.slashdot.org/story/25/02/14/1817233/western-digital-aims-for-100tb-hard-drives-by-2030?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1739563260,"author":"msmash","guid":212,"unread":true,"content":"Western Digital plans to introduce its first heat-assisted magnetic recording (HAMR) drives in late 2026, with 36TB conventional magnetic recording (CMR) and 44TB shingled UltraSMR variants. Volume production won't begin until the first half of 2027, following qualification by cloud data center providers in late 2026. \n\nThe company projects that HAMR technology, combined with OptiNAND, increased platter count, and mechanical improvements, will enable drives reaching 80TB CMR and 100TB UltraSMR capacities around 2030 -- a departure from Western Digital's previous commitment to microwave-assisted magnetic recording (MAMR) in 2017, which evolved into the energy-assisted perpendicular magnetic recording (ePMR) technology used in current drives.","contentLength":750,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Elon Musk’s AI company, xAI, said to be in talks to raise $10B","url":"https://techcrunch.com/2025/02/14/elon-musks-ai-company-xai-said-to-be-in-talks-to-raise-10b/","date":1739562841,"author":"Kyle Wiggers","guid":274,"unread":true,"content":"<p>Elon Musk’s AI company, xAI, is said to be in talks to raise $10 billion in a round that would value xAI at $75 billion. Bloomberg reported Friday that xAI is canvassing existing investors, including Sequoia Capital, Andreessen Horowitz, and Valor Equity Partners for the round, which would bring xAI’s total raised to $22.4 billion, […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":406,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Hedge Fund Startup That Replaced Analysts With AI Beats the Market","url":"https://slashdot.org/story/25/02/14/187221/hedge-fund-startup-that-replaced-analysts-with-ai-beats-the-market?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1739560920,"author":"msmash","guid":211,"unread":true,"content":"A hedge fund startup that uses AI to do work typically handled by analysts has outperformed the global stock market in its first six months while slashing research costs. From a report: The Sydney-based firm, Minotaur Capital, was founded by Armina Rosenberg and Thomas Rice. Rosenberg previously managed a global equities portfolio for tech billionaire Mike Cannon-Brookes and ran Australian small-company research for JPMorgan Chase &amp; Co. when she was 25. Rice is a former portfolio manager at Perpetual. The duo's bets on global stocks returned 13.7% in the six months ending January, versus 6.7% for the MSCI All-Country World Index. Minotaur has no analysts on staff, with Rosenberg saying AI models are far quicker and cheaper. \n\n\"We're looking at about half the price\" in terms of cost of AI versus a junior analyst salary, Rosenberg, 37, said of the firm's program. Minotaur is among a growing number of hedge funds experimenting with ways to improve returns and cut expenses with AI as the technology becomes increasingly sophisticated. Still, the jury is still out on the ability of AI-driven models to deliver superior returns over the long run.","contentLength":1156,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Meta’s next big bet may be humanoid robotics","url":"https://techcrunch.com/2025/02/14/metas-next-big-bet-may-be-humanoid-robotics/","date":1739560571,"author":"Kyle Wiggers","guid":273,"unread":true,"content":"<p>Meta is forming a new team within its Reality Labs hardware division to build robots that can assist with physical tasks, Bloomberg reported. The team will be responsible for developing humanoid robotics hardware, potentially including hardware that can perform household chores. Meta’s new robotics group, which will be led by Marc Whitten, driverless car startup […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":435,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How PAUL, a Soft Robot, is Designed and Built","url":"https://hackernoon.com/how-paul-a-soft-robot-is-designed-and-built?source=rss","date":1739559606,"author":"EScholar: Electronic Academic Papers for Scholars","guid":344,"unread":true,"content":"<p>(1) Jorge Francisco Garcia-Samartın, Centro de Automatica y Robotica (UPM-CSIC), Universidad Politecnica de Madrid — Consejo Superior de Investigaciones Cientıficas, Jose Gutierrez Abascal 2, 28006 Madrid, Spain (jorge.gsamartin@upm.es);</p><p>(2) Adrian Rieker, Centro de Automatica y Robotica (UPM-CSIC), Universidad Politecnica de Madrid — Consejo Superior de Investigaciones Cientıficas, Jose Gutierrez Abascal 2, 28006 Madrid, Spain;</p><p>(3) Antonio Barrientos, Centro de Automatica y Robotica (UPM-CSIC), Universidad Politecnica de Madrid — Consejo Superior de Investigaciones Cientıficas, Jose Gutierrez Abascal 2, 28006 Madrid, Spain.</p><p>3 PAUL: Design and Manufacturing</p><p>4 Data Acquisition and Open-Loop Control</p><p>The first step in the manufacturing process is to obtain the wax cores which, when inserted into the mould, are used to create the holes for what, in the finished segment, will be the bladders. These are made by pouring paraffin wax into previously made female moulds (Figure 5a).</p><p>\\\nAfter half an hour, the wax has solidified and the cores can be removed and inserted into the mould (Figure 5b). The mould consists of four 3D printed parts (two sides, a bottom cap and a top grip on which the cores rest) which are screwed together and then sealed with a hot silicone bead to prevent leakage during subsequent curing (Figure 5c).</p><p>\\\nThe silicone can then be poured into the mould, which must be filled to the top to counteract the aforementioned shrinkage. In particular, TinSil8015 requires a mass ratio of 10:1 liquid to catalyst. For the dimensions of the segment, about 175 g of total mixture are required.</p><p>\\\nThe curing process lasts 24 hours at ambient temperature (Figure 5d), after which it can be removed from the mould. It may be necessary to use a scalpel to remove the silicone burrs (Figure 5e).</p><p>\\\nOnce the segment has been built, the cores that have been used to create the bladders are removed. While the wood can be removed by pulling, it is necessary to apply heat to the segment to remove the wax. Thus, it is first placed in an oven at 110 ◦C (Figure 5f) and then immersed in a boiling water bath for 15 minutes, which ensures the elimination of the residual traces of wax (Figure 5g).</p><p>\\\nSince the males are through, it is required to close the lower part of the segment. To do this, a layer of silicone is poured onto the plate of Figure 5h, glued onto the segment and left to cure for 24 hours. Finally, the pneumatic tubes are joined to the segment, adhering them with cyanoacrylate and strengthening the tightness with the usage of plastic flanges (Figure 5i).</p><p>\\\nThe final result, a functional segment is depicted in Figure 6. Experimentally, it is found that its weight is 161 g and that, as designed, it has a height of 100 mm and an external diameter of 45 mm.</p><p>Within the robot, the function of the pneumatic bench is to control the flow of compressed air from the compressor according to the control signals. Specifically, the PAUL bench consists of 6 pairs of 2/2 valves (SMC VDW20BZ1D model) and 3/2 valves (SMC Y100 model) placed in series, which will therefore allow up to 12 degrees of freedom. Both are shown in Figure 7. The physical characteristics of the 2/2 valves limited the total pressure of the assembly to 4 bar, but to reduce the risk of segment leakage, it was reduced with a flow regulator to 2 bar. Figure 8 presents a schematic of the pneumatic circuit.</p><p>\\\n\\\nThe valves are operated via 24 V voltage signals. A MOSFET (model IRF540) is the switch in charge of managing them. Initially, the use of relays was considered, but the high current they would consume made their use unfeasible. An Arduino Due was chosen as the bench controller. A PC power supply, capable of supplying up to 8.5 A, is responsible for powering the unit, whose final layout is illustrated in Figure 9.</p>","contentLength":3825,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"No Startup Has Ever Failed Because it Didn’t Have a Blog","url":"https://hackernoon.com/no-startup-has-ever-failed-because-it-didnt-have-a-blog?source=rss","date":1739559603,"author":"susie liu","guid":343,"unread":true,"content":"<p>\\\nSomewhere along the way, startup marketing got hijacked by creator economy logic.</p><ul><li>“If I build an audience, I’ll have an easier time selling.” </li><li>“If I post valuable content, customers will come to me.” </li><li>“Content is how you earn trust.”</li></ul><blockquote><p>No startup has ever failed because it didn’t have a blog. Name one high-growth startup that failed because it didn’t have a content marketing strategy. </p><p>\\\n  . Because it’s never happened. </p></blockquote><p>\\\nStartups fail because: 1) They didn’t find product-market fit. 2) They spent money like fools. 3) A combo of shaky financials plus bad operations. <strong>Not because they skipped the “10 SaaS Growth Hacks” Medium post.</strong></p><h2><strong>The Case Against Content Marketing</strong></h2><p>\\\nContent isn’t just eating up your time—<strong><em>it’s going to eat your startup for lunch</em></strong>. You think you’re building something, but really, you’re just shuffling pixels around and calling it momentum. <strong>==You’ll die because you’re wasting your best thinking on being interesting instead of being necessary.==</strong></p><p>\\\nDon’t try to be a media company when you haven’t even figured out how to be a business.</p><h3><strong>You Ignore Your Most Powerful Asset: Your Product</strong></h3><p>\\\nThe best startups don’t need a perfect LinkedIn strategy. They need a product so good that people can’t shut up about it.</p><ul><li>Tesla didn’t become Tesla because Musk wrote aspirational posts. (Tesla happened, then people started dissecting every Elon tweet.) </li><li>Superhuman didn’t win because they ranked for “best email productivity tool”.</li><li>Notion didn’t explode because they had a “high-value” newsletter.</li></ul><p>\\\nThey each built something so good that content wasn’t necessary.</p><p>\\\n<strong>==But content marketing makes you spend more time talking about your product than making it actually worth talking about.==</strong> If you’re creating Canva graphics explaining why your product is amazing, ask yourself: <em>Why isn’t it obvious already?</em></p><h3><strong>You’re Playing To Your Weakness</strong></h3><p>\\\nIf you’re a tech founder, chances are your biggest strength isn’t crafting “valuable content.” But content marketing throws you into the most crowded, attention-starved battlefield on earth that’s populated by all the creative genius humanity has to offer: the Internet. </p><p>\\\nContent marketing pulls you away from your strengths. It forces you into a slow, bloated, competitive game where you’re fighting against seasoned creators and media companies—people whose  is content. <em>And you’re out here thinking you can compete?</em></p><p>\\\nWhile you’re wasting time learning how to be a copywriter, you’re neglecting the strengths that gave you the guts to build a company in the first place. </p><p>\\\n<strong>Content marketing is a wait-and-see game.</strong></p><ul></ul><p>Do this long enough, and <strong>you'll start convincing yourself that the reason you're not making progress is because you haven’t published enough</strong>. So, you rinse and repeat, cranking out more content—and waiting for something to happen. <strong><em>I promise you, nothing will</em></strong>. <strong>==Unless you’re a media company, the real problem won’t be solved through content volume==</strong>. Look at the Airbnb guys. They tackled crappy check-in rates by bringing their cameras into homes and taking better photos, not by blogging about the future of holiday stays. </p><p>\\\nFounders love content marketing because it’s <strong><em>a safe way to feel productive without doing the uncomfortable shit</em></strong>. Well, if you want to stay away from the uncomfortable, you should consider going back to your desk job. </p><h3><strong>You’re Sprinting For The Wrong Finish Line</strong></h3><p>\\\n==Content marketing subtly shifts the goalpost of what success looks like.== </p><ul><li>Instead of $$$ in the bank, founders start measuring social impressions. </li><li>Instead of customers using the product, they’re tracking newsletter signups. </li><li>Instead of winning market share, they’re focused on LinkedIn comments.</li></ul><p>\\\n Awareness and engagement doesn’t pay the bills. Real growth is customers in, cash in. If you don’t know the difference between attention and action, content marketing is eating your brain. <strong><em>Are you really growing, or have you just gotten more people to consume free content?</em></strong></p><h3><strong>You’re Killing Your Brand</strong></h3><p>\\\nWeird, right? You’d think viral content will help you build your brand. Nope, because going viral means you’ve got to jump on every buzzword, every new format, and every other trend because it’s what everyone’s talking about. Well, trends don’t care two cents about what your brand stands for. </p><p>\\\n<strong>Every time you chase a trend, you’re stretching your brand thin, trying to force it into a mold that doesn’t fit.</strong> You’re watering down your purpose for a quick hit, all while ignoring the fact that <strong>==<em>building a memorable brand means sticking to your guns, even if it’s what the algorithm despises.</em>==</strong></p><h2><strong>Inbound’s Still In. You Just Don’t Need Content To Do It.</strong></h2><blockquote><p>The content marketing trend is a byproduct of people misunderstanding HubSpot’s whole inbound marketing thing. </p><p>\\\n  Inbound was and still is genius, but inbound marketing was never about “just create content.” It was about <strong>==creating undeniable value before asking for the sale.==</strong> (That, and not relying on paid ads for awareness.) </p></blockquote><p>\\\nHubSpot made content work because information was scarce in 2006—they gave away what no one else would. Today, everyone’s got an “ultimate guide” to something. And if they don’t, GPT can make something up based on a prompt. The problem now isn’t lack of content. </p><p>\\\n<strong><em>Here’s how to do inbound marketing in the post-content age.</em></strong></p><h3><strong>1. Figure Out If Content Even Makes Sense for You</strong></h3><p>\\\nBefore you waste another hour on a blog post, ask yourself:</p><ul><li>Is my audience actively looking for information, but struggling to find it? </li><li>Is there a knowledge gap that makes them hesitate to buy? </li><li>Are my competitors hoarding insights instead of sharing them?</li></ul><p>\\\nIf the answer is yes, fine. Write. Publish. Own the space. If the answer is no, STOP. No one needs your “Top 10 Trends” list. <em>They have Google and chatbots for that.</em></p><p>\\\nKnow what’s better than teaching people how to do something? ***Making sure they never have to learn it in the first place. ***</p><p>\\\nYou can write another 1,500-word thesis. <strong>Or, you can build something—a tool, a feature, an experience—that solves the same problem but without needing people to read a bunch of text</strong>. Look at the content that’s dominating your space—the posts that get all the likes, shares, and comments. Then ask yourself: <strong><em>How can I make this educational BS obsolete?</em></strong></p><blockquote><p>Here’s a thought: Tell your audience exactly how much time and money you’re burning on content—and then tell them you’re ditching it to build something free that actually helps them. \"We were going to spend $20K this quarter on content, but instead, we’re using it to build a free AI-powered email draft generator for sales teams. Tell us what you need, and we’ll make it happen.\" </p></blockquote><p>\\\nPeople will talk about it. They’ll share it, they’ll use it, <strong><em>and they’ll remember the one who actually did something instead of just saying something.</em></strong></p><h3><strong>3. Content Isn’t The Only Thing That Gets Organic Attention</strong></h3><p>\\\nThe other principle of inbound marketing?  Yes, content generates organic awareness and conversation. So do a lot of other things. . This is a last resort because stunts could backfire (but for a startup, any PR is good PR), but at least you’re exercising your creative brain cells. </p><blockquote><p>If you have to force people to see your content, why not just skip the middle step and force them to see your product instead? </p></blockquote><p>\\\nStop badgering GPT for content ideas, and use that time to hijack attention—starting fights on X, sitting on the doorsteps of potential clients for weeks on end with a cardboard sign, <strong><em>anything that gets people talking about your company now, not in six months when Google decides to bless you with traffic.</em></strong></p><p>\\\n(Tip: When pulling a stunt, ==just make sure it barely costs you anything to execute.== That way you won’t hate yourself if you don’t get returns.) </p><h2><strong>Final Thoughts: Why Are You Marketing Like a Coward?</strong></h2><p>\\\nYou built something from nothing. You ignored the safe path, told the doubters to shove it, and bet on yourself. You made a move.</p><p>\\\n<strong>So where’d that nerve go?</strong></p><blockquote><p>The second it came time to market, you swapped instinct for “best practices.” </p><p>\\\n  ==Innovation doesn’t come from following rules, and attention won’t be earned through compliance.== </p><p>\\\n  It’s taken. It’s ripped out of the market’s hands by people willing to do what no one else is doing.</p></blockquote><h3>Treat marketing like you treat your product—or get used to being ignored.</h3>","contentLength":8455,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Dynamic Triple Buffering Merged For GNOME 48","url":"https://www.phoronix.com/news/GNOME-48-Triple-Buffering","date":1739558110,"author":"Michael Larabel","guid":703,"unread":true,"content":"<article>As quite a Valentine's Day treat, the long-in-development dynamic triple buffering support for GNOME's Mutter compositor was just merged ahead of next month's GNOME 48 desktop release!..</article>","contentLength":186,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Jay Xiao on the Power of Technology and Surety Through SuretyNow","url":"https://hackernoon.com/jay-xiao-on-the-power-of-technology-and-surety-through-suretynow?source=rss","date":1739557864,"author":"Jon Stojan Journalist","guid":342,"unread":true,"content":"<p>\\\n has always believed in the power of technology to improve people's lives. As a millennial, Xiao witnessed life before the internet as we know it and how much easier things became after it became more accessible to everyday people. He is now the co-founder and president of SuretyNow, a company that works to help protect the public from dishonest businesses.</p><h3><strong>A Heart and Talent for Tech</strong></h3><p>\\\nAfter graduating high school, Xiao attended Queen's University in Canada for commerce and computer science. Though his original goal was to go into consulting and finance, he made a decision to switch fully into tech after an unfulfilling internship at an asset management firm his first summer. During this time, he was balancing the internship while working on a startup with friends, eventually leading him to leave the asset management internship behind to dedicate his time to that startup.</p><p>\\\nHowever, Xiao did not know how to code, so he began taking computer science classes to expand his horizons. He interned at a Toronto startup called Nuology and then parlayed that internship into full-time roles at Google, where he worked on the Google Ads and Google Stadia teams.</p><h2><strong>Making an Impact with the Biggest Names in Tech</strong></h2><p>Breaking into the tech field was difficult for Xiao, partly because he was new to the industry and didn't go to a school with a strong history of tech company recruitment. As a result, he worked to better himself in technology through education and went from zero tech experience to interning with Google within three years. At Google Stadia, he helped build Stadia's publisher analytics platform from zero to launch. He helped facilitate an analytics platform used by around 30 publishers at its peak, including Ubisoft and Electronic Arts.</p><p>As the driving force behind <a href=\"https://suretynow.com/\">SuretyNow</a>, Xiao's role extends far beyond the title of co-founder and president. He single-handedly built the company's website, developed the internal tooling and infrastructure, and now manages multiple teams. His strategic vision and hands-on approach have been instrumental in the company's success, making it a prime example of his entrepreneurial prowess.</p><p>\\\nAt SuretyNow, Xiao says that their agents can produce two times the industry average due to the automation they've built to make them more efficient. SuretyNow serves businesses who wish to buy surety to work like other modern tools they love, all with fast and affordable customer service. With exceptional customer service and a commitment to innovation through technology, they aim to educate and deliver peace of mind with their expertise in surety.</p><p>\\\nXiao's future goals for SuretyNow are simple: to lead and inspire others by hiring and mentoring interns. Ultimately, Xiao wants to make buying surety bonds and insurance as easy as purchasing a keychain on Amazon—a fact that can be difficult for some and challenging for others.</p>","contentLength":2882,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Choosing Wallets for Decentralized Applications","url":"https://hackernoon.com/choosing-wallets-for-decentralized-applications?source=rss","date":1739557803,"author":"EVEDEX","guid":341,"unread":true,"content":"<p>\\\nFor modern blockchain applications, it’s crucial to balance ease of use for experienced users with accessibility for newcomers. One of the first challenges for beginners is selecting and creating a wallet. Wallet interaction must be simple enough to maintain high conversion rates while preserving blockchain’s core advantage - decentralization - without compromising user experience (UX).</p><h3><strong>Two Audiences: Crypto Enthusiasts and Regular Users</strong></h3><p>When developing blockchain solutions, it’s important to account for varying user experience levels. In the context of decentralized exchanges like EVEDEX, two main audiences can be identified:</p><ol><li><strong>Crypto Enthusiasts (\"Cryptans\"</strong>) – users who are already familiar with blockchain technology, have experience with cold wallets, and value autonomy and decentralization.</li><li><strong>Regular Users (“Normies”)</strong> – those who want to trade and interact with decentralized financial instruments without having to dive into the technical aspects of blockchain.</li></ol><p>\\\nFor the second group, social logins and embedded wallets are especially important, as they make the onboarding process and platform interaction as seamless as possible.</p><h3><strong>Why is Social Login Important?</strong></h3><p>Social login plays a key role in lowering the entry barrier for new users. Traditional crypto wallets require users to store seed phrases, install extensions, and connect hardware devices. This is complicated, especially for those just starting their journey in Web3.</p><p>\\\nEVEDEX offers a built-in wallet with social login, allowing users to sign in via Google. This reduces the likelihood of losing access and makes the platform more convenient for a broader audience.</p><p>\\\n<strong>Advantages of Social Login:</strong></p><ul><li>Registration takes only a few seconds.</li><li>No need for a seed phrase.</li><li>Access to the account via multiple devices.</li><li>More users can try to use DeFi without technical difficulties.</li></ul><p>\\\nThe social login concept allows users to instantly enter the platform without memorizing complex seed phrases or going through lengthy registration processes. This is particularly important for newcomers encountering DeFi for the first time and who might be discouraged by the complexity of traditional wallets. By simplifying the login process, we lower the entry barrier for new users and grow the potential audience, allowing more people to explore decentralized finance effortlessly.</p><h3><strong>Why is Wallet Choice Important?</strong></h3><p>One of the main problems with modern blockchain solutions is the complexity of the first experience for new users. To start using decentralized applications, one must learn many new concepts, such as private keys, transactions, fees, and security. This discourages less technically inclined users and significantly reduces engagement. Therefore, choosing the most suitable wallet technology is not just a matter of convenience but also a way to grow the audience and improve the exchange’s conversion rates.</p><p>\\\nEVEDEX is a decentralized exchange focused on providing an interface similar to traditional centralized platforms. To achieve this goal, wallets must combine decentralization (user-controlled funds) with Web2-level convenience.</p><ul><li>Sponsored transactions or fee payments in non-native currencies</li><li>Two-factor authentication (2FA) support</li><li>Cross-device account access</li></ul><p>The fastest way to implement these features is through Wallets as a Service (WaaS) solutions like Magic, Fireblocks, or Thirdweb.</p><ul><li>: Providers offer ready-made solutions with social login and 2FA support. Users do not need to understand blockchain technicalities, the wallet is ready to use immediately after registration.</li><li>: Key storage is distributed, and the provider does not have direct access to the user's funds. Additionally, two-factor authentication significantly reduces user risks.</li><li>: Users can quickly start using the wallet without complicated setup or seed phrase storage, relying only on social networks or email.</li></ul><ul><li><strong>Limited Blockchain Support</strong>: Some providers only work with specific networks.</li><li>: Account recovery is implemented strictly according to the provider's mechanics.</li><li>: For large user volumes, WaaS services can become prohibitively expensive.</li><li><strong>Geographical Restrictions</strong>: Providers may block access for users from certain regions.</li></ul><p>Account Abstraction is a technology that allows the use of smart contracts as wallets. Unlike classic wallets, which rely on private keys, smart contract wallets provide virtually unlimited flexibility in implementing interaction logic.</p><p>\\\nCurrently, the technology is actively developing on EVM-compatible blockchains, thanks to the ERC-4337 standard, which enables AA without changes to Ethereum's base protocol. However, this increases the complexity of the solution's architecture.</p><p>\\\nFor implementing a wallet with account recovery and two-factor authentication, the optimal approach is to choose a standard open-source smart account wallet implementation that is well-tested and audited.</p><h3>Advantages of AA for Users</h3><ul><li><strong>Flexibility and Customization</strong>: The ability to tailor wallet logic to user needs and preferred verification methods.</li><li><strong>Decentralization and Full Asset Control</strong>: Eliminates risks of account blocking or access restrictions due to the absence of databases and centralized service controls.</li><li><strong>Access Recovery Through Pre-Defined Mechanisms</strong>: Useful in case of key loss or other unforeseen circumstances.</li></ul><h3>Disadvantages of AA (Primarily for Projects, Not Users):</h3><ul><li><strong>Complexity of Implementation</strong>: Integrating AA with 2FA and recovery mechanisms requires significant amounts of resources.</li><li>: It is possible to encounter bugs as the technology is still evolving rapidly.</li><li>Need for AA Infrastructure Deployment in New Networks.</li></ul><p>EVEDEX is actively exploring hybrid solutions for maximum user convenience. One key aspect is the integration of Account Abstraction for enhanced security and user interaction with the platform. The platform offers embedded wallets with social login while maintaining decentralization. This allows traders to use a DEX with the ease of a CEX, without having to trust a centralized entity.</p><p>\\\nAdditionally, EVEDEX is testing the possibility of sponsored transactions, enabling users to pay fees in project tokens, as well as flexible access recovery mechanisms without handing over private keys.</p><p>EVEDEX allows users to choose between different interaction options:</p><ol><li> (Recommended for Beginners):</li></ol><ul><li>Quickly create an embedded wallet.</li></ul><ol start=\"2\"><li><strong>Connecting an Existing Wallet</strong>:</li></ol><ul><li>Use MetaMask, Trust Wallet, Ledger, and other wallets.</li><li>Full control over assets.</li><li>Requires seed phrase storage.</li></ul><p>An innovative approach is combining embedded wallets with Account Abstraction. In this model, an embedded wallet is used to create and manage a smart contract (AA) wallet. This solution allows for seamless integration of social login and 2FA functionality while retaining the ability to implement custom logic at the AA wallet level.</p><p>Choosing the right wallet for decentralized applications requires balancing user convenience with decentralization principles. Embedded wallets provide quick setup and ready-made solutions but may limit flexibility and increase costs. Account Abstraction offers extensive possibilities but demands significant effort during implementation. A hybrid approach enables easy account recovery, social logins, and additional features without sacrificing wallet functionality.</p><p>\\\nEVEDEX is betting on hybrid solutions, integrating advanced technologies into a user-friendly interface to offer the best of both worlds: CEX-like convenience and DEX-level security.</p>","contentLength":7437,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"HyveDA Secures $50 Million in Pre-Deposits After Symbiotic Mainnet Launch","url":"https://hackernoon.com/hyveda-secures-$50-million-in-pre-deposits-after-symbiotic-mainnet-launch?source=rss","date":1739556785,"author":"Ishan Pandey","guid":340,"unread":true,"content":"<p><a href=\"https://hyveda.xyz/\">HyveDA</a> reached a supply cap of $50 million in pre-deposits from early contributors. The deposit phase began with the launch of the Symbiotic mainnet on January 28 and completed within two weeks. The deposits occurred during a market decline triggered by President Trump’s tariff policy.</p><p>\\\nContributors participated through two vault types. One vault is managed by <a href=\"https://hyveda.xyz/\">HyveDA</a> and additional vaults are provided by partners including EtherFi, Renzo, MEV Capital, Re7, Steakhouse, Gautlet, and P2P. Investors deposited assets into the vaults to become eligible for points that will be assigned after the deposit phase and carried forward to later phases.</p><p>\\\nThe deposited funds are not subject to penalties or risks from operations. The deposit process is structured to maintain a controlled onboarding process while allowing the protocol to expand. HyveDA operates a network that uses a delegated staking system through Symbiotic’s restaking process. The network depends on the participation of nodes to maintain data availability.</p><p>\\\nThe deposit phase may affect the protocol’s progress. A group of participants engaged in the process during a period of market instability. The method for assigning points after the deposit phase may influence future participation in the ecosystem. Observers note that the outcome may serve as a reference for protocols that seek to raise funds during periods of market change.</p><p>\\\nThe experience of this deposit phase stands as a point of reference for protocols seeking similar funding processes. Future updates will determine how this approach influences the transition from the pre-testnet phase to subsequent network stages and the overall development of the protocol.</p><p>The pre-deposit event resulted in a funding limit of 50 million dollars collected from early contributors. The process relied on a deposit mechanism with a defined cap and used multiple vault options. Contributors deposited assets into a native vault and several partner vaults. The method permitted a spread of contributions across many participants during a period when market conditions were affected by external policy changes.</p><p>\\\nThe deposit process provided an opportunity to test a funding method under conditions where market sentiment was shifting. Early participants engaged in the process despite the influence of external events. The use of a points system to reward participation introduces a variable for future involvement. This points system will be carried into subsequent phases and will affect how contributors interact with the network as it develops.</p><p>\\\nThe event also offered an example of a funding process that limits resource collection through a preset cap. The method used may serve as a reference for other protocols that plan to gather funds in similar market environments. The choice to spread contributions across several vaults instead of a single source appears to reduce the concentration of deposits. This approach may have an effect on how risk is distributed among network participants.</p><p>\\\nDon’t forget to like and share the story! </p><p>:::tip\n<strong>Vested Interest Disclosure:</strong>&nbsp;This author is an independent contributor publishing via our&nbsp;. HackerNoon has reviewed the report for quality, but the claims herein belong to the author. #DYOR</p>","contentLength":3262,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI and security startups blossom on cloudy days","url":"https://techcrunch.com/2025/02/14/ai-and-security-startups-blossom-on-cloudy-days/","date":1739556300,"author":"Anna Heim","guid":272,"unread":true,"content":"<p>Welcome to Startups Weekly — your weekly recap of everything you can’t miss from the world of startups. Want it in your inbox every Friday? Sign up here. This week confirmed that even when current events cloud the outlook, some startups still manage to raise significant amounts of funding, with those tied to security and […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":395,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Meta confirms ‘Project Waterworth,’ a global subsea cable project spanning 50,000 kilometers","url":"https://techcrunch.com/2025/02/14/meta-confirms-project-waterworth-a-global-subsea-cable-project-spanning-50000km/","date":1739555947,"author":"Ingrid Lunden","guid":271,"unread":true,"content":"<p>Back in November, we broke the news that Meta — owner of Facebook, Instagram, and WhatsApp, with billions of users accounting for 10% of all fixed and 22% of all mobile traffic — was close to announcing work on a major new, $10 billion+ subsea cable project to connect up the globe. The aim was […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":367,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Mastodon is working to add the controversial ‘quote posts’ feature","url":"https://techcrunch.com/2025/02/14/mastodon-is-working-to-add-the-controversial-quote-posts-feature/","date":1739554944,"author":"Sarah Perez","guid":270,"unread":true,"content":"<p>Mastodon, the decentralized alternative to X, is going to adopt a controversial feature from the platform formerly known as Twitter: quote posts. The company on Friday shared the progress it’s making on the implementation of the feature, which has divided users over its potential to be used for online abuse and bullying. Critics have long […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":411,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"DeepSeek: Everything you need to know about the AI chatbot app","url":"https://techcrunch.com/2025/02/14/deepseek-everything-you-need-to-know-about-the-ai-chatbot-app/","date":1739554650,"author":"Kyle Wiggers","guid":269,"unread":true,"content":"<p>DeepSeek has gone viral. Chinese AI lab DeepSeek broke into the mainstream consciousness this week after&nbsp;its chatbot app rose to the top of the Apple App Store charts (and Google Play, as well). DeepSeek’s AI models, which were trained using compute-efficient techniques,&nbsp;have led Wall Street analysts&nbsp;—&nbsp;and technologists&nbsp;— to question whether the U.S. can maintain its […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":449,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Video Friday: PARTNR","url":"https://spectrum.ieee.org/video-friday-partnr","date":1739552404,"author":"Evan Ackerman","guid":91,"unread":true,"content":"<p>Your weekly selection of awesome robot videos</p>","contentLength":45,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NjQ5NjM2MS9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTc0MDk5OTA2Nn0.hMaiDCMfAle2DiX2_S3CZKODrsXEYRxu4BQGU0eByc4/image.png?width=600","enclosureMime":"","commentsUrl":null},{"title":"A job ad for Y Combinator startup Firecrawl seeks to hire an AI agent for $15K a year","url":"https://techcrunch.com/2025/02/14/a-job-ad-for-y-combinator-startup-firecrawl-seeks-to-hire-an-ai-agent-for-15k-a-year/","date":1739552400,"author":"Julie Bort","guid":268,"unread":true,"content":"<p>Last week, an ad from the Y Combinator job board for a tiny startup called Firecrawl went viral on X.&nbsp; That’s because the ad wasn’t for a human. “Please apply only if you are an AI agent, or if you created an AI agent that can fill this job,” the job posting read.&nbsp; The seven-person […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":361,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.15 To Ensure PlayStation 5 Controllers Use The Correct Driver","url":"https://www.phoronix.com/news/Linux-6.15-Ensures-PS5-Driver","date":1739548149,"author":"Michael Larabel","guid":702,"unread":true,"content":"<article>A change queued up by an Amazon engineer ahead of the upcoming Linux 6.15 kernel cycle will ensure that PlayStation 5 controllers on Linux load with the correctly desired driver...</article>","contentLength":180,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Fwupd 2.0.6 Adds Support For HPE Gen10/Gen10+ Servers","url":"https://www.phoronix.com/news/Fwupd-2.0.6-Released","date":1739541176,"author":"Michael Larabel","guid":701,"unread":true,"content":"<article>Fwupd 2.0.6 is out today as the newest update to this widely-used open-source solution for system and peripheral device firmware updating under Linux...</article>","contentLength":152,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ubuntu Making Progress On Replacing initramfs-tools With Dracut","url":"https://www.phoronix.com/news/Ubuntu-Dracut-Still-WIP","date":1739534419,"author":"Michael Larabel","guid":700,"unread":true,"content":"<article>As a follow-up to the news from last October of Ubuntu considering Dracut to replace initramfs-tools for initrd generation, that work remains ongoing with some improvements since having been prepared for the upcoming Ubuntu 25.04 release but it remains overall an active affair...</article>","contentLength":280,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"GNOME Software May Eventually Drop RPM Support In Favor Of Flatpaks","url":"https://www.phoronix.com/news/GNOME-Software-RPM-Flatpak","date":1739533076,"author":"Michael Larabel","guid":699,"unread":true,"content":"<article>Stemming from the ongoing discussion around the issues raised with Fedora's Flatpak package of OBS Studio and how Flatpaks should be prioritized within the GNOME Software app center/store, the future of RPM support within GNOME Software raised...</article>","contentLength":246,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Show Your Love For Linux Hardware Coverage This Valentine's Day","url":"https://www.phoronix.com/news/Phoronix-Premium-Valentine-2025","date":1739532602,"author":"Michael Larabel","guid":698,"unread":true,"content":"<article>If you wish to show your appreciation for all of the Linux hardware reviews, Linux benchmarking, and open-source news provided on Phoronix each and every day, you can join Phoronix Premium this Valentine's Day weekend at a discounted rate...</article>","contentLength":241,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Vulkan 1.4.308 Brings NVIDIA's Provisional Present Metering Extension","url":"https://www.phoronix.com/news/Vulkan-1.4.308-Present-Metering","date":1739531666,"author":"Michael Larabel","guid":697,"unread":true,"content":"<article>Vulkan 1.4.308 was quietly released last week and besides a few fixes what makes it interesting is the provisional VK_NV_present_metering extension...</article>","contentLength":150,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Valkey 8.1-rc1 Delivers Fresh Performance Improvements","url":"https://www.phoronix.com/news/Valkey-8.1-rc1","date":1739531155,"author":"Michael Larabel","guid":696,"unread":true,"content":"<article>Valkey as the open-source in-memory store forked from Redis is preparing for its next feature release...</article>","contentLength":104,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"TrueNAS 25.04 \"Fangtooth\" Beta Unifies Linux SCALE & FreeBSD CORE Efforts","url":"https://www.phoronix.com/news/TrueNAS-25.04-Beta","date":1739509200,"author":"Michael Larabel","guid":695,"unread":true,"content":"<article>TrueNAS 25.04 beta was released on Thursday as another step toward unifying the TrueNAS CORE OS derived from FreeBSD and the Linux-based TrueNAS SCALE...</article>","contentLength":153,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"OBS Studio Raises Issues With Fedora's Flatpak Package","url":"https://www.phoronix.com/news/OBS-Studio-Poor-Fedora-Flatpak","date":1739497192,"author":"Michael Larabel","guid":694,"unread":true,"content":"<article>The OBS Studio open-source screencasting and streaming app has called out Fedora's poor Flatpak packaging of the application and is threatening as going as far as legal action if it isn't addressed...</article>","contentLength":200,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Zed Editor Introduces Open-Source \"Zeta\" Edit Prediction Model","url":"https://www.phoronix.com/news/Zed-Zeta-AI-Model-Edit-Predict","date":1739480328,"author":"Michael Larabel","guid":693,"unread":true,"content":"<article>The Zed code editor for macOS and Linux systems has proven to be quite popular for this Rust-based editor started by the creators of the Atom editor. Their latest feature being introduced is Zeta as an open-source edit prediction model to further enhance this code editor with AI capabilities...</article>","contentLength":295,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Bcachefs Freezes Its On-Disk Format With Future Updates Optional","url":"https://www.phoronix.com/news/Bcachefs-On-Disk-Format-Freeze","date":1739474312,"author":"Michael Larabel","guid":692,"unread":true,"content":"<article>The latest round of Bcachefs file-system fixes have been submitted today for the in-development Linux 6.14 kernel. Besides fixes for the current kernel, it was announced today that the on-disk format for the file-system is now considered frozen in its latest development \"master\" branch...</article>","contentLength":289,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Hector Martin Resigns From The Asahi Linux Project","url":"https://www.phoronix.com/news/Hector-Martin-Resigns-Asahi","date":1739462186,"author":"Michael Larabel","guid":691,"unread":true,"content":"<article>Last week Hector Martin resigned from upstream maintainership of the Apple Silicon code for the Linux kernel. At the time he was still going to contribute to the Asahi Linux project's downstream kernel but in a surprise move today, he has decided to resign as project leader of Asahi Linux...</article>","contentLength":292,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.14-rc3 To Fix Platform Profile Support For Newer AMD-Powered ThinkPads","url":"https://www.phoronix.com/news/Linux-6.14-rc3-Newer-AMD-PP","date":1739461284,"author":"Michael Larabel","guid":690,"unread":true,"content":"<article>Submitted today via the x86 platform driver updates ahead of Linux 6.14-rc3 on Sunday are some Lenovo ThinkPad patches that may interest some users...</article>","contentLength":150,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["tech"]}