{"id":"2BCfkBRHmbhytY8nm9spZ4inpFkqHBsLKs6LqzTxwmhuxSvfYzGLsd","title":"nixCraft: Linux Tips, Hacks, Tutorials, And Ideas In Blog Format (RSS/FEED)","displayTitle":"Dev - NixCraft","url":"https://www.cyberciti.com/atom/atom.xml","feedLink":"https://www.cyberciti.biz/atom/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":3,"items":[{"title":"Critical Rsync Vulnerability Requires Immediate Patching on Linux and Unix systems","url":"https://www.cyberciti.biz/linux-news/cve-2024-12084-rsyn-security-urgent-update-needed-on-unix-bsd-systems/","date":1736964264,"author":"Vivek Gite","guid":275,"unread":true,"content":"<p>sync is a opensource command-line tool in Linux, macOS, *BSD and Unix-like systems that synchronizes files and directories. It is a popular tool for sending or receiving files, making backups, or setting up mirrors. It minimizes data copied by transferring only the changed parts of files, making it faster and more bandwidth-efficient than traditional copying methods provided by tools like sftp or ftp-ssl. Rsync versions 3.3.0 and below has been found with SIX serious vulnerabilities. Attackers could exploit these to leak your data, corrupt your files, or even take over your system. There is a heap-based buffer overflow with a CVSS score of 9.8 that needs to be addressed on both the client and server sides of rsync package. Apart from that info leak via uninitialized stack contents defeats ASLR protection and rsync server can make client write files outside of destination directory using symbolic links.</p>","contentLength":915,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How to control the SSH multiplexing with the control commands","url":"https://www.cyberciti.biz/faq/ssh-multiplexing-control-command-to-check-forward-list-cancel-stop-connections/","date":1736929750,"author":"Vivek Gite","guid":274,"unread":true,"content":"<p>ultiplexing will boost your SSH connectivity or speed by reusing existing TCP connections to a remote host. This is useful when you frequently connect to the same server using SSH protocol for remote login, server management, using IT automation tools over SSH or even running hourly backups. However, sometimes your SSH command (client) will not respond or get hung up on the session when using multiplexing. Typically, this happens when your public IP changes (IPv4 to IPv6 changes when using DNS names), VPN issues, or firewall cuts connections. Hence, knowing SSH client control commands can save you time and boost your productivity when such gotchas occur. </p>","contentLength":663,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ZFS Raidz Expansion Finally, Here in version 2.3.0","url":"https://www.cyberciti.biz/linux-news/zfs-raidz-expansion-finally-here-in-version-2-3-0/","date":1736846360,"author":"Vivek Gite","guid":273,"unread":true,"content":"<p>fter years of development and testing, the ZFS raidz expansion is finally here and has been released as part of version 2.3.0. ZFS is a popular file system for Linux and FreeBSD. RAIDz is like RAID 5, which you find with hardware or Linux software raid devices. It protects your data by spreading it across multiple hard disks along with parity information. A raidz device can have single, double, or triple parity to sustain one, two, or three hard disk failures, respectively, without losing any data. Hence, expanding or adding a new HDD is a very handy feature for sysadmins in today's data-sensitive apps.</p>","contentLength":610,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev"]}