{"id":"2k6wXud2N91xpf4PwnSfo4j5WSuTNX5k","title":"Tech News - Last 2 days","displayTitle":"Tech News - Last 2 days","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":68,"items":[{"title":"Bluesky launches a custom feed for vertical videos","url":"https://techcrunch.com/2025/01/19/bluesky-launches-a-custom-feed-for-vertical-videos/","date":1737349321,"author":"Ivan Mehta","guid":221,"unread":true,"content":"<p>It is the product shipping time for all social networks with&nbsp;TikTok’s services in the restoration phase,&nbsp;and the app still unavailable in the App Store and the Play Store. Bluesky said Sunday that it is launching a custom feed for vertical video in its app. Users can see a trending videos section in the explore tab […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":389,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How to stream Donald Trump’s Inauguration Day 2025","url":"https://techcrunch.com/2025/01/19/how-to-stream-donald-trumps-inauguration-day-2025/","date":1737340374,"author":"Lauren Forristal","guid":220,"unread":true,"content":"<p>Donald Trump will take the presidential oath of office on Monday in front of the Capitol building in Washington, D.C., once again. The event takes place at noon ET and is expected to attract considerable attention from both supporters and opponents. How to stream Trump’s inauguration You can watch the inauguration live with cable or […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":405,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Aptera's Solar-Powered Electric Car Shown at CES, Finally Nears Production","url":"https://tech.slashdot.org/story/25/01/20/0215215/apteras-solar-powered-electric-car-shown-at-ces-finally-nears-production?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737339420,"author":"EditorDavid","guid":236,"unread":true,"content":"\"Engineers have showcased a prototype electric vehicle that can drive for up to 40 miles (64 kilometers) per day using just solar power,\" reports LiveScience. The production-ready \"Aptera Launch Edition\" made its first appearance this month at CES 2025, and \"also offers up to 400 miles (640 km) of range from a single charge via an electrical output, company representatives said in a statement.\" \n\n\nLiveScience describes the vehicle as \"lighter and more energy-efficient than conventional EVs, while offering a 50% reduction in aerodynamic resistance,\" with an energy efficiency rating of 100 Watt-hours per mile (Wh/mile).\nBy contrast, a Tesla Model S (released in 2022) consumes 194 Wh/mile in the city in mild weather and 288 Wh/mile on the highway in mild weather, according to the EV Database. At a maximum range of 440 miles — including 40 miles using solar power and 400 miles using electricity — the Aptera EV may also overtake the current longest-range vehicles in production. The Mercedes-Benz EQS 450+ has a maximum range of 425 miles (684 km), according to the EV Database, followed by the Lucid Air Grand Touring at 410 miles (660 km). \nAptera says it's raised $135 million \"through equity crowdfunding\" to fund its pre-production progress. \"Since its launch, the Company has accepted $1.7 billion in pre-orders with nearly 50,000 vehicles reserved by future Aptera owners in the U.S. and internationally.\" \n\n MotorTrend writes that \"nearly two decades in the making, the otherworldly three-wheel Aptera is headed to production this year as a $40,000, 400-mile EV that can capture up to 40 miles worth of free solar energy every day. Maybe.\"\n\nThe California startup made similar promises in 2008, 2009, 2012, and 2022 and yet it has never delivered a single vehicle. Is anything different this time...? \n\nAt CES, co-CEO (and one of Aptera's original founders) Chris Anthony told MotorTrend it will take another $60 million to finish the development work, buy the tooling, and build out the Carlsbad, California, assembly plant. \"We're still in fundraising mode and we hope that we inspire some people in this beautiful building (Las Vegas Convention Center) to invest in Aptera,\" Anthony said. \"We're trying to raise $20 million in the first quarter of this year. That will basically kick off all the long-lead items to get into production, but it's a $60 million plan to get into volume production.\" Anthony said the company has already made one of its largest purchases, the molds for the carbon-fiber sheet-molding composite body structure and the fiberglass sheet-molding composite body panels that will be made in Italy. The next $20 million will cover the tooling for the diecast metal suspension arms and the injection-molded interior components... \n\n\n\nIt would be relatively easy for Aptera to hand build cars in a garage and announce the start of production, but the plan calls for building up to 80 cars per day per the guidance of engineering consultant and YouTuber Sandy Munro, who is an Aptera investor and adviser. \"He really helped shepherd the design from what was an early prototype prove-out design into how to make the most manufacturable vehicle ever,\" Anthony said. The structure is built from just six parts and the entire car has been designed to be put together in a factory with just 12 stations. But that radical simplicity complicates the job at hand right now. In addition to developing the car, the small engineering team also has to create the machine that makes it. Anthony's plan has the factory ramping up to build 20,000 vehicles a year within nine months of starting production at the end of 2025. \nBefore that can happen, Aptera needs to clear the same hurdle that tripped it up in 2011 and sent the company stumbling into liquidation — the money. \"We would love one investor to be so inspired by what we're doing that they just hand us a $60 million check,\" Anthony told MotorTrend. \"But it could be something that's kind of piecemeal over the next nine months to get that $60 million into the company.\" Are you convinced?","contentLength":4081,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A Videogame Meets Shakespeare in 'Grand Theft Hamlet' Film","url":"https://entertainment.slashdot.org/story/25/01/20/0025225/a-videogame-meets-shakespeare-in-grand-theft-hamlet-film?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737332880,"author":"EditorDavid","guid":235,"unread":true,"content":"The Los Angeles Times calls it \"a guns-blazingly funny documentary about two out-of-work British actors who spent a chunk of their COVID-19 lockdown staging Shakespeare's masterpiece on the mean streets of Grand Theft Auto V.\" \n\n Grand Theft Hamlet won SXSW's Jury Award for best documentary, and has now opened in U.S. theatres this weekend (and begun streaming on Mubi), after opening in the U.K. and Ireland. But nearly the entire film is set in Grand Theft Auto's crime-infested version of Los Angeles, the Times reports, \"where even the good guys have weapons and a nihilistic streak — the vengeful Prince of Denmark fits right in.\"\nYet when Sam Crane, a.k.a. @Hamlet_thedane, launches into one of the Bard's monologues, he's often murdered by a fellow player within minutes. Everyone's a critic. \n\nCrane co-directed the movie with his wife, Pinny Grylls, a first-time gamer who functions as the film's camera of sorts. What her character sees, where she chooses to stand and look, makes up much of the film, although the editing team does phenomenal work splicing in other characters' points of view. (We're never outside of the game until the last 30 seconds; only then do we see anyone's real face....) The Bard's story is only half the point. Really, this is a classic let's-put-on-a-pixilated-show tale about the need to create beauty in the world — even this violent world — especially when stage productions in England have shuttered, forcing Crane, a husband and father, and Mark Oosterveen, single and lonely, to kill time speeding around the digital desert... \n\n\nTo our surprise (and theirs), the play's tussles with depression and anguish and inertia become increasingly resonant as the production and the pandemic limps toward their conclusions. When Crane and Oosterveen's \"Grand Theft Auto\" avatars hop into a van with an anonymous gamer and ask this online stranger for his thoughts on Hamlet's suicidal soliloquy, the man, a real-life delivery driver stuck at home with a broken leg, admits, \"I don't think I'm in the right place to be replying to this right now....\" \nIn 2014 Hamlet was also staged in Guild Wars 2, the article points out. \"This is, however, the first attempt I'm aware of that attempts to do the whole thing live in one go, no matter if one of the virtual actors falls to their doom from a blimp. \n\n\"As Grylls says, 'You can't stop production just because somebody dies.'\"","contentLength":2418,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.13 Released With AutoFDO + Propeller, AMD Changes & Broader Apple Support","url":"https://www.phoronix.com/news/Linux-6.13-Released","date":1737331200,"author":"Michael Larabel","guid":641,"unread":true,"content":"<article>As anticipated the Linux 6.13 kernel was promoted to stable today with an on-time release and in turn also marking the start of the Linux 6.14 merge window. Linux 6.13 stable has plenty of fine features for this first major kernel release of 2025...</article>","contentLength":249,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"In AI Arms Race, America Needs Private Companies, Warns National Security Advisor","url":"https://yro.slashdot.org/story/25/01/19/1955244/in-ai-arms-race-america-needs-private-companies-warns-national-security-advisor?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737327960,"author":"EditorDavid","guid":234,"unread":true,"content":"America's outgoing national security adviser has \"wide access to the world's secrets,\" writes Axios, adding that the security adviser delivered a \"chilling\" warning that \"The next few years will determine whether AI leads to catastrophe — and whether China or America prevails in the AI arms race.\" \n\nBut in addition, Sullivan \"said in our phone interview that unlike previous dramatic technology advancements (atomic weapons, space, the internet), AI development sits outside of government and security clearances, and in the hands of private companies with the power of nation-states... 'There's going to have to be a new model of relationship because of just the sheer capability in the hands of a private actor,' Sullivan says...\"\n\n Somehow, government will have to join forces with these companies to nurture and protect America's early AI edge, and shape the global rules for using potentially God-like powers, he says. U.S. failure to get this right, Sullivan warns, could be \"dramatic, and dramatically negative — to include the democratization of extremely powerful and lethal weapons; massive disruption and dislocation of jobs; an avalanche of misinformation...\" \n\nTo distill Sullivan: America must quickly perfect a technology that many believe will be smarter and more capable than humans. We need to do this without decimating U.S. jobs, and inadvertently unleashing something with capabilities we didn't anticipate or prepare for. We need to both beat China on the technology and in shaping and setting global usage and monitoring of it, so bad actors don't use it catastrophically. Oh, and it can only be done with unprecedented government-private sector collaboration — and probably difficult, but vital, cooperation with China... \n\nThere's no person we know in a position of power in AI or governance who doesn't share Sullivan's broad belief in the stakes ahead... \nThat said, AI is like the climate: America could do everything right — but if China refuses to do the same, the problem persists and metastasizes fast. Sullivan said Trump, like Biden, should try to work with Chinese leader Xi Jinping on a global AI framework, much like the world did with nuclear weapons. \n\n\"I personally am not an AI doomer,\" Sullivan says in the interview. \"I am a person who believes that we can seize the opportunities of AI. But to do so, we've got to manage the downside risks, and we have to be clear-eyed and real about those risks.\" \n\nThanks to long-time Slashdot reader Mr_Blank for sharing the article.","contentLength":2524,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A Guide to Container Networking: Part III - Docker Container Networking","url":"https://hackernoon.com/a-guide-to-container-networking-part-iii-docker-container-networking?source=rss","date":1737325803,"author":"Atul Thosar","guid":281,"unread":true,"content":"<p>This is the third part of the series&nbsp;<a href=\"https://simplyatul.github.io/blog/Container-Networking/\">Container Networking</a>. I will explain a little bit about the docker container networking in this blog post.</p><p>\\\nI followed the steps mentioned in&nbsp;<a href=\"https://docs.docker.com/engine/install/ubuntu/\">this</a>&nbsp;to install docker on Ubuntu.</p><p>\\\nPost docker install, you can see the&nbsp;&nbsp;device in the list</p><pre><code>ip link\n1: lo: &lt;LOOPBACK,UP,LOWER_UP&gt; mtu 65536 qdisc noqueue state UNKNOWN mode DEFAULT group default qlen 1000\n    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00\n2: enp0s3: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc fq_codel state UP mode DEFAULT group default qlen 1000\n    link/ether 02:fd:4d:34:55:76 brd ff:ff:ff:ff:ff:ff\n11: docker0: &lt;NO-CARRIER,BROADCAST,MULTICAST,UP&gt; mtu 1500 qdisc noqueue state DOWN mode DEFAULT group default \n    link/ether 02:42:cf:b4:c1:a8 brd ff:ff:ff:ff:ff:ff\n</code></pre><p>\\\nLet’s create a busybox container.</p><pre><code>docker run --name bb -dt busybox\n</code></pre><pre><code> docker ps -a\nCONTAINER ID   IMAGE     COMMAND   CREATED              STATUS              PORTS    NAMES\n02429964e449   busybox   \"sh\"      About a minute ago   Up About a minute             bb\n</code></pre><p>\\\nIn the device list, you see the&nbsp;&nbsp;interface is created with the master as docker0.</p><pre><code>ip link\n1: lo: &lt;LOOPBACK,UP,LOWER_UP&gt; mtu 65536 qdisc noqueue state UNKNOWN mode DEFAULT group default qlen 1000\n    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00\n2: enp0s3: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc fq_codel state UP mode DEFAULT group default qlen 1000\n    link/ether 02:fd:4d:34:55:76 brd ff:ff:ff:ff:ff:ff\n11: docker0: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc noqueue state UP mode DEFAULT group default \n    link/ether 02:42:cf:b4:c1:a8 brd ff:ff:ff:ff:ff:ff\n17: veth7b01920@if16: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc noqueue master docker0 state UP mode DEFAULT group default \n    link/ether e2:15:50:88:11:03 brd ff:ff:ff:ff:ff:ff link-netnsid 2\n</code></pre><p>\\\nLet’s check the network namespace.</p><p>\\\nAnd you won’t see any network namespaces…How come??? This is because:</p><pre><code>ip netns list command looks up network namespaces file in the \n/var/run/netns directory.\n\nHowever, the Docker daemon doesn’t create a reference of\nthe network namespace file in the /var/run/netns directory\nafter the creation. Therefore, ip netns ls cannot resolve the\nnetwork namespace file\n\nRef: https://www.baeldung.com/linux/docker-network-namespace-invisible\n</code></pre><p>\\\nIf you want&nbsp;&nbsp;to show the namespace name docker has created, then follow the below steps</p><pre><code>export container_name=bb\ncontainer_pid=$(sudo docker inspect -f '' $container_name)\necho $container_pid\n\nsudo touch /var/run/netns/$container_name\nsudo mount -o bind /proc/$container_pid/ns/net /var/run/netns/$container_name\n</code></pre><p>\\\nNow, you can see the namespace name.</p><pre><code>sudo ip netns exec bb ip link\n1: lo: &lt;LOOPBACK,UP,LOWER_UP&gt; mtu 65536 qdisc noqueue state UNKNOWN mode DEFAULT group default qlen 1000\n    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00\n16: eth0@if17: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc noqueue state UP mode DEFAULT group default \n    link/ether 02:42:ac:11:00:02 brd ff:ff:ff:ff:ff:ff link-netnsid 0\n</code></pre><p>\\\nThe following diagram will help you visualize it better.</p><p>With this, I’m signing off. I hope this blog series helps to de-clutter your container networking.</p>","contentLength":3197,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Accidents, Not Sabotage, Likely Damaged Baltic Undersea Cables, Say US and European Intelligence Officials","url":"https://tech.slashdot.org/story/25/01/19/225237/accidents-not-sabotage-likely-damaged-baltic-undersea-cables-say-us-and-european-intelligence-officials?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737324480,"author":"EditorDavid","guid":233,"unread":true,"content":"The Washington Post reports:\nRuptures of undersea cables that have rattled European security officials in recent months were likely the result of maritime accidents rather than Russian sabotage, according to several U.S. and European intelligence officials. \n\nThe determination reflects an emerging consensus among U.S. and European security services, according to senior officials from three countries involved in ongoing investigations of a string of incidents in which critical seabed energy and communications lines have been severed... [S]o far, officials said, investigations involving the United States and a half-dozen European security services have turned up no indication that commercial ships suspected of dragging anchors across seabed systems did so intentionally or at the direction of Moscow. Instead, U.S. and European officials said that the evidence gathered to date — including intercepted communications and other classified intelligence — points to accidents caused by inexperienced crews serving aboard poorly maintained vessels. \n\nU.S. officials cited \"clear explanations\" that have come to light in each case indicating a likelihood that the damage was accidental, and a lack of evidence suggesting Russian culpability. Officials with two European intelligence services said that they concurred with U.S. assessments. Despite initial suspicions that Russia was involved, one European official said there is \"counter evidence\" suggesting otherwise. The U.S. and European officials declined to elaborate and spoke on the condition of anonymity, citing the sensitivity of ongoing investigations... \n\n\nA Nordic official briefed on the investigation said conditions on the tanker were abysmal. \"We've always gone out with the assumption that shadow fleet vessels are in bad shape,\" the official said. \"But this was even worse than we thought....\" European security officials said that Finland's main intelligence service is in agreement with Western counterparts that the Dec. 25 incident appears to have been an accident, though they cautioned that it may be impossible to rule out a Russian role. \nThe article points out another reason Russia might not want to draw attention to the waterways around NATO countries. Doing so \"could endanger oil smuggling operations Russia has relied on to finance the war in Ukraine, and possibly provoke more aggressive efforts by Western governments to choke off Russia's route to the North Atlantic.\"","contentLength":2463,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Large-Scale US Solar Farms Brings 'Solar Grazing' Work for Sheep","url":"https://hardware.slashdot.org/story/25/01/19/213256/large-scale-us-solar-farms-brings-solar-grazing-work-for-sheep?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737320760,"author":"EditorDavid","guid":232,"unread":true,"content":"\"As large-scale solar farms crop up across the U.S.,\" reports ABC News, \"the booming solar industry has found an unlikely mascot...\" Sheep.\n\n\nIn Milam County, outside Austin [Texas], SB Energy operates the fifth-largest solar project in the country, capable of generating 900 megawatts of power across 4,000 acres (1,618 hectares). How do they manage all that grass? With the help of about 3,000 sheep, which are better suited than lawnmowers to fit between small crevices and chew away rain or shine. The proliferation of sheep on solar farms is part of a broader trend — solar grazing — that has exploded alongside the solar industry. Agrivoltaics, a method using land for both solar energy production and agriculture, is on the rise with more than 60 solar grazing projects in the U.S., according to the National Renewable Energy Laboratory. \n\nThe American Solar Grazing Association says 27 states engage in the practice. \"The industry tends to rely on gas-powered mowers, which kind of contradicts the purpose of renewables,\" SB Energy asset manager James Hawkins said... Because solar fields use sunny, flat land that is often ideal for livestock grazing, the power plants have been used in coordination with farmers rather than against them.... \n\nSome agriculture experts say [solar sheepherders'] success reflects how solar farms have become a boon for some ranchers. Reid Redden, a sheep farmer and solar vegetation manager in San Angelo, Texas, said a successful sheep business requires agricultural land that has become increasingly scarce. \"Solar grazing is probably the biggest opportunity that the sheep industry had in the United States in several generations,\" Redden said. The response to solar grazing has been overwhelmingly positive in rural communities near South Texas solar farms where Redden raises sheep for sites to use, he said. \"I think it softens the blow of the big shock and awe of a big solar farm coming in,\" Redden said.","contentLength":1957,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Suicide Hotlines Promised Anonymity - So Why Was Sensitive Data Sent to Facebook?","url":"https://hackernoon.com/suicide-hotlines-promised-anonymity-so-why-was-sensitive-data-sent-to-facebook?source=rss","date":1737320405,"author":"The Markup","guid":280,"unread":true,"content":"<p>Websites for mental health crisis resources across the country—which promise anonymity for visitors, many of whom are at a desperate moment in their lives—have been quietly sending sensitive visitor data to Facebook, The Markup has found.</p><p>\\\nDozens of websites tied to the national mental health crisis 988 hotline, which launched last summer, transmit the data through a tool called the Meta Pixel, according to testing conducted by The Markup. That data often included signals to Facebook when visitors attempted to dial for mental health emergencies by tapping on dedicated call buttons on the websites.</p><p>\\\nIn some cases, filling out contact forms on the sites transmitted hashed but easily unscrambled names and email addresses to Facebook.</p><p>The Markup tested <a href=\"https://988lifeline.org/our-crisis-centers/\">186 local crisis center websites</a> under the umbrella of the national 988&nbsp;Suicide and Crisis Lifeline. Calls to the national 988 line are routed to these centers based on the area code of the caller. The organizations often also operate their own crisis lines and provide other social services to their communities.</p><p>\\\nThe Markup’s testing revealed that more than 30 crisis center websites employed the Meta Pixel, formerly called the Facebook Pixel. The pixel, a short snippet of code included on a webpage that enables advertising on Facebook, is a free and widely used tool. A <a href=\"https://themarkup.org/blacklight/2020/09/22/blacklight-tracking-advertisers-digital-privacy-sensitive-websites\">2020 Markup investigation</a> found that 30 percent of the web’s most popular sites use it.</p><p>\\\nThe pixels The Markup found tracked visitor behavior to different degrees. All of the sites recorded that a visitor had viewed the homepage, while others captured more potentially sensitive information.</p><p>\\\nMany of the sites included buttons that allowed users to directly call either 988 or a local line for mental health help. But clicking on those buttons often triggered a signal to be sent to Facebook that shared information about what a visitor clicked on. A pixel on one site sent data to Facebook on visitors who clicked a button labeled “24-Hour Crisis Line” that called local crisis services.</p><p>\\\nClicking a button or filling out a form also sometimes sent personally identifiable data, such as names or unique ID numbers, to Facebook.</p><p>The website for the <a href=\"https://www.voaww.org/\">Volunteers of America Western Washington</a> is a good example. The social services nonprofit says it responds to more than 300,000 requests for assistance each year. When a web user visited the organization’s website, a pixel on the homepage noted the visit.</p><p>If the visitor then tried to call the national 988 crisis hotline through the website by clicking on a button labeled “call or text 988,” that click—including the text on the button—was sent to Facebook. The click also transmitted an “external ID,” a code that <a href=\"https://developers.facebook.com/docs/marketing-api/conversions-api/parameters/external-id/\">Facebook uses</a> to attempt to match web users to their Facebook accounts.</p><p>\\\nIf a visitor filled out a contact form on the Volunteers of America Western Washington’s homepage, even more private information was transmitted to Facebook. After filling out and sending the form, a pixel transmitted hashed, or scrambled, versions of the person’s first and last name, as well as email address.</p><p>\\\nAfter publication, Maca Ferguson, a spokesperson for Volunteers of America Western Washington, said the pixel was used for fundraising efforts and “not intended to collect personally identifiable information for purposes of tracking or transmitting this data back to Meta, its subsidiaries, or any third party for any reason” and that any data was sent “without our knowledge or consent.” Ferguson told The Markup the organization has since removed the pixel.</p><p>\\\nThe Markup found similar activity on other sites.</p><p>\\\n<a href=\"https://www.crisis-center.org/\">The Contra Costa Crisis Center</a>, an organization providing social services in Northern California, noted to Facebook when a user clicked on a button to call or text for crisis services. About 3,000 miles away, in Rhode Island, an organization called <a href=\"https://www.bhlink.org/\">BH Link</a> used a pixel that also pinged Facebook when a visitor clicked a button to call crisis services from its homepage.&nbsp;(After publication of this article Contra Costa Crisis Center told The Markup that it had removed the pixel.)</p><p>\\\nFacebook can use data collected by the pixel to link website visitors to their&nbsp;Facebook accounts, but the data is collected whether or not the visitor has a Facebook account. Although the names and email addresses sent to Facebook were hashed, they can be easily unscrambled with <a href=\"https://crackstation.net/\">free and widely available web services</a>.</p><p>\\\nAfter The Markup contacted the 33 crisis centers about their practices, some said they were unaware that the code was on their sites and that they’d take steps to remove it.</p><p>\\\n“This was not intentional and thank you for making us aware of the potential issue,” Leo Pellerin, chief information officer for the <a href=\"http://www.211ct.org/\">United Way of Connecticut</a>, a partner in the national 988&nbsp;network, said in an emailed statement. Pellerin said they had removed the code, which they attributed to a plug-in on their website.</p><p>\\\nLee Flinn, director of the <a href=\"https://idahocrisis.org/\">Idaho Crisis and Suicide Hotline</a>, said in an email that she had “never heard of Meta Pixel” and was asking the outside vendor who had worked on the organization’s site to remove the code. “We value the privacy of individuals who reach out to us, and any tracking devices are not intentional on our part, nor did we ask any developer to install,” she said. “Anything regarding tracking that is found will be immediately removed.”</p><p>\\\nKen Gibson, a spokesperson for the <a href=\"https://www.crisiscenter.com/\">Crisis Center of Tampa Bay</a>, said the organization had recently placed the pixel on its site to advertise for staff but would now reduce the information the pixel gathers to only careers pages on the site.</p><p>\\\nIn follow-up tests, four organizations appeared to have completely removed the code. The majority of the centers we contacted did not respond to requests for comment.</p><p>\\\n“Advertisers should not send sensitive information about people through our Business Tools,” Meta spokesperson Emil Vazquez told The Markup in an emailed statement that mirrored those the company has previously provided in response to reporting on the Meta Pixel. “Doing so is against our policies and we educate advertisers on properly setting up Business tools to prevent this from occurring. Our system is designed to filter out potentially sensitive data it is able to detect.”</p><p>\\\nVazquez did not respond to a question about whether or how Meta could determine if this specific data was filtered.</p><p>\\\nThere is no evidence that either Facebook or any of the crisis centers themselves attempted to identify visitors or callers, or that an actual human ever identified someone who attempted to call for help through a website. Some organizations explicitly said in response to The Markup’s requests for comment that they valued the anonymity promised by the 988&nbsp;line.</p><p>\\\nMary Claire Givelber, executive director of New Jersey–based <a href=\"https://caringcontact.org/\">Caring Contact</a>, said in an email that the organization had briefly used the pixel to recruit volunteers on Facebook but would now remove it.</p><p>\\\n“For the avoidance of all doubt, Caring Contact has not used the Meta Pixel to identify, target, or advertise to any potential or actual callers or texters of the Caring Contact crisis hotline,” Givelber said.</p><p>\\\nMeta can use information gathered from its tools for its own purposes, however, and data sent to the company through the pixels scattered across the web enters a black box that can catalog and organize data with little oversight.</p><p>\\\nDivendra Jaffar, a spokesperson for <a href=\"https://www.vibrant.org/\">Vibrant Emotional Health</a>, the nonprofit responsible for administering the national 988 crisis line, pointed out in an emailed statement that data transmitted through the pixel is encrypted.</p><p>\\\n“While Vibrant Emotional Health does not require our 988 Lifeline network of crisis centers to provide updates on their marketing and advertising practices, we do provide best practices guidelines to our centers, counselors, and staff and hold them to rigorous operating standards, which are reviewed and approved by our government partners,” Jaffar said.</p><p>\\\nThe organization did not respond to a request to provide any relevant best practices.</p><p>\\\nJen King, the privacy and data policy fellow at the Stanford Institute for Human-Centered Artificial Intelligence, said in an interview that, regardless of the reasons, Meta is gathering far too much data through its tools.</p><p>\\\n“Even if this is accidental still on the part of the developers, you shouldn’t still be able to fall into this trap,” she said. “The time has long passed when you can use that excuse.”</p><h2>The Pixel and Sensitive Data</h2><p>Meta, Facebook’s parent company, offers the pixel as a way to track visitors on the web and to more precisely target ads to those visitors on Facebook. For businesses and other organizations, it’s a valuable tool: A small company can advertise on Facebook directly to people who purchased a certain product, for example, or a nonprofit could follow up on Facebook with users who donated on their last visit to a website.</p><p>\\\nOne organization, the Minnesota-based <a href=\"https://www.gtcuw.org/\">Greater Twin Cities United Way</a>, said it did not use its website to reach out to potential 988 callers but instead focused on “donors and other organizational stakeholders.” Sam Daub, integrated marketing manager of the organization, said in an emailed statement that the organization uses tools like the pixel “to facilitate conversion-tracking and content retargeting toward users who visit our website” to reach those people but did not track specific activity of 988&nbsp;callers.</p><p>\\\nApart from encouraging users to buy ads, this sort of data is also potentially valuable to Meta, which, in accordance with its <a href=\"https://www.facebook.com/legal/businesstech?paipv=0&amp;eav=AfbuZ37crE7L3iqd_RlDFt27pwm8_MMyxDagLYC8UKU13TEBSzOoMIQ7oSmxJ0ZMfTg&amp;_rdr\">terms of service</a>, can use the information to power its algorithms. The company reserves the right to use data transmitted through the pixel to, for instance, “personalize the features and content (including ads and recommendations) that we show people on and off our Meta Products.” (This is one of the reasons an online shopper might look at a pair of pants online and suddenly see the same pair follow them in advertisements across social media.)</p><p>\\\nThe pixel has proved massively popular. The company <a href=\"https://www.commerce.senate.gov/services/files/9d8e069d-2670-4530-bcdc-d3a63a8831c4\">told Congress in 2018</a> that there were more than two million pixels collecting data across the web, a number that has likely increased in the time since. There is no federal privacy legislation in the United States that regulates how most of that data can be used.</p><p>\\\nMeta’s policies prohibit organizations from sending sensitive information through the pixel on children under 13, or generally any data related to sensitive financial or health matters. The company says it has an automated system “designed to filter out potentially sensitive data that it detects” but that it is advertisers’ responsibility to “ensure that their integrations do not send sensitive information to Meta.”</p><p>\\\nThe types of sensitive health information Meta <a href=\"https://www.facebook.com/business/help/361948878201809?id=188852726110565\">specifically prohibits</a> being sent include information on “mental health and psychological states” as well as “physical locations that identify a health condition, or places of treatment/counseling.” Vazquez did not directly respond to a question about whether the data sent from the crisis centers violated Meta’s policies.</p><p>\\\nThere is evidence that even Meta itself can’t always say where that data ends up. In <a href=\"https://www.vice.com/en/article/akvmke/facebook-doesnt-know-what-it-does-with-your-data-or-where-it-goes\">a leaked document</a> obtained and published by Vice’s Motherboard, company engineers said they did not “have an adequate level of control and explainability over how our systems use data.” The document compared user data to a bottle of ink spilled into a body of water that then becomes unrecoverable.&nbsp;</p><p>\\\nA Facebook spokesperson responded to the report at the time, saying it left out a number of the company’s “extensive processes and controls to comply with privacy regulations,” though the spokesperson did not give any specifics. “It’s simply inaccurate to conclude that it demonstrates non-compliance,” the spokesperson said.</p><p>\\\n“The original use cases [for the pixel] perhaps weren’t quite so invasive, or people weren’t using it so widely,” King said but added that, at this point, Meta is “clearly grabbing way too much data.”</p><h2>988 History and&nbsp;Controversy</h2><p>The national 988 crisis line is the result of a years-long effort by the Federal Communications Commission to provide a simple, easy-to-remember, three-digit number for people experiencing a mental health crisis.</p><p>\\\nBut the launch of 988 has been accompanied by questions about privacy and anonymity, mostly around how or whether callers to the line can ever be tracked by emergency services. The national line is advertised as an anonymous service, but in the past callers have said they’ve been tracked without their consent when calling crisis lines. Police have sometimes responded directly in those incidents, <a href=\"https://www.madinamerica.com/2020/11/suicide-hotlines-trace-your-call/\">leading to harrowing incidents</a>.</p><p>\\\nThe current 988 line doesn’t track users through geolocation technology, <a href=\"https://apnews.com/article/fact-check-988-geolocation-authorities-967858057668\">according to the service</a>, although counselors are required to provide information to emergency services like 911 in certain situations. That requirement has been the source of controversy, and groups like the Trans Lifeline, a nonprofit crisis hotline serving the trans community, stepped away from the network.</p><p>\\\nThe organization has launched a campaign to bring the issue more prominence. Yana Calou, the director of advocacy at <a href=\"https://translifeline.org/\">Trans Lifeline</a>, told The Markup in an interview that there are some lines that “really explicitly don’t” track, and the campaign is meant to direct people to those lines instead. (Trans Lifeline, which is not involved in the national 988 network, also uses the Meta Pixel on its site. After being alerted by The Markup, a Trans Lifeline spokesperson, Nemu HJ, said they would remove the code from the site.)</p><p>\\\nData-sharing practices have landed other service providers in controversy as well. Last year, <a href=\"https://www.politico.com/news/2022/01/28/suicide-hotline-silicon-valley-privacy-debates-00002617\">Politico reported</a> that the nonprofit <a href=\"https://www.crisistextline.org/\">Crisis Text Line</a>, a popular mental health service, was partnering with a for-profit spinoff that used data gleaned from text conversations to market customer-service software. The organization <a href=\"https://www.politico.com/news/2022/01/31/crisis-text-line-ends-data-sharing-00004001\">quickly ended</a> the partnership after it was publicly revealed.</p><p>\\\nHaving a space where there’s a sense of trust between a caller and an organization can make all the difference in an intervention, Calou said. “Actually being able to have people tell us the truth about what’s going on lets people feel like they can get support,” they said.</p><p>This story has been updated to include a Facebook response last year to the linked Motherboard article.</p><h3>Updates: June 13, 2023; June 20, 2023</h3><p>This story was updated on June 13 to note that Contra Costa Crisis Center removed the pixel from its site after publication. It was updated on June 20 to add a comment from Volunteers of American Western Washington received after publication noting that that organization has since removed the pixel from its site.</p>","contentLength":14907,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"From recruiting for Palantir to landing a plane on Highway 85: meet defense tech’s wildest power broker","url":"https://techcrunch.com/2025/01/19/from-recruiting-for-palantir-to-landing-on-highway-85-meet-defense-techs-wildest-power-broker/","date":1737320400,"author":"Margaux MacColl","guid":219,"unread":true,"content":"<p>Peter Conway has recruited for some of the buzziest defense and hard tech firms in Silicon Valley over the last decade, like Palantir and Mach Industries.</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":217,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI benchmarking organization criticized for waiting to disclose funding from OpenAI","url":"https://techcrunch.com/2025/01/19/ai-benchmarking-organization-criticized-for-waiting-to-disclose-funding-from-openai/","date":1737316707,"author":"Kyle Wiggers","guid":218,"unread":true,"content":"<p>An organization developing math benchmarks for AI didn’t disclose that it had received funding from OpenAI until relatively recently, drawing allegations of impropriety from some in the AI community. Epoch AI, a nonprofit primarily funded by Open Philanthropy, a research and grantmaking foundation, revealed on December 20 that OpenAI had supported the creation of FrontierMath. […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":450,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"What Kind of Skills Are Required to Become a Data Analyst?","url":"https://hackernoon.com/what-kind-of-skills-are-required-to-become-a-data-analyst?source=rss","date":1737315002,"author":"Azize Sultan Palali","guid":279,"unread":true,"content":"<p>\\\nNothing is impossible! Just plan what you will do with the right strategy. I am an interior architecture graduate and currently working as a Data Analyst Lead in one of Turkey's largest e-commerce companies.</p><p>\\\nI’ve been asked this question a lot lately: <strong>“How can I become a Data Analyst?”</strong> Many people want to start but don’t know where to begin. In this article, I want to share a heartfelt guide, highlighting that becoming a Data Analyst isn’t just about learning technical skills, it’s about adopting the right mindset and what I did to focus during this process. If you’re ready to dive into this field, here’s a step-by-step roadmap for your journey.</p><h2>Ask Yourself: Why Do You Want to Be a Data Analyst?</h2><p>Like any profession, being a Data Analyst comes with its challenges and responsibilities. Before starting this journey, take a moment to reflect:</p><ul><li>Do you genuinely enjoy working with data? 🤓</li></ul><ul><li>Does solving problems excite you? 🤩</li></ul><ul><li>Are you passionate about finding stories hidden in numbers and sharing them with others? 🧐</li></ul><p>\\\nIf your answer is “yes,” you’re off to a great start. This isn’t just a job: it’s a way of thinking, a curiosity-driven mindset.</p><p>At its core, being a Data Analyst requires technical tools, but don’t let that intimidate you. These skills can be learned with time and practice. </p><p>\\\nHere are the essentials:</p><ul><li> This is where most analysts begin. It might seem basic, but it’s powerful when mastered.</li></ul><ul><li> The key to accessing and managing data. Without SQL, reaching the data you need can be a challenge.</li></ul><ul><li> These programming languages allow for deeper analysis and automation of repetitive tasks.</li></ul><ul><li><strong>Data Visualization Tools:</strong> Turning data into visual insights is crucial for telling stories.</li></ul><p>\\\nThe good news? All of these skills are learnable. You don’t have to master everything at once start with one and build gradually.</p><h2><strong>Think Beyond the Technical: A Data Analyst’s Mindset</strong></h2><p>Becoming a great Data Analyst isn’t just about crunching numbers. It’s about  and  your findings. Here are the key non-technical skills to focus on:</p><ul><li> Learn to break down complex problems into manageable steps. Think of data as a puzzle and develop a structured approach to solving it.</li></ul><ul><li><strong>Understanding the End User:</strong> Always consider who you’re analyzing the data for. What do they care about? What problems are they trying to solve? Tailor your insights accordingly.</li></ul><ul><li> As an analyst, you’re the bridge between technical teams and non-technical stakeholders. Your ability to explain complex findings in simple terms can make all the difference.</li></ul><ul><li><strong>Defining the Problem Clearly:</strong> A well-defined problem is already half-solved. Before jumping into analysis, ask the right questions to clarify the scope and purpose of your work.</li></ul><h2><strong>Learn by Doing: Start Small Projects</strong></h2><p>The best way to learn is through hands-on experience. You don’t need to wait for a formal job to start practicing. Here are some ideas:</p><ul><li>Explore free datasets on platforms like Kaggle or public data portals and create your own reports.</li></ul><ul><li>Try to understand which metrics they paid attention to in the shared reports and how they calculated them.</li></ul><ul><li>Analyze your personal expenses to uncover spending patterns.</li></ul><blockquote><p><strong>Additionally, you may try tools like  for practicing SQL on real world big data without worrying about costs.</strong></p><p><strong>You may use free version of Datastudio for visulisation .</strong></p><p><strong>Every project, no matter how small, builds your confidence and portfolio.</strong></p></blockquote><h2><strong>Build Your Network and Showcase Your Skills</strong></h2><p>Once you’ve developed some foundational skills, it’s time to put yourself out there.</p><p>\\\nNetworking platforms like LinkedIn, online communities, and local meetups can help you connect with others in the field.</p><p>\\\nDon't be afraid to share what you have learned with people, remember that everyone has something to learn from everyone else. Even if this information seems easy and simple to you after you learn it, there will always be people who don't know what you know.</p><p>\\\nCreate a portfolio showcasing your projects. It doesn’t have to be perfect, just authentic.</p><p>\\\nRemember, your first job might not be your dream job, but it’s a stepping stone.</p><h2><strong>Your Unique Story Matters</strong></h2><p>Every Data Analyst has a different journey. Some come from engineering, others from art or business backgrounds. The beauty of this field is that your unique perspective adds value. Don’t compare yourself to others, focus on your growth and your path.</p><p>Becoming a Data Analyst is a journey filled with learning and growth. It’s about more than just mastering tools; it’s about developing a mindset that combines curiosity, problem-solving, and storytelling.</p><p>\\\nIf this article inspires even one person to take the first step, I’ll consider it a success. Remember: every great journey begins with a single step. </p><p>\\\nStart where you are, and trust that you’ll grow along the way.</p><p>\\\nGood luck on your journey, you’ve got this! 😊</p><p>\\\n<strong>Thank you for your time; sharing is caring! 🌍</strong></p>","contentLength":4914,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"RedNote Scrambles to Hire English-Speaking Content Moderators","url":"https://yro.slashdot.org/story/25/01/19/0127205/rednote-scrambles-to-hire-english-speaking-content-moderators?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737315000,"author":"EditorDavid","guid":231,"unread":true,"content":"ABC News reported that the official newspaper of China's communist party is claiming TikTok refugees on RedNote found a \"new home,\" and \"openness, communication, and mutual learning are... the heartfelt desires of people from all countries.\" \n\nBut in fact, Wired reports, \"China's Cyberspace Administration, the country's top internet watchdog, has reportedly already grown concerned about content being shared by foreigners on Xiaohongshu,\" and \"warned the platform earlier this week to 'ensure China-based users can't see posts from U.S. users,' according to The Information.\" \n\nAnd that's just the beginning. Wired reports that RedNote is now also \"scrambling to hire English-speaking moderators.\"\n\nSocial media platforms in China are legally required to remove a wide range of content, including nudity and graphic violence, but especially information that the government deems politically sensitive... \"RedNote — like all platforms owned by Chinese companies — is subject to the Chinese Communist Party's repressive laws,\" wrote Allie Funk, research director for technology and democracy at the nonprofit human rights organization Freedom House, in an email to WIRED. \"Independent researchers have documented how keywords deemed sensitive to those in power, such as discussion of labor strikes or criticism of Xi Jinping, can be scrubbed from the platform.\" \n\nBut the influx of American TikTok users — as many as 700,000 in merely two days, according to Reuters — could be stretching Xiaohongshu's content moderation abilities thin, says Eric Liu, an editor at China Digital Times, a California-based publication documenting censorship in China, who also used to work as a content moderator himself for the Chinese social media platform Weibo... Liu reposted a screenshot on Bluesky showing that some people who recently joined Xiaohongshu have received notifications that their posts can only be shown to other users after 48 hours, seemingly giving the company time to determine whether they may be violating any of the platform's rules. This is a sign that Xiaohongshu's moderation teams are unable to react swiftly, Liu says... \n\nWhile the majority of the new TikTok refugees still appear to be enjoying their time on Xiaohongshu, some have already had their posts censored. Christine Lu, a Taiwanese-American tech entrepreneur who created a Xiaohongshu account on Wednesday, says she was suspended after uploading three provocative posts about Tiananmen, Tibet, and Taiwan. \"I support more [Chinese and American] people engaging directly. But also, knowing China, I knew it wouldn't last for long,\" Lu tells WIRED. \n\nDespite the 700,000 signups in two days, \"It's also worth nothing that the migration to RedNote is still very small, and only a fraction of the 170 million people in the US who use TikTok,\" notes The Conversation. (And they add that \"The US government also has the authority to pressure Apple to remove RedNote from the US App Store if it thinks the migration poses a national security threat.\") \n\nOne nurse told the Los Angeles Times Americans signed up for the app because they \"just don't want to give in\" to \"bullying\" by the U.S. government. (The Times notes she later recorded a video acknowledging that on the Chinese-language app, \"I don't know what I'm doing, I don't know what I'm reading, I'm just pressing buttons.\")\n\nOn Tuesday, the Wall Street Journal reported that Chinese officials had discussed the possibility of selling TikTok to a trusted non-Chinese party such as Elon Musk, who already owns social media platform X. However, analysts said that Bytedance is unlikely to agree to a sale of the underlying algorithm that powers the app, meaning the platform under a new owner could still look drastically different.\n","contentLength":3770,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Pentagon says AI is speeding up its ‘kill chain’","url":"https://techcrunch.com/2025/01/19/the-pentagon-says-ai-is-speeding-up-its-kill-chain/","date":1737315000,"author":"Maxwell Zeff","guid":217,"unread":true,"content":"<p>Leading AI developers, such as OpenAI and Anthropic, are threading a delicate needle to sell software to the United States military: make the Pentagon more efficient, without letting their AI kill people. Today, their tools are not being used as weapons, but AI is giving the Department of Defense a “significant advantage” in identifying, tracking, […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":422,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Meta announces a new CapCut rival called Edits","url":"https://techcrunch.com/2025/01/19/meta-announces-a-new-video-editing-app-called-edits-amidst-tiktok-and-capcut-ban/","date":1737314955,"author":"Ivan Mehta","guid":216,"unread":true,"content":"<p>Meta Sunday announced a new video editing app called Edits, after ByteDance’s video editing app CapCut was removed from Apple’s App Store and the Google Play Store as part of the TikTok ban. Instagram head Adam Mosseri (pictured above) said on Threads that the app will launch next month on iOS, with an Android version […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":392,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"IEEE Power & Energy Society Boosts Scholarship to $10,000","url":"https://spectrum.ieee.org/ieee-students","date":1737313203,"author":"Amanda Davis","guid":81,"unread":true,"content":"<p>Students pursuing degrees in any IEEE field of interest are eligible</p>","contentLength":68,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTY0NDUwMi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc2OTIyNTIzN30.xx_sk0GoPMjCaR1LpmRzMGpzXnP8Pcqans2_H_Fys98/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"How I Solved the WebSocket Scaling Problem Without Breaking the Bank","url":"https://hackernoon.com/how-i-solved-the-websocket-scaling-problem-without-breaking-the-bank?source=rss","date":1737313202,"author":"Kamil Fronczak","guid":278,"unread":true,"content":"<p>A long time ago, I found myself in a situation where I had to create a scalable system that could be capable of handling hundreds of simultaneous connections at not very high cost, and with reasonable, but not instant time of response.</p><p>\\\nMy first thoughts? Let's move all create/edit/delete actions to the queue and notify users if their actions succeeded or not via WebSocket.</p><p>\\\nBut back then, I hadn't much experience with WebSockets in production, so my first step was to investigate how it works with the help of tutorials, stack overflow, and other sources.</p><p>\\\nSo, after some time, I got a gist of how it should work and started to prepare a code and mess around for a while with a load tests tool to simulate high traffic.</p><p>Some questions and answers suggested calling the subscribe method on the Redis instance on the connected WebSocket client.</p><pre><code>io.sockets.on('connection', function (sockets) {\n    sockets.emit('message',{Hello: 'World!'});\n    sub.subscribe('attack-map-production');\n\n    sockets.on('disconnect', function() {\n            sub.unsubscribe('attack-map-production');\n    });\n});\n</code></pre><p>\\\nBut in this way, we are creating a new connection to Redis, so the memory usage in our application and Redis connection pool are rising. (Redis allows only 10k connections to one instance)</p><p>\\\nThat was a big no for me because I had to lower memory usage to a minimum.</p><p>\\\nRight now, many articles, fortunately, mention that you should not create a new Redis connection on each WebSocket client.</p><p>After creating a big chunk of business code, when I started the part with web sockets, a question popped into my mind - how to create them in a proper and safe way?</p><p>\\\nI already had some events in the system, and some of them were ready to be additionally published via WebSockets, the rest of them were meant to stay inside the system.</p><p>\\\nMy gold promise was that I wouldn't have to change code drastically and still be able to send only selected events to websocket clients.</p><p>\\\nThat's why, at first, I created a Redis pub-sub module, as I thought that my events, in order to be visible in other instances, have to be transmitted via the Redis pub-sub pattern.</p><p>\\\nDon't feel overwhelmed by looking at the module below, as I will explain details later in a use case</p><pre><code>export const REDIS_PUB_CLIENT = 'REDIS_PUB_CLIENT';\nexport const REDIS_SUB_CLIENT = 'REDIS_SUB_CLIENT';\nexport const REDIS_EVENT_PUB_SUB_REGISTER_EVENT_OPTIONS =\n  'REDIS_EVENT_PUB_SUB_REGISTER_EVENT_OPTIONS';\n\n@Module({\n  providers: [\n    {\n      provide: REDIS_EVENT_PUB_SUB_REGISTER_EVENT_OPTIONS,\n      useFactory: (options: RedisEventPubSubModuleOptions) =&gt; options,\n      inject: [MODULE_OPTIONS_TOKEN],\n    },\n    {\n      provide: REDIS_PUB_CLIENT,\n      useFactory: async (options: RedisEventPubSubModuleOptions) =&gt; {\n        const client = createClient({\n          url: `redis://${options.host}:${options.port}`,\n        });\n        client.on('error', (err) =&gt; console.error('Redis Client Error', err));\n        await client.connect();\n        return client;\n      },\n      inject: [MODULE_OPTIONS_TOKEN],\n    },\n    {\n      provide: EVENT_EMITTER_TOKEN,\n      useFactory: (\n        redisPubClient: RedisClientType,\n        eventEmitter: EventEmitter2,\n      ) =&gt; {\n        return new RedisEventEmitter(redisPubClient, eventEmitter);\n      },\n      inject: [REDIS_PUB_CLIENT, EventEmitter2],\n    },\n    {\n      provide: EVENT_SUBSCRIBER_TOKEN,\n      useFactory: (eventEmitterSub: EventEmitter2) =&gt; {\n        return new EventEmitter2EventSubscriber(eventEmitterSub);\n      },\n      inject: [EventEmitter2],\n    },\n  ],\n  exports: [\n    REDIS_PUB_CLIENT,\n    EVENT_EMITTER_TOKEN,\n    EVENT_SUBSCRIBER_TOKEN,\n    REDIS_EVENT_PUB_SUB_REGISTER_EVENT_OPTIONS,\n  ],\n})\nexport class RedisEventPubSubModule extends ConfigurableModuleClass {\n  static registerEvents(eventsPublishableNames: string[]): DynamicModule {\n    return {\n      module: class {},\n      providers: [\n        {\n          provide: REDIS_SUB_CLIENT,\n          useFactory: async (\n            options: RedisEventPubSubModuleOptions,\n            eventEmitter: EventEmitter2,\n          ) =&gt; {\n            const client = createClient({\n              url: `redis://${options.host}:${options.port}`,\n            });\n            client.on('error', (err) =&gt;\n              console.error('Redis Client Error', err),\n            );\n            await client.connect();\n            for (const eventPublishableName of eventsPublishableNames) {\n              await client.subscribe(eventPublishableName, (message) =&gt; {\n                const normalizedMessage = JSON.parse(\n                  message,\n                ) as PublishableEventInterface;\n                delete (\n                  normalizedMessage as Writeable&lt;PublishableEventInterface&gt;\n                ).publishableEventName;\n                eventEmitter.emit(eventPublishableName, normalizedMessage);\n              });\n            }\n            return client;\n          },\n          inject: [REDIS_EVENT_PUB_SUB_REGISTER_EVENT_OPTIONS, EventEmitter2],\n        },\n      ],\n    };\n  }\n}\n</code></pre><p>\\\nThis module takes care of creating/exposing a Pub Redis client and exposing an additional method - registerEvents, which is responsible for listening for given events on Redis pub-sub and re-emitting them via event emitter.</p><p>\\\nIt may be a little foggy for now. Why re-emitting events? Why do we need to register for those events? What are   and  and why do we have to export them?</p><p>\\\nIt will be more clear with real-life usage, so let's create a use case - chat messages. We want to be able to send messages via HTTP POST and receive them via WebSocket on the front end.</p><pre><code>@Module({\n  imports: [],\n  controllers: [],\n  providers: [],\n})\nexport class UserChatModule {}\n</code></pre><p>\\\nAnd an event that this module will be emitting after receiving a POST request</p><pre><code>export class NewMessageEvent {\n  constructor(public readonly message: string) {}\n}\n</code></pre><p>\\\nIn the controller, we have to make it possible to emit events both for our system and the Redis pub queue. We will use wrapped </p><pre><code>export const EVENT_EMITTER_TOKEN = 'EVENT_EMITTER_TOKEN';\n\nexport class RedisEventEmitter implements EventEmitterInterface {\n  constructor(\n    private redisPubClient: RedisClientType,\n    private eventEmitter: EventEmitter2,\n  ) {}\n\n  async emit(eventName: string, payload: Record&lt;any, any&gt;): Promise&lt;void&gt; {\n    this.eventEmitter.emit(eventName, payload);\n\n    if (this.isPublishableEvent(payload)) {\n      await this.redisPubClient.publish(\n        payload.publishableEventName,\n        JSON.stringify(payload),\n      );\n    }\n  }\n\n  private isPublishableEvent(event: any): event is PublishableEventInterface {\n    return event.publishableEventName !== undefined;\n  }\n}\n</code></pre><p>\\\nAnd then, we are able to use it in our controller</p><pre><code>@Controller('messages')\nexport class SendMessageAction {\n  constructor(\n    // Previously eventEmitter2\n    @Inject(EVENT_EMITTER_TOKEN)\n    private readonly eventEmitter: EventEmitterInterface,\n  ) {}\n\n  @Post()\n  async handle(@Body() request: SendMessageHttpRequest) {\n    await this.eventEmitter.emit(\n      NewMessageEvent.name,\n      new NewMessageEvent(request.content),\n    );\n  }\n}\n</code></pre><p>\\\nBut before that, we have to enhance our event with PublishableEventInterface in order to allow RedisEventEmitter to catch our event and emit it in the Redis pub queue.</p><pre><code>export class NewMessageEvent implements PublishableEventInterface {\n  static publishableEventName = 'events:new-message';\n\n  publishableEventName = NewMessageEvent.publishableEventName;\n\n  constructor(public readonly message: string) {}\n}\n</code></pre><p>\\\nGreat, we are now sending our events like we used to, but now, if they are marked as publishable, they will land in the Redis pub queue.</p><p>But now, we need to make it possible to receive those events on WebSocket, right?</p><p>So, let's take a look at our user chat module</p><pre><code>@Module({\n  imports: [\n    RedisEventPubSubModule.registerEvents([\n      NewMessageEvent.publishableEventName,\n    ]),\n  ],\n  controllers: [SendMessageAction],\n  providers: [],\n})\nexport class UserChatModule {}\n</code></pre><p>\\\nAs you can see, we used the method mentioned earlier - registerEvents.</p><p>Thanks to that method, we told RedisEventPubSubModule that it should listen for our NewMessageEvent event in the Redis pub-sub queue on the publishableEventName attribute.</p><p>\\\nSo, if any NewMessageEvent event occurs, then it will be re-emitted as a normal NewMessageEvent event, but under the publishableEventName attribute.</p><p>\\\nIt's worth mentioning, that it will work on 1 instance or 1,000 instances. So even if we scale to a high number of instances, each of them will receive this and re-emit this event inside the system.</p><p>\\\nSo, now we have abilities to emit events and listen for them. Now we need to deliver them to our websocket clients.</p><p>Let's take a look at Websocket Gateway</p><pre><code>export enum WebsocketEventSubscribeList {\n  FETCH_EVENTS_MESSAGES = 'fetch-events-messages',\n  EVENTS_MESSAGES_STREAM = 'events-messages-stream',\n}\n\n@WebSocketGateway({\n  pingInterval: 30000,\n  pingTimeout: 5000,\n  cors: {\n    origin: '*',\n  },\n})\nexport class MessagesWebsocketGateway {\n  constructor(\n    @Inject(EVENT_SUBSCRIBER_TOKEN)\n    private eventSubscriber: EventSubscriberInterface,\n  ) {}\n\n  @SubscribeMessage(WebsocketEventSubscribeList.FETCH_EVENTS_MESSAGES)\n  async streamMessagesData(@ConnectedSocket() client: any) {\n    const stream$ = this.createWebsocketStreamFromEventFactory(\n      client,\n      this.eventSubscriber,\n      NewMessageEvent.publishableEventName,\n    );\n\n    const event = WebsocketEventSubscribeList.EVENTS_MESSAGES_STREAM;\n    return from(stream$).pipe(map((data) =&gt; ({ event, data })));\n  }\n\n  private createWebsocketStreamFromEventFactory(\n    client: any,\n    eventSubscriber: EventSubscriberInterface,\n    eventName: string,\n  ): Observable&lt;any&gt; {\n    return new Observable((observer) =&gt; {\n      const dynamicListener = (message: PublishableEventInterface) =&gt; {\n        observer.next(message);\n      };\n\n      eventSubscriber.on(eventName, dynamicListener);\n\n      client.on('disconnect', () =&gt; {\n        eventSubscriber.off(eventName, dynamicListener);\n      });\n    });\n  }\n}\n</code></pre><p>\\\nSo there is a thing, in the constructor, we have EVENTTOKEN, which type is EventSubscriberInterface. But what it really does? This is how it looks under the hood</p><pre><code>export class EventEmitter2EventSubscriber implements EventSubscriberInterface {\n  constructor(private eventEmitter: EventEmitter2) {}\n\n  on(name: string, listener: any): void {\n    this.eventEmitter.on(name, listener);\n  }\n\n  off(name: string, listener: any): void {\n    this.eventEmitter.removeListener(name, listener);\n  }\n}\n</code></pre><p>\\\nIt's just a wrapper for EventEmitter2, that we are using in the method createWebsocketStreamFromEventFactory</p><pre><code> private createWebsocketStreamFromEventFactory(\n    client: any,\n    eventSubscriber: EventSubscriberInterface,\n    eventName: string,\n  ): Observable&lt;any&gt; {\n    return new Observable((observer) =&gt; {\n      const dynamicListener = (message: PublishableEventInterface) =&gt; {\n        observer.next(message);\n      };\n\n      eventSubscriber.on(eventName, dynamicListener);\n\n      client.on('disconnect', () =&gt; {\n        eventSubscriber.off(eventName, dynamicListener);\n      });\n    });\n  }\n}\n</code></pre><p>\\\nWe are using this wrapped EventEmitter2 to create dynamic listeners on publishableName when websocket clients connect and remove on disconnect.</p><p>\\\nThen, we are doing nothing more than creating rxjs stream to keep the websocket connection and send messages from the listener via observer.next(message); when a new message occurs.</p><p>How this event will reach our listeners?</p><p>\\\nIf you return to the first snippet of code, our Redis pub sub module, then you can spot this in the registerEvents method</p><pre><code> for (const eventPublishableName of eventsPublishableNames) {\n              await client.subscribe(eventPublishableName, (message) =&gt; {\n                const normalizedMessage = JSON.parse(\n                  message,\n                ) as PublishableEventInterface;\n                delete (\n                  normalizedMessage as Writeable&lt;PublishableEventInterface&gt;\n                ).publishableEventName;\n                eventEmitter.emit(eventPublishableName, normalizedMessage);\n              });\n</code></pre><p>\\\nWhich basically listens for events on the pub queue, and then re-emit them via the event emitter.</p><p>\\\nSo, let's sum up what we have done here</p><ul><li><p>We are still using our events in the system like we used to via EventEmitter2, but if we want to publish to our connected websocket clients, then all we have to do is implement PublishableInterface</p></li><li><p>We are not creating new Redis connections on each connected websocket client</p></li><li><p>We can scale up our system to X instances and it will still behave in the same way - each connected client will get a copy of the event via websocket, no matter to which instance they will be connected</p></li></ul>","contentLength":12758,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How Gamekins Integrates Gamification into Continuous Integration for Better Testing","url":"https://hackernoon.com/how-gamekins-integrates-gamification-into-continuous-integration-for-better-testing?source=rss","date":1737313024,"author":"Gamifications FTW Publications","guid":277,"unread":true,"content":"<h2>3.2 Gamification Elements of Gamekins</h2><p>We aim to improve testing courses by incentivizing students to test more and better using the CI system underlying their coding tasks. For this, we developed a tool, Gamekins [47] [2], which incorporates gamification elements into CI based on static code, coverage, and mutation analysis. The combination of underlying quality metrics is intended to shift the students’ focus away from solely relying on one metric. To enforce better commit and testing behavior, Gamekins provides gamification elements only after new commits.</p><p>\\\nThe general workflow of Gamekins is as follows[3]: Developers commit code changes to a version control system, which triggers a job in the Jenkins CI environment. Jenkins executes a build job, which includes running the project’s tests, and then invokes Gamekins. Gamekins utilizes information from the run and the version control system to update and generate challenges, quests, achievements, and the leaderboard.</p><p>\\\n. Gamekins offers a variety of seven distinct challenge types, each designed to provide developers with specific test and quality-related tasks to complete:[3]</p><p>\\\n This challenge requires developers to resolve a build failure. To prevent misuse of Gamekins by repeatedly breaking and fixing the build for points, this challenge is generated only once per week.</p><p>\\\n This generic challenge requires developers to write at least one additional test without specifying the specific code area to target.</p><p>\\\n<em>• Class Coverage Challenge:</em> This challenge type focuses on increasing code coverage for a selected Java class.</p><p>\\\n<em>• Method Coverage Challenge:</em> This challenge focuses on improving the coverage of a specific target method.</p><p>\\\n<em>• Line Coverage Challenge:</em> This challenge focuses on improving the coverage of a specific line of code that is not fully covered. The task is to either cover or increase the branch coverage of the line. • Mutation Challenge: This challenge focuses on detecting a specific mutant by adding or improving a test, and therefore goes beyond a simple check of the robustness of the test suite to closing test gaps [38]. The mutants are generated with PIT[4], a popular mutation testing tool for Java.</p><p>\\\n This challenge involves analyzing a target class using SonarLint[5], a code quality tool. The challenge is to choose one of the detected smells in either the source or test files and remove it.</p><p>\\\nIn order to generate new challenges, Gamekins ensures that there is always a (configurable) fixed number of current challenges. When generating a new challenge, Gamekins only considers recently changed classes based on the commit history. This ensures that the challenge is relevant to the functionality currently considered by the developer. To generate a challenge, Gamekins first ranks all classes in the project under test based on the current code coverage, then probabilistically selects a class for the challenge, giving higher chances to classes with lower coverage; finally, a challenge type is randomly selected, and a random instance for this type is generated.</p><p>\\\nIf a developer already has open challenges, Gamekins checks if these challenges have been solved. If they have been solved, Gamekins will generate new challenges to replace them. Additionally, Gamekins also checks if all currently open challenges are still applicable, for example by verifying if the specific code fragment for a challenge has not been deleted. To keep developers informed, all current challenges are displayed on a dedicated page in Jenkins, which provides an overview of open challenges and their status (Fig. 1). Clicking on a challenge provides additional information, including the code snippet mentioned in the challenge description, as well as an explanation of what needs to be done. This information is particularly important for Mutation Challenges, where both the modified source code and the original code are shown.</p><p>\\\nTo remove a current challenge from the list, participants can click on the Reject button. When rejecting a challenge, participants are required to provide a reason, which aims to limit rejections and helps to improve Gamekins. Some possible reasons for rejecting a challenge include cases where the challenge is unnecessary due to defensive programming or when reported code smells are intentionally present in the code. In some cases, challenges may be</p><p>\\\nautomatically rejected if, for example, the target line or class has been removed. If a Class Coverage Challenge is rejected, this will block the future generation of any challenges in the class that the rejected challenge was targeting. However, this can be undone in the list of rejected challenges if necessary.</p><p>\\\n Quests are a way to group multiple challenges together. They consist of a series of individual challenges that need to be solved one after the other. In a quest, only the current challenge that needs to be solved next is enabled and can be expanded to show more details (Fig. 2). The successive challenges in the quest are disabled and cannot be viewed until it is their turn to be solved. To earn points for a quest, all steps must be solved in succession. Gamekins supports a total of nine different types of quests3].</p><p>\\\nQuests are created by checking the prerequisites of potential quests, such as ensuring that a sufficient number of required challenges can be generated. One quest is then randomly chosen from the available options. The individual steps or challenges within a quest are generated as if they were standalone challenges but with predetermined classes based on the quest type. Participants have the option to reject quests, or quests can be automatically rejected by Gamekins if at least one of the challenges within the quest becomes unsolvable. In this case, participants will receive points for the challenges they have already solved within the quest, but not for the steps themselves.</p><p>\\\n By completing challenges and quests, users earn points, and their point rankings are displayed on a leaderboard in Jenkins. The leaderboard not only shows the points but also the total number of completed challenges and achievements, fostering competition. Participants can personalize their experience by selecting one of the 50 avatars to be displayed on the leaderboard.</p><p>\\\n\\\n3.2.4 Achievements. Developers are rewarded for their test achievements, which are based on specific behaviors or actions they perform, regardless of specific challenges. These achievements have</p><p>\\\nvarying difficulty, ranging from easy tasks, like having a test in a project, to more challenging ones, like achieving 100 % coverage. Currently, Gamekins implements 63 achievements, and developers can view obtained and open achievements (Fig. 4). Some achievements are kept secret and are only revealed once they are completed.</p><h2>3.3 Gamified Elements and the Testing Curriculum</h2><p>Besides offering general incentives, the integration of Gamekins into coursework allows to address several learning objectives outlined in the Curriculum Guidelines for Undergraduate Degree Programs in Software Engineering [2], such as:</p><p>\\\n• Static analysis (VAV.rev.3) and refactoring (PRO.evo.3), e.g., with Smell Challenges</p><p>\\\n• Unit (VAV.tst.1) and integration (VAV.tst.5) testing with Challenges and Quests</p><p>\\\n• Testing edge cases and boundary conditions with Mutation Challenges (VAV.tst.2) • Coverage analysis with Coverage Challenges (VAV.tst.3)</p><p>\\\n• Regression testing (VAV.tst.10), testing tools and automation (VAV.tst.11) with Gamekins as CI plugin</p><p>\\\n• Build processes (PRO.cm.4) and analyzing failure reports (VAV.par.1) with Gamekins as CI plugin</p><p>[2] Available at https://gamekins.org</p><p>\\\n[3] Detailed information can be found in [47]</p><p>\\\n[4] https://pitest.org/</p><p>\\\n[5] https://www.sonarlint.org/</p><p>(1) Philipp Straubinger, University of Passau, Germany;</p><p>(2) Gordon Fraser, University of Passau, Germany.</p>","contentLength":7862,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How to Gamify Continuous Integration","url":"https://hackernoon.com/how-to-gamify-continuous-integration?source=rss","date":1737313012,"author":"Gamifications FTW Publications","guid":276,"unread":true,"content":"<h2>3 GAMIFYING CONTINUOUS INTEGRATION</h2><p>Despite its importance, testing is not tightly integrated into most computer science curricula. Very often, it is part of general software engineering courses, where time dedicated to testing tends to be limited [25]. However, dedicated software testing courses are becoming more common. Dedicating an entire course to software testing provides the opportunity to cover many different facets of testing, ranging from testing techniques to automating testing, and also how to firmly integrate testing during software development.</p><h3>3.1 Challenges in Teaching Software Testing</h3><p>At the University of Passau, we established a mandatory undergraduate course on software testing in 2018. Grading is based entirely on coursework, forcing the students to engage practically with testing challenges at different levels. Besides covering the standard portfolio of techniques common in software quality assurance, where testing in practice is often conducted by dedicated software testers, we also aim to cover developer testing, i.e., the tight integration of testing into regular software development activities. Thus, one of the course aims is to establish testing as a routine activity that students perform when developing their own software.</p><p>\\\nHowever, throughout multiple iterations of the course, we observed several issues inhibiting this aim: Students exhibit a lack of motivation to write tests, which results in them writing only the bare minimum number of tests required to meet a certain goal (e.g., if code coverage is required). This also indicates that students tend to overly focus on metrics, in particular code coverage, which is easy to obtain and understand. Further evidence for the lack of engagement can be found in the students’ commit logs: Rather than including tests throughout the process and using fine-grained commits [42], testing is usually conducted as a post-hoc exercise. Anecdotally, we also observed general weaknesses such as hardcoded test data (e.g., paths to test resources) which may not be reflected in the metrics students aim for but suggest a lack of proper engagement with testing. Consequently, there is a need for further incentives to establish testing in regular software development.</p><p>(1) Philipp Straubinger, University of Passau, Germany;</p><p>(2) Gordon Fraser, University of Passau, Germany.</p>","contentLength":2360,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Boosting Developer Engagement in Software Testing with Gamification","url":"https://hackernoon.com/boosting-developer-engagement-in-software-testing-with-gamification?source=rss","date":1737313005,"author":"Gamifications FTW Publications","guid":275,"unread":true,"content":"<p>Software developers have access to various tools and metrics that help them identify how to improve their tests, such as code coverage, which identifies statements, branches, or execution paths that have not been covered by tests. This measurement is achieved by recording the parts of the application that are reached during test execution, resulting in lists of uncovered lines of code, percentages of covered code, and visualizations of the coverage [53]. Mutation analysis [28] assesses the effectiveness of test suites by inserting artificial faults (mutants) into a program and checking whether the tests can detect them and provides guidance on additional tests if not. Static code analysis is used to identify common patterns in the code that may lead to potential bugs. For example, patterns such as code [17] and test [48] smells suggest where code should be refactored or removed by developers to improve code quality.</p><p>\\\nAlthough there are various metrics and tools for software testing, they are often not widely used in an automated manner [6]. Continuous integration (CI) is a common solution to this problem: CI allows developers to automatically execute their tests and calculate metrics such as code coverage after each push to a remote repository [8]. This enables developers to focus on writing code and tests in their IDE, while the CI system performs analyses and provides a summary of findings and uncovered code [44]. The use of CI platforms has been shown to improve productivity and enable faster software releases with higher quality [43, 52].</p><h2>2.2 Gamification of Software Testing</h2><p>The lack of motivation to write tests and to use test automation can at least partially be attributed to the perception of testing as being tedious, stressful, uncreative [30, 49, 50], or not appreciated [13, 14]. Motivation, which is crucial for developer productivity [18–20], can be intrinsic, describing the inner willingness to participate in an activity, or it can refer to an external signal related to a task. Gamification is a way to provide external motivation, and it does so using game design elements within non-game contexts [15]. Gamification has been shown to increase engagement and improve results compared to non-gamified development environments [11, 45]. The most common gamification elements include points, badges, and leaderboards, but other elements such as challenges and achievements are also often applicable [39].</p><p>\\\nIn the context of software testing, gamification has been applied in both professional (e.g., [37, 40]) and educational (e.g., [5, 21, 22, 51]) settings. Previous attempts to gamify software testing education have focused on specific aspects such as mutation testing [21] or security testing [22]. Our aim is orthogonal: Rather than teaching specific test techniques, we aim to get students to integrate testing into their regular software development routine.</p><p>(1) Philipp Straubinger, University of Passau, Germany;</p><p>(2) Gordon Fraser, University of Passau, Germany.</p>","contentLength":3014,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Gamification Makes It Easier to Teach Software Testing – New Study Shows","url":"https://hackernoon.com/gamification-makes-it-easier-to-teach-software-testing-new-study-shows?source=rss","date":1737312998,"author":"Gamifications FTW Publications","guid":274,"unread":true,"content":"<p>(1) Philipp Straubinger, University of Passau, Germany;</p><p>(2) Gordon Fraser, University of Passau, Germany.</p><p>Testing plays a crucial role in software development, and it is essential for software engineering students to receive proper testing education. However, motivating students to write tests and use automated testing during software development can be challenging. To address this issue and enhance student engagement in testing when they write code, we propose to incentivize students to test more by gamifying continuous integration. For this we use Gamekins, a tool that is seamlessly integrated into the Jenkins continuous integration platform and uses game elements based on commits to the source code repository: Developers can earn points by completing test challenges and quests generated by Gamekins, compete with other developers or teams on a leaderboard, and receive achievements for their test-related accomplishments. In this paper, we present our integration of Gamekins into an undergraduate-level course on software testing. We observe a correlation between how students test their code and their use of Gamekins, as well as a significant improvement in the accuracy of their results compared to a previous iteration of the course without gamification. As a further indicator of how this approach improves testing behavior, the students reported enjoyment in writing tests with Gamekins.</p><p>\\\n<strong>• Software and its engineering → Software testing and debugging; • Social and professional topics → Software engineering education</strong></p><p>\\\nSoftware Testing, Gamification, Continuous Integration, Education</p><p>\\\nPhilipp Straubinger and Gordon Fraser. 2024. Gamifying a Software Testing Course with Continuous Integration. In 46th International Conference on Software Engineering: : Software Engineering Education and Training (ICSESEET ’24), April 14–20, 2024, Lisbon, Portugal. ACM, New York, NY, USA, 12 pages. https://doi.org/10.1145/3639474.3640054</p><p>Software testing is a well-established concept and is extensively used in the industry [13]. However, despite the availability of various tools that facilitate the testing process, such as testing support in integrated development environments (IDE) [26] and automated test execution in continuous integration (CI) platforms [8], testing is often overlooked in practice. Speculated reasons for this include developers’ lack of motivation to engage in testing activities and a lack of education in software testing [14, 30, 41, 49, 50]. Although the often inadequate treatment of testing in higher education [41] has recently been countered with a growing recognition of the importance of testing [9, 29, 35], this is nevertheless hampered by learners just like developers tending to perceive testing as tedious and boring [32]. As a result, the industry suffers significant losses due to inadequate software quality and insufficient testing [31].</p><p>\\\nGamification techniques provide an opportunity to motivate students to test despite their perception of it being boring or tedious. Gamification involves incorporating elements commonly found in games, such as leaderboards and achievements, into nongame contexts [15]. It has been demonstrated that this approach helps engage students in software engineering education [24], for example by gamifying lectures or tools to teach software testing [7, 12, 16, 22, 36]. However, in order for students to internalize testing and establish it as an integral part of their development approach, we argue that seamless integration of gamification of testing into the software development process is necessary.</p><p>\\\nIn order to achieve this, we integrate gamification into continuous integration (CI) systems used by students. Specifically, we use Gamekins [47], a plugin designed for the widely used CI platform Jenkins[1], which seamlessly integrates gamification into the software development workflow. By analyzing source code and test results, Gamekins identifies areas where testing can be improved based on code coverage [53] or mutation analysis [28] and then incentivizes improvement using gamification concepts such as challenges and quests, rewarding good testing with points, achievements, and leaderboard rankings. We evaluated the benefits of integrating Gamekins in an undergraduate software testing course, investigating its impact on the course’ learning objectives and student behavior. In detail, the contributions of this paper are as follows:</p><p>\\\n• We propose the use of gamification as a means to incentivize and reward testing activities in CI.</p><p>\\\n• We introduceGamekins as a tool to be used in an undergraduate-level software testing course.</p><p>\\\n• We empirically evaluate the effects of integrating Gamekins into the software testing course, comparing to a previous cohort without gamification and surveying the students.</p><p>\\\nThe results of the study demonstrate a correlation between students’ testing behavior and the use of Gamekins, as well as a significant improvement in correct results compared to the previous edition of the course, where no gamification was used on the same assignments. While not all aspects of Gamekins were universally liked by students, overall, they enjoyed its use throughout the course, confirming that Gamekins is a viable teaching tool.</p><p>[1] https://www.jenkins.io/</p>","contentLength":5316,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"TikTok Goes Offline in US - Then Comes Back Online After Trump Promises 90-Day Reprieve","url":"https://tech.slashdot.org/story/25/01/19/1814232/tiktok-goes-offline-in-us---then-comes-back-online-after-trump-promises-90-day-reprieve?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737310620,"author":"EditorDavid","guid":230,"unread":true,"content":"CNN reports:\n TikTok appears to be coming back online just hours after President-elect Donald Trump pledged Sunday that he would sign an executive order Monday that aims to restore the banned app. Around 12 hours after first shutting itself down, U.S. users began to have access to TikTok on a web browser and in the app, although the page still showed a warning about the shutdown. \n\nThe brief outage was \"the first time in history the U.S. government has outlawed a widely popular social media network,\" reports NPR. Apple and Google removed TikTok from their app stores. (And Apple also removed Lemon8). \n\n\nThe incoming president announced his pending executive order \"in a post on his Truth Social account,\" reports the Associated Press, \"as millions of TikTok users in the U.S. awoke to discover they could no longer access the TikTok app or platform.\" \nBut two Republican Senators said Sunday that the incoming president doesn't have the power to pause the TikTok ban. Tom Cotton of Arkansas and Peter Ricketts of Nebraska posted on X.com that \"Now that the law has taken effect, there's no legal basis for any kind of 'extension' of its effective date. For TikTok to come back online in the future, ByteDance must agree to a sale... severing all ties between TikTok and Communist China. Only then will Americans be protected from the grave threat posted to their privacy and security by a communist-controlled TikTok.\" \n\nThe Associated Press reports that the incoming president offered this rationale for the reprieve in his Truth Social post. \"Americans deserve to see our exciting Inauguration on Monday, as well as other events and conversations.\"\n\nThe law gives the sitting president authority to grant a 90-day extension if a viable sale is underway. Although investors made a few offers, ByteDance previously said it would not sell. In his post on Sunday, Trump said he \"would like the United States to have a 50% ownership position in a joint venture,\" but it was not immediately clear if he was referring to the government or an American company... \n\n\"A law banning TikTok has been enacted in the U.S.,\" a pop-up message informed users who opened the TikTok app and tried to scroll through videos on Saturday night. \"Unfortunately that means you can't use TikTok for now.\" The service interruption TikTok instituted hours earlier caught most users by surprise. Experts had said the law as written did not require TikTok to take down its platform, only for app stores to remove it. Current users had been expected to continue to have access to videos until the app stopped working due to a lack of updates... \"We are fortunate that President Trump has indicated that he will work with us on a solution to reinstate TikTok once he takes office. Please stay tuned,\" read the pop-up message... \n\n\n\n\nApple said the apps would remain on the devices of people who already had them installed, but in-app purchases and new subscriptions no longer were possible and that operating updates to iPhones and iPads might affect the apps' performance. \n\nIn the nine months since Congress passed the sale-or-ban law, no clear buyers emerged, and ByteDance publicly insisted it would not sell TikTok. But Trump said he hoped his administration could facilitate a deal to \"save\" the app. TikTok CEO Shou Chew is expected to attend Trump's inauguration with a prime seating location. Chew posted a video late Saturday thanking Trump for his commitment to work with the company to keep the app available in the U.S. and taking a \"strong stand for the First Amendment and against arbitrary censorship....\" \nOn Saturday, artificial intelligence startup Perplexity AI submitted a proposal to ByteDance to create a new entity that merges Perplexity with TikTok's U.S. business, according to a person familiar with the matter...\n \nThe article adds that TikTok \"does not operate in China, where ByteDance instead offers Douyin, the Chinese sibling of TikTok that follows Beijing's strict censorship rules.\" \n\nSunday morning Republican House speaker Mike Johnson offered his understanding of Trump's planned executive order, according to Politico. Speaking on Meet the Press, Johnson said \"the way we read that is that he's going to try to force along a true divestiture, changing of hands, the ownership. \n\n\"It's not the platform that members of Congress are concerned about. It's the Chinese Communist Party and their manipulation of the algorithms.\"\n\n \nThanks to long-time Slashdot reader ArchieBunker for sharing the news.","contentLength":4513,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A Guide to Container Networking: Part II - Network Namespaces and Linux Bridges","url":"https://hackernoon.com/a-guide-to-container-networking-part-ii-network-namespaces-and-linux-bridges?source=rss","date":1737309606,"author":"Atul Thosar","guid":273,"unread":true,"content":"<p>This is the second part of the series&nbsp;<a href=\"https://simplyatul.github.io/blog/Container-Networking/\">Container Networking</a>. I will cover Network Namespaces and Linux Bridges in this blog post.</p><p>\\\nLinux Namespaces&nbsp;<a href=\"https://en.wikipedia.org/wiki/Linux_namespaces\">wiki</a>&nbsp;says</p><pre><code>Namespaces are a feature of the Linux kernel that partition kernel resources \nsuch that one set of processes sees one set of resources, while another set \nof processes sees a different set of resources.\n</code></pre><p>\\\nSo, the process isolation is provided using namespaces and cgroups. This allows each process to see its personal view of the system (files, process, network interfaces, hostname).</p><p>\\\nAnother excerpt from&nbsp;the <a href=\"https://en.wikipedia.org/wiki/Linux_namespaces\">wiki</a>.</p><pre><code>ince kernel version 5.6, there are 8 kinds of namespaces. \nNetwork namespaces virtualize the network stack. On creation, a network \nnamespace contains only a loopback interface. Each network interface \n(physical or virtual) is present in exactly 1 namespace and can be moved \nbetween namespaces. \n</code></pre><p>\\\n<a href=\"https://man7.org/linux/man-pages/man8/ip-netns.8.html\">ip-netns</a>&nbsp;utility helps to create network namespaces. Let’s see how.</p><p>Create a network namespaces.</p><p>\\\nOnly the loopback interface is available in&nbsp;&nbsp;namespace.</p><pre><code>sudo ip netns exec ns1 ip link\n1: lo: &lt;LOOPBACK&gt; mtu 65536 qdisc noop state DOWN mode DEFAULT group default qlen 1000\n    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00\n</code></pre><p>\\\nThe following diagram helps to visualize the setup.</p><p>For brevity, I will not list&nbsp;&nbsp;and&nbsp;&nbsp;interfaces in the rest of the diagrams.</p><p>\\\nNow, let’s create a&nbsp;&nbsp;pair.</p><pre><code>sudo ip link add vethX type veth peer name vethY\nsudo ip link set vethX up\nsudo ip link set vethY up\n</code></pre><p>Attach one end of the&nbsp;&nbsp;pair to&nbsp;&nbsp;namespace.</p><pre><code>sudo ip link set vethX netns ns1\n</code></pre><p>This ensures processes in the default/root namespace cannot see&nbsp;&nbsp;interface.</p><pre><code>ip link\n1: lo: &lt;LOOPBACK,UP,LOWER_UP&gt; mtu 65536 qdisc noqueue state UNKNOWN mode DEFAULT group default qlen 1000\n    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00\n2: enp0s3: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc fq_codel state UP mode DEFAULT group default qlen 1000\n    link/ether 02:fd:4d:34:55:76 brd ff:ff:ff:ff:ff:ff\n18: vethY@if19: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc noqueue state UP mode DEFAULT group default qlen 1000\n    link/ether 5a:bc:4d:7e:76:b1 brd ff:ff:ff:ff:ff:ff link-netns ns1\n</code></pre><p>\\\nAnd processes in&nbsp;&nbsp;namespace could not see&nbsp;&nbsp;interface.</p><pre><code>sudo ip netns exec ns1 ip link\n1: lo: &lt;LOOPBACK&gt; mtu 65536 qdisc noop state DOWN mode DEFAULT group default qlen 1000\n    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00\n19: vethX@if18: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc noqueue state UP mode DEFAULT group default qlen 1000\n    link/ether 5e:4b:13:90:7d:63 brd ff:ff:ff:ff:ff:ff link-netnsid 0\n</code></pre><p>\\\nIn a similar fashion, we can create another namespace. Create a new&nbsp;&nbsp;pair. And then attach one end of&nbsp;&nbsp;pair to a namespace.</p><pre><code>udo ip netns add ns2\nsudo ip link add vethP type veth peer name vethQ\nsudo ip link set vethP up\nsudo ip link set vethQ up\nsudo ip link set vethP netns ns2\n</code></pre><p>Now, the last part is to connect these two namespaces with a Bridge.</p><p>\\\nA bridge connects two LAN segments together. We will create a new bridge and attach&nbsp;&nbsp;and&nbsp;&nbsp;to this bridge.</p><pre><code>sudo ip link add name br0 type bridge\nsudo ip link set dev br0 up\nsudo ip link set vethY master br0\nsudo ip link set vethQ master br0\n</code></pre><p>As we have looked in&nbsp;the <a href=\"https://simplyatul.github.io/blog/Container-Networking-Part1/\">last blog post</a>, any packet on bridge&nbsp;&nbsp;is seen on all the&nbsp;&nbsp;we have created. You can try it for yourself.</p><p>\\\nNow, by this time, you might have started imagining how a container achieves network isolation using Virtual Ethernet, Bridge, and Linux Namespaces. We will take a look at the docker container in&nbsp;the <a href=\"https://simplyatul.github.io/blog/Container-Networking-Part3/\">next blog post</a>.</p><p>\\\nBefore you jump to the next article, let’s clean up the setup.</p><pre><code>sudo ip link del br0\nsudo ip link del vethY\nsudo ip link del vethQ\nsudo ip netns del ns1\nsudo ip netns del ns2\n</code></pre>","contentLength":3707,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The History of GitHub Awesome-Lists","url":"https://hackernoon.com/the-history-of-github-awesome-lists?source=rss","date":1737309603,"author":"Zevi Reinitz","guid":272,"unread":true,"content":"<h2><strong>Awesome-Lists, Everywhere</strong></h2><p>Chances are, if you use GitHub, you’re familiar with “awesome lists”.</p><p>\\\nAwesome-lists are a series of open source GitHub projects. They offer curated content around a specific topic that readers will find… awesome. Each list uses the “awesome-” naming convention and most of them give credit to other awesome lists that inspired them to create their own.</p><p>\\\nThey’ve become so popular that GitHub now displays “Awesome Lists” as one of the options in the mobile app Explore tab:</p><p>\\\nYou’ll find awesome-lists ranging from mainstream tech topics like <a href=\"https://github.com/enaqx/awesome-react#readme\">awesome-react</a> to random stuff like <a href=\"https://github.com/kdeldycke/awesome-falsehood\">awesome-falsehoods</a> (”a curated&nbsp;&nbsp;list of falsehoods programmers believe in.”), <a href=\"https://github.com/edm00se/awesome-board-games\">awesome-board -games</a> (“a curated list of awesome and exceptional board games”) and <a href=\"https://github.com/sdassow/awesome-veganism#readme\">awesome-veganism</a>  (“a curated list of awesome resources, pointers, and tips to make veganism easy and accessible to everyone”).</p><h2>My Progress From Consumer → Maintainer</h2><p>For me, awesome-lists were love at first site when I was introduced to the concept a few years ago. I’m now a maintainer of my very own list, having recently started <a href=\"https://github.com/BigDataBoutique/awesome-opensearch\">awesome-opensearch</a> together with my friends at <a href=\"https://pulse.support/\">Pulse</a>.</p><p>\\\n👉 👉  ⭐ <strong><em>? I’d really appreciate it!</em></strong> 🙏 🙏</p><h2>Researching the Origins of awesome-lists</h2><p>All of this got me thinking - where did this awesome-list concept come from in the first place? Who started it? Did they do anything to promote the idea early on? And why “awesome” of all possible superlatives?</p><p>\\\nI couldn’t find anyone who has written about this, so I decided to fill the gap myself. </p><p>\\\nIt’s helpful that GitHub is built to leave digital fingerprints and clues, and so after sifting through lot of commit histories, READMEs and PR comments I’ve pieced together the first timeline and history of awesome-lists.</p><p>\\\nThe first awesome-list in history was <a href=\"https://github.com/ziadoz/awesome-php/\">awesome-php</a>, launched January 25, 2012 by Jamie York (<a href=\"https://github.com/ziadoz\">@ziadoz</a> on GitHub). </p><pre><code>Here's some awesome PHP libraries that are awesome. Yes, so awesome I've used the word three times! You should be using them already:\n</code></pre><p>\\\nTwo years later, on January 17, 2014 another awesome-list came to life when <a href=\"https://github.com/JanVanRyswyck\">**Jan Van Ryswyck</a> launched <a href=\"https://github.com/JanVanRyswyck/awesome-talks\">awesome-talks</a>. And while this project carried a similar naming convention to awesome-php, Jack didn’t make any connection in his <a href=\"https://github.com/JanVanRyswyck/awesome-talks/commit/863a79a1801c79bb4f79543d18837aa5d3ec26e0\">initial commits</a>.**</p><p>The first signal of influence and attribution would come a month later, on February 10, 2014 with the launch of awesome-sysadmin. In the <a href=\"https://github.com/kahun/awesome-sysadmin/commit/cce60e1b6fb7ad56d07cbcaee7a62030f7d01777https://github.com/kahun\">initial commit</a>, <a href=\"https://github.com/kahun\">Francisco Augusto</a> wrote:</p><pre><code>A curated list of amazingly awesome sysadmin open source resources inspired by Awesome PHP.\n</code></pre><pre><code>A curated list of amazingly awesome sysadmin open source resources inspired by [Awesome PHP](https://gist.github.com/Xanza/7663627)\n</code></pre><p>\\\nNotice that the reference is a  URL. Gist is a GitHub feature that lets you store and distribute code snippets without setting up a full-fledged repository. It’s sort of like GitHub’s version of a post or a tweet.</p><p>\\\nIt turns out that the specific Gist reference that Francisco added is a dead link. Looks like he meant to reference: <a href=\"https://gist.github.com/ziadoz/1677679\">https://gist.github.com/ziadoz/1677679</a> which is where Jamie York had posted awesome-php back in January of 2012.</p><p>It seems then, that the initial awesome-lists were not actually repositories - they were Gists. And the initial traction and visibility of the awesome-list concept was thanks to the social and sharing nature of the Gists feature.</p><p>\\\nAfter almost 2 years on Gists, awesome-php had reached 260 forks and 1400 stars. And on Nov 29, 2013, Francisco <a href=\"https://gist.github.com/ziadoz/1677679/revisions?page=14\">announced</a> that \"Awesome PHP has been relocated permanently to its own Github repository](<a href=\"https://github.com/ziadoz/awesome-php\">https://github.com/ziadoz/awesome-php</a>). No further updates will made to this gist\".</p><p>\\\nAwesome-lists had outgrown Gists and it was time to finally find their permanent home as stand-alone projects in GitHub proper.</p><p>The real inflection point for awesome-list growth was the summer of 2014 as several new awesome-list GitHub projects were launched during June and July.</p><pre><code>A curated list of awesome Python frameworks, libraries and resources. Inspired by awesome-php.\n</code></pre><p>\\\nOn July 3rd, <a href=\"https://github.com/markets\">Marc Anguera</a> launched awesome-ruby. There was no reference to other lists in the <a href=\"https://github.com/markets/awesome-ruby/commit/97fa92e1ae5e34d2368ac380b4c3ebc52397f3d4\">initial commit</a>, but the timing and naming convention suggest that this was inspired by other awesome-lists that preceded it.</p><p>Awesome-lists were also starting to gain wider promotion on other social platforms. Take this tweet for example on July 9th 2014 telling people about the awesome-ruby project:</p><p>The rapid growth signals continued a couple of days later on July 6, 2014 when <a href=\"https://github.com/avelino\">@avelino</a> launched awesome-go. The <a href=\"https://github.com/avelino/awesome-go/commit/1411022042b65f960ea86615d06b7562129e2ee1\">initial commit</a> reads:</p><pre><code>A curated list of awesome Go frameworks, libraries and software. Inspired by awesome-python.\n</code></pre><p>\\\nWhereas other awesome-lists had referenced  as their OG awesome inspiration, awesome-go had taken inspiration from the  project that was launched just a week prior.</p><p>\\\nThe next day (July 7th) <a href=\"https://github.com/alebcay/awesome-shell\">awesome-shell</a> was launched by <a href=\"https://github.com/alebcay\">Caleb Xu</a>. People throughout the GitHub ecosystem had apparently took notice of the awesome-list trend and they were joining with lists of their own.</p><h2>Awesome-lists Filled With awesome-lists</h2><p>By July 8th, there were enough awesome-lists out there with enough exposure to inspire the first awesome-list of other awesome-lists.</p><pre><code>A curated list of amazingly awesome awesomeness\n</code></pre><p>\\\nThe list collected all of the above awesome-lists that came before it in one convenient place.</p><pre><code>A curated list of awesome tools, resources and workflow tips making an awesome development environment.\n\nInspired by [awesome-go](https://github.com/avelino/awesome-go), which was in turn inspired by [awesome-python](https://github.com/vinta/awesome-python).\n</code></pre><pre><code>“A curated list of awesome lists.”\n</code></pre><p>\\\nJun 22, 2013, a year before the explosive growth of 2014. The frontend-dev-bookmarks project obviously did not use the awesome- naming convention and it’s not clear that it was inspired by the budding awesome-list trend. It appears that this was a parallel, similar effort to curate useful information, as Tim suggests in the <a href=\"https://github.com/dypsilon/frontend-dev-bookmarks/commit/84a26e3166a8cdeb7dee7443ba5da3be0fb48398#diff-b335630551682c19a781afebcf4d07bf978fb1f8ac04c6bf87428ed5106870f5R2\">initial commit</a>:</p><pre><code>A badass list of frontend development resources I collected over time. Pull requests are welcome.\n</code></pre><p>\\\nThe pull of the awesome-list ecosystem was so strong, that even parallel efforts such as this one were pulled in.</p><pre><code>A curated list of delightful Node.js [packages](#packages) and [resources](#resources). \nInspired by the [awesome](https://github.com/sindresorhus/awesome) list thing.\n</code></pre><p>\\\nAwesome-lists had arrived at scale. </p><p>\\\nThey were officially “thing”.</p><h2>What Caused the Wild Summer of 2014?</h2><p>I reached out to several of these early awesome-list creators to understand what prompted the rapid growth during that summer of 2014. I assumed there must of been an event or conference that put the awesome-list concept on display to the entire dev community, but it turns out that it was completely organic. This was a trend that caught on thanks to social media sharing and algorithms.</p><h2>Balancing Scale and Quality</h2><p>One of the interesting corollaries of awesome-list adoption was the challenge in maintaining them. How does one ensure that the links are correct? How do you identify links that become broken over time?</p><p>\\\nThis was something that the early adopters thought about, with Dotan of awesome-devenv <a href=\"https://jondot.medium.com/using-travis-ci-to-validate-awesome-lists-ed12ed697146\">sharing an article</a> at the end of 2015 explaining how he used Travis CI to automatically review and validate awesome list content.</p><p>As we referenced at the beginning of this article, Jamie York used the word “awesome” to describe the very first awesome-list: <em>“Here's some awesome PHP libraries that are awesome. Yes, so awesome I've used the word three times! You should be using them already:”</em></p><p>\\\nAwesome was used as an emotional measure of how delightful a resource of piece of content was. If it wasn’t delightful, then it didn’t belong on the list. The word “awesome” captured the ethos of the awesome-list movement and solidified the key distinction between  and . The objective was to curate only the best content, and leave the other stuff out.</p><p>\\\n<em>[Make sure the list] only has awesome items. Awesome lists are curations of the best, not everything.</em></p><p>The rest, as they say, is history. Awesome lists are here to stay as an important part of GitHub culture. Collectively, these projects have gained millions of GitHub stars and they hav proven to be a valuable set of resources for the dev community and beyond.</p><p>\\\nThe prolific growth of the awesome-list trend highlights the value of thoughtful content curation, and emphasizes the collaborative nature of open source.</p><p>\\\nIf you go this far and have an extra 8 seconds to spare, I’d appreciate it if you would give <a href=\"https://github.com/BigDataBoutique/awesome-opensearch\">awesome-opensearch</a> a star! </p>","contentLength":8611,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"TikTok is restoring service in the US","url":"https://techcrunch.com/2025/01/19/tiktok-is-restoring-service-in-the-us/","date":1737309181,"author":"Anthony Ha","guid":215,"unread":true,"content":"<p>Barely more than 12 hours after TikTok went dark in the United States, the video-sharing app is coming back online. “In agreement with our service providers, TikTok is in the process of restoring service,” the company said in a statement. “We thank President Trump for providing the necessary clarity and assurance to our service providers […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":414,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"REST API Automation Using Postman, Newman and Jenkins","url":"https://hackernoon.com/rest-api-automation-using-postman-newman-and-jenkins?source=rss","date":1737305679,"author":"","guid":271,"unread":true,"content":"<p><strong>Hi all! My name is Alena and QA Lead :)</strong></p><p>\\\n<strong>In this article, I would like to share my experience in automating REST APIs using tools such as Postman, Newman and Jenkins.</strong></p><p><strong>Postman is a popular API client that allows you to test, share, create, collaborate, and document your API development process within a team. An important feature of Postman is the ability to write and run JavaScript-based tests for APIs. Postman offers built-in API integration tools for some continuous integration (CI) tools, such as Jenkins.</strong></p><h3>==Creating Collections and Writing Autotests in Postman==</h3><p>First, you need to create a collection and populate it with requests. Once the collection is ready, you can start writing autotests. There are two ways to add JavaScript code:</p><ol><li>You can add a script that runs before sending a request to the server, which is done on the \"Pre-Request Script\" tab.</li><li>Alternatively, you can add a script that executes after receiving a response from the server, which is done on the \"Tests\" tab.</li></ol><p>\\\nI typically use the \"Tests\" tab. After adding the code to the tab, it will be launched when the request is executed. The result of the launch will be available on the Test Results tab of the response from the server. Dynamic variables can be used in test scripts. You can add checks for data from the response and transfer the received values between requests.</p><p>It is very convenient that Postman offers ready-made code snippets for standard tasks that can be edited to suit your needs to save time. Thus, this type of automation can be mastered by someone who knows only the basics of JavaScript.</p><p>\\\nThe first simple autotest is to verify that the request was successful, and we received the status code 200 (or any other code that we expect). It is most convenient to enable this test at the collection level so that all queries under it inherit this check:</p><pre><code>pm.test(\"Status code is 200\", function () {\n   pm.response.to.have.status(200);\n</code></pre><p>\\\nThe following test example is a JSON schema check. Why is the JSON schema validation required? Because:</p><ul><li><p>We monitor API responses and ensure that the format we receive is the same as expected.</p></li><li><p>We receive an alert whenever there is any critical change in the JSON response.</p></li><li><p>For integration tests, it is useful to check the schema. It can be generated once from the service response in order to test all future versions of the service with it.</p></li></ul><pre><code>  let schema = {\n     \"items\": {\n         \"type\": \"boolean\"\n     }\n  };\n\n  pm.test(\"Схема корректна\", () =&gt; {\n     pm.response.to.have.jsonSchema(schema);\n  });\n</code></pre><p>\\\n  Thus, we already have two automated REST API checks. I won’t bore you with further autotest examples, as they can be found and studied in the documentation at<a href=\"https://learning.postman.com/docs/writing-scripts/test-scripts\"></a>, so let’s move on to the exciting part: integrating our collection with Jenkins.</p><h3><strong>==Integrating Postman with Continuous Integration (CI) Build Systems==</strong></h3><p>The first question that arises is how to link Postman and Jenkins. To accomplish this, you need to use the CLI (command-line interface). Newman, an application that allows you to run and test Postman collections directly from the command line, is used to convert the Postman collection into command-line language.</p><p>\\\nHere is a simplified list of steps on how to proceed:</p><ol><li>&nbsp;and run it. For more details, refer to the Jenkins documentation at<a href=\"https://www.jenkins.io/?ref=hackernoon.com\">&nbsp;Jenkins.io</a>.</li><li><strong>Install Node.js and Newman in Jenkins:</strong></li></ol><ul><li>Go to your Jenkins server and log in.</li><li>Navigate to \"Manage Jenkins\" &gt; \"Manage Plugins\" and install the NodeJS plugin.</li><li>Go to \"Manage Jenkins\" &gt; \"Global Tool Configuration\" and select \"Add NodeJS\" in the NodeJS section.</li><li>Enter a name for the Node.js installation.</li><li>In the \"Global npm packages\" field, enter&nbsp;.</li><li>Select \"Save\". Detailed instructions can be found&nbsp;<a href=\"https://learning.postman.com/docs/collections/using-newman-cli/integration-with-jenkins/?ref=hackernoon.com\">here</a>.</li></ul><ol start=\"3\"><li><strong>Verify that npm (the package manager for JavaScript) is also installed</strong>&nbsp;by entering the following commands in the command line:</li></ol><ol start=\"4\"><li><strong>Open the console and install Newman</strong>&nbsp;itself using the command:</li></ol><ol start=\"5\"><li><strong>Save your collection of tests</strong>; you can either generate a URL for the tests (share) or save it as a file (export).</li><li><strong>Run the tests in the console with the following command:</strong></li></ol><ul><li><pre><code> newman run https://www.getpostman.com/collections/...  # (replace with the actual URL)\n</code></pre></li><li><p>If using a file, use the command with the directory of the collection file:</p><pre><code> newman run /Users/Postman/postman_collection.json\n</code></pre></li></ul><p>After running, the tests will execute in the console, and the results will be displayed:</p><p>\\\nAfter running, the tests will execute in the console, and the results will be displayed.</p><p>\\\nNext, you can execute Newman from Jenkins after each commit to test the correctness of the responses. It is advisable to prepare templates in Postman, such as placing the host address and other changing request parameters into variables, which can then be transferred from the Credentials plugin to Jenkins.</p><ol start=\"8\"><li><strong>To configure tasks, add a shell command that includes a Newman call.</strong> After that, Jenkins will run the tests. You can set the desired frequency by navigating to the build window → Configure → Build Triggers → Build periodically. Jenkins will then report whether the build was successful or unsuccessful.</li></ol><p>\\\nYou can also set up email distribution to inform team members about the latest builds and their statuses. This allows for active monitoring of your API builds along with other API components. Additionally, there are many other configurations you can implement to make the collection more dynamic.</p><p>In conclusion, I would like to outline the pros and cons of using this type of automation.</p><ul><li>Postman is intuitive and easy to use.</li><li>It requires no complicated configuration.</li><li>It supports various APIs (REST, SOAP, GraphQL).</li><li>It integrates easily into CI/CD processes using Newman.</li><li>Newman is user-friendly and ideal for those who frequently use Postman and seek extended functionality with minimal effort.</li></ul><p>These tools are very effective for adding automation to testing, especially in the initial stages.</p><ul><li>Constructing automated tests for large projects with numerous REST services can be challenging.</li><li>The inability to reuse code may lead to excessive duplication, making maintenance difficult, particularly when the number of scripts exceeds 1,000.</li><li>This approach may not be viable if many tasks are being executed within the CI system—such as ongoing builds, running autotests, managing internal dependencies, or deploying builds to an environment. In such cases, you would need to increase the number of machines running the autotests and configure each one from scratch, ensuring that nothing is overlooked.</li></ul>","contentLength":6459,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Is the Universe Capable of Thinking? According to Sabine Hossenfelder, Maybe","url":"https://hackernoon.com/is-the-universe-capable-of-thinking-according-to-sabine-hossenfelder-maybe?source=rss","date":1737305137,"author":"Laszlo Fazekas","guid":270,"unread":true,"content":"<p>A few days ago, a video by Sabine Hossenfelder was released on YouTube discussing whether the Universe is capable of thinking. For those unfamiliar with Sabine, she is a physicist and one of the best presenters on scientific topics. No fluff, no mysticism—just facts and physical principles. She has excellent material on quantum mechanics, for example, where she demonstrates that these phenomena aren’t mystical but rather peculiar and manageable through mathematics. That’s why it was surprising to see her (seemingly) dive into a topic that appears mystical, like the thinking Universe. Moreover, she claims that it’s possible.</p><p>Of course, anyone who watches the video won’t be disappointed. True to her style, Sabine approaches the topic from the perspective of physics.</p><p>\\\nThe first question, of course, is how we define thinking or perhaps consciousness. These topics are still the subject of intense debate today, but most would likely agree that thinking involves some form of information processing. And if that’s the case, then information transmission must occur. This, however, can immediately be addressed using our current knowledge of physics. According to Einstein’s theory of relativity, information cannot be transmitted faster than the speed of light. This imposes an upper limit on any thinking structure. If something is too large, the slow transmission of information would prevent it from being able to think—or it would do so incredibly slowly.</p><p>\\\nSimilarly, there is also a lower limit to thinking, as the smallest unit for storing information could be an elementary particle. Moreover, due to environmental noise, stable information storage requires structures much larger than atoms. This provides a good explanation for why humans—and thinking life in general—exist in the middle range of scales.</p><p>\\\nBased on the above, we should immediately dismiss the idea of a thinking Universe, but in her video, Sabine points out that there are a few loopholes.</p><p>\\\nOne such loophole is that while the speed of light imposes a limit on motion through space, space itself is not necessarily homogeneous. Fans of science fiction might immediately think of wormholes—regions that connect two distant points in space. A wormhole shouldn’t be imagined as a tunnel with a specific length; rather, it’s simply a peculiar structure of space. If I travel left, it might take 10 light-years to reach the next star, but there could be a shorter path to the right that takes only 1 light-minute.</p><p>\\\nWe haven’t discovered any wormholes yet, but that doesn’t mean they can’t exist. It’s possible that the world around us is full of them, but they’re so small that we’re incapable of detecting them. Still, information might be able to travel through them. Perhaps the Universe’s nervous system weaves densely through our world, and we remain completely unaware of it.</p><p>\\\nThe other loophole is that the theory of relativity doesn’t actually rule out the existence of speeds greater than the speed of light. It merely states that if something moves slower than the speed of light, it cannot be accelerated to exceed it. However, it doesn’t exclude the possibility of particles that are inherently faster than light. These hypothetical particles are called tachyons. They travel faster than the speed of light and cannot be slowed down to below light speed.</p><p>\\\nNothing rules out the possibility that the Universe might possess a nervous system made up of tiny wormholes or some tachyon brain (which sounds much cooler than a positronic brain). Because of this, the laws of physics do not completely exclude the possibility that the Universe could think.</p><p>\\\nOf course, the question remains whether such a tachyon-brained Universe could know anything about us. Even if the Universe does think, it’s unlikely that our existence matters to it in any way—or that the Universe’s thoughts would have any impact on us. So, for those searching for God, this is probably the wrong place to look. A thinking Universe doesn’t really align with the traditional concept of God. However, to ensure that even those who started reading this article for that reason aren’t disappointed, let’s delve into a further line of reasoning.</p><p>\\\n<strong>Attention! Pseudo-science alert!</strong></p><blockquote><p>Sabine started from the laws of physics and examined whether consciousness could emerge as a property. But what if consciousness is fundamental, and the laws of physics are emergent?</p></blockquote><p>\\\nThe very first article I wrote on HackerNoon was about this exact topic. What if the Universe is actually a brain—a thinking structure suffering from massive dissociative identity disorder, imagining itself as billions of humans? The physical reality and the world around us would then be nothing more than an interface between individual consciousnesses. It’s impossible to rule out this possibility because any experiment we might conduct to disprove this theory would fail. Our consciousness would always generate a reality that aligns with the laws of physics as we expect them to. Yes, yes, I’m talking about the good old simulation hypothesis. For those interested in exploring this topic further, feel free to read the article I mentioned:</p><p>\\\nOne of the counterarguments against the simulation hypothesis is: \"Okay, but who built the computer running the simulation?\" The answer is very simple: there is no computer (like there is no spoon). Just as the currently accepted scientific perspective holds that the Universe emerged from nothing, a thinking structure—a \"Brain Universe\"—could similarly have emerged from nothing. In this Universe, it wasn’t galaxies and stars that formed over time, but thoughts and consciousnesses. I’ve also written a full article on this topic. If you’re interested, you can read it here: <a href=\"https://hackernoon.com/a-brief-introduction-to-the-boltzmann-brain-theory\">A Brief Introduction to The Boltzmann Brain Theory</a></p><p>\\\nAs we reach the end of this article, we still don’t have an answer to our question. We still don’t know whether the Universe thinks or not. However, I believe we’ve gained many new ideas—ones that perhaps even go beyond this question.</p>","contentLength":6106,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"So You Think You’re Smart? Try These 5 Levels of Quantum Computing Explanations","url":"https://hackernoon.com/so-you-think-youre-smart-try-these-5-levels-of-quantum-computing-explanations?source=rss","date":1737304906,"author":"Maximiliano Contieri","guid":269,"unread":true,"content":"<p>\\\n<em>Back to the Future: Revisiting Quantum Computing 25 years later</em></p><p>More than 25 years ago, circa 1999, I authored an article on the future of quantum computing, which was published in the science section of a printed newspaper in Argentina.</p><p>You can access the original article <a href=\"https://www.pagina12.com.ar/1999/suple/futuro/99-05-29/NOTA_A.HTM\">here</a> (in Spanish) and view an automatic translation by following <a href=\"https://www-pagina12-com-ar.translate.goog/1999/suple/futuro/99-05-29/NOTA_A.HTM?_x_tr_sl=es&amp;_x_tr_tl=en\">this link</a>.</p><p>My article was quite speculative back then.</p><p>Quantum computing has gained significant traction and relevance in technology discussions today.</p><blockquote><p>TL;DR: I will explain quantum computing in five levels to different audiences.</p></blockquote><p>A quantum computer is like a super-smart magic box.</p><p>These qubits can do more tricks than normal bits.</p><p>Imagine you’re playing with a spinning top. A qubit is like a spinning top that can do many tricks all at the same time.</p><p>These magic computers might one day help solve impossible 100000-piece puzzles.</p><p>Picture you can play with special building blocks used in many places simultaneously.</p><p>Quantum computers use something similar called qubits.</p><p>Think about a magic coin that can be heads and tails at the same time!</p><p>A qubit can be 0, 1, or both, like the coin spinning in the air. All at once.</p><p>This lets quantum computers explore many possibilities simultaneously.</p><p>Quantum computers are powerful because they can break secret codes like personal passwords.</p><p>It's like having a super-powerful calculator that can solve really hard puzzles much faster than regular computers.</p><p>Each qubit can represent both 0 and 1 simultaneously, enabling massive parallel computation.</p><p>You can think of Schrödinger's cat - a famous thought experiment where a cat can be alive and dead at the same time.</p><p>Qubits work similarly by being in multiple states simultaneously.</p><p>Quantum computers can factor large numbers exponentially faster than classical computers breaking public and private keys in encrypted internet connections.</p><p>This capability threatens traditional cryptography and blockchains that rely on factoring difficulty.</p><p>Researchers also explore quantum computing’s implications in multiverse theories, as qubits seemingly compute across many realities.</p><p>Recently, Google claimed a quantum computer achieved <a href=\"https://research.google/pubs/quantum-supremacy-using-a-programmable-superconducting-processor/\">“quantum supremacy”</a>, solving a problem classical computers couldn’t handle in a reasonable timeframe.</p><p>A Nature study also highlighted new quantum materials to stabilize qubits.</p><p>The weird part is that these particles might suggest that many different realities exist at the same time, like parallel universes in science fiction movies!</p><p>Quantum computing exploits quantum phenomena such as superposition, entanglement, and interference.</p><p>While classical bits are binary, qubits utilize quantum superposition to represent multiple states concurrently.</p><p><a href=\"https://en.wikipedia.org/wiki/Quantum_entanglement\">Quantum entanglement</a> ensures qubits remain interconnected, even over distance, enabling highly efficient algorithms.</p><p>You can use quantum gates to manipulate qubits, enabling you to create quantum circuits to execute quantum algorithms.</p><p>These advancements drive concerns about securing digital systems against quantum threats.</p><p>Multiverse speculation arises because qubits in superposition might interact with other realities, as postulated in Hugh Everett’s Many-Worlds Interpretation.</p><p>Quantum computing pushes the principles of quantum superposition, entanglement, and unitary evolution to process information.</p><p>Qubits transcend classical logic gates by encoding information in a multidimensional <a href=\"https://en.wikipedia.org/wiki/Hilbert_space\">Hilbert space</a>, enabling an exponential state space.</p><p>Algorithms like Shor’s algorithm decompose semiprime integers in polynomial time, undermining cryptosystems like RSA and ECC.</p><p>Grover’s algorithm demonstrates quadratic optimization for search tasks, representing a pivotal class of quantum advantage.</p><p>Interpretations of quantum mechanics underpinning these systems differ: The Copenhagen interpretation postulates wavefunction collapse during measurement.</p><p>This fuels debates on quantum parallelism across multiversal states.</p><p>Google’s demonstration of quantum supremacy leveraged a 54-qubit Sycamore processor to complete a sampling problem in 200 seconds, previously estimated to require 10,000 years on the world’s most powerful supercomputers.</p><p>The Planck scale (10^-35 m) suggests a fundamental graininess to spacetime, potentially limiting quantum computational power.</p><p>Nature reports underscore advancements in stabilizing qubits through topological quantum error correction and fault-tolerant designs, essential for practical quantum computation.</p><p>Are you excited about the quantum future?</p>","contentLength":4482,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"TikTok goes dark in the US","url":"https://techcrunch.com/2025/01/19/tiktok-goes-dark-in-the-u-s/","date":1737304090,"author":"Kyle Wiggers, Anthony Ha","guid":214,"unread":true,"content":"<p>TikTok went dark in the U.S. on Saturday night as a result of a federal law that bans the popular short-form video app for millions of Americans. However, the company began restoring service by midday Sunday. TikTok users began receiving a message about the ban around 10:30 p.m. Eastern on Saturday evening, and the app […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":389,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Starlink, Spacecoin, and the Dawn of a New Era for Connectivity","url":"https://hackernoon.com/starlink-spacecoin-and-the-dawn-of-a-new-era-for-connectivity?source=rss","date":1737304002,"author":"Edwin Liava'a","guid":268,"unread":true,"content":"<p>When I recently posed the question \"<a href=\"https://hackernoon.com/who-even-needs-undersea-cables-for-internet-anymore\">Who Even Needs Undersea Cables for the Internet Anymore?</a>\" I did not expect events to validate my perspective quite so dramatically or quickly. The reliance on undersea submarine cables, once the backbone of global connectivity, appears increasingly antiquated in light of recent technological breakthroughs.</p><p>\\\nThe theoretical discussion of satellite internet supremacy transformed into practical reality when SpaceX made a ground-breaking announcement. As reported by <a href=\"https://www.pcmag.com/news/spacex-teases-1tbps-of-download-bandwidth-on-v3-starlink-satellites\">PCMag</a> on January 3rd, \"Each V3 Starlink satellite will have 1 Tbps of downlink speeds and 160 Gbps of uplink capacity, which is more than 10x the downlink and 24x the uplink capacity of the V2 Mini Starlink satellites.\" This isn't just an improvement, it's a complete re-imagining of global connectivity's future.</p><p>\\\nThis development has profound implications for Spacecoin's blockchain-powered satellite network. The convergence of high-bandwidth satellite technology and blockchain governance could create something entirely new: a system that's both incredibly powerful and truly democratic. While traditional infrastructure providers risk becoming centralized authorities in our digital age, the combination of Starlink's proven satellite capabilities and Spacecoin's blockchain governance model offers an alternative path.</p><p>\\\nFor the Pacific Islands, where I live and work, this evolution represents an unprecedented opportunity. Our region has long struggled with the limitations and vulnerabilities of traditional infrastructure, particularly during natural disasters when communication systems are most crucial. Rather than playing catch-up, we could pioneer the adoption of this new paradigm, leveraging satellite networks that provide both resilience and transformation.</p><p>\\\nThe implications extend far beyond basic internet access. When each node in a blockchain network can process and transmit data at terabyte speeds while maintaining security and transparency, we're looking at a fundamental shift in how human beings connect and interact. This isn't about replacing one technology with another, it's about the transformation of the very nature of global connectivity.</p><p>\\\nThe potential for collaboration between Starlink and Spacecoin particularly intrigues me. These aren't competing visions so much as complementary approaches to solving humanity's connectivity challenges. Such a partnership could ensure that satellite providers enhance rather than restrict digital democracy.</p><p>\\\nYesterday while we were out on the beach with my family, as I watched the sun set over the Pacific Ocean, I can imagine a cargo ship passes through the horizon, likely carrying materials for yet another undersea cable repair. I can't help but smile at the irony. The future of connectivity isn't buried beneath these vast waters but soaring high above them, in a network of satellites governed by the very people it serves. For those of us in the Pacific, and indeed for people everywhere who have struggled with digital isolation, this evolution couldn't come soon enough.</p><p>\\\nThe most exciting part? We're just at the beginning. As these technologies mature and converge, we're not just solving today's connectivity challenges, we're laying the foundation for tomorrow's world. And from where I sat on the sand at the beach, watching the stars begin to appear over the Pacific, that future looks brighter than ever.</p>","contentLength":3405,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Trump says he will delay TikTok ban, suggests a joint venture with US ownership","url":"https://techcrunch.com/2025/01/19/trump-says-he-will-delay-tiktok-ban-suggests-a-joint-venture-with-us-ownership/","date":1737303545,"author":"Anthony Ha","guid":213,"unread":true,"content":"<p>TikTok went dark for users in the US on Saturday night, but it may not be gone for long. President-elect Donald Trump posted on Truth Social Sunday morning that he will issue an executive order Monday that will “extend the period of time before the law’s prohibitions take effect, so that we can make a […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":375,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The HackerNoon Newsletter: Lumoz Unveils TEE+ZK Multi-Proof for On-chain AI Agent (1/19/2025)","url":"https://hackernoon.com/1-19-2025-newsletter?source=rss","date":1737302709,"author":"Noonification","guid":267,"unread":true,"content":"<p>🪐 What’s happening in tech today, January 19, 2025?</p><p>By <a href=\"https://hackernoon.com/u/mexcmedia\">@mexcmedia</a> [ 4 Min read ] MEXC highlights key December 2024 crypto trends, from Bitcoins $100K milestone to Solanas transaction records, AI narratives, and NFT sales surge. <a href=\"https://hackernoon.com/crypto-2024-recap-key-updates-from-mexcs-december-highlights\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/decoded\">@decoded</a> [ 7 Min read ] Discover HackerNoon Decoded: the top stories, writers, and trends that defined 2024. Celebrate the readers and writers who shaped our community! <a href=\"https://hackernoon.com/welcome-to-hackernoon-decoded-the-best-of-2024\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/lumoz\">@lumoz</a> [ 5 Min read ] AI Agents demonstrate potential in Web3 applications, such as managing private keys, automating transactions, and supporting DAO operations.  <a href=\"https://hackernoon.com/lumoz-unveils-teezk-multi-proof-for-on-chain-ai-agent\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/awsmarketplace\">@awsmarketplace</a> [ 10 Min read ] Meet Fortinet FortiGate: AI-Powered Firewall Ranked by Gartner in the Leader’s Quadrant 13 Years in a Row. <a href=\"https://hackernoon.com/fortinet-fortigate-vm-enterprise-class-security-for-applications-and-workloads-running-on-aws\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/dmytrospilka\">@dmytrospilka</a> [ 4 Min read ] Let’s take a deeper look into what could become a watershed moment for the cryptocurrency landscape. <a href=\"https://hackernoon.com/could-a-trump-bitcoin-reserve-spark-an-unprecedented-cryptocurrency-market-rally\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/dadan\">@dadan</a> [ 5 Min read ] Choosing the right recording software is vital for creators to streamline video production, grow audiences, and succeed in the competitive digital space.  <a href=\"https://hackernoon.com/why-your-choice-of-recording-software-is-important-for-long-term-success\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/mexcmedia\">@mexcmedia</a> [ 6 Min read ] Platform tokens like MX and BNB are surging as MEXC’s innovative features attract traders with value-driven benefits and high-growth opportunities. <a href=\"https://hackernoon.com/platform-tokens-spark-a-new-wave-mx-takes-the-center-stage\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/jameseffarah\">@jameseffarah</a> [ 16 Min read ] With the help of a photographic memory, Ive read over 50 product management books in 2024. Here is a curated list from my Kindle library. Youre welcome. <a href=\"https://hackernoon.com/35-product-management-books-youll-actually-learn-from\">Read More.</a></p><p>🧑‍💻 What happened in your world this week?</p><p>We hope you enjoy this worth of free reading material. Feel free to forward this email to a nerdy friend who'll love you for it.See you on Planet Internet! With love, \n The HackerNoon Team ✌️</p>","contentLength":1720,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"DeepSee: Making It Easier to Analyze and Explore Ocean Data for Future Research","url":"https://hackernoon.com/deepsee-making-it-easier-to-analyze-and-explore-ocean-data-for-future-research?source=rss","date":1737302402,"author":"Oceanography: Everything You Need to Study the Ocean","guid":266,"unread":true,"content":"<ul></ul><ul><li>6.2 Scenario: On-the-Fly Decision-Making</li></ul><h2>8 CONCLUSIONS AND FUTURE WORK</h2><p>In this work, we conducted a design study with a team of domain experts in geology, chemistry, and biology to develop multidimensional visualizations of seabed sediment cores for studying deep ocean microbial ecosystems. We presented , an interactive workspace that enables scientists to explore their previous sediment sampling history and decide where new sediment samples may yield the greatest scientific return. By visualizing samples in the context of the environment, bringing together multiple data types in a single interface, and providing capabilities to predict values in unsampled locations,  offers a new approach to visualizing 3D point samples in fieldwork-driven science.</p><p>\\\nIn the future, we envision adding enhanced data analysis capabilities such as supporting multiple levels of phylogenetic hierarchy as well as aggregating and visualizing hierarchical data in the . Additionally, we aim to integrate new and more sophisticated models for large-scale interpolation over several tens or hundreds of meters, based on new research enabled by . The design elements introduced by  could also extend beyond operator-driven deep ocean sampling into similar domains, including studying remote terrestrial ecosystems as well as interplanetary exploration missions. For example, as autonomous sampling scenarios led by an AI system become possible, we could leverage insights into how human operators work with a system like  to train future autonomous sampling systems.</p><p>Funding for this work was provided by grants from the National Science Foundation including the STC Center For Dark Energy Biosphere Investigations and NSF-OCE 2048666 (to V.J.O.). D.R.U. is a National Science Foundation-Ocean Sciences Postdoctoral Research Fellow (2126631), R.L.W. is an NSF Graduate Research Fellow, and S.A.P. is supported through a grant from the NASA FINESST program (80NSSC22K1336). V.J.O. is a science fellow in the Canadian Institute for Advanced Science (CIFAR) in the Earth 4D program.</p><p>\\\nData included in this study was collected during cruise FK181031 on the R/V Falkor supported by the Schmidt Ocean Institute. AUV data have been archived at the Marine Geoscience Data System (MGDS) in the data compilation titled  [5].</p><p>\\\nThe research was carried out at in part at the Jet Propulsion Laboratory, California Institute of Technology, under a contract with the National Aeronautics and Space Administration (80NM0018D0004). The development of  was enabled by Data to Discovery[6], a data visualization, art and design research initiative based at NASA Jet Propulsion Laboratory, California Institute of Technology and ArtCenter College of Design; this support is gratefully acknowledged. Finally, we would also like to thank Jasmine Otto for her valuable discussions about this research.</p><p>\\\nAny opinions, findings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the National Science Foundation.</p><p>[1] S. Afzal, M.M. Hittawe, S. Ghani, T. Jamil, O. Knio, M. Hadwiger, and I. Hoteit. 2019. The State of the Art in Visual Analysis Approaches for Ocean and Atmospheric Datasets. Computer Graphics Forum 38, 3 (2019), 881–907. https://doi.org/10. 1111/cgf.13731</p><p>\\\n[2] Wael H. Ali, Mohamad H. Mirhi, Abhinav Gupta, Chinmay S. Kulkarni, Corbin Foucart, Manan M. Doshi, Deepak N. Subramani, Chris Mirabito, Patrick J. Haley, and Pierre F. J. Lermusiaux. 2019. SeaVizKit: Interactive Maps for Ocean Visualization. In OCEANS 2019 MTS/IEEE SEATTLE. 1–10. https://doi.org/10.23919/ OCEANS40490.2019.8962794</p><p>\\\n[3] Natalia Andrienko and Gennady Andrienko. 2006. Exploratory analysis of spatial and temporal data: a systematic approach. Springer Science &amp; Business Media.</p><p>\\\n[4] Natalia Andrienko, Gennady Andrienko, and Peter Gatalsky. 2003. Exploratory spatio-temporal visualization: an analytical review. Journal of Visual Languages &amp; Computing 14, 6 (2003), 503–541. https://doi.org/10.1016/S1045-926X(03)00046-6 Visual Data Mining.</p><p>\\\n[5] Suyun Bae, Federico Rossi, Joshua Vander Hook, Scott Davidoff, and Kwan-Liu Ma. 2020. A Visual Analytics Approach to Debugging Cooperative, Autonomous Multi-Robot Systems’ Worldviews. In 2020 IEEE Conference on Visual Analytics Science and Technology (VAST). 24–35. https://doi.org/10.1109/VAST50239.2020. 00008</p><p>\\\n[6] Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 data-driven documents. IEEE transactions on visualization and computer graphics 17, 12 (2011), 2301–2309.</p><p>\\\n[7] R.E. Boyatzis. 1998. Transforming Qualitative Information: Thematic Analysis and Code Development. SAGE Publications.</p><p>\\\n[8] R. Cavicchioli, T. Charlton, H. Ertan, S. Mohd Omar, K. S. Siddiqui, and T. J. Williams. 2011. Biotechnological uses of enzymes from psychrophiles. Microbial Biotechnology 4, 4 (2011), 449–460. https://doi.org/10.1111/j.1751-7915.2011. 00258.x</p><p>\\\n[9] Matthew Conlen, Sara Stalla, Chelly Jin, Maggie Hendrie, Hillary Mushkin, Santiago Lombeyda, and Scott Davidoff. 2018. Towards Design Principles for Visual Analytics in Operations Contexts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3173574.3173712</p><p>\\\n[10] Cinzia Corinaldesi. 2015. New perspectives in benthic deep-sea microbial ecology. Frontiers in Marine Science 2 (2015). https://doi.org/10.3389/fmars.2015.00017</p><p>\\\n[11] Michael Correll, Dominik Moritz, and Jeffrey Heer. 2018. Value-suppressing uncertainty palettes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–11.</p><p>\\\n[12] Roberto Danovaro, Paul V.R. Snelgrove, and Paul Tyler. 2014. Challenging the paradigms of deep-sea ecology. Trends in Ecology &amp; Evolution 29, 8 (2014), 465–475. https://doi.org/10.1016/j.tree.2014.06.002</p><p>\\\n[13] Robert A. Drebin, Loren Carpenter, and Pat Hanrahan. 1988. Volume Rendering. SIGGRAPH Comput. Graph. 22, 4 (jun 1988), 65–74. https://doi.org/10.1145/ 378456.378484</p><p>\\\n[14] J Dykes, AM MacEachren, and MJ Kraak. 2005. Exploring Geovisualization. Exploring Geovisualization (2005), 3.</p><p>\\\n[15] Joscha Eirich, Jakob Bonart, Dominik Jäckle, Michael Sedlmair, Ute Schmid, Kai Fischbach, Tobias Schreck, and Jürgen Bernard. 2022. IRVINE: A Design Study on Analyzing Correlation Patterns of Electrical Engines. IEEE Transactions on Visualization and Computer Graphics 28, 1 (2022), 11–21. https://doi.org/10.1109/ TVCG.2021.3114797</p><p>\\\n[16] Niklas Elmqvist, Andrew Vande Moere, Hans-Christian Jetter, Daniel Cernea, Harald Reiterer, and TJ Jankun-Kelly. 2011. Fluid interaction for information visualization. Information Visualization 10, 4 (2011), 327–340. https://doi.org/10. 1177/1473871611413180</p><p>\\\n[17] Michael Gleicher. 2018. Considerations for Visualizing Comparison. IEEE Transactions on Visualization and Computer Graphics 24, 1 (2018), 413–423. https://doi.org/10.1109/TVCG.2017.2744199</p><p>\\\n[18] Sarah Goodwin, Jason Dykes, Sara Jones, Iain Dillingham, Graham Dove, Alison Duffy, Alexander Kachkaev, Aidan Slingsby, and Jo Wood. 2013. Creative User-Centered Visualization Design for Energy Analysts and Modelers. IEEE Transactions on Visualization and Computer Graphics 19, 12 (2013), 2516–2525. https://doi.org/10.1109/TVCG.2013.145</p><p>\\\n[19] Kevin P Hand, Christopher F Chyba, John C Priscu, Robert W Carlson, and Kenneth H Nealson. 2009. Astrobiology and the potential for life on Europa. Europa (2009), 589–629.</p><p>\\\n[20] Charles D Hansen and Chris R Johnson. 2011. Visualization handbook. Elsevier.</p><p>\\\n[21] Maggie Hendrie, Hillary Mushkin, Santiago Lombeyda, and Scott Davidoff. 2022. JPL/Caltech ArtCenter: Towards a collaborative methodology for interactive scientific data visualization. Information Design Journal 27, 1 (2022), 76–84. https://doi.org/10.1075/idj.22009.hen</p><p>\\\n[22] Eric Horvitz. 1999. Principles of Mixed-Initiative User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Pittsburgh, Pennsylvania, USA) (CHI ’99). Association for Computing Machinery, New York, NY, USA, 159–166. https://doi.org/10.1145/302979.303030</p><p>\\\n[23] Thomas Höllt, Ahmed Magdy, Guoning Chen, Ganesh Gopalakrishnan, Ibrahim Hoteit, Charles D. Hansen, and Markus Hadwiger. 2013. Visual analysis of uncertainties in ocean forecasts for planning and operation of off-shore structures. In 2013 IEEE Pacific Visualization Symposium (PacificVis). 185–192. https://doi. org/10.1109/PacificVis.2013.6596144</p><p>\\\n[24] Thomas Höllt, Ahmed Magdy, Peng Zhan, Guoning Chen, Ganesh Gopalakrishnan, Ibrahim Hoteit, Charles D. Hansen, and Markus Hadwiger. 2014. Ovis: A Framework for Visual Analysisof Ocean Forecast Ensembles. IEEE Transactions on Visualization and Computer Graphics 20, 8 (2014), 1114–1126. https: //doi.org/10.1109/TVCG.2014.2307892</p><p>\\\n[25] Bo Barker Jørgensen and Antje Boetius. 2007. Feast and famine—microbial life in the deep-sea bed. Nature Reviews Microbiology 5, 10 (2007), 770–781.</p><p>\\\n[26] Patrick Köthur, Mike Sips, Henryk Dobslaw, and Doris Dransch. 2014. Visual Analytics for Comparison of Ocean Model Output with Reference Data: Detecting and Analyzing Geophysical Processes Using Clustering Ensembles. IEEE Transactions on Visualization and Computer Graphics 20, 12 (2014), 1893–1902. https://doi.org/10.1109/TVCG.2014.2346751</p><p>\\\n[27] Dan R. Lipşa, Robert S. Laramee, Simon J. Cox, Jonathan C. Roberts, Rick Walker, Michelle A. Borkin, and Hanspeter Pfister. 2012. Visualization for the Physical Sciences. Computer Graphics Forum 31, 8 (2012), 2317–2347. https://doi.org/10. 1111/j.1467-8659.2012.03184.x</p><p>\\\n[28] David Lloyd and Jason Dykes. 2011. Human-Centered Approaches in Geovisualization Design: Investigating Multiple Methods Through a Long-Term Case Study. IEEE Transactions on Visualization and Computer Graphics 17, 12 (2011), 2498–2507. https://doi.org/10.1109/TVCG.2011.209</p><p>\\\n[29] Shannon M. MacKenzie, Marc Neveu, Alfonso F. Davila, Jonathan I. Lunine, Morgan L. Cable, Charity M. Phillips-Lander, Jennifer L. Eigenbrode, J. Hunter Waite, Kate L. Craft, Jason D. Hofgartner, Chris P. McKay, Christopher R. Glein, Dana Burton, Samuel P. Kounaves, Richard A. Mathies, Steven D. Vance, Michael J. Malaska, Robert Gold, Christopher R. German, Krista M. Soderlund, Peter Willis, Caroline Freissinet, Alfred S. McEwen, John Robert Brucato, Jean-Pierre P. de Vera, Tori M. Hoehler, and Jennifer Heldmann. 2022. Science Objectives for Flagship-Class Mission Concepts for the Search for Evidence of Life at Enceladus. Astrobiology 22, 6 (2022), 685–712. https://doi.org/10.1089/ast.2020.2425</p><p>\\\n[30] Andrew Martin and Andrew McMinn. 2018. Sea ice, extremophiles and life on extra-terrestrial ocean worlds. International Journal of Astrobiology 17, 1 (2018), 1–16. https://doi.org/10.1017/S1473550416000483</p><p>\\\n[31] Eric J. Martin, David W. Caress, Hans Thomas, Brett Hobson, Richard Henthorn, Michael Risi, Charles K. Paull, James P. Barry, and Giancarlo Troni. 2016. Enabling new techniques in environmental assessment through multi-sensor hydrography. In OCEANS 2016 MTS/IEEE Monterey. 1–7. https://doi.org/10.1109/OCEANS.2016. 7761487</p><p>\\\n[32] Olivia U Mason, Di Meo-Savoie, A Carol, Joy D Van Nostrand, Jizhong Zhou, Martin R Fisk, and Stephen J Giovannoni. 2009. Prokaryotic diversity, distribution, and insights into their role in biogeochemical cycling in marine basalts. The ISME Journal 3, 2 (2009), 231–242.</p><p>\\\n[33] Sean Mckenna, Diane Staheli, and Miriah Meyer. 2015. Unlocking user-centered design methods for building cyber security visualizations. In 2015 IEEE Symposium on Visualization for Cyber Security (VizSec). 1–8. https://doi.org/10.1109/VIZSEC. 2015.7312771</p><p>\\\n[34] Kenneth H. Nealson. 1997. SEDIMENT BACTERIA: Who’s There, What Are They Doing, and What’s New? Annual Review of Earth and Planetary Sciences 25, 1 (1997), 403–434. https://doi.org/10.1146/annurev.earth.25.1.403</p><p>\\\n[35] Yukari Ohta and Yuji Hatada. 2006. A Novel Enzyme, 𝜆-Carrageenase, Isolated from a Deep-Sea Bacterium. The Journal of Biochemistry 140, 4 (10 2006), 475–481. https://doi.org/10.1093/jb/mvj180</p><p>\\\n[36] M. A. Oliver and R. Webster. 1990. Kriging: a method of interpolation for geographical information systems. International journal of geographical information systems 4, 3 (1990), 313–332. https://doi.org/10.1080/02693799008941549</p><p>\\\n[37] Jennifer Brophy Paduan, David W. Caress, Eric J. Martin, Michael Risi, Chad D. Kecy, Giancarlo Troni, and David A. Clague. 2022. Centimeter-Scale Mapping of Four Hydrothermal Vent Sites at Axial Seamount: Low-Altitude Surveys Combining Multibeam Sonar, Lidar, and Color Stereo Photography. In AGU Fall Meeting Abstracts, Vol. 2022. Article OS21B-09, OS21B-09 pages.</p><p>\\\n[38] Jennifer B. Paduan, Robert A. Zierenberg, David A. Clague, Ronald M. Spelz, David W. Caress, Giancarlo Troni, Hans Thomas, Justin Glessner, Marvin D. Lilley, Thomas Lorenson, John Lupton, Florian Neumann, Miguel A. Santa Rosa-del Rio, and C. Geoffrey Wheat. 2018. Discovery of Hydrothermal Vent Fields on Alarcón Rise and in Southern Pescadero Basin, Gulf of California. Geochemistry, Geophysics, Geosystems 19, 12 (2018), 4788–4819. https://doi.org/10.1029/ 2018GC007771</p><p>\\\n[39] S.W. Park, L. Linsen, O. Kreylos, J.D. Owens, and B. Hamann. 2006. Discrete Sibson interpolation. IEEE Transactions on Visualization and Computer Graphics 12, 2 (2006), 243–253. https://doi.org/10.1109/TVCG.2006.27</p><p>\\\n[40] Sergio Parra. 2021. DeepSEE: A Virtual Window Under the Waves. https://schmidtocean.org/cruise-log-post/deepsee-a-virtual-window-underthe-waves/</p><p>\\\n[41] Peter Pirolli and Stuart Card. 2005. The sensemaking process and leverage points for analyst technology as identified through cognitive task analysis. In Proceedings of international conference on intelligence analysis, Vol. 5. McLean, VA, USA, 2–4.</p><p>\\\n[42] Reiner Schlitzer. 2022. Ocean data view. (2022).</p><p>\\\n[43] Michael Sedlmair, Miriah Meyer, and Tamara Munzner. 2012. Design study methodology: Reflections from the trenches and the stacks. IEEE transactions on visualization and computer graphics 18, 12 (2012), 2431–2440.</p><p>\\\n[44] Yuyan Song, Jing Ye, Nikolai Svakhine, Sonia Lasher-Trapp, Mike Baldwin, and David Ebert. 2006. An Atmospheric Visual Analysis and Exploration System. IEEE Transactions on Visualization and Computer Graphics 12, 5 (2006), 1157–1164. https://doi.org/10.1109/TVCG.2006.117</p><p>\\\n[45] Daan R Speth, Feiqiao B Yu, Stephanie A Connon, Sujung Lim, John S Magyar, Manet E Peña-Salinas, Stephen R Quake, and Victoria J Orphan. 2022. Microbial communities of Auka hydrothermal sediments shed light on vent biogeography and the evolutionary history of thermophily. The ISME Journal 16, 7 (2022), 1750–1764.</p><p>\\\n[46] Pauli Virtanen, Ralf Gommers, Travis E. Oliphant, Matt Haberland, Tyler Reddy, David Cournapeau, Evgeni Burovski, Pearu Peterson, Warren Weckesser, Jonathan Bright, Stéfan J. van der Walt, Matthew Brett, Joshua Wilson, K. Jarrod Millman, Nikolay Mayorov, Andrew R. J. Nelson, Eric Jones, Robert Kern, Eric Larson, C J Carey, İlhan Polat, Yu Feng, Eric W. Moore, Jake VanderPlas, Denis Laxalde, Josef Perktold, Robert Cimrman, Ian Henriksen, E. A. Quintero, Charles R. Harris, Anne M. Archibald, Antônio H. Ribeiro, Fabian Pedregosa, Paul van Mulbregt, and SciPy 1.0 Contributors. 2020. SciPy 1.0: Fundamental Algorithms for Scientific Computing in Python. Nature Methods 17 (2020), 261–272. https://doi.org/10.1038/s41592-019-0686-2</p><p>\\\n[47] Suijie Wu, Bin Liu, and Xiaobo Zhang. 2006. Characterization of a recombinant thermostable xylanase from deep-sea thermophilic Geobacillus sp. MT-1 in East Pacific. Applied Microbiology and Biotechnology 72 (2006), 1210–1216.</p><p>\\\n[48] John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through Design as a Method for Interaction Design Research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’07). Association for Computing Machinery, New York, NY, USA, 493–502. https://doi.org/10.1145/1240624.1240704</p><p>[5] https://www.marine-geo.org/tools/search/entry.php?id=PescaderoBasin_MBARI</p><p>\\\n[6] https://datavis.caltech.edu/</p><p>(1) Adam Coscia, Georgia Institute of Technology, Atlanta, Georgia, USA (acoscia6@gatech.edu);</p><p>(2) Haley M. Sapers, Division of Geological and Planetary Sciences, California Institute of Technology, Pasadena, California, USA (hsapers@caltech.edu);</p><p>(3) Noah Deutsch, Harvard University Cambridge, Massachusetts, USA (ndeutsch@mde.harvard.edu);</p><p>(4) Malika Khurana, The New York Times Company, New York, New York, USA (malika.khurana@nytimes.com);</p><p>(5) John S. Magyar, Division of Geological and Planetary Sciences, California Institute of Technology Pasadena, California, USA (jmagyar@caltech.edu);</p><p>(6) Sergio A. Parra, Division of Geological and Planetary Sciences, California Institute of Technology Pasadena, California, USA (sparra@caltech.edu);</p><p>(7) Daniel R. Utter, rwipfler@caltech.edu Division of Geological and Planetary Sciences, California Institute of Technology Pasadena, California, USA (dutter@caltech.edu);</p><p>(8) John S. Magyar, Division of Geological and Planetary Sciences, California Institute of Technology Pasadena, California, USA (rwipfler@caltech.edu);</p><p>(9) David W. Caress, Monterey Bay Aquarium Research Institute, Moss Landing, California, USA (caress@mbari.org);</p><p>(10) Eric J. Martin Jennifer B. Paduan Monterey Bay Aquarium Research Institute, Moss Landing, California, USA (emartin@mbari.org);</p><p>(11) Jennifer B. Paduan, Monterey Bay Aquarium Research Institute, Moss Landing, California, USA (paje@mbari.org);</p><p>(12) Maggie Hendrie, ArtCenter College of Design, Pasadena, California, USA (maggie.hendrie@artcenter.edu);</p><p>(13) Santiago Lombeyda, California Institute of Technology, Pasadena, California, USA (santiago@caltech.edu);</p><p>(14) Hillary Mushkin, California Institute of Technology, Pasadena, California, USA (hmushkin@caltech.edu);</p><p>(15) Alex Endert, Georgia Institute of Technology, Atlanta, Georgia, USA (endert@gatech.edu);</p><p>(16) Scott Davidoff, Jet Propulsion Laboratory, California Institute of Technology, Pasadena, California, USA (scott.davidoff@jpl.nasa.gov);</p><p>(17) Victoria J. Orphan, Division of Geological and Planetary Sciences, California Institute of Technology, Pasadena, California, USA (vorphan@caltech.edu).</p>","contentLength":18394,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Employees of failed startups are at special risk of stolen personal data through old Google logins","url":"https://techcrunch.com/2025/01/19/employees-of-failed-startups-are-at-special-risk-of-stolen-personal-data-through-old-google-logins/","date":1737302400,"author":"Julie Bort","guid":212,"unread":true,"content":"<p>As if losing your job when the startup you work for collapses isn’t bad enough, now a security researcher has found that employees at failed startups are at particular risk of having their data stolen. This ranges from their private Slack messages to Social Security numbers and, potentially, bank accounts. The researcher who discovered the […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":412,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Meta's Superapp Ambitions Take Shape as WhatsApp Expands UPI Access in India","url":"https://hackernoon.com/metas-superapp-ambitions-take-shape-as-whatsapp-expands-upi-access-in-india?source=rss","date":1737302256,"author":"Hugh Harsono","guid":265,"unread":true,"content":"<p>\\\nIndia is considered <a href=\"https://hackernoon.com/company/whatsapp\">WhatsApp</a>’s , with many Indians using WhatsApp as their  and hundreds of millions of monthly active users. Despite the app’s immense popularity in the market, it has faced significant regulatory challenges from the Indian government, with a Delhi High Court mandating traceability (resulting in the breaking of WhatsApp’s end-to-end encryption) in , followed by a five-year ban on sharing information collected from WhatsApp by India’s Competition Commission in .</p><p>\\\nDespite these regulatory challenges, WhatsApp <a href=\"https://www.npci.org.in/PDF/npci/press-releases/2024/NPCI-Press-Release-WhatsApp-Pay-Can-Now-Extend-UPI-Services-To-All-Users-in-India.pdf\">received approval</a> from India’s National Payments Corporation of India (NPCI) in December 2024 to extend its UPI services through WhatsApp Pay to its entire Indian user base. The NPCI, which oversees the country's retail payments and settlement infrastructure, granted this permission, marking a significant expansion for WhatsApp Pay in its largest market.</p><p>\\\nThis ruling speaks to the importance of WhatsApp’s role in Indian digitalization but also highlights the increasing footprint, and therefore, a potentially Meta-branded super app, within India.</p><h3>The Indian digital payments landscape</h3><p>In , the NPCI introduced the Unified Payments Interface (UPI), a real-time, instant payment system that facilitates both peer-to-peer and merchant transactions. UPI’s core strength in enabling intermediate funds transfers through a phone number or UPI ID, along with its ability to integrate with third-party applications, has made it the de-facto backbone of all digital payments in India. UPI is also playing a <a href=\"https://www.ibef.org/blogs/digital-rupee-exploring-the-future-of-india-s-central-bank-digital-currency-cbdc\">significant role</a> in the implementation of India’s digital rupee central bank digital currency (CBDC), highlighting India’s appetite for digitalization.</p><p>\\\nPopular e-payment applications in India today  Google Pay, Walmart-backed PhonePe, Paytm, CRED, and BharatPe, which all utilize UPI to facilitate transactions. Since their respective launches, all of these applications have integrated a variety of additional digital payment features, including offline transactions, utility bill payments,</p><p>\\\nBefore this decision, WhatsApp had been limited in onboarding UPI users for Whatsapp Pay, with an initial cap of 1 million users in  (later raised to 100 million users in ), which required WhatsApp Pay to take a phased approach to expand its UPI user base.</p><p>\\n Therefore, despite currently having a relatively small share of the payments market, the removal of the user cap for WhatsApp will enable significant market share capture by India’s top communication application, with the merging of both communications and payments services potentially establishing WhatsApp’s, and a Meta-developed super app’s, dominance in the digital Indian market.</p><p> throughout the globe by WeChat and AliPay,  have played a big role in the digitization of Southeast Asian countries, with Singapore’s Grab, Indonesia’s GoJek, and South Korea’s KakaoTalk revolutionizing everything from ride-hailing to food delivery to digital payments, among many other services.</p><p>\\\nDespite these positive trends elsewhere throughout the world, superapps in India have not received much success, with one prime case study being Tata Group’s Tata Neu, launched in , which has experienced exponentially declining interest due to many . This failure could be due to market saturation from entrenched players, lack of interest from local audiences, high market share capture costs, and/or a myriad of other factors.</p><p>\\\nHowever, the removal of barriers against WhatsApp, combined with its existing popularity, especially when combined with capabilities offered by other Meta products, could help supercharge a Meta-built platform to superapp status in India.</p><p>The Indian social media market is already  by <a href=\"https://hackernoon.com/company/meta\">Meta</a> products such as Facebook and WhatsApp, with Indians being the  behind Meta-owned platform downloads. As a result, Meta’s foothold in India remains strong, giving rise to the potential of a Meta-built application with WhatsApp integration being India’s first undisputed superapp.</p><p>\\\nMeta is deeply entrenched in India in both private and public contexts. On the private front, Meta announced an expansion of its business subscription program to Indian users in , followed by an  announcement of a Meta partnership focusing on generative artificial intelligence (AI) with global conglomerate Infosys. One recent public sector partnership included the  announcement of Meta to work with the Telangana government to provide Indians with emerging technologies such as AI to enhance e-governance and citizen services. Another recent public partnership included the  announcement to partner with India’s Ministry of Skill Development and Entrepreneurship (MSDE) to integrate AI and VR into Skill India to increase and incubate talent Indian talent.</p><p>While an independently-created Meta-developed superapp, or even enhancements on WhatsApp, may seem far-fetched to some, the fact remains that Meta controls India’s most popular communication and social media platforms. The removal of restrictions on onboarding users to digital payments for one of those platforms, WhatsApp, highlights an immense opportunity for Meta to develop India’s first widely-adopted super-app.</p><p>\\\nHowever, regardless of whether a Meta-built superapp is in development or not, it is clear that WhatsApp has and will continue to play an important role in Indian digitalization, whether through its status as India’s #1 communication platform or as a growing digital payments application.</p>","contentLength":5481,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"GameGPT Launches Genesis AI NFT Collection, Combining AI And Blockchain For The Future Of Gaming","url":"https://hackernoon.com/gamegpt-launches-genesis-ai-nft-collection-combining-ai-and-blockchain-for-the-future-of-gaming?source=rss","date":1737301968,"author":"Chainwire","guid":264,"unread":true,"content":"<p>AUSTIN, United States / Texas, January 18th, 2025/Chainwire/--Bringing cutting-edge AI technology to the forefront of gaming and blockchain, GameGPT announces the official launch of their Genesis AI NFT Collection—an innovative blend of digital NFT ownership and advanced AI Agent capability.</p><p>\\\nWith this launch, GameGPT aims to redefine how video games are created: providing gamers, creators, and blockchain enthusiasts with next-generation tools for immersive digital experiences.</p><h3>A New Era for Gaming: AI Meets NFTs</h3><p>Just as AI-driven automation transformed global industries in recent years, GameGPT is poised to do the same for gaming and Web3. The company has been building AI solutions since 2020, culminating in a platform that can create fully functional video games from user prompts at a fraction of the usual development time—1/100 of the norm.</p><p>\\\nThe upcoming AI Agent NFT Collection of 6,000 NFTs offers owners the ability to upgrade these digital assets into interactive AI Agents. These Agents can:</p><ul><li>Engage with social media on behalf of the owner,</li><li>Execute blockchain transactions autonomously, and</li><li>Learn to play games built on GameGPT’s platform (or others).</li></ul><p>It’s a powerful merging of two major trends—AI and NFTs—at a time when the gaming world is increasingly embracing new technologies.</p><ul><li>AI Game Builder: turn simple text prompts into functional video games—dramatically reducing development time and costs.</li><li>Collaborative Creativity: Ideal for teams or individuals looking to expand their creative reach without requiring advanced coding skills.</li></ul><ul><li>Upgradeable Agents: Each NFT can evolve into an intelligent Agent capable of social media interactions and game-playing actions.</li><li>Blockchain Integration: Agents can perform on-chain tasks, bringing unparalleled utility to NFT ownership.</li></ul><p>Over 500k social media followers, US$11.5 million raised to date, and partnerships with leading firms such as Animoca Brands, CoinFund, Polygon, Merit Circle, Hivemind, Republic Ventures, Placeholder Ventures, and Liberty City Ventures.</p><ul><li>Start Date: January 20, 2025, 10 AM EST</li><li>Supply: 6,000 total, with 2,400 in auction.</li><li>Bid Range: 0.035–0.075 ETH</li></ul><ul><li>Target Release: Coming soon.</li><li>Access: Web-based platform; additional details will be announced closer to launch.</li></ul><p>\\\nDuring the first 12 hours of the auction, whitelisted wallets can place bids; the last 12 hours will be open to the public. If more than 2,400 bids are placed at the max bid price, the top 2,400 bidders will each win an NFT. Unsuccessful bidders receive a full refund.</p><h3>The Growing Impact of AI in Gaming</h3><p>As AI and blockchain continue to surge in adoption, GameGPT sees 2025 as a pivotal year for AI-based gaming. The ability to automate game creation and manage in-game activity through AI Agents stands to revolutionize how players and developers interact with virtual worlds.</p><blockquote><p>“We believe AI is the next frontier in game development,” says Will Deane, Founder and CEO of GameGPT.</p></blockquote><blockquote><p>“By combining blockchain with advanced AI, we’re not only speeding up the creation process but also enabling the average person to bring their game ideas to life. This launch is just our first step in radically reshaping the future of online gaming.”</p></blockquote><p>GameGPT aims to bridge the gap between AI, gaming and blockchain technology — empowering millions of gamers and creators worldwide. GameGPT’s mission is to democratize game creation through the power of AI and blockchain, making it possible for anyone to conceive, build and monetize unique gaming experiences.</p><p>\\\nThe company is best known for creating the first-ever AI Game Builder, which was demoed live for over 500,000 followers. GameGPT’s achievements are fueled by partnerships with industry leaders, including Animoca Brands, CoinFund, Aethir and others. For more information on the upcoming AI Agent NFT auction or AI Game Builder, visit  or follow their social media channels.</p><p>\\\nDisclaimer: The AI Agent NFTs are digital collectibles that enable optional AI-powered features. Buyers should familiarize themselves with potential risks, including technical, financial, and regulatory considerations.</p><p>:::tip\nThis story was distributed as a release by Chainwire under HackerNoon’s Business Blogging Program. Learn more about the program&nbsp;</p>","contentLength":4244,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Google Upgrades Open Source Vulnerability Scanning Tool with SCA Scanning Library","url":"https://news.slashdot.org/story/25/01/19/0547233/google-upgrades-open-source-vulnerability-scanning-tool-with-sca-scanning-library?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737300840,"author":"EditorDavid","guid":228,"unread":true,"content":"In 2022 Google released a tool to easily scan for vulnerabilities in dependencies named OSV-Scanner. \"Together with the open source community, we've continued to build this tool, adding remediation features,\" according to Google's security blog, \"as well as expanding ecosystem support to 11 programming languages and 20 package manager formats... Users looking for an out-of-the-box vulnerability scanning CLI tool should check out OSV-Scanner, which already provides comprehensive language package scanning capabilities...\" \n\nThursday they also announced an extensible library for \"software composition analysis\" scanning (as well as file-system scanning) named OSV-SCALIBR (Open Source Vulnerability — Software Composition Analysis LIBRary). The new library \"combines Google's internal vulnerability management expertise into one scanning library with significant new capabilities such as:\n\n Software composition analysis for installed packages, standalone binaries, as well as source code \n OSes package scanning on Linux (COS, Debian, Ubuntu, RHEL, and much more), Windows, and Mac \n Artifact and lockfile scanning in major language ecosystems (Go, Java, Javascript, Python, Ruby, and much more) \n Vulnerability scanning tools such as weak credential detectors for Linux, Windows, and Mac \n Software Bill of Materials (SBOM) generation in SPDX and CycloneDX, the two most popular document formats \n Optimization for on-host scanning of resource constrained environments where performance and low resource consumption is critical\n\n\n\"OSV-SCALIBR is now the primary software composition analysis engine used within Google for live hosts, code repos, and containers. It's been used and tested extensively across many different products and internal tools to help generate SBOMs, find vulnerabilities, and help protect our users' data at Google scale. We offer OSV-SCALIBR primarily as an open source Go library today, and we're working on adding its new capabilities into OSV-Scanner as the primary CLI interface.\"","contentLength":2017,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How to Boost App Downloads with AI-Powered Promo Videos","url":"https://hackernoon.com/how-to-boost-app-downloads-with-ai-powered-promo-videos?source=rss","date":1737300237,"author":"MarGrowth","guid":263,"unread":true,"content":"<p>\\\nCreating a top-quality app is only half the battle; the real challenge lies in effective promotion. The right marketing channels can rapidly increase your product's visibility and download conversion rates. Among the various marketing strategies, an app promotion video has become indispensable. It’s an engaging way to introduce your app, demonstrate its features, and persuade users to download it. Whether on social media, app stores, or websites, promotional videos are proven to enhance brand recognition and user engagement.</p><p>\\\nThis article will offer a beginner’s guide to making a promotional video for an app using AI tools. With the steps below, you'll be able to create attention-grabbing videos that effectively communicate your app’s value to your target audience.</p><p>Creating an app promotion video is no longer daunting, especially with the rise of AI tools designed to streamline the process. We’ll break down the steps involved in making an effective promotional video, from identifying your audience to choosing the right AI tools and then executing your vision using platforms like .</p><h3>1. Identify Your Audience and Goals</h3><p>Before diving into the technical side, it’s important to define your audience and the goals of your video. Are you aiming to increase awareness, drive app downloads, or engage users with specific features? Identifying these will guide the tone, content, and structure of your app promotion video.</p><p>Selecting the best app promotion video maker is crucial to ensure that your video not only looks professional but also meets platform-specific requirements. Similarvideo is an excellent choice, offering AI-powered features that help you generate high-quality videos quickly. With its user-friendly interface, you can create videos tailored to different platforms like YouTube, Instagram, or TikTok.</p><p>Here’s a step-by-step guide to creating your app promotional video using Similarvideo:</p><p>\\\n<strong>Step 1: Script Your Video</strong></p><p>Leverage Similarvideo’s AI-powered script generation tool to create a clear and compelling narrative. Focus on highlighting your app’s unique features, benefits, and the value it provides to users. Keep the script concise and tailored to your target audience. Upload relevant images, such as app screenshots or promotional graphics, to enhance your script visually.</p><p><strong>Step 2: Select a Visual Style</strong></p><p>Choose a visual style from the options available in Similarvideo. Opt for B-roll Footage to add professional and dynamic visuals that complement your app’s branding and message.</p><p>\\\n</p><p>Review your video using the platform’s real-time preview feature. Refine the content by adjusting transitions, syncing visuals with the script, and incorporating captions to improve accessibility and engagement.</p><p>\\\n<strong>Step 4: Publish and Distribute</strong></p><p>Finalize your app promotion video and export it in your desired format. Distribute it across key channels such as social media platforms, app stores, email campaigns, and messaging apps to maximize your app’s visibility and user reach. By following these steps, you can create professional and captivating promotional videos that effectively showcase your app and drive downloads.</p><p>Creating a great app promotional video is about more than just showcasing features—it’s about captivating your audience. Here are some tips to help you create compelling promotional videos that resonate with viewers.</p><ul><li>Short Promo Videos Are Always Better: Attention spans are shorter than ever, especially online. Studies show that videos under 30 seconds are more likely to be watched in full. Focus on delivering your core message quickly and clearly to keep your audience engaged.</li></ul><ul><li>Brand Your Promo Video: Your promotional video should reflect your app’s brand identity. Use consistent colors, fonts, and logos to build recognition. Incorporate your brand's tone and messaging to create a cohesive experience for your users.</li></ul><ul><li><p>Optimize Your Video with SEO Strategies:For better visibility, make sure your video is SEO-optimized. Use relevant keywords like “app promotion video template” or “free promo video templates after effects” in your video’s title, description, and tags. This will help your video rank higher on platforms like YouTube.</p></li></ul><p>To enhance discoverability,  recommends integrating SEO into your video marketing strategy. Optimizing your video with keywords, descriptions, and relevant tags can significantly improve its visibility and engagement rate.</p><ul><li>Strong Call-to-Action: A great video always ends with a strong call-to-action (CTA). Whether it's prompting users to download your app or visit your website, make sure your CTA is clear and actionable.</li></ul><ul><li>Showcase App Features: Don’t just tell your audience about your app—show them. Highlight key features with dynamic visuals to give potential users a taste of what your app can offer.</li></ul><ul><li>Promo Creativity: Creativity is key to standing out. Think outside the box—use animation, user testimonials, or even humor to make your video memorable.</li></ul><p>In conclusion, creating app promotional videos has never been easier with the help of AI tools. Platforms like Similarvideo simplify the video creation process by offering AI-powered features such as script generation, voice cloning, and dynamic editing. These tools help you create high-quality videos that captivate your audience and boost your app’s visibility.By following the steps outlined in this guide, you can create professional, attention-grabbing&nbsp;promotional videos that showcase your app’s unique features and drive user engagement.</p><p>\\\nWhether you’re a beginner or an experienced marketer, leveraging AI technology can save you time and resources while enhancing your video’s impact.</p><p>\\\nWe recommend trying Similarvideo to streamline your video creation process and create videos that effectively promote your app. Get started today and see how AI can elevate your marketing strategy!</p><p>Have more questions about creating app promotional videos? Check out the answers to some frequently asked questions below!</p><p>The best AI tool for creating app promotional videos is Similarvideo. It offers a range of features such as script generation, voice cloning, and video editing to help you create high-quality videos quickly and easily.</p><h3>How to Create Video Ads With AI?</h3><p>Creating video ads with AI is simple with tools like Similarvideo.</p><p>\\\n Select your ad objective and audience.</p><p> Generate a script with the AI tool.</p><p> Choose a voice and upload visuals.</p><p> Customize your video with transitions and effects.</p><p> Export your video and publish it on ad platforms.</p><p>The most important quality of a good app promotion video is clarity. It should clearly communicate the app’s value and features while keeping the audience engaged through visuals and a strong call-to-action.</p>","contentLength":6738,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI isn’t very good at history, new paper finds","url":"https://techcrunch.com/2025/01/19/ai-isnt-very-good-at-history-new-paper-finds/","date":1737298860,"author":"Charles Rollet","guid":211,"unread":true,"content":"<p>Top LLMs performed poorly on a high-level history test, a new paper has found.</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":141,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Are 'Career Catfishers' Justified In Not Showing Up for Work?","url":"https://it.slashdot.org/story/25/01/18/0018202/are-career-catfishers-justified-in-not-showing-up-for-work?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737290040,"author":"EditorDavid","guid":227,"unread":true,"content":" Fortune reports 18% of workers have engaged in \"career catfishing\" — getting a job offer, but then refusing to show up on the first day of work. \n\nAnd when someone posted Fortune's article to Reddit's antiwork subreddit, it drew 2,100 upvotes -- and another 84 comments. (\"I love doing this...! This feels really great to do after a company has jerked you around, and basically said that several other people were in line ahead of you... after five interviews.\") \n\nBut Fortune reports there's other sources of frustration:\n\nAt the moment, Gen Z is contending with an onerous battle to land an entry-level, full-time role. The class of 2025 is set to apply to more jobs than the graduating class prior, already submitting 24% more applications on average this past summer than seniors did last year. Furthermore, the class of 2024 applied to 64% more jobs than the cohort before them, according to job platform Handshake. To make matters all the more bleak, the number of job listings has dwindled from 2023 levels, generating deeper frenzy and more intense competition for the roles listed. \n\n\nThat adds up to a hiring managers' market and senior executives are playing hardball; only 12% of mid-level executives think entry-level workers are prepared to join the workforce, per a report from technology education provider General Assembly. About one in four say they wouldn't hire today's entry-level employees. Yet, that's not really the point of entry-level roles, points out Jourdan Hathaway, General Assembly's chief business officer. By definition, it's a position that requires investment in a young adult, she explained. \"The entry-level employee pipeline is broken,\" Hathaway wrote in a statement. \"Companies must rethink how they source, train, and onboard employees.\" \n\nThe especially competitive hiring landscape could be forcing Gen Zers to accept the first gig they can get because the job market is so dire — only to later regret it and not show up the first day. \n\nThe article also acknowledges that \"employers themselves have a role in the two-way communication — or lack thereof — between hire and hirer.\"\n\nAlmost 80% of hiring managers admitted they've stopped responding to candidates during the application process, according to a survey of 625 hiring managers from Resume Genius. \n\nGen Zers say that their ghosting is in reaction to the company's behavior. More than a third of applicants who have purposefully dropped the ball say it was because a recruiter was rude to them or misled them about a position, according to Monster... In part, it's likely AI that's fueling said ghosting. AI has become more integrated into the hiring process, becoming a screener that rejects resumes without ever reaching a human person's eyes. That phenomenon possibly fuels both sides' tendency to be non-responsive...","contentLength":2834,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux To Allow Adjusting pid_max Per PID Namespace - Helping Old Software","url":"https://www.phoronix.com/news/Linux-6.14-PID-Namespace","date":1737287580,"author":"Michael Larabel","guid":640,"unread":true,"content":"<article>The pid_max tunable for the maximum number of process IDs allowed simultaneously was increased by default back in 2019 with systemd. But that increase breaks a long held assumption by some user-space software that pid_max or the process ID would not be greater than 65,535. To now better workaround such outdated user-space software, a set of patches for the Linux 6.14 kernel will allow adjusting the pid_max limit on a per PID namespace basis to help cope with such software hitting such artificial limits and without having to lower the overall system limit...</article>","contentLength":563,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A Last Minute Fix For EEVDF Scheduling Lag With Linux 6.13","url":"https://www.phoronix.com/news/Linux-6.13-Last-Minute-EEVDF","date":1737286277,"author":"Michael Larabel","guid":639,"unread":true,"content":"<article>Ahead of the Linux 6.13 stable kernel expected to be released later today, there is a last minute fix for the EEVDF CPU scheduler...</article>","contentLength":132,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Rust Coreutils 0.0.29 Brings Improved Compatibility, New Performance Optimizations","url":"https://www.phoronix.com/news/Rust-Coreutils-uutils-0.0.29","date":1737285317,"author":"Michael Larabel","guid":638,"unread":true,"content":"<article>Following the release a few days ago of GNU Coreutils 9.6, the Rust Coreutils \"uutils\" project as a re-implementation of these core utilities within the Rust programming language is out with a fresh update...</article>","contentLength":208,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.14 EDAC Preps For Intel Clearwater Forest, Adds LoongArch Driver For ECC Memory","url":"https://www.phoronix.com/news/Linux-6.14-EDAC","date":1737284240,"author":"Michael Larabel","guid":637,"unread":true,"content":"<article>The Error Detection And Correction (EDAC) subsystem updates have been sent out in advance of the Linux 6.14 merge window opening...</article>","contentLength":131,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Scientists Probe Mysterious Oxygen Source Possibly Discovered on the Sea Floor","url":"https://news.slashdot.org/story/25/01/18/2240252/scientists-probe-mysterious-oxygen-source-possibly-discovered-on-the-sea-floor?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737275640,"author":"EditorDavid","guid":226,"unread":true,"content":"CNN has the latest on \"a startling discovery made public in July that metallic rocks were apparently producing oxygen on the Pacific Ocean's seabed, where no light can penetrate. \n\n\"Initial research suggested potato-size nodules rich in metals, predominantly found 4,000 meters (13,100 feet) below the surface in the Clarion-Clipperton Zone, released an electrical charge, splitting seawater into oxygen and hydrogen through electrolysis.\"\n\n The unprecedented natural phenomenon challenges the idea that oxygen can only be made from sunlight via photosynthesis. Andrew Sweetman, a professor at the UK's Scottish Association for Marine Science who was behind the find, is embarking on a three-year project to investigate the production of \"dark\" oxygen further... Uncovering dark oxygen revealed just how little is known about the deep ocean, and the Clarion-Clipperton Zone, or CCZ, in particular. The region is being explored for the deep-sea mining of rare metals contained in the rock nodules. The latter are formed over millions of years, and the metals play a key role in new and green technologies... \n\nUnderstanding the phenomenon better could also help space scientists find life beyond Earth, [Sweetman] added... Officials at NASA are interested in the research on dark oxygen production because it could inform scientific understanding of how life might be sustained on other planets without direct sunlight, Sweetman said. The space agency wants to run experiments to understand the amount of energy required to potentially produce oxygen at higher pressures that occur on Enceladus and Europa, the icy moons of Saturn and Jupiter, respectively, he added. Those moons are among the targets for investigating the possibility of life. \n\n Deep-sea mining companies are aiming to mine the cobalt, nickel, copper, lithium and manganese contained in the nodules for use in solar panels, electric car batteries and other green technology. Some companies have taken issue with Sweetman's research. Critics say deep-sea mining could irrevocably damage the pristine underwater environment and that it could disrupt the way carbon is stored in the ocean, contributing to the climate crisis. \n\nCNN's article also notes Massachusetts microbiologist Emil Ruff, who found unexpected oxygen far below the Canadian prairie in water isolated from the atmosphere for more than 40,000 years. \n\"Nature keeps surprising us,\" he said. \"There are so many things that people have said, 'Oh, this is impossible,' and then later it turns out it's not.\"","contentLength":2536,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Apple lists all apps it removed alongside TikTok in the U.S.","url":"https://techcrunch.com/2025/01/18/apple-lists-all-apps-it-removed-alongside-tiktok-in-the-u-s/","date":1737273368,"author":"Ivan Mehta","guid":210,"unread":true,"content":"<p>In a rare move amid the TikTok shutdown, Apple has published a statement and a support document listing all affected apps that are inaccessible in the U.S. The iPhone maker typically doesn’t publish information when it blocks apps. Notably, other ByteDance apps, including CapCut, Lemon8 — which surged in the last few months — and […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":406,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The TechBeat: Project DIGITS: NVIDIA’s Leap into Personal AI Supercomputing (1/19/2025)","url":"https://hackernoon.com/1-19-2025-techbeat?source=rss","date":1737270652,"author":"Techbeat","guid":262,"unread":true,"content":"<p>By <a href=\"https://hackernoon.com/u/filestack\">@filestack</a> [ 4 Min read ] \n This article highlights the eight best JavaScript APIs for file uploads in 2025, analyzing factors such as scalability, ease of use, and advanced features. <a href=\"https://hackernoon.com/the-best-javascript-apis-for-file-upload-in-2025\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/lumoz\">@lumoz</a> [ 5 Min read ] \n AI Agents demonstrate potential in Web3 applications, such as managing private keys, automating transactions, and supporting DAO operations.  <a href=\"https://hackernoon.com/lumoz-unveils-teezk-multi-proof-for-on-chain-ai-agent\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/awsmarketplace\">@awsmarketplace</a> [ 10 Min read ] \n Meet Fortinet FortiGate: AI-Powered Firewall Ranked by Gartner in the Leader’s Quadrant 13 Years in a Row. <a href=\"https://hackernoon.com/fortinet-fortigate-vm-enterprise-class-security-for-applications-and-workloads-running-on-aws\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/mexcmedia\">@mexcmedia</a> [ 5 Min read ] \n Discover how AI agents and blockchain are merging to drive the next crypto bull run, with top-performing projects like $GOAT and $VIRTUAL leading the way. <a href=\"https://hackernoon.com/will-ai-agents-lead-the-next-big-crypto-bull-run\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/hackernooncontests\">@hackernooncontests</a> [ 4 Min read ] \n Join the Spacecoin Writing Contest, today! Win from a 15,000 USDT prize pool by writing on decentralized internet, space tech, blockchain use cases &amp; more.  <a href=\"https://hackernoon.com/win-your-share-of-15000-usdt-in-the-spacecoin-writing-contest-by-spacecoin-and-hackernoon\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/mexcmedia\">@mexcmedia</a> [ 5 Min read ] \n Discover the latest crypto bull run trends! Bitcoin hits $108K, Ethereum rallies, and traders explore MEXC tools for maximizing gains in a volatile market. <a href=\"https://hackernoon.com/navigating-the-latest-crypto-bull-run-a-quick-guide-for-traders\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/dmytrospilka\">@dmytrospilka</a> [ 4 Min read ] \n Let’s take a deeper look into what could become a watershed moment for the cryptocurrency landscape. <a href=\"https://hackernoon.com/could-a-trump-bitcoin-reserve-spark-an-unprecedented-cryptocurrency-market-rally\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/aisweatshop\">@aisweatshop</a> [ 4 Min read ] \n Gameboi.AI reinvents Web3 airdrops with AI-powered, bot-proof, fun, and fair campaigns. Engage on X, earn $OPEN points, and join the decentralized revolution.  <a href=\"https://hackernoon.com/gameboiai-your-new-247-airdrop-specialist-is-live-on-x-twitter\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/dadan\">@dadan</a> [ 5 Min read ] \n AI tools like Dadan.io can help to propel video creators to new heights in 2025 and beyond.  <a href=\"https://hackernoon.com/how-ai-is-changing-the-way-we-make-and-share-videos\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/dadan\">@dadan</a> [ 5 Min read ] \n Choosing the right recording software is vital for creators to streamline video production, grow audiences, and succeed in the competitive digital space.  <a href=\"https://hackernoon.com/why-your-choice-of-recording-software-is-important-for-long-term-success\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/2077research\">@2077research</a> [ 26 Min read ] \n Learn about ERC-7683, an Ethereum standard designed to streamline cross-chain intents, improve rollup interoperability, and fix fragmentation of Layer 2 chains. <a href=\"https://hackernoon.com/erc-7683-unifying-ethereum-with-cross-chain-intents\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/juancguerrero\">@juancguerrero</a> [ 3 Min read ] \n Michael Saylor is not advancing Satoshi's vision – he's systematically dismantling it. <a href=\"https://hackernoon.com/bitcoins-judas-how-michael-saylors-support-is-killing-satoshis-vision\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/2077research\">@2077research</a> [ 13 Min read ] \n Learn how EIP-7762 and EIP-7691 improve Ethereum blobs—boosting scalability and storage efficiency while transforming Ethereum's architecture. <a href=\"https://hackernoon.com/eip-7762-and-eip-7691-making-ethereum-blobs-great-again\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/davidjdeal\">@davidjdeal</a> [ 6 Min read ] \n Read this article to understand the significance of Project DIGITS, the AI deskiop supercomputer from NVIDIA. <a href=\"https://hackernoon.com/project-digits-nvidias-leap-into-personal-ai-supercomputing\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/gleams\">@gleams</a> [ 8 Min read ] \n While AI offers efficient shortcuts to problem-solving, it changes the nature of the journey that shapes our genius. <a href=\"https://hackernoon.com/i-over-relied-on-ai-and-those-shortcuts-cost-me\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/lrochat\">@lrochat</a> [ 6 Min read ] \n The time to start building one's synthetic replacement is now. <a href=\"https://hackernoon.com/why-i-built-a-saas-to-replace-myself\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/socialai\">@socialai</a> [ 3 Min read ] \n Discover Social AI, the Web3-powered social media platform that puts YOU in control. Own your data, earn rewards, and experience AI-powered tools like Victoria  <a href=\"https://hackernoon.com/break-free-from-big-tech-join-the-social-ai-revolution\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/proflead\">@proflead</a> [ 3 Min read ] \n Google recently unveiled Gemini 2.0, its latest and most advanced AI model in what it terms the “agentic era.” <a href=\"https://hackernoon.com/google-unveils-its-most-powerful-ai-yet\">Read More.</a></p>","contentLength":3099,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A 'Hubble Crisis'? New Measurement Confirms Universe is Expanding Too Fast for Current Models","url":"https://science.slashdot.org/story/25/01/19/0422230/a-hubble-crisis-new-measurement-confirms-universe-is-expanding-too-fast-for-current-models?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737264840,"author":"EditorDavid","guid":225,"unread":true,"content":"\"The universe is expanding faster than predicted by theoretical models,\" writes Phys.org, \"and faster than can be explained by our current understanding of physics.\" There's now been new confirmation of this (published in The Astrophysical Journal Letters) by a team led by Dan Scolnic, an associate professor of physics at Duke University. \n\nAnd this means the so-called Hubble tension \"now turns into a crisis,\" said Dan Scolnic, who led the research team... This is saying, to some respect, that our model of cosmology might be broken.\"\nMeasuring the universe requires a cosmic ladder, which is a succession of methods used to measure the distances to celestial objects, with each method, or \"rung,\" relying on the previous for calibration. The ladder used by Scolnic was created by a separate team using data from the Dark Energy Spectroscopic Instrument (DESI), which is observing more than 100,000 galaxies every night from its vantage point at the Kitt Peak National Observatory. Scolnic recognized that this ladder could be anchored closer to Earth with a more precise distance to the Coma Cluster, one of the galaxy clusters nearest to us. \"The DESI collaboration did the really hard part, their ladder was missing the first rung,\" said Scolnic. \"I knew how to get it, and I knew that that would give us one of the most precise measurements of the Hubble constant we could get, so when their paper came out, I dropped absolutely everything and worked on this non-stop.\" \n\nTo get a precise distance to the Coma cluster, Scolnic and his collaborators used the light curves from 12 Type Ia supernovae within the cluster. Just like candles lighting a dark path, Type Ia supernovae have a predictable luminosity that correlates to their distance, making them reliable objects for distance calculations. The team arrived at a distance of about 320 million light-years, nearly in the center of the range of distances reported across 40 years of previous studies — a reassuring sign of its accuracy. \"This measurement isn't biased by how we think the Hubble tension story will end,\" said Scolnic. \"This cluster is in our backyard, it has been measured long before anyone knew how important it was going to be.\" \n\nThe results? \"It matches the universe's expansion rate as other teams have recently measured it,\" writes Phys.org, \"but not as our current understanding of physics predicts it. The longstanding question is: is the flaw in the measurements or in the models? Scolnic's team's new results add tremendous support to the emerging picture that the root of the Hubble tension lies in the models...\" \n\nAnd the article closes with this quote from Scolnic:\n\n\"Ultimately, even though we're swapping out so many of the pieces, we all still get a very similar number. So, for me, this is as good of a confirmation as it's ever gotten. We're at a point where we're pressing really hard against the models we've been using for two and a half decades, and we're seeing that things aren't matching up,\" said Scolnic. \n\n\"This may be reshaping how we think about the universe, and it's exciting! There are still surprises left in cosmology, and who knows what discoveries will come next?\"","contentLength":3185,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"After PFAS Contamination on English Channel Island, Government Panel Recommends Bloodletting for Those Affected","url":"https://science.slashdot.org/story/25/01/18/2310259/after-pfas-contamination-on-english-channel-island-government-panel-recommends-bloodletting-for-those-affected?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737257640,"author":"EditorDavid","guid":224,"unread":true,"content":"Jersey is an island in the English channel, \"a self-governing British Crown Dependency near the coast of northwest France,\" according to Wikipedia — population: 103,267. \n\nBut now some residents of Jersey \"have been recommended bloodletting to reduce high concentrations of 'forever chemicals' in their blood,\" reports the Guardian, \"after tests showed some islanders have levels that can lead to health problems.\"\n\n\nPrivate drinking water supplies in Jersey were polluted by the use of firefighting foams containing PFAS (per- and polyfluoroalkyl substances) at the island's airport, which were manufactured by the U.S. multinational 3M. .. Bloodletting draws blood from a vein in measured amounts. It is safe and the body replenishes the blood naturally, but it must be repeated until clean... \n\nIn response to the blood results, the government established an independent PFAS scientific advisory panel to advise public policy. The panel's first report recommended that the government should look at offering bloodletting to affected residents. \"Studies show that bloodletting is an effective way to lower levels of PFAS in blood,\" said Ian Cousins, one of the panel members, though he added that there were no guarantees the process would prevent or cure diseases associated with the chemicals. The therapy costs about £100,000 upfront and then as much as £200,000 a year to treat 50 people. The panel is also considering the benefit of the drug cholestyramine, which a study has shown reduces PFAS in blood more quickly and cheaply, albeit with possible side effects. The government says it plans to launch a clinical service by early 2025. \n\nContamination persisted on the island for decades. \"We know they started to use 3M's firefighting foam in the 1960s and then ramped up in the 1990s in weekly fire training exercises, after which foam started to appear in nearby streams,\" said Jeremy Snowdon, a former Jersey airport engineer who drank contaminated water for years. He has measured elevated levels of PFAS in his own blood and has high cholesterol. \n\nThe article includes this quote from one of the 88 residents of the polluted area found to have high levels of PFAS after blood testing. \"I just want this out of my body. I don't want to end up with bladder cancer.\"","contentLength":2283,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"On Eve of TikTok Ban, Chinese App RedNote Surges in Popularity, Delighting Chinese State Media","url":"https://yro.slashdot.org/story/25/01/19/0016233/on-eve-of-tiktok-ban-chinese-app-rednote-surges-in-popularity-delighting-chinese-state-media?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737250440,"author":"EditorDavid","guid":223,"unread":true,"content":"Chinese social-networking site RedNote became the #1 most-downloaded app in America, reports the Associated Press, with some new users considering it a way to protest America's possible TikTok ban. \n\nSo what happened next?\nThey were met with surprise, curiosity and in-jokes on Xiaohongshu — literally, \"Little Red Book\" — whose users saw English-language posts take over feeds almost overnight. Americans introduced themselves with hashtag TikTok refugees, ask me anything attitude and posting photos of their pets to pay their hosts' \"cat tax.\" Parents swapped stories about raising kids and Swifties from both countries, of course, quickly found each other. It's a rare moment of direct contact between two online worlds that are usually kept apart by language, corporate boundaries, and China's strict system of online censorship that blocks access to nearly all international media and social media services... Xiaohongshu's 300 million monthly active users are overwhelmingly Chinese — so much so that parts of its interface have no English-language version... [Press reports suggest about a million of TikTok's 170 million users tried switching to RedNote this week...] \n\nOn the platform, two versions of the TikTok refugee hashtag have over 24 million posts, with related posts appearing at the top of many users' feeds. A large number of American users say they've received a warm welcome from the community, with #TikTokrefugee. \"Welcome the global villagers\" remains the top one trending topic on Xiaohongshu, with 8.9 million views on Thursday. Users from both countries are comparing notes on grocery prices, rent, health insurance, medical bills and the relationship between mother-in-law and daughter-in-law. Parents talk about what the kids learn in school in two countries. Some have already joined book clubs and are building up a community. American users asked how Chinese see the LGBTQ community and got warned that it was among sensitive topics, Chinese users taught Americans what are sensitive topics and key words to avoid censorship on the app. Chinese students pulled out their English homework, looking for help. \n\nChinese state media, which have long dismissed U.S. allegations against TikTok, have welcomed the protest against the ban. People's Daily [the official newspaper of the Central Committee of the Chinese Communist Party], said in an op-ed about TikTok refugees on Thursday that says the TikTok refugees found a \"new home,\" and \"openness, communication, and mutual learning are the unchanging themes of mankind and the heartfelt desires of people from all countries.\" \nMaking the most of the moment is Jianlu Bi, who is apparently a senior content producer for Beijing's state-run China Global Television Network, which Wikipedia describes as \"under the control of the Central Propaganda Department of the Chinese Communist Party\". Friday Jianlu Bi crafted an article claiming \"surprising\" and \"stark contrasts\" were revealed:\nWhile the United States is often portrayed as a land of limitless opportunity, many American netizens have shared their struggles with high living costs, particularly in urban areas. One common theme is the exorbitant cost of healthcare. \"I just got a simple bill for a routine checkup and it was over $500,\" shared one American user. \"I can't imagine what a serious illness would cost! I feel like I'm constantly on the brink of financial ruin due to medical expenses.\" In contrast, Chinese netizens often express surprise at the affordability of many goods and services in their home country. For instance, the cost of housing, particularly in smaller cities, is often significantly lower in China compared to the United States.... This disparity is often attributed to factors such as government policies, economic development, and cultural differences... \n\nTraditional media narratives often present simplified and often biased portrayals of China and the United States. For example, the U.S. is often portrayed as a land of opportunity with limitless possibilities, while China is sometimes depicted as a country with limited freedoms. Xiaohongshu, on the other hand, provides a platform for ordinary people to share their authentic experiences and perspectives... A Chinese student studying in the U.S. shared, \"I was surprised to learn that many of my classmates are working part-time jobs to cover their tuition and living expenses. This is very different from the image of affluent American students I had in my mind. It really opened my eyes to the realities of life for many young people in the U.S.\" \n\n\"As social media continues to evolve, these platforms will undoubtedly play an increasingly important role in shaping global perceptions...\" the article concludes. \n\nArticle suggested by long-time Slashdot reader hackingbear.","contentLength":4812,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"WSJ Reports 'The Balance of Power is Shifting Back to Bosses'","url":"https://it.slashdot.org/story/25/01/18/0121213/wsj-reports-the-balance-of-power-is-shifting-back-to-bosses?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737242280,"author":"EditorDavid","guid":222,"unread":true,"content":"The ratio of vacant U.S. jobs to jobless workers \"has fallen from a record of 2 in 2022 to 1.1 in November,\" reports the Wall Street Journal — which adds that \"the balance of power between employers and employees has shifted as the labor market has gone from white-hot to merely solid.\" \n\nJP Morgan's five-days-a-week return-to-office mandate was only the beginning, with big companies like Amazon and Dell \"tightening remote-work policies, shrinking travel budgets and cutting back on benefits... Companies are slashing perks such as college-tuition assistance and time off for a sick pet... \"\n\n\n76% of [U.S.] job growth in the past year has been in healthcare and education, leisure and hospitality, and government. In fields such as finance, information, and professional and business services, job growth has been far weaker. While a shift in leverage to employers might have shown up in layoffs or wage cuts in the past, now it is more subtle, often in changes to working conditions. For example, knowing that some workers will quit rather than return to the office, some companies are ending remote work as a way of trimming payroll. \"Quiet quitting\" — workers who slacked off rather than quit — has been replaced by \"quiet cutting\" — employers who cut jobs without actually announcing job cuts... \n\nMichael Gibbs, a professor of economics at the University of Chicago's Booth School of Business, said the new mandates might simply be a message to workers that times have changed. \"Firms are trying to reset expectations,\" he said... [After refusing her employers return-to-office four-days-a-week mandate, Mayrian] Sanz, who now works as an independent business and leadership coach, said she applied for 25 to 30 jobs listed as remote but initially got no responses. When some hiring managers finally replied, they had a surprise: Jobs listed as remote would now be in-office. \"They just say everything is shifting to going back to the office,\" she said. \n\nAmong tech workers, the share receiving perks such as paid volunteer hours, college-tuition reimbursement, free financial advice and mental-health programs all declined by about 4 percentage points in 2024 from 2023, according to Dice, a technology job board. Average bonuses fell by more than $800, from $15,011 to $14,194. Meanwhile, Netflix has quietly backed off from its unlimited parental leave in a child's first year, The Wall Street Journal reported last month. A company spokesman said at that time that employees have the freedom and flexibility to determine what is best for them. \n\nThe article notes that \"The actual impact of return-to-office directives remains to be seen,\" with economists \"skeptical\" the directives make companies more productive and faster-growing:\n\nMany workers now being called in were already spending some time in their cubicles. Nicholas Bloom, a professor of economics at Stanford University, said most of the benefits of collaboration can be achieved with just a few days in the office, while some tasks that require concentration are better done at home. \nElsewhere the Wall Street Journal that looking for a job \"is set to get less miserable this year,\" since roughly two-thirds of U.S. employers plan to add permanent roles within the next six months, \"according to a new survey by staffing and consulting firm Robert Half.\" \n\nAnd Computerworld notes that the IT unemployment rate is now just 2% in the U.S. (according to official figures from the US Bureau of Labor statistics).","contentLength":3496,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Perplexity AI submits bid to merge with TikTok","url":"https://techcrunch.com/2025/01/18/perplexity-ai-submits-bid-to-merge-with-tiktok/","date":1737235236,"author":"Anthony Ha","guid":209,"unread":true,"content":"<p>With a TikTok ban looming in the United States, Perplexity AI is the latest bidder hoping to give the video app a new corporate home. CNBC first reported on Perplexity’s interest. A source with knowledge of the offer confirmed to TechCrunch that Perplexity (whose CEO Aravind Srinivas is pictured above) has submitted a bid to […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":397,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"New \"mountinfo\" Program Set To Be Bundled With Linux 6.14","url":"https://www.phoronix.com/news/Linux-6.14-mountinfo","date":1737234558,"author":"Michael Larabel","guid":636,"unread":true,"content":"<article>The VFS mount pull request was sent out today in advance of the Linux 6.14 merge window opening. One of the changes here is adding a new mountinfo program to the Linux kernel source tree...</article>","contentLength":189,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"FTC says partnerships like Microsoft-OpenAI raise antitrust concerns","url":"https://techcrunch.com/2025/01/18/ftc-says-partnerships-like-microsoft-openai-raise-antitrust-concerns/","date":1737233336,"author":"Anthony Ha","guid":208,"unread":true,"content":"<p>The Federal Trade Commission said in a staff report issued Friday that there are potential competitive issues in partnerships between big tech companies and generative AI developers — specifically, Microsoft’s backing of OpenAI and Amazon and Alphabet/Google’s partnerships with Anthropic. “The FTC’s report sheds light on how partnerships by big tech firms can create lock-in, […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":456,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"What we know about the TikTok ban","url":"https://techcrunch.com/2025/01/18/what-we-know-about-the-tiktok-ban/","date":1737223500,"author":"Cody Corrall","guid":207,"unread":true,"content":"<p>Welcome back to Week in Review. This week, we’re looking at the impacts of the looming TikTok ban in the U.S., including the “TikTok refugees” moving to Chinese app RedNote, the surge of English speakers learning Mandarin on Duolingo, and more! Let’s get into it. The Supreme Court upheld the law that will effectively ban […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":399,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"QH Electronics Game Controller Support Being Added For Linux 6.14","url":"https://www.phoronix.com/news/QH-Electronics-XPad-Linux-6.14","date":1737221055,"author":"Michael Larabel","guid":635,"unread":true,"content":"<article>Thanks to Valve, another Xbox 360-compatible game controller will see support with the upstream XPad input driver with the upcoming Linux 6.14 kernel...</article>","contentLength":152,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Once high-flying proptech startups Divvy Homes and EasyKnock are the latest to struggle","url":"https://techcrunch.com/2025/01/18/once-high-flying-proptech-startups-divvy-homes-easyknock-are-the-latest-to-struggle/","date":1737216000,"author":"Mary Ann Azevedo, Marina Temkin","guid":206,"unread":true,"content":"<p>Many proptech startups, born and funded during the low-interest-rate heydays, are in the throes of struggle. With investments into U.S.-based real estate startups falling from $11.1 billion in 2021 to $3.7 billion last year, according to PitchBook data, some are selling themselves off, while others are closing shop. The two most recent examples are the […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":423,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"DOJ confirms arrested US Army soldier is linked to AT&T and Verizon hacks","url":"https://techcrunch.com/2025/01/18/doj-confirms-arrested-us-army-soldier-is-linked-to-att-and-verizon-hacks/","date":1737214032,"author":"Zack Whittaker","guid":205,"unread":true,"content":"<p>The alleged hacker claimed to have access to huge amounts of call records, including VP Kamala Harris and President Trump.</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":185,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"TikTok says it will go dark Sunday unless Biden offers ‘definitive statement’","url":"https://techcrunch.com/2025/01/18/tiktok-says-it-will-go-dark-sunday-unless-biden-offers-definitive-statement/","date":1737213745,"author":"Anthony Ha","guid":204,"unread":true,"content":"<p>It remains unclear whether TikTok will still be available in the United States on Sunday, with the company claiming that President Joe Biden’s outgoing administration needs to offer “definitive” assurances that it won’t enforce a ban. On Friday, the Supreme Court upheld a law that would effectively ban TikTok in the US if the app’s […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":412,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.14 To Perform Better With The Drgn Debugger Via Faster /proc/kcore Reads","url":"https://www.phoronix.com/news/Linux-6.14-Faster-kcore-Reads","date":1737212676,"author":"Michael Larabel","guid":634,"unread":true,"content":"<article>Christian Brauner of Microsoft began sending out his various pull requests today of new material for the Linux 6.14 kernel in advance of the merge window expected to open next week. One of the interesting pull requests is carrying the work of Omar Sandoval for faster /proc/kcore reads that can help with debugger performance...</article>","contentLength":328,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"GNU Debugger GDB 16.1 Brings Better Intel PT Support, gstack Added","url":"https://www.phoronix.com/news/GNU-Debugger-GDB-16.1","date":1737210559,"author":"Michael Larabel","guid":633,"unread":true,"content":"<article>GDB 16.1 was tagged today as the newest version of the GNU Debugger for helping debug a variety of programming languages on numerous different CPU architectures and platforms...</article>","contentLength":177,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"5 AI Image Generators You Can Use Now","url":"https://spectrum.ieee.org/ai-art-generator-2670499999","date":1737208802,"author":"Matthew S. Smith","guid":80,"unread":true,"content":"<p>AI art generation has entered an era of evolution over revolution</p>","contentLength":65,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTU2NjQwNC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTczOTc1NjAyMX0.NVrvYXtgXIfRKFcoKIQAMOxLtAUzTT0nixILn1jMOlc/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"Intel Tofino P4 Software Open-Sourced Years Later","url":"https://www.phoronix.com/news/Intel-Tofino-P4-Open-Source","date":1737203043,"author":"Michael Larabel","guid":632,"unread":true,"content":"<article>An interesting open-source announcement out of Intel this week is that they have open-sourced their P4 software for their line of Tofino programmable Ethernet switches...</article>","contentLength":170,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How victims of PowerSchool’s data breach helped each other investigate ‘massive’ hack","url":"https://techcrunch.com/2025/01/18/how-victims-of-powerschools-data-breach-helped-each-other-investigate-massive-hack/","date":1737201600,"author":"Lorenzo Franceschi-Bicchierai","guid":203,"unread":true,"content":"<p>School workers say they resorted to crowdsourcing help among each other following PowerSchool's breach, fueled by solidarity and the slow response from PowerSchool.</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":227,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"GNOME Snapshot Can Now Read QR Codes, Flatpak 1.16 Brings More Features","url":"https://www.phoronix.com/news/GNOME-48-Alpha-Week","date":1737201203,"author":"Michael Larabel","guid":631,"unread":true,"content":"<article>It was a busy week in the GNOME space with many packages checking in their \"48.alpha\" releases for the GNOME 48 Alpha milestone. Plus there has been some additional exciting GNOME developments for the week...</article>","contentLength":208,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Year Of The BSD Desktop? There's Going To Be A BSD Desktop Conference At Least","url":"https://www.phoronix.com/news/BSD-Desktop-Conference-GhostBSD","date":1737200531,"author":"Michael Larabel","guid":630,"unread":true,"content":"<article>Technical BSD conferences aren't quite as common as the many Linux conferences these days. For the BSD conferences that do happen they tend to be more general in nature than carrying a desktop focus. But being announced this week was GhostBSDCon 2025 as a forthcoming developer conference largely focused on desktop use of this FreeBSD-derived distribution...</article>","contentLength":359,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"KDE Developers Fixing \"Record Amounts Of Bugs\" Following Plasma 6.3 Beta","url":"https://www.phoronix.com/news/KDE-Plasma-6.3-Bug-Fixing","date":1737199528,"author":"Michael Larabel","guid":629,"unread":true,"content":"<article>Following the recent KDE Plasma 6.3 Beta, there's been a lot of bug fixing happening ahead of the stable release due out next month for this open-source desktop...</article>","contentLength":163,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}]}