{"id":"2k6wXud2N91xpf4PwnSfo4j5WSuTNX5k","title":"Tech News - Last 2 days","displayTitle":"Tech News - Last 2 days","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":86,"items":[{"title":"Ultra-Fast Cancer Treatments Could Replace Conventional Radiotherapy","url":"https://science.slashdot.org/story/25/01/25/0020230/ultra-fast-cancer-treatments-could-replace-conventional-radiotherapy?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737788400,"author":"BeauHD","guid":246,"unread":true,"content":"CERN's particle accelerator is being used in a pioneering cancer treatment called Flash radiotherapy. This method delivers ultra-high radiation doses in less than a second, minimizes side effects while targeting tumors more effectively than conventional radiotherapy. The BBC reports: In a series of vast underground caverns on the outskirts of Geneva, Switzerland, experiments are taking place which may one day lead to new generation of radiotherapy machines. The hope is that these devices could make it possible to cure complex brain tumors (PDF), eliminate cancers that have metastasized to distant organs, and generally limit the toll which cancer treatment exerts on the human body. The home of these experiments is the European Laboratory for Particle Physics (Cern), best known to the world as the particle physics hub that developed the Large Hadron Collider, a 27 kilometer (16.7 mile)-long ring of superconducting magnets capable of accelerating particles to near the speed of light.\n \nArguably Cern's crowning achievement was the 2012 discovery of the Higgs boson, the so-called \"God Particle\" which gives other particles their mass and in doing so lays the foundation for everything that exists in the universe. But in recent years, the centre's unique expertise in accelerating high-energy particles has found a new niche -- the world of cancer radiotherapy. Eleven years ago, Marie-Catherine Vozenin, a radiobiologist now working at Geneva University Hospitals (Hug), and others published a paper outlining a paradigm-shifting approach to traditional radiotherapy treatment which they called Flash. By delivering radiation at ultra-high dose rates, with exposures of less than a second, they showed that it was possible to destroy tumors in rodents while sparing healthy tissue. Its impact was immediate. International experts described it as a seminal breakthrough, and it galvanized fellow radiobiologists around the world to conduct their own experiments using the Flash approach to treat a wide variety of tumors in rodents, household pets, and now humans.\n \nIn recent years, animal studies have repeatedly shown that Flash makes it possible to markedly increase the amount of radiation delivered to the body while minimizing the impact that it has on surrounding healthy tissue. In one experiment, healthy lab mice which were given two rounds of radiation via Flash did not develop the typical side effects which would be expected during the second round. In another study, animals treated with Flash for head and neck cancers experienced fewer side effects, such as reduced saliva production or difficulty swallowing. Loo is cautiously optimistic that going forwards, such benefits may also translate to human patients. \"Flash produces less normal tissue injury than conventional irradiation, without compromising anti-tumor efficacy -- which could be game-changing,\" he says. An additional hope is that this could then reduce the risk of secondary cancers (PDF), resulting from radiation-induced damage later in life, although it is still too early to know if that will be the case. [...] But the next phase of research is not only about testing whether Flash works in people. It's also about identifying which kind of radiation is the best one to use.","contentLength":3275,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Wall Street banks plan sale of X debt at a discount","url":"https://techcrunch.com/2025/01/24/wall-street-banks-plan-sale-of-x-debt-at-a-discount/","date":1737780134,"author":"Connie Loizos","guid":163,"unread":true,"content":"<p>Bankers are reportedly gearing up to offload debt used to fund Elon Musk’s social network, for which he paid $44 million in 2022 including $13 billion in financing. Morgan Stanley is leading the charge, hoping to sell senior debt at between 90 and 95 cents on the dollar, reports the WSJ.&nbsp; As notes the outlet, […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":382,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"US Reviewing Automatic Emergency Braking Rule","url":"https://tech.slashdot.org/story/25/01/25/0011211/us-reviewing-automatic-emergency-braking-rule?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737775800,"author":"BeauHD","guid":245,"unread":true,"content":"An anonymous reader quotes a report from Reuters: A U.S. auto safety agency said on Friday it is reconsidering a landmark rule from the administration of former President Joe Biden requiring nearly all new cars and trucks by 2029 to have advanced automatic emergency braking systems. The National Highway Traffic Safety Administration said it would delay the effective date to March 20 to give the new Trump administration time to further review the regulation.\n \nThe Alliance for Automotive Innovation, representing General Motors, Toyota Motor, Volkswagen and other automakers, last week filed suit to block the rule, saying the regulation is \"practically impossible with available technology.\" The group asked the U.S. Court of Appeals for the District of Columbia to overturn the rule, saying the requirement that cars and trucks must be able to stop and avoid striking vehicles in front of them at up to 62 miles per hour (100 kph) is unrealistic. It unsuccessfully asked NHTSA last year to reconsider the rule. Come 2029, all cars sold in the U.S. \"must be able to stop and avoid contact with a vehicle in front of them at speeds up to 62 mph,\" reports Car and Driver.\"\n \n\"Additionally, the system must be able to detect pedestrians in both daylight and darkness. As a final parameter, the federal standard will require the system to apply the brakes automatically up to 90 mph when a collision is imminent, and up to 45 mph when a pedestrian is detected.\"\n \nAccording to the NHTSA, the rule will save at least 360 lives annually and prevent more than 24,000 injuries.","contentLength":1574,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Nvidia Starts Phasing Out Maxwell, Pascal, and Volta GPUs","url":"https://tech.slashdot.org/story/25/01/24/2356254/nvidia-starts-phasing-out-maxwell-pascal-and-volta-gpus?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737771000,"author":"BeauHD","guid":244,"unread":true,"content":"As spotted by Tom's Hardware, Nvidia's CUDA 12.8 release notes signal the transition of Maxwell, Pascal, and Volta GPUs to the legacy driver branch. As a result, there will be no more new feature updates for these architectures; however, CUDA and gaming driver support will remain for now. From the report: It's crucial to highlight that this has nothing to do with GeForce gaming driver support. In fact, Maxwell and Pascal continue to be on the support list for the GeForce RTX series driver, unlike Kepler. Nvidia didn't detail whether or when it'll drop support for Maxwell, Pascal, and Volta GPUs for the gaming driver.\n \nNvidia has not issued an exact date for the end of full support for these three GPU architectures, but it will soon. The current CUDA toolkit still supports the three affected architectures, but they won't receive future updates. Once the move goes through, the only remaining GTX-series GPUs with full support will be the GTX 16-series, based on the RTX 20-series' Turing architecture.","contentLength":1013,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"British Museum Forced To Partly Close After Alleged IT Attack By Former Employee","url":"https://news.slashdot.org/story/25/01/24/2351234/british-museum-forced-to-partly-close-after-alleged-it-attack-by-former-employee?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737768600,"author":"BeauHD","guid":243,"unread":true,"content":"The British Museum was partly closed after a dismissed IT contractor trespassed, shutting down systems including its ticketing platform. The move disrupted operations and forced the closure of temporary exhibitions. The Guardian reports: While the museum will remain open this weekend, only a handful of ticket holders will be able to access its paid-for exhibitions, such as its Silk Roads show, because the IT system that manages bookings has been rendered unusable. The incident caused chaos in the middle of a busy Friday afternoon and is the latest security issue to blight the institution. A statement on the museum's website on Friday said that \"due to an IT infrastructure issue some galleries have had to be closed. Please note that this means capacity will be limited, and priority will be given to members and pre-booked ticket holders. Currently our exhibitions remain closed.\"","contentLength":889,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Uncached Buffered I/O & Some Other Nice Memory Management Optimizations With Linux 6.14","url":"https://www.phoronix.com/news/Linux-6.14-MM","date":1737768522,"author":"Michael Larabel","guid":661,"unread":true,"content":"<article>Andrew Morton made for an exciting Friday evening by sending out his \"MM\" pull request for Linux 6.14 as the large collection of memory management related patches for this next kernel version...</article>","contentLength":194,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Microplastics Block Blood Flow in the Brain, Mouse Study Reveals","url":"https://science.slashdot.org/story/25/01/24/2348221/microplastics-block-blood-flow-in-the-brain-mouse-study-reveals?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737766260,"author":"msmash","guid":242,"unread":true,"content":"Scientists have observed for the first time how microplastics move through and block blood vessels in mouse brains, according to research published in Science Advances this week. Using fluorescence imaging, researchers at Peking University tracked plastic particles as they were consumed by immune cells and accumulated in brain blood vessels, causing obstructions that persisted for up to four weeks and reduced blood flow. The study found that these blockages, which behaved similarly to blood clots, decreased the mice's mobility for several days.","contentLength":550,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"UnitedHealth Data Breach Hits 190 Million Americans in Worst Healthcare Hack","url":"https://yro.slashdot.org/story/25/01/24/2337254/unitedhealth-data-breach-hits-190-million-americans-in-worst-healthcare-hack?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737763800,"author":"msmash","guid":241,"unread":true,"content":"Nearly 190 million Americans were affected by February's cyberattack on UnitedHealth's Change Healthcare unit, almost double initial estimates, the company disclosed Friday. The breach, the largest in U.S. medical history, exposed sensitive data including Social Security numbers, medical records, and financial information. \n\nUnitedHealth said it has not detected misuse of the stolen data or found medical databases among compromised files. Change Healthcare, a major U.S. healthcare claims processor, paid multiple ransoms after Russian-speaking hackers known as ALPHV breached its systems using stolen credentials lacking multi-factor authentication, according to CEO Andrew Witty's testimony to Congress.","contentLength":709,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Crypto Czar David Sacks Says NFTs and Memecoins Are Collectibles, Not Securities","url":"https://news.slashdot.org/story/25/01/24/2322249/crypto-czar-david-sacks-says-nfts-and-memecoins-are-collectibles-not-securities?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737761400,"author":"msmash","guid":240,"unread":true,"content":"Non-fungible tokens and memecoins are neither securities nor commodities, according to White House crypto czar David Sacks. Instead, he defines them as \"collectibles.\" From a report: \"It's like a baseball card or a stamp,\" Sacks said in an interview with Fox Business on Thursday, referencing Trump's explosively popular memecoin. \"People buy it because they want to commemorate something.\" \n\nThe famous venture capitalist's comments touched on a long-running debate about the crypto industry in general: how exactly to treat different digital assets. Some argue that digital assets are securities, which are tradable financial assets like stocks. But others say they're commodities, or raw materials that can be bought and sold, like gold and wheat. The classification differences have vast regulatory implications. \"There's a few different categories here, so defining the market structure is important,\" said Sacks.","contentLength":918,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Retro Biosciences, backed by Sam Altman, is raising $1 billion to extend human lifespan","url":"https://techcrunch.com/2025/01/24/retro-biosciences-backed-by-sam-altman-is-raising-1-billion-to-extend-human-lifespan/","date":1737761066,"author":"Charles Rollet","guid":162,"unread":true,"content":"<p>Sam Altman-backed Retro Biosciences is raising $1 billion to develop drugs that extend human lifespan by 10 years, the FT reports.</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":193,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"UnitedHealth confirms 190 million Americans affected by Change Healthcare data breach","url":"https://techcrunch.com/2025/01/24/unitedhealth-confirms-190-million-americans-affected-by-change-healthcare-data-breach/","date":1737760573,"author":"Zack Whittaker","guid":161,"unread":true,"content":"<p>The number of individuals confirmed to be affected by the data breach is almost double the company's previous estimate.</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":182,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"In motion to dismiss, chatbot platform Character AI claims it is protected by the First Amendment","url":"https://techcrunch.com/2025/01/24/in-motion-to-dismiss-chatbot-platform-character-ai-claims-it-is-protected-by-the-first-amendment/","date":1737759864,"author":"Kyle Wiggers","guid":160,"unread":true,"content":"<p>Character AI, a platform that lets users engage in roleplay with AI chatbots, has filed a motion to dismiss a case brought against it by the parent of a teen who committed suicide, allegedly after becoming hooked on the company’s technology. In October, Megan Garcia filed a lawsuit against Character AI in the U.S. District […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":395,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Apple Enlists Veteran Software Executive To Help Fix AI and Siri","url":"https://apple.slashdot.org/story/25/01/24/2113240/apple-enlists-veteran-software-executive-to-help-fix-ai-and-siri?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737759000,"author":"BeauHD","guid":239,"unread":true,"content":"An anonymous reader quotes a report from Bloomberg: Apple executive Kim Vorrath, a company veteran known for fixing troubled products and bringing major projects to market, has a new job: whipping artificial intelligence and Siri into shape. Vorrath, a vice president in charge of program management, was moved to Apple's artificial intelligence and machine learning division this week, according to people with knowledge of the matter. She'll be a top deputy to AI chief John Giannandrea, said the people, who asked not to be identified because the change hasn't been announced publicly. The move helps bolster a team that's racing to make Apple a leader in AI -- an area where it's fallen behind technology peers. [...]\n \nVorrath, who has spent 36 years at Apple, is known for managing the development of tough software projects. She's also put procedures in place that can catch and fix bugs. Vorrath joins the new team from Apple's hardware engineering division, where she helped launch the Vision Pro headset. Over the years, Vorrath has had a hand in several of Apple's biggest endeavors. In the mid-2000s, she was chosen to lead project management for the original iPhone software group and get the iconic device ready for consumers. Until 2019, she oversaw project management for the iPhone, iPad and Mac operating systems, before taking on the Vision Pro software. Haley Allen will replace Vorrath overseeing program management for visionOS, the headset's operating system, according to the people.\n \nPrior to joining Giannandrea's organization, Vorrath had spent several weeks advising Kelsey Peterson, the group's previous head of program management. Peterson will now report to Vorrath -- as will two other AI executives, Cindy Lin and Marc Schonbrun. Giannandrea, who joined Apple from Google in 2018, disclosed the changes in a memo sent to staffers. The move signals that AI is now more important than the Vision Pro, which launched in February 2024, and is seen as the biggest challenge within the company, according to a longtime Apple executive who asked not to be identified. Vorrath has a knack for organizing engineering groups and creating an effective workflow with new processes, the executive said. It has been clear for some time now that Giannandrea needs additional help managing an AI group with growing prominence, according to the executive. Vorrath is poised to bring Apple's product development culture to the AI work, the person said.","contentLength":2468,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Cold Calling? STOP Asking to Speak With the \"Decision-Maker\"","url":"https://hackernoon.com/cold-calling-stop-asking-to-speak-with-the-decision-maker?source=rss","date":1737758641,"author":"Jonathan Roseland","guid":289,"unread":true,"content":"<h2><strong>Making a Cold Call to a Prospect</strong></h2><p>Business-to-business sales (B2B) is a difficult nut to crack, especially if you're used to dealing with decision-makers for smaller or local companies only.</p><p>\\\nWhy does it seem like every startup is antsy to gobble up your helpful services, but the large C-level corporate heads couldn't care less about you? Do not be discouraged, my friend. Industry professionals who have \"been there, done that\" have a few suggestions to help you and your business break into this lucrative market.</p><h3><strong>We asked our industry experts two questions</strong>…</h3><p>: <em>Who do I want to talk to?</em> a) President/Owner b) Vice-President of Marketing c) Or do I want to talk to multiple people?</p><p>\\\n: With large corporate organizations, the chances are higher that decisions will be made bureaucratically. You will need to talk with multiple people and build value in your product based on their perspectives of their organization's needs. In medium-to-small organizations, it's more likely that one person can make unilateral decisions. It was recommended that I do not call up and ask for the \"decision-maker\" - this just screams, \"I'm a salesperson!\" The key with higher-level execs of large companies is to NOT get past the gatekeeper but get the gatekeeper to introduce you.\" So make friends with the administrative assistant.</p><p>: <em>What's the best way to talk to the decision-maker?</em> a) Calling the corporate office b) Using social media or LinkedIn? c) Finding their phone extension or email on the corporate website?</p><p>\\\n:&nbsp;Actually, all of the above were recommended for various steps in the process. Tools like Google, LinkedIn, and social media are great for finding out who the decision-maker is. In more progressive or entrepreneurial organizations, chances are better that the management team is willing to talk to  like you through social media. It was recommended that I create awareness about myself and my company/product/service first by either a personal phone call or a brief email customized to the person I am trying to influence. The phone call or personalized email should separate my sales solicitation from spam.</p><p>: A few things to note about this email: it's brief, it's customized to the recipient, and the features of what I'm selling are quantifiable. The chances of getting a reply to this email are pretty high…</p><blockquote><p><em>Hi Chris,As the CEO of a property management company, I can imagine you are constantly looking for ways to maximize the efficiency of your organization. I'm the business development officer of a company specializing in property management software solutions. Our proprietary software has on average saved firms like yours 20 man-hours a week by automating property management tasks. In addition to saving firms like yours over 50% on their tenant background checking using our 30-minute online qualification process.Please check out a 5-minute demo here on our website for more details. I will follow up with a phone call to your office tomorrow morning.Best Regards,Jonathan</em></p></blockquote><p>I've been doing cold email outreach for <a href=\"https://marketplacegold.com/\">MarketplaceGOLD</a>, my cryptocurrency geo-directory; I add crypto-friendly businesses to my website and send them a simple email from my Gmail address:</p><blockquote><p>\\\n  <em>I've added you to my cryptocurrency directory, MarketplaceGOLD.com, here[link]Which cryptos do you accept there? You'll notice a \"Claim\" button on the listing, you can register on my website and you'll be able to make any changes you want to the listing.</em></p></blockquote><h2><strong>Cold-Calling Phone Script</strong> for Getting Through the Gatekeeper</h2><p>In my experience, you can usually find out who the decision-maker is in about 60 seconds using Google or quickly browsing through the company's website.</p><blockquote><p> (admin assistant's name), <em>how are you today? I'm Jonathan Roseland and I'm calling in regard to marketing. Is the person in charge of that type of thing at your office?</em></p></blockquote><p>\\\n<strong>If you know the name of the decision-maker</strong>:</p><blockquote><p> (admin assistant's name), <em>how are you today? I'm Jonathan Roseland; I'm calling for Dave Johnson</em> (the decision-maker's name). </p></blockquote><p>\\\nI find that when dealing with small to mid-sized companies, this line works great because the directness and use of my last name subtly indicate that the decision-maker . It's important to deliver it with a confident intonation. A lot of the time, they will connect you right to the decision-maker.</p><blockquote><p><em>Hello Dave, this is Jonathan Roseland, my number is XXX-XXX-XXXX, please give me a call back at your convenience.</em></p></blockquote><p>\\\nThis voicemail message will get you a call back 50%-70% of the time compared with 10%-20% of the callbacks you get when you describe your product. While some might consider it slightly misleading since I'm not telling them what my call is about, I've used this message for years, and I can't think of a time when my prospect was mad or felt misled when they called back.</p><p>\"<strong>C-level executives don't actually care what you sell. They care about their businesses</strong>. There is nothing about your business you can tell them that is of interest,\" says Tiffany Lyman Otten, a Senior Account Executive with PAETEC. She recommends introducing yourself as quickly as possible, then launching into how you can address a problem they may be facing with their business. </p><p>\\\nBe prepared to give specifics as to how you've helped others and boosted net profits for a comparable business. Eliminate excess words in your proposal and give executives the room to respond. Most importantly, Tiffany reminds us, \"You need to be thinking with every word out of your mouth \"Why should I care?\" because you have all of about 5 seconds to answer that question if you want to get another 5 seconds.\"</p><h2>Survival, Cash Flow, and Profitability</h2><p>To take it one step further, Gary McLean, a Sales Representative with Royal LePage Real Estate, reminds B2B marketers: \"C Level managers are concerned with survival, cash flow, and profitability - usually in that order. It doesn't matter what you are selling. If you address these three areas, you will hold their rapt attention for as long as you want it.\" It's important to craft your entire presentation around these important areas.</p><p><img src=\"https://cdn.hackernoon.com/images/null-g963xv4.png\" alt=\"\"> \\n Remember, when working with larger corporate entities, part of your success depends upon getting through the gatekeepers to the real decision-makers. \"<strong>Treat these gatekeepers with respect</strong>, ask for their help, and position what you want in very straightforward language. What you want is \"to see if my services may provide value for your organization,\" advises Shawn Greene, a Sales Performance Expert at Savage &amp; Greene. </p><p>\\\nShe adds, \"Since you will not succeed with the 'decision-maker,' learn to say something more like, 'Who would you suggest I talk to about that?'\" Few things are more important than research when you're dealing with big corporations, so be sure you're clear on how your business can address their wants, needs, and interests.</p><h3>If you want to take your sales game to the next level, here are a couple of sales psychology books that will ROI like buying Bitcoin in 2015…</h3>","contentLength":6944,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ask Slashdot: What Matters When Buying a New Smartphone?","url":"https://ask.slashdot.org/story/25/01/24/2057209/ask-slashdot-what-matters-when-buying-a-new-smartphone?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737756600,"author":"BeauHD","guid":238,"unread":true,"content":"Longtime Slashdot reader shanen writes: What matters to you when buying a new smartphone? How can we make the recurring topic relevant without more SCREAMS about \"dupe\"? I do have a bit of recent research I could share -- quite a bit of fresh data since my latest search started a couple of months ago. Or perhaps I could start with a summary of the useful bits from an ancient Ask Slashdot discussion about batteries?\n \nSeems funny to ask about relevant books, even though two come to mind already. One is The Anxious Generation by Jonathan Haidt, where he argues that smartphone use by preadolescents is destroying their personalities. The other is Antifragile by Nassim Nicholas Taleb, who doesn't actually say much about them, but I still think they should have been included in the the big table of examples at the end of the prologue. The \"system\" of smartphones is antifragile, even though the earliest models were quite fragile. The essence of this question is about which current smartphone models are the most robust...\n \nMaybe I should include a list of my own criteria so far? However, would would just be responses to the problems with my current Samsung Galaxy and the Oppo I had before that. I've already determined that the two main problems with those models don't exist with any of the current options offered by my phone company... And the ancient battery problems are still lurking, too.","contentLength":1407,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"OSYS CRM Redefines Proprietary Trading With Its Latest Integration","url":"https://hackernoon.com/osys-crm-redefines-proprietary-trading-with-its-latest-integration?source=rss","date":1737754401,"author":"BTCWire","guid":288,"unread":true,"content":"<p>OSYS CRM Redefines Proprietary Trading with Its Latest Integration OSYS CRM has unveiled an advanced integration designed to empower trading firms with cutting-edge technology. By combining real-time analytics, centralized management tools, and enhanced security protocols, this new solution addresses the challenges of modern proprietary trading. </p><p>\\\nTrading firms now have access to a versatile platform that streamlines operations, safeguards sensitive data, and enables strategic growth—all while remaining adaptable to the demands of a fast-evolving financial market. Innovative Tools to Drive Success The new proprietary trading integration from OSYS CRM introduces a host of features designed to support both operational efficiency and long-term growth.</p><ol><li><p>Insightful Analytics at Your Fingertips Trading success relies on data, and this platform delivers real-time market insights through advanced analytics. By identifying patterns and trends, firms can fine-tune their strategies and respond to market changes effectively.</p></li><li><p>Streamlined Portfolio Management Simplify trading operations with a centralized system that provides clear visibility across all activities. Comprehensive reporting tools ensure firms can monitor their performance and optimize portfolio management with ease.</p></li><li><p>Built-In Security You Can Trust In today’s digital-first world, protecting trading data is critical. OSYS CRM includes multi-layered security measures, such as data masking, IP restrictions, and two-factor authentication, offering peace of mind without compromising efficiency.</p></li><li><p>Expert Support Every Step of the Way With 24/7 access to professional consulting and technical guidance, trading firms can resolve challenges and maintain uninterrupted operations. OSYS CRM’s commitment to customer success ensures you’re never left without support.</p></li></ol><p>Effortless Expansion Opportunities Whether integrating new payment methods or building affiliate networks, this platform is designed for scalability. Firms can expand seamlessly while maintaining operational continuity. </p><h3>A Strategic Advantage for Trading Firms</h3><p>OSYS CRM’s proprietary trading solution offers more than just functionality—it provides a distinct competitive edge. By streamlining operations and equipping firms with advanced tools, the platform empowers traders to navigate the complexities of modern financial markets with confidence. </p><p>\\\nWith automation at its core, the integration brings greater clarity to daily operations, reducing manual workflows and allowing teams to focus on strategy and growth. Real-time analytics provide actionable insights, enabling firms to make informed decisions backed by accurate market data. </p><p>\\\nDesigned to adapt alongside businesses, the solution offers scalable capabilities that evolve as firms expand their operations. Additionally, its cutting-edge risk management tools and robust security protocols ensure that sensitive information and critical assets are safeguarded at every stage. By addressing these key areas, OSYS CRM positions itself as an invaluable partner for trading firms striving for success in an ever-changing financial landscape. </p><h3>OSYS CRM: A Legacy of Innovation</h3><p>Since 2015, OSYS CRM has been a driving force in delivering innovative, client-focused solutions for businesses worldwide. The company’s emphasis on secure, scalable, and efficient platforms has positioned it as a trusted partner for firms navigating the digital landscape. The launch of this proprietary trading integration underscores OSYS CRM’s dedication to addressing the unique needs of the financial sector. </p><p>\\\nBy combining advanced technology with seamless usability, this latest solution empowers trading firms to achieve their goals and thrive in an increasingly competitive environment. For a closer look at OSYS CRM’s proprietary trading integration or to schedule a demo, visit their website or connect on LinkedIn.</p><p>:::tip\nThis story was distributed as a release by Btcwire under HackerNoon’s Business Blogging Program. Learn more about the program&nbsp;</p>","contentLength":4040,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Netflix's Cloud Plans Include Co-Op and Party Games","url":"https://entertainment.slashdot.org/story/25/01/24/2052235/netflixs-cloud-plans-include-co-op-and-party-games?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737754200,"author":"BeauHD","guid":237,"unread":true,"content":"Netflix plans to expand its cloud gaming offerings to include couch co-op and party games, according to co-CEO Greg Peters. The company will also continue developing narrative games based on its IP, despite recent leadership changes and the closure of its AAA game studio. The Verge reports: In the blog post, Netflix notes that it's a \"limited\" beta test, so it seems like this won't be available to too many people to start. (Netflix used that same \"limited\" language with the initial launch in Canada and the UK.) Like with the original test, the only two games available to stream are Oxenfree from Netflix's own Night School Studio and another game titled Molehew's Mining Adventure.\n \nIf you have access to the service, you'll need to download Netflix's special controller app for your iPhone or Android device to play the game on your TV. (Netflix says the streamed games work on \"select devices,\" including Amazon Fire TV devices, Chromecast with Google TV, Roku devices and TVs, and more.) On the web, you'll be able to play games with a mouse and keyboard.","contentLength":1066,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Tailor Your Data Visualization Design Choices for Key Stakeholders to Create Organizational Buy-In","url":"https://hackernoon.com/tailor-your-data-visualization-design-choices-for-key-stakeholders-to-create-organizational-buy-in?source=rss","date":1737753969,"author":"Alex Holloway","guid":287,"unread":true,"content":"<h3><strong>What Are We Talking About?</strong></h3><p>The power of data visualization lies in its ability to simplify complexity, making even the most intricate datasets accessible and comprehensible to a wide audience. In modern organizations, visualization isn’t just a tool for analysis - it's a key method of communication that bridges the gap between data experts and decision-makers. Effective visualizations don’t just make data look appealing; they transform raw data into actionable insights that allow decision-makers to make better, faster, and more informed choices. By turning data into stories, visualization helps communicate insights that drive strategy, improve efficiency, and create a shared understanding across teams.</p><h3><strong>Why Does Data Visualization Matter?</strong></h3><ul><li>: Visuals reduce cognitive load by allowing users to absorb complex information quickly, turning abstract data into meaningful insights. Humans process visual information faster than text or numbers. While the often-cited figure that we process visuals 60,000x faster than words is unsubstantiated, it’s true that well-designed visualizations enable quicker decision-making by tapping into our natural ability to process visual information rapidly.</li><li>: By highlighting trends, anomalies, and outliers, visualizations provide critical context for decision-makers. This context enables them to spot potential issues or opportunities they might otherwise miss, turning data into actionable insight that drives results.</li><li><strong>Data-Driven Communication</strong>: Data visualization acts as a universal language, ensuring that both technical and non-technical stakeholders can access the same insights and participate in the decision-making process. This democratization of data allows for more inclusive, informed conversations across all levels of an organization.</li><li>: In long-term planning, visualizations help reveal patterns and trends in historical data that can inform future strategies. They offer an overview of complex processes, helping businesses identify areas for improvement, innovation, and resource allocation. These insights often inform key strategic initiatives such as market expansion, product development, or operational efficiency.</li></ul><h3><strong>Key Consideration #1: Tailoring Visualizations to Stakeholders</strong></h3><p>One of the key components in  in organizational data visualization is tailoring the outputs to the specific needs of various stakeholders:</p><ul><li>: Executives require high-level, strategic overviews focused on key business metrics such as revenue growth, profit margins, and overall efficiency. These visualizations prioritize simplicity, allowing decision-makers to see trends and red flags at a glance. Interactive dashboards that summarize performance across functions or regions and highlight progress toward key strategic objectives are particularly useful. Executives benefit from being able to drill into certain metrics, but only when relevant to assessing high-level performance.</li><li>: Directors and senior managers need visualizations that bridge strategic goals with operational realities, often focused on department-level performance metrics or specific project KPIs. For example, they might monitor product performance, regional sales trends, or customer satisfaction across segments. Interactive dashboards that offer drill-downs into finer details, such as performance by region or product line, help senior managers identify trends and operationalize strategic objectives.</li><li>: Mid-level managers are responsible for translating strategy into daily operations, so they benefit from dashboards with a higher level of granularity. Their visualizations often emphasize team or process-specific metrics, enabling them to track efficiency, productivity, and immediate goals. For example, a sales manager might track performance by team member, while a production manager might view metrics on manufacturing speed and quality. Real-time updates and the ability to filter data by category (e.g., team, process) allow them to address challenges promptly.</li><li><strong>Team Leads and Supervisors</strong>: Supervisors and team leads rely on detailed, real-time visualizations to manage individual and team-level performance. Dashboards that provide metrics on task completion rates, output quality, and short-term targets are essential for making immediate adjustments and supporting team members. In customer service, for instance, a supervisor might track average response time and resolution rates in real time, enabling quick responses to issues as they arise.</li><li>: For employees who directly interact with customers, produce goods, or handle core tasks, visualizations should be accessible and task-oriented. Simple, real-time metrics, such as individual productivity rates or customer satisfaction scores, help frontline staff understand their impact and align their actions with broader objectives. For example, a customer support agent might see daily feedback scores, while a factory worker might monitor real-time production counts against targets.</li></ul><p>\\\nBy tailoring visualizations to the requirements of each organizational level, companies can enhance alignment, enable decision-making, and ensure that insights support both strategic and operational goals across the hierarchy. It cannot be overstated that the value delivered by a report or dashboard is directly related to its ability to <em>enable the target audience to take action</em>. A generic set of numbers that requires further interpretation by the audience will engender poor engagement – a waste of the developer’s time and a missed opportunity for delivering business value.</p><h3><strong>Key Consideration #2: Make Good Design Choices</strong></h3><p>Data Visualization is often about delivering an accurate narrative such that the message received by the audience is not misleading, ambiguous, or , worse, incorrect. Having considered the needs of your audience, the following best practices apply:</p><p>\\\n<strong>Simplicity Over Complexity:</strong> one of the core principles of good visualization is . The purpose of a visual is to distill complex data into a format that is easy to interpret, without overwhelming the viewer. Avoid clutter by eliminating unnecessary elements like decorative graphics or excessive labeling that distract from the core message. When designing a visualization, always ask: <strong>does this element help communicate the data more clearly, or does it add confusion?</strong></p><ul><li>: Use clean, minimalist designs that focus on the data itself, rather than excessive styling or effects. Less is often more when it comes to making data understandable.</li><li>: Attempting to ‘be all things to all people’ usually results in the creation of something too complicated that serves no audience well.</li></ul><p>\\\n<strong>Choosing the Right Visualization:</strong> different types of data require different types of visuals. A pie chart, for instance, is best for showing proportions, while a line graph is ideal for displaying trends over time. Choosing the wrong type of visualization can lead to misinterpretation or a lack of clarity.</p><ul><li>: Match the visualization to the nature of the data:</li><li>: Compare quantities across categories.</li><li>: Show trends over time.</li><li>: Illustrate relationships or correlations between variables.</li><li>: Highlight intensity or frequency within datasets.</li><li> Using a combination chart in an attempt to compare two dimensions can result in neither being easy to read. Two well-calibrated charts can be more effective than one.</li></ul><p>\\\n color can be a powerful tool for emphasizing important data points or drawing attention to key insights. However, improper use of color can also be misleading or create visual confusion. Always use color with purpose, ensuring that it aligns with the data you want to emphasize and remains accessible to all audiences, including those who are colorblind.</p><ul><li>: Limit your color palette to a few key colors. Use contrasting colors to highlight important points but avoid overloading the visualization with too many hues. Ensure that your visualizations are  by using color combinations that can be distinguished by all viewers. Your organization may have color guidelines or established standards for indicating good or poor performance. Adopt these to enable readers to more easily interpret performance from one report to the next.</li><li>: Avoid ‘trendy’ uses of color and style (black backgrounds, 3d columns, etc.) where these differ from organizational standards as these present a further barrier to stakeholders who are already intimidated by data and dashboards.</li></ul><p>\\\n<strong>Avoiding Misleading Visuals:</strong> it’s easy to unintentionally mislead viewers with data visualizations, especially when visual elements are exaggerated or out of proportion. Manipulating scales, axes, or proportions can make trends seem more significant than they are, leading to incorrect conclusions.</p><ul><li>: Always ensure that axes are appropriately scaled, and proportions are represented accurately. Avoid truncating axes unless necessary, and clearly label any anomalies in the data.</li><li>: It can be tempting to adjust visualizations so that they show  rather than nothing. However, context is everything when interpreting performance and a small dip in quarterly revenue when annual performance is on track should not become a distraction for an audience who likely has many operational concerns and will welcome a set of indicators that report ‘do not worry about this at the moment’.</li></ul><p>\\\n a well-designed visualization should be understandable at a glance, but it also needs context to convey its full meaning. This includes clear and concise labels, legends, and titles that explain what the data represents and why it matters. Proper labeling is essential for guiding the viewer through the visual, helping them understand the relationships between different data points.</p><ul><li>: Include a descriptive title that summarizes the key takeaway of the chart and ensure all axes and data points are clearly labelled.</li><li>: The use of too many labels crowds out the value of those that tell the story of the visual as in  above.</li></ul><p>\\\n when visualizing data, it’s important to remain transparent and ethical. This means presenting the data honestly, without manipulating or distorting it to suit a particular narrative. Ethical visualization also involves being mindful of privacy concerns, especially when visualizing sensitive data.</p><ul><li>: Prioritize data anonymization when visualizing sensitive information to protect individual privacy. Transparency about data sources, limitations, and the purpose of the visualization helps build trust and mitigates ethical risks.</li><li>: A common oversight is not anonymizing personal data or grouping data in a way that could unintentionally expose vulnerable populations.</li></ul><p>\\\n good design includes making your visualizations accessible to as many people as possible. This means ensuring that charts and graphs can be easily understood by viewers with disabilities, such as those with colorblindness or visual impairments. Incorporating accessible design principles is not only inclusive but also enhances clarity for all viewers.</p><ul><li>: Use high-contrast color schemes and avoid relying solely on color to distinguish between categories. Add  for screen readers, and ensure your visuals are readable in grayscale when color is not an option.</li><li>: Overlooking accessibility in an attempt to make visuals more visually appealing. Adding too many decorative elements or relying on color alone can make visualizations less accessible for those with color vision deficiencies or low vision, reducing comprehension and usability.</li></ul><p>\\\nThese two sets of considerations can make data visualization more effective when deployed in an organization and are a useful set of principles to follow as an analyst, report or dashboard developer, and to managers interested in using data effectively within their enterprise or business unit.</p>","contentLength":11702,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"KTON Targets $6.12 Billion Liquid Staking Opportunity On TON, Tapping Telegram’s 950 Million Users","url":"https://hackernoon.com/kton-targets-$612-billion-liquid-staking-opportunity-on-ton-tapping-telegrams-950-million-users?source=rss","date":1737753827,"author":"BTCWire","guid":286,"unread":true,"content":"<p>New York, United States - 9:00AM, January 24, 2025&nbsp;--KTON,an institutional-grade liquid staking protocol incubated by , the leading TON-focused venture studio  by top VC firms from the Asia-Pacific region, is gearing up for its V1 launch in February 2025.</p><p>\\\nTONX is also the force behind , a multisig solution managing $400M in assets and adopted by the TON Foundation. KTON is set to enter the United States and global markets, bringing its enterprise-grade liquid staking solution to institutional and retail users.</p><p>\\\nTelegram  it will exclusively support The Open Network (TON) for its blockchain ecosystem. KTON is uniquely positioned to capitalize on this growth as it is being built specifically for TON users.</p><p>\\\nBuilding on TONX’s success in the API and security space, KTON is positioned to capture the $6.12 billion TON liquid staking market opportunity.</p><p>\\\nKTON allows users to stake TON while receiving $KTON, unlocking liquidity without sacrificing staking rewards. Unlike existing solutions that often concentrate risk or lack robust standardization, KTON provides institutional-grade security tailored for family offices, trusts, and exchanges. Users can start staking with as little as 1 TON, and there is no lock-up period.</p><h3>Unlocking TON's $6.12B Liquid Staking Market Potential</h3><p>Liquid staking has transformed blockchain ecosystems with Lido Finance dominating Ethereum's LST market at $30B TVL. KTON aims to capture similar potential in TON's nascent LST market, currently valued at $377M.</p><blockquote><p>“Our research reveals TON's LST ratio matches Solana at 10% of staked tokens, yet TON's total staking rate is merely 13.7% versus Solana's 69%, indicating a 5x growth potential. Furthermore, if TON's LST ratio reaches Ethereum's 36%, the market could surge 18X, unlocking an additional $6.12B in value,” said Dr. Awesome Doge, founder of TONX and KTON.</p></blockquote><blockquote><p>“KTON aims to bridge this gap by providing the infrastructure needed to unlock this liquidity and drive TON’s DeFi expansion.”</p></blockquote><p>\\\nKTON's staking service will unlock liquidity, enabling seamless integration with leading TON native DEXs and protocols, and more DeFi giants which are entering TON like Ethena and Curve Finance. This offers TON users flexible and stable yield strategies through various DeFi opportunities while maintaining staking rewards.</p><blockquote><p>\"TONX's triumph is a powerful testament to why KTON has solidified its place as a trusted pillar in the ecosystem,\" said Howard Peng of TON Ventures.</p></blockquote><h3>TONXKTON Sets New Standards for TON Liquid Staking Infrastructure</h3><p>KTON is addressing the critical challenges of existing liquid staking solutions, such as concentration risks and lack of standardization, by introducing a decentralized protocol with institutional-grade security.</p><p>\\\nTo further enhance accessibility, KTON is launching a Telegram Mini App designed for the platform’s 950M users in a move to bridge DeFi adoption and mainstream accessibility. By integrating liquid staking directly within Telegram, KTON simplifies the process, ensuring that anyone can participate with ease.</p><p>\\\nThis innovative approach positions KTON to drive the widespread adoption of TON blockchain technology, expanding its reach in the US market and globally.</p><p>The platform’s roadmap goes beyond staking rewards.</p><p>\\\nFollowing the launch of KTON V1, the planned upgrade will introduce a dual-token model featuring $KTON and a new governance token. This system allows $KTON holders to earn rewards while actively participating in KTON DAO governance.</p><h3>Unlock Your Yield with KTON, Launching February 2025</h3><p>KTON is poised to seize the $6.12 billion market potential in TON's liquid staking ecosystem with its enterprise-grade staking services.</p><p>\\\nLaunching this February, KTON provides the most secure and user-friendly solutions for both retail and institutional clients, enabling them to unlock liquidity, maximize staking rewards, and confidently participate in TON’s thriving DeFi ecosystem.</p><p>\\\nKTON’s commitment to security, combined with a decentralized governance structure, makes KTON a trusted choice for staking at scale.&nbsp;For partnerships and customized solutions, contact: contact@kton.io</p><p>KTON is a next-generation liquid staking protocol built for the TON ecosystem, designed to unlock liquidity for both retail and institutional users. Through its liquid staking token $KTON, users can participate in TON's growing DeFi ecosystem while earning staking rewards.adoption</p><p>\\\nCombining institutional-grade security with decentralized governance and seamless Telegram integration, KTON aims to drive TON's ecosystem growth and mass adoption.</p><p>Founded in 2021, TONX is a SuperApp platform layer driving the new Web3 economy. As a cornerstone of the TON ecosystem, it delivers powerful tools like TONX API, a trusted RPC solution integrated with over 20 leading projects, and Tonkey, a secure multi-signature wallet managing over $400 million in assets.</p><p>:::tip\nThis story was distributed as a release by Btcwire under HackerNoon’s Business Blogging Program. Learn more about the program&nbsp;</p>","contentLength":5030,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"When Knowledge Creates Doubt: Explaining the Expertise Paradox","url":"https://hackernoon.com/when-knowledge-creates-doubt-explaining-the-expertise-paradox?source=rss","date":1737753564,"author":"Scott D. Clary","guid":285,"unread":true,"content":"<p><em>Every entrepreneur dreams of mastery.</em>&nbsp;Of reaching that point where decisions feel easy, where success feels certain, where expertise eliminates doubt.</p><p>\\\nBut there's a hidden cost to deep expertise that nobody talks about – one that becomes more apparent the more successful you become.</p><p>\\\nThe more you learn about building companies, the&nbsp;&nbsp;decisions get. The more you understand your market, the&nbsp;&nbsp;certain you feel.</p><p>\\\nAnd counterintuitively, this growing uncertainty isn't a sign that you're doing something wrong.&nbsp;<strong>It's evidence that you're evolving into the kind of operator who builds lasting companies.</strong></p><p>\\\nBecause most people think expertise brings clarity.</p><p>\\\nLast month, I sat with three founders at a private dinner in Miami. Combined valuation? Over $3 billion. But they weren't talking about their successes. Instead, they were sharing something more interesting:&nbsp;<strong>how much more uncertain they feel now than when they started.</strong></p><p>\\\nOne of them said something that stopped me cold:</p><p>\\\n<em>\"The more I learn about building companies, the less confident I am about every decision. Five years ago, I thought I knew everything. Now? I see a thousand ways each choice could go wrong.\"</em></p><p>\\\n<strong>The Hidden Pattern in High Performance</strong></p><p>\\\nThis isn't just about founders. This pattern shows up everywhere once you start looking for it:</p><ul><li>The senior engineer who takes longer to ship code because they can see all the edge cases.</li><li>The experienced investor who feels less certain about deals because they've seen how many ways things can fail.</li><li>The veteran CEO who spends more time on decisions because they understand the ripple effects.</li></ul><p>\\\nBut here's what makes this fascinating:&nbsp;<strong>This increasing uncertainty isn't a bug in your development. It's a feature of true expertise.</strong></p><p>\\\nThink about your own journey:</p><ul><li>Remember when decisions felt simple?</li><li>When solutions seemed obvious?</li><li>When you could make choices quickly without seeing all the complexities?</li></ul><p>\\\nThat wasn't because you were better then.&nbsp;<strong>It was because you were blind to what you didn't know.</strong></p><p>Let me show you why this happens at a fundamental level.</p><p>\\\nEvery level of expertise you gain doesn't just add new knowledge – it&nbsp;&nbsp;the variables you can see. The interactions you can spot.</p><p>\\\nThe complexity you can comprehend.</p><p>\\\nHere's how it breaks down:</p><ul><li>Considers 10-15 interactions</li><li>Feels confident because the scope seems manageable</li></ul><p>\\\n</p><ul><li>Considers 50-100 interactions</li><li>Starts feeling the weight of complexity</li></ul><ul><li>Must consider 1000+ potential interactions</li><li>Understands the true scope of uncertainty</li></ul><p>\\\n<strong>But here's where it gets really interesting…</strong></p><p>\\\nAs you gain true expertise, your brain develops two capabilities at different rates:</p><ol><li>Your ability to solve problems</li><li>Your ability to&nbsp;&nbsp;problems</li></ol><p>\\\nThe second one? It grows faster.&nbsp;</p><ul><li>At 2 years in: You can spot 100 potential issues but solve 80</li><li>At 5 years in: You can spot 500 issues but solve 300</li><li>At 10 years in: You can spot 1000+ issues but solve 600</li></ul><p>\\\n<strong>This creates what I call the \"Expert's Burden\"</strong>&nbsp;– your awareness of complexity grows faster than your ability to handle it.</p><p><em>Here's what makes this especially brutal for high performers:</em></p><p>\\\nYour success depends on decisive action, but your expertise reveals exactly why everything could go wrong. The more you learn, the heavier each decision becomes.</p><p>\\\nThink about what happens as you gain true expertise. At first, you operate with what I call \"beginner's confidence\" - that beautiful state where decisions feel clear because you can't see their complexity. Your ignorance becomes your superpower.&nbsp;<strong>You move fast precisely because you don't know what could break.</strong></p><p>\\\nAs your knowledge deepens, you start seeing systems instead of isolated decisions. Every choice reveals its hundred potential consequences. What used to take days now takes weeks - not because you're slower, but because you can see more clearly what's at stake.</p><p>\\\n<strong>The three phases look like this:</strong></p><p>\\\nFirst comes the&nbsp;, where you know just enough to act decisively. Everything feels clear because your vision is still simple.</p><p>\\\nThen hits the&nbsp;, where your rapidly expanding knowledge shows you just how much could go wrong. Your confidence decreases as your awareness increases. Each decision feels heavier because you can see its full implications.</p><p>\\\nBut if you push through, you reach the&nbsp;. This is where expertise becomes power. You learn to operate with uncertainty rather than despite it. Your doubt transforms from a burden into sophisticated judgment.</p><p>\\\nThe same awareness that makes decisions harder also makes them better.&nbsp;<strong>Your uncertainty isn't a weakness - it's your evolved understanding expressing itself.</strong></p><p>Most people run from uncertainty. They see it as a weakness, as proof they don't know enough. But here's what changes everything: your growing uncertainty isn't a flaw - it's evidence of your expanding expertise.</p><p>\\\nWhen you first start anything, certainty comes cheap. You haven't seen enough fail to doubt your decisions. You haven't watched enough strategies crumble to question your assumptions. Your confidence flows from your limited view.</p><p>\\\n<strong>But then something shifts.</strong></p><p>\\\nAs your expertise deepens, you begin seeing layers that others miss. Every decision reveals new complexities. Every strategy shows its hidden weaknesses. What looked simple became sophisticated.</p><p>\\\nThis is why the truly elite operators often sound the least certain. They're not confused or weak - they're just aware of what others can't see.</p><h3><strong>The Science of Expert Uncertainty</strong></h3><p>In their pivotal 2009 paper \"Conditions for Intuitive Expertise\" published in American Psychologist, Daniel Kahneman and Gary Klein studied when expert intuition can be trusted. Instead of just asserting that more expertise leads to better decisions, they found something more nuanced: expertise only develops effectively in environments with clear feedback and opportunities to practice.</p><p>\\\n<em>Think about what this means for decision-making:</em></p><p>\\\nExpertise isn't just about accumulating knowledge - it's about developing sophisticated pattern recognition through repeated exposure and clear feedback loops. When those conditions exist, experts can process complex scenarios rapidly in ways that novices can't match.</p><p>\\\n<strong>This translates directly to business:</strong></p><p>\\\nTrue expertise doesn't mean simpler decisions - it means better ways of navigating complexity. Kahneman and Klein found that the best performers aren't those who are most certain, but those who can effectively hold multiple competing scenarios in mind while still taking decisive action.</p><p>\\\n<em>This explains something crucial about your journey:</em></p><p>\\\nYour growing uncertainty isn't a flaw - it's a natural result of developing true expertise. As your pattern recognition deepens, you see more variables, more connections, and more potential outcomes than ever before.</p><p>\\\n<strong>Your uncertainty isn't your enemy. It's your edge.</strong></p><p>\\\nBut what makes this journey so challenging is that as your expertise grows, you start carrying weights that others can't even see:</p><ul><li>Every past failure becomes a lesson that complicates future decisions.</li><li>Every success shows you how many things had to go right.</li><li>Every experience adds another layer of nuance to consider.</li></ul><p>\\\n<em>It's like trying to sprint while carrying an invisible backpack that gets heavier with each step.</em></p><p>\\\nThis creates a unique kind of pressure:</p><ul><li>Your team wants clear answers, but you see endless nuance.</li><li>Your investors want confident projections, but you see countless variables.</li><li>Your market wants decisive action, but you see intricate dependencies.</li></ul><p>\\\nAnd here's the real kicker:&nbsp;<strong>The more successful you become, the more this intensifies.</strong></p><ul></ul><p>But here's where it gets interesting. At some point, something shifts:</p><p>\\\nYou stop fighting the complexity. You start using it.</p><p>\\\nYour uncertainty becomes a tool rather than a burden.</p><p>\\\n<em>This happens when you realize:</em></p><ul><li>Being less certain makes you more accurate.</li><li>Seeing more problems helps you build better solutions.</li><li>Understanding complexity leads to simpler strategies.</li><li>Your doubt is actually sophisticated pattern recognition.</li></ul><p>\\\n<strong>When Doubt Transforms into Power</strong></p><p>\\\nMost people never grasp what really happens as you gain deep expertise. They think the goal is to eliminate uncertainty. To become so knowledgeable that doubt disappears.</p><p>\\\n<em>They're looking at it backward.</em></p><p>\\\n<strong>The Power of Sophisticated Uncertainty</strong></p><p>\\\nTrue expertise doesn't eliminate uncertainty - it transforms it. The same awareness that makes you pause before decisions also lets you spot opportunities others miss. Your slower pace isn't a weakness - it's the foundation of systems that actually scale.</p><p>\\\nThink about how your mind evolves as expertise deepens:</p><p>\\\nFirst comes&nbsp;. You start seeing rhymes in chaos. Market shifts whisper to you before they're obvious. Team dynamics reveal themselves in subtle signals that others miss entirely.</p><p>\\\nThen develops&nbsp;. You stop thinking in simple steps and start seeing entire systems. Each decision reveals its ripple effects.</p><p>\\\nYou map implications that others can't even imagine.</p><p>\\\nFinally emerges what I call&nbsp;. You move not just with speed, but with precision. Every action considers scale. Every choice leaves room for adaptation.</p><p>\\\n<strong>The Reality of Elite Performance</strong></p><p>\\\nThe best operators don't fight their doubt - they leverage it. Their uncertainty becomes a lens that reveals opportunities. Their awareness of complexity becomes their strategic advantage.</p><p>\\\nThis is why true expertise often feels like a paradox: The more you know, the more questions you have. The deeper your understanding, the greater your uncertainty.</p><p>\\\nBut that's exactly what makes it valuable.</p><p>\\\nBecause while others rush to judgment, you see the full picture. While others chase certainty, you navigate with sophistication. While others follow formulas, you move with nuance.</p><p>\\\nYour doubt isn't your weakness.&nbsp;<strong>It's your evolved understanding expressing itself.</strong></p><p>\\\nHere's what changes everything:</p><p>\\\nThe moment you realize that your increasing uncertainty isn't a weakness – it's your evolved understanding expressing itself.</p><ul><li>How you navigate complexity</li></ul><p>\\\nBecause here's the truth about expertise:</p><p>\\\nIt's not about having all the answers. It's about having the sophistication to ask better questions.</p><p>\\\nIt's not about being certain. It's about being capable despite uncertainty.</p><p>\\\nAnd that sophisticated uncertainty?&nbsp;</p><p>\\\n&nbsp;Next time you feel that doubt creeping in about a decision, remember: You're not losing confidence. You're gaining sophistication. Big difference.</p>","contentLength":10348,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI companies upped their federal lobbying spend in 2024 amid regulatory uncertainty","url":"https://techcrunch.com/2025/01/24/ai-companies-upped-their-federal-lobbying-spend-in-2024-amid-regulatory-uncertainty/","date":1737752593,"author":"Kyle Wiggers","guid":159,"unread":true,"content":"<p>Companies spent significantly more lobbying AI issues at the U.S. federal level last year compared to 2023 amid regulatory uncertainty. According to data compiled by OpenSecrets, 648 companies spent on AI lobbying in 2024 versus 458 in 2023, representing a 141% year-over-year increase. Companies like Microsoft supported legislation such as the CREATE AI Act, which […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":435,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Complexity Physics Finds Crucial Tipping Points In Chess Games","url":"https://games.slashdot.org/story/25/01/24/2046222/complexity-physics-finds-crucial-tipping-points-in-chess-games?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737751800,"author":"BeauHD","guid":236,"unread":true,"content":"An anonymous reader quotes a report from Ars Technica: The game of chess has long been central to computer science and AI-related research, most notably in IBM's Deep Blue in the 1990s and, more recently, AlphaZero. But the game is about more than algorithms, according to Marc Barthelemy, a physicist at the Paris-Saclay University in France, with layers of depth arising from the psychological complexity conferred by player strategies. Now, Barthelmey has taken things one step further by publishing a new paper in the journal Physical Review E that treats chess as a complex system, producing a handy metric that can help predict the proverbial \"tipping points\" in chess matches. [...]\n \nFor his analysis, Barthelemy chose to represent chess as a decision tree in which each \"branch\" leads to a win, loss, or draw. Players face the challenge of finding the best move amid all this complexity, particularly midgame, in order to steer gameplay into favorable branches. That's where those crucial tipping points come into play. Such positions are inherently unstable, which is why even a small mistake can have a dramatic influence on a match's trajectory. Barthelemy has re-imagined a chess match as a network of forces in which pieces act as the network's nodes, and the ways they interact represent the edges, using an interaction graph to capture how different pieces attack and defend one another. The most important chess pieces are those that interact with many other pieces in a given match, which he calculated by measuring how frequently a node lies on the shortest path between all the node pairs in the network (its \"betweenness centrality\").\n \nHe also calculated so-called \"fragility scores,\" which indicate how easy it is to remove those critical chess pieces from the board. And he was able to apply this analysis to more than 20,000 actual chess matches played by the world's top players over the last 200 years. Barthelemy found that his metric could indeed identify tipping points in specific matches. Furthermore, when he averaged his analysis over a large number of games, an unexpected universal pattern emerged. \"We observe a surprising universality: the average fragility score is the same for all players and for all openings,\" Barthelemy writes. And in famous chess matches, \"the maximum fragility often coincides with pivotal moments, characterized by brilliant moves that decisively shift the balance of the game.\" Specifically, fragility scores start to increase about eight moves before the critical tipping point position occurs and stay high for some 15 moves after that. \"These results suggest that positional fragility follows a common trajectory, with tension peaking in the middle game and dissipating toward the endgame,\" writes Barthelemy. \"This analysis highlights the complex dynamics of chess, where the interaction between attack and defense shapes the game's overall structure.\"","contentLength":2921,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Silencio Network Officially Launches, Revolutionizing Noise Data Collection Globally","url":"https://hackernoon.com/silencio-network-officially-launches-revolutionizing-noise-data-collection-globally?source=rss","date":1737750049,"author":"Chainwire","guid":284,"unread":true,"content":"<p>GEORGETOWN, Cayman Islands, January 24th, 2025/Chainwire/--Silencio, the world’s first decentralized noise data engine, has officially launched, setting a new standard in environmental data utilization.</p><p>\\\nPowered by community contributions, Silencio transforms smartphones into secure, anonymous sensors that crowdsource real-time, hyper-local noise data.</p><p>\\\nAt its launch, Silencio Network is operational with almost 800k members in over 180 countries, covering 43.86 billion square meters (+560 times the size of New York) and recording 8.1 million hours of data collection.</p><p>\\\n$SLC Token Lists on Major Exchanges as Silencio Ecosystem Expands</p><p>Central to the Silencio ecosystem is the $SLC token, powered by the , which is used for rewarding contributors, transactions, staking, and governance across the network. </p><p>\\\nAs of its launch on January 24, 2025, $SLC is available on leading exchanges such as , , , , and , with more to be added soon. The $SLC token is designed to incentivize the collection of noise data, supporting the network's expansion with an initial issuance geared towards fostering sustainable growth.</p><p>\\\nSilencio’s Vision: Transforming Noise Into Actionable Insights for a Quieter World</p><p>Silencio’s mission is to harness real-time noise data to enable smarter decisions for individuals, businesses, and governments. </p><p>\\\nWith its cutting-edge approach, the network aims to address critical issues such as urban planning, public health, and environmental management, making it especially relevant for sectors aiming for decentralization and enhanced community engagement.</p><p>\\\nSilencio is set to change the way people value real estate, select restaurants, and decide where to live. By providing actionable noise data, Silencio aims to impact the decision-making of millions of people worldwide, offering a new layer of insight that influences everyday choices and long-term planning. </p><p>\\\nThis approach ensures that noise levels, often overlooked, are now a central consideration in creating quieter, more enjoyable living and working environments.</p><h3>Leading the Web3 Revolution with Real-World, Decentralized Solutions</h3><p>Beyond its token utility, Silencio is also pioneering in governance and community engagement through its transparent, blockchain-based ecosystem.</p><p>\\\nThe network allows contributors to earn $SLC tokens in reward for their data contributions, ensuring that every user is a stakeholder in the network's success. Plans are underway to expand into the global personal data market, estimated to be worth more than $300 billion according to a McKinsey report. </p><p>\\\nSilencio aims to commercialize any smartphone-collected data in a transparent and anonymized manner, providing full control and rewards to users.</p><p>\\\nLooking ahead, Silencio plans to further expand its platform to include more diverse data applications, potentially integrating additional environmental variables and enhancing its impact on global data-driven decision-making. </p><p>\\\nWith a robust user base and a clear vision, Silencio is poised to lead the Web3 revolution, bringing blockchain solutions to the real-world challenges of noise pollution and beyond.</p><h3>Joining the Silencio Revolution</h3><p>Silencio paves the way for a quieter, more informed world, it invites individuals and industries to join its network, contribute data, and benefit from the insights generated. </p><p>\\\nWith its official launch, Silencio reaffirms its commitment to a sustainable and participatory approach to environmental data, welcoming all to be part of this revolutionary journey.</p><p> is revolutionizing the global approach to capturing, processing, and utilizing noise intelligence data. By transforming everyday smartphones into real-time noise sensors, Silencio provides hyper-local insights that drive impactful decisions across industries such as urban planning, real estate, and hospitality. </p><p>\\\nEnvisioning a future where noise-level data influences real estate pricing and guides daily choices in selecting hotels and restaurants, Silencio is paving the way for smarter, more informed decisions. </p><p>\\\nWith operations spanning over 180 countries and a network of almost 800k sensors, the platform generates more than 100,000 daily on-chain transactions, solidifying its position as the world’s largest noise intelligence platform.</p><p>marketing@blocksoundfoundation.org</p><p>:::tip\nThis story was distributed as a release by Chainwire under HackerNoon’s Business Blogging Program. Learn more about the program&nbsp;</p>","contentLength":4446,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Flipster Launches Superstars Program Amid Rapid User Growth Globally","url":"https://hackernoon.com/flipster-launches-superstars-program-amid-rapid-user-growth-globally?source=rss","date":1737749098,"author":"Chainwire","guid":283,"unread":true,"content":"<p>Panama City, Panama, January 24th, 2025, Chainwire/--In a move to foster deeper connections with crypto communities and empower individuals passionate about the digital economy, Flipster, a global crypto trading exchange with millions of users and nearly $120 billion in annual trading volumes, is launching the .</p><p>\\\nThis innovative Superstars program is designed to empower individuals passionate about crypto to lead the conversation, spotlight innovative ideas, and redefine how trading platforms engage with their users.</p><p>\\\nFlipster Superstars offers an opportunity for crypto digital enthusiasts to influence the industry from within. The program calls on creators, community influencers, and storytellers to team up with Flipster, leveraging their unique talents to drive awareness and adoption of the platform’s cutting-edge features while amplifying its presence in nearly 200 countries.</p><p>Flipster Superstars focuses on three core roles to engage a diverse range of talents:</p><ul><li>The Social Media Guru: Driving engagement on platforms like X (formerly Twitter) by creating content that resonates with crypto audiences and builds meaningful connections</li><li>The Influencer Maker: Strengthening Flipster’s presence within key crypto communities, including Telegram and Discord, by leveraging networks and fostering authentic conversations</li><li>The Storyteller: Crafting engaging content—whether visual or written—that highlights Flipster’s unique offerings and simplifies complex concepts for a global audience</li></ul><h3>Opportunities and How to Join&nbsp;</h3><p>Flipster Superstars offers performance-based rewards of up to 100,000 USDT, along with exclusive previews of campaigns and access to premium trading tools. Further details on the opportunities and how to become a Flipster Superstar can be found .</p><h3>A Collaborative Initiative for Crypto Digital Enthusiasts</h3><p>Flipster Superstars is a voluntary initiative designed for individuals passionate about crypto and community engagement. Participants will have the chance to work closely with Flipster users and employees while gaining firsthand experience in the crypto space.&nbsp;</p><p> is a global cryptocurrency exchange serving millions of users globally. Catering to both novice and experienced traders, the platform offers over  across futures and spot markets, with zero trading fees and tools designed for seamless, efficient trading. </p><p>\\\nBeyond trading, Flipster provides opportunities for users to participate in the broader crypto ecosystem, including yield-generation options with  APR on deposits with no lock-in periods and staking features like .</p><p>:::tip\nThis story was distributed as a release by Chainwire under HackerNoon’s Business Blogging Program. Learn more about the program&nbsp;</p>","contentLength":2708,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ElevenLabs has raised a new round at $3B+ valuation led by ICONIQ Growth, sources say","url":"https://techcrunch.com/2025/01/24/elevenlabs-has-raised-a-new-round-at-3b-valuation-led-by-iconiq-growth-sources-say/","date":1737748783,"author":"Ingrid Lunden, Marina Temkin","guid":158,"unread":true,"content":"<p>Companies that want to build AI voice into their products are rushing to work with ElevenLabs, the startup that develops synthetic voice technology like voice cloning and dubbing tools. Now ElevenLabs is turning up the volume on its business with a huge Series C raise, just a year after a sizable Series B. The New […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":384,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"X expands its vertical video feed to global users","url":"https://techcrunch.com/2025/01/24/x-expands-its-vertical-video-feed-to-global-users/","date":1737748338,"author":"Jagmeet Singh","guid":157,"unread":true,"content":"<p>X has started expanding its dedicated vertical video feed to users outside the U.S., TechCrunch has exclusively learned and confirmed with the company.</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":214,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"TechCrunch Disrupt 2025 tickets now on sale: Lowest rates ever","url":"https://techcrunch.com/2025/01/24/techcrunch-disrupt-2025-tickets-now-on-sale-lowest-rates-ever/","date":1737747560,"author":"TechCrunch Events","guid":156,"unread":true,"content":"<p>We’re kicking things off earlier than ever! TechCrunch Disrupt 2025 tickets are officially on sale. Don’t miss your chance to snag them at the lowest rates of the year! Immerse yourself in the epicenter of tech innovation at Disrupt 2025! From October 27 to 29, Moscone West in San Francisco transforms into the global hub […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":395,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Waymo lobbyist activity in SF skyrocketed in 2024","url":"https://techcrunch.com/2025/01/24/waymo-lobbyist-activity-in-sf-skyrocketed-in-2024/","date":1737746953,"author":"Kirsten Korosec","guid":155,"unread":true,"content":"<p>Waymo lobbyists had a busy 2024. A recent review of lobbyist disclosure data by the San Francisco Examiner revealed Waymo paid lobbyists to meet with San Francisco government officials 348 times last year, more than double the 137 times it reported in 2023. The pop in lobbyist activity is in sync with Waymo’s expansion in […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":394,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ditching Meta? Open source alternatives to Instagram, TikTok, and WhatsApp fundraise on Kickstarter","url":"https://techcrunch.com/2025/01/24/ditching-meta-open-source-alternatives-to-instagram-tiktok-and-whatsapp-fundraise-on-kickstarter/","date":1737746739,"author":"Sarah Perez","guid":154,"unread":true,"content":"<p>The developer behind Pixelfed, Loops, and Sup, open source alternatives to Instagram, TikTok, and WhatsApp, respectively, is now raising funds on Kickstarter to fuel the apps’ further development. The trio is part of the growing open social web, also known as the fediverse, powered by the same ActivityPub protocol used by X alternative Mastodon. The […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":422,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Stargate will use solar and batteries to power $100B AI venture","url":"https://techcrunch.com/2025/01/24/stargate-will-use-solar-and-batteries-to-power-100b-ai-venture/","date":1737746097,"author":"Tim De Chant","guid":153,"unread":true,"content":"<p>Solar farms can be completed far faster than nuclear reactors and natural gas power plants.</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":154,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"India’s Param Foundation Opens New Science Centers","url":"https://spectrum.ieee.org/india-new-science-centers","date":1737745204,"author":"Julianne Pepitone","guid":82,"unread":true,"content":"<p>They offer immersive, interactive exhibits and educational programs</p>","contentLength":67,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTgzMjA4MC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTczODM0NTYyN30.bP-FsZdZm3jqjAxcl8AvdSLhMVBl_9fyNgGGl3L25E4/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.14 Adds Support For Blaize BLZP1600, SpacemiT K1 & Snapdragon 8 Elite SoCs","url":"https://www.phoronix.com/news/Linux-6.14-SoCs","date":1737744757,"author":"Michael Larabel","guid":660,"unread":true,"content":"<article>The four SoC pull requests were sent out today for the ongoing Linux 6.14 merge window. These pull requests are principally about various ARM SoC and platform hardware additions/changes but also an increasing number of RISC-V SoC activity too...</article>","contentLength":245,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"FBI: North Korean IT Workers Steal Source Code To Extort Employers","url":"https://it.slashdot.org/story/25/01/24/1851209/fbi-north-korean-it-workers-steal-source-code-to-extort-employers?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737744600,"author":"msmash","guid":235,"unread":true,"content":"The FBI warned this week that North Korean IT workers are abusing their access to steal source code and extort U.S. companies that have been tricked into hiring them. From a report: The security service alerted public and private sector organizations in the United States and worldwide that North Korea's IT army will facilitate cyber-criminal activities and demand ransoms not to leak online exfiltrated sensitive data stolen from their employers' networks. \"North Korean IT workers have copied company code repositories, such as GitHub, to their own user profiles and personal cloud accounts. While not uncommon among software developers, this activity represents a large-scale risk of theft of company code,\" the FBI said. \n\n\"North Korean IT workers could attempt to harvest sensitive company credentials and session cookies to initiate work sessions from non-company devices and for further compromise opportunities.\" To mitigate these risks, the FBI advised companies to apply the principle of least privilege by disabling local administrator accounts and limiting permissions for remote desktop applications. Organizations should also monitor for unusual network traffic, especially remote connections since North Korean IT personnel often log into the same account from various IP addresses over a short period of time.","contentLength":1326,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"iOS 18 hits 68% adoption across iPhones, per new Apple figures","url":"https://techcrunch.com/2025/01/24/ios-18-hits-68-adoption-across-iphones-per-new-apple-figures/","date":1737742753,"author":"Brian Heater","guid":152,"unread":true,"content":"<p>Apple released new figures Friday, highlighting user adoption of iOS 18. Released in public form back in September 2024, the mobile operating system is now installed on 68% of compatible devices. That number jumps to 78% on iPhones released in the last four years. As for the remaining iPhones out there, 19% are running iOS […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":393,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Walgreens Replaced Fridge Doors With Smart Screens. It's Now a $200 Million Fiasco","url":"https://slashdot.org/story/25/01/24/1813201/walgreens-replaced-fridge-doors-with-smart-screens-its-now-a-200-million-fiasco?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737742320,"author":"msmash","guid":234,"unread":true,"content":"Walgreens Boots Alliance has ended a $200 million digital display venture with startup Cooler Screens after widespread technical failures and poor revenue, removing thousands of smart screens from its store freezer doors [non-paywalled link]. The screens, which displayed product information and ads, frequently crashed, showed incorrect inventory, and occasionally caught fire, Bloomberg reports. \n\nCooler Screens CEO Arsen Avakian cut data feeds to over 100 Chicago-area stores in December 2023 during a contract dispute, prompting Walgreens to obtain a restraining order. Walgreens completed removal of 10,300 screens from 700 stores in August 2024, replacing them with traditional glass doors. The screens generated just $215 per door annually, less than half the contractual minimum, according to Walgreens. Nearly $50 million worth of custom-made screens now sit unused in a Texas warehouse.","contentLength":897,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Vulkan 1.4.306 Published With Two More Extensions","url":"https://www.phoronix.com/news/Vulkan-1.4.306","date":1737742252,"author":"Michael Larabel","guid":659,"unread":true,"content":"<article>Vulkan 1.4.306 was published this morning as the newest routine specification update to this graphics/compute API...</article>","contentLength":116,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Neko Health’s unicorn-sized Series B is larger than some Series C rounds","url":"https://techcrunch.com/2025/01/24/neko-healths-unicorn-sized-series-b-is-larger-than-some-series-c-rounds/","date":1737742080,"author":"Anna Heim","guid":151,"unread":true,"content":"<p>Welcome to Startups Weekly — your weekly recap of everything you can’t miss from the world of startups. Want it in your inbox every Friday? Sign up here. This week was supposed to be a short one in the U.S., as it started with a holiday. But Inauguration Day kept some founders busy, and the […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":364,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The EU wants to talk to US tech companies ahead of Germany’s upcoming election","url":"https://techcrunch.com/2025/01/24/the-eu-wants-to-talk-to-us-tech-companies-ahead-of-germanys-upcoming-election/","date":1737742067,"author":"Rebecca Szkutak","guid":150,"unread":true,"content":"<p>The European Union will give tech and social media companies a “stress test” to see how they handle misinformation ahead of Germany’s election next month. European Commission officials have invited tech companies, including X, Meta, Snap, TikTok, Google, Microsoft, and LinkedIn, to a meeting on January 31, according to multiple news outlets. During this meeting, […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":439,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ellipsoid Algorithms as a Tool Against Predictable Opponents","url":"https://hackernoon.com/ellipsoid-algorithms-as-a-tool-against-predictable-opponents?source=rss","date":1737741602,"author":"Algorithmic Bias","guid":282,"unread":true,"content":"<p>(1) Avrim Blum, Toyota Technological Institute at Chicago, IL, USA;</p><p>(2) Melissa Dutz, Toyota Technological Institute at Chicago, IL, USA.</p><h2>4.4 Follow-the-Leader Opponent</h2><p>Recall that the Follow-the-Leader opponent plays the best action in retrospect, defined as the action that would have achieved the highest payoff against our entire history of play. For this opponent, our strategy will be to learn a best response to each action, and then use the well-known ellipsoid algorithm to predict the opponent’s actions while playing best responses to the predicted actions.</p><p>\\\n<strong>Using Ellipsoid for Prediction</strong></p><p>\\\nNote that while the bound on the number of losses and ties we incur is exponential, the runtime can be considered efficient since choosing which action to play in each round is efficient; this is an improvement over the simple general prediction algorithm we considered in section 3, which requires considering an exponential number of game matrices to choose which action to play in a single round. We also consider a limited-history variant of the Follow-the-Leader opponent below, against which we can achieve a polynomial bound on losses and ties.</p><h3>4.4.1 Variant: Limited History</h3><h3>4.5 Highest Average Payoff Opponent</h3><p>The Highest Average Payoff opponent plays the action that has achieved the highest average payoff over the times they have played it. We discuss this opponent in A.4.</p>","contentLength":1383,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The AI industry’s pace has researchers stressed","url":"https://techcrunch.com/2025/01/24/the-ai-industrys-pace-has-researchers-stressed/","date":1737741600,"author":"Kyle Wiggers","guid":149,"unread":true,"content":"<p>To outside observers, AI researchers are in an enviable position. They’re sought after by tech giants. They’re taking home eye-popping salaries. And they’re in the hottest industry of the moment. But all this comes with intense pressure. More than half a dozen researchers TechCrunch spoke with, some of whom requested anonymity for fear of reprisals, […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":426,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"People are benchmarking AI by having it make balls bounce in rotating shapes","url":"https://techcrunch.com/2025/01/24/people-are-benchmarking-ai-by-having-it-make-balls-bounce-in-rotating-shapes/","date":1737740892,"author":"Kyle Wiggers","guid":148,"unread":true,"content":"<p>The list of informal, weird AI benchmarks keeps growing. Over the past few days, some in the AI community on X have become obsessed with a test of how different AI models, particularly so-called reasoning models, handle prompts like this: “Write a Python script for a bouncing yellow ball within a shape. Make the shape […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":390,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"US users dumped RedNote after Trump paused the TikTok ban","url":"https://techcrunch.com/2025/01/24/us-users-dumped-rednote-after-trump-paused-the-tiktok-ban/","date":1737740666,"author":"Sarah Perez","guid":147,"unread":true,"content":"<p>In the days leading up to the TikTok ban in the U.S. on Sunday, U.S. users flooded the Chinese app RedNote, which offered a similar experience to their favorite short-form video app. The app, which is listed in the U.S. App Store under its Chinese name Xiaohongshu, quickly became the No. 1 free app in […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":371,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"French e-bike startup Angell nears bankruptcy","url":"https://techcrunch.com/2025/01/24/french-e-bike-startup-angell-nears-bankruptcy/","date":1737739837,"author":"Romain Dillet","guid":146,"unread":true,"content":"<p>Angell, a French smart electric bike startup, has announced in an email to customers that the company is declaring insolvency and approaching a court to ask for judicial liquidation. “It’s over for Angell,” said company co-founder and CEO Marc Simoncini on Instagram. (He also happens to be a judge on the French version of “Shark […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":407,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Electric Cars in UK Last as Long as Petrol and Diesel Vehicles, Study Finds","url":"https://tech.slashdot.org/story/25/01/24/171242/electric-cars-in-uk-last-as-long-as-petrol-and-diesel-vehicles-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737739800,"author":"msmash","guid":233,"unread":true,"content":"Battery cars on Britain's roads are lasting as long as petrol and diesel cars, according to a study that has found a rapid improvement in electric vehicle reliability. From a report: An international team of researchers has estimated that an electric car will have a lifespan of 18.4 years, compared with 18.7 years for petrol cars and 16.8 years for diesels, according to a peer-reviewed study published on Friday in the journal Nature Energy. The findings were based on 300m records from compulsory annual MOT tests of roadworthiness. \n\nAutomotive engineers have long suspected electric cars will be more reliable than petrol or diesel cars, because they contain many fewer moving parts. Data has been limited, however, because the earliest mass-market electric cars are only just reaching the end of their lives. The researchers, from the University of Birmingham, the London School of Economics, the University of California San Diego, and the University of Bern, Switzerland, used MOT data to estimate the failure rate of all cars -- ignoring scrappage in the first few years, which is most likely to be related to accidents. The analysis found that Tesla cars had the longest lifespan among battery cars.","contentLength":1210,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Kodiak has made its first driverless truck deliveries to customer Atlas Energy","url":"https://techcrunch.com/2025/01/24/kodiak-has-made-its-first-driverless-truck-deliveries-to-customer-atlas-energy/","date":1737738711,"author":"Rebecca Bellan","guid":145,"unread":true,"content":"<p>Kodiak Robotics has officially handed off two autonomous trucks to customer Atlas Energy Solutions, marking the startup’s first commercial launch.&nbsp; Atlas, a provider of proppant (i.e., sand) and oilfield logistics, received its first Kodiak-equipped trucks in December and began driverless operations in an off-road environment in West Texas’s remote Permian Basin shortly after. The company […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":465,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Threads is testing ads in the US and Japan","url":"https://techcrunch.com/2025/01/24/threads-is-testing-ads-in-the-u-s-and-japan/","date":1737738551,"author":"Ivan Mehta","guid":144,"unread":true,"content":"<p>Meta’s X rival Threads said Friday that it is now testing ads with select brands in the U.S. and Japan. Instagram head Adam Mosseri said that the company will listen to feedback before expanding this experiment in other markets. “We know there will be plenty of feedback about how we should approach ads, and we […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":384,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Understanding Bias-Driven Opponent Models in Competitive Gameplay","url":"https://hackernoon.com/understanding-bias-driven-opponent-models-in-competitive-gameplay?source=rss","date":1737738031,"author":"Algorithmic Bias","guid":281,"unread":true,"content":"<p>(1) Avrim Blum, Toyota Technological Institute at Chicago, IL, USA;</p><p>(2) Melissa Dutz, Toyota Technological Institute at Chicago, IL, USA.</p><p>We consider two-player, repeated games with the following properties:</p><ul><li><p>Payoffs are limited to {1, 0, −1} (representing win, tie, and loss respectively)</p></li><li><p>Each action beats at least one other action</p></li><li><p>Each action loses to at least one other action</p></li></ul><p>\\\n (Permissible Game). We refer to a game with the above properties as a permissible game for convenience.</p><p>\\\nWe consider how well we can do without knowing the payoff matrix M or even observing payoffs when playing against a behaviorally-biased opponent who does know M. Our goal will be to win nearly every round.</p><h3>2.1 Models of behaviorally-biased opponents</h3><p>We assume all opponents know the payoff matrix and play a deterministic, behaviorallybiased strategy. The following are the particular biased adversaries we consider here:</p><p>\\\nThe opponent plays a best response to our last action. If there are multiple best responses to our last action, we assume the opponent breaks ties according to some fixed but unknown order over actions. On the first round, since there is no previous action, we assume the opponent plays the first action in that ordering.</p><p>\\\nThis is our simplest opponent, who just assumes that tomorrow will be exactly like today.</p><p>\\\ne opponent plays a best response to our “most overdue” (least-frequently-played) action. This opponent is motivated by the Gambler’s Fallacy, in which one assumes an event which hasn’t happened as often as expected is “overdue” and is more likely to occur (for example, when tossing a fair coin, the belief that Tails is more likely following a series of Heads).</p><p>\\\nIf there are multiple best responses to our “most overdue” action, or if there are multiple “most overdue” actions the opponent might try to counter (for example, at the start of the game when all actions are equally “overdue” since they have all been played zero times), the opponent breaks ties using a fixed but unknown order over actions.</p><p>\\\nThe opponent continues to play the same action following a win, and switches to a new action following a loss. We consider two variants of this strategy: one in which the opponent behaves as if a tie is a win, continuing to play the same action after tying, and one in which the opponent behaves as if a tie is a loss, switching actions after tying.</p><p>\\\nWe assume that when the opponent shifts actions, they shift to the action immediately following the current action in some fixed but unknown order over actions. In the first round, we assume the opponent plays the first action in that ordering.</p><p>\\\nWin-stay lose-shift was initially proposed as an early algorithm for bandit problems by Robbins [15]. There is also some empirical research indicating that people may play rock-paper-scissors according to an approximate version of this strategy: Wang et al. [19] observed that players are more likely to play the same action again after winning, and more likely to shift to the next action in the sequence rock-paper-scissors following a loss. More broadly, win-stay lose-shift has been proposed as a potential explanation for the evolution of cooperative behavior [13].</p><p>\\\nThis strategy can also be viewed as similar to the hot-hand fallacy, in which one believes an action which has just won is having a “hot streak” and is more likely to win in the future, and conversely believes an action which has just lost is having a “cold” streak and is more likely to lose in the future.</p><p>\\\nThe opponent plays the best action in retrospect, where the best action in retrospect is the action that would have achieved the highest net payoff against our history of play. If multiple actions are tied for the highest payoff, the opponent breaks ties using some fixed but unknown order over actions. In the first round, when there is no history to choose based on, the opponent plays the first action in that ordering.</p><p>\\\nIt has been hypothesized that irrational strategic behavior may be explained by agents playing a misspecified or simplified version of a game rationally [7]. The above strategy is reasonable for an opponent who erroneously models our play as stochastic. In online learning, this strategy is called Follow-the-Leader or FTL (see [16]).</p><p>\\\nWe also consider a limited-history variant of this opponent, in which the the opponent only considers the last r rounds, where r &gt; 0.</p><p>\\\nThe opponent plays the action that has achieved the highest average payoff over the times they have played it. We assume the opponent initializes the average payoff of each action as 0. If multiple actions are tied for the highest average payoff, the opponent breaks ties using some fixed but unknown order over actions.</p><p>\\\nThis is a reasonable strategy for an opponent who believes our play is stochastic, in which case its actions can be viewed as coins with various biases. It also corresponds to a well-known reinforcement learning algorithm, epsilon-greedy Q-learning, with ϵ = 0 (see [17]).</p>","contentLength":5027,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ways to Counter Limited-History Opponents with Algorithmic Tools","url":"https://hackernoon.com/ways-to-counter-limited-history-opponents-with-algorithmic-tools?source=rss","date":1737738029,"author":"Algorithmic Bias","guid":280,"unread":true,"content":"<p>(1) Avrim Blum, Toyota Technological Institute at Chicago, IL, USA;</p><p>(2) Melissa Dutz, Toyota Technological Institute at Chicago, IL, USA.</p><h2>A.2 Follow-the-Leader Variant: Limited History</h2><p>Recall that the limited-history variant of the Follow-the-Leader opponent plays the action that would have achieved the highest net payoff against the last r rounds of our play. Note that we assume r &gt; 0. If r = 0, the opponent would simply play the same action every round (the first action in their action ordering) regardless of our play. In that case, their play would not reveal any information about best responses, so the best we could do is tie in most rounds by playing the same action as the opponent.</p><p>\\\nWe again use the ellipsoid algorithm for prediction, essentially the same way as described for the unlimited-history variant of this opponent in 4.4. In this case, the inequality we observe when a mistake is made is only relative to the past r rounds.</p>","contentLength":946,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Future Directions for Exploiting Behavioral Biases in Games","url":"https://hackernoon.com/future-directions-for-exploiting-behavioral-biases-in-games?source=rss","date":1737738026,"author":"Algorithmic Bias","guid":279,"unread":true,"content":"<p>(1) Avrim Blum, Toyota Technological Institute at Chicago, IL, USA;</p><p>(2) Melissa Dutz, Toyota Technological Institute at Chicago, IL, USA.</p><p>In future work, it would be interesting to further characterize which behaviorally-biased strategies can be exploited to win nearly every round without observing payoffs. In that vein, one clear next step would be to explore the exploitability of behaviorally-motivated probabilistic strategies. In the probabilistic setting it may not be possible to win even most of the time; for example, probabilistic strategies could be regret-minimizing, in which case the best we can hope to achieve is the minimax value of the game. However, we could aim to get bounds on our performance relative to the best possible strategy given full information about the game matrix, payoffs, and the opponent’s strategy. Another direction would be considering more complex games, for example exploring extensive-form games.</p><p>\\\n2 Peter Auer, Nicolò Cesa-Bianchi, Yoav Freund, and Robert E. Schapire. The nonstochastic multiarmed bandit problem. SIAM Journal on Computing, 32(1):48–77, 2002. doi:10.1137/S0097539701398375.</p><p>\\\n4 Edward Cartwright. Behavioral economics. Routledge, 2018.</p><p>\\\n5 Nicolò Cesa-Bianchi and Gábor Lugosi. Prediction, learning, and games. Cambridge University Press, 2006. doi:10.1017/CBO9780511546921.</p><p>\\\n6 Nicolas Christin. Network security games: Combining game theory, behavioral economics, and network measurements. In John S. Baras, Jonathan Katz, and Eitan Altman, editors, Decision and Game Theory for Security, pages 4–6, Berlin, Heidelberg, 2011. Springer Berlin Heidelberg. doi:10.1007/978-3-642-25280-8_2.</p><p>\\\n9 Joseph Y. Halpern and Rafael Pass. Algorithmic rationality: Game theory with costly computation. Journal of Economic Theory, 156:246–268, 2015. URL: <a href=\"https://doi.org/10.1016/j.jet.2014.04.007\">https://doi.org/10.1016/j.jet.2014.04.007</a>, doi:10.1016/J.JET.2014.04.007.</p><p>\\\n10 Daniel Kahneman. Thinking, Fast and Slow. Farrar, Straus and Giroux, New York, 2011.</p><p>\\\n11 Nick Littlestone. Learning quickly when irrelevant attributes abound: A new linear-threshold algorithm. Machine Learning, 2(4):285–318, 1988. doi:10.1007/BF00116827.</p><p>\\\n12 John M. McNamara, Alasdair I. Houston, and Olof Leimar. Learning, exploitation and bias in games. PLOS ONE, 16(2):1–14, 02 2021. doi:10.1371/journal.pone.0246588.</p><p>\\\n13 Martin Nowak and Karl Sigmund. A strategy of win-stay, lose-shift that outperforms tit-for-tat in the prisoner’s dilemma game. Nature, 364(6432):56–58, July 1993. doi:10.1038/364056a0.</p><p>\\\n15 Herbert Robbins. Some aspects of the sequential design of experiments. Bulletin of the American Mathematical Society, 58(5):527 – 535, 1952. doi:10.1090/s0002-9904-1952-09620-8.</p><p>\\\n16 Shai Shalev-Shwartz. Online learning and online convex optimization. Foundations and Trends in Machine Learning, 4(2):107–194, 2012. doi:10.1561/2200000018.</p><p>\\\n17 Richard S Sutton and Andrew G Barto. Reinforcement learning: An introduction. MIT press, 2018.</p><p>\\\n19 Zhijian Wang, Bin Xu, and Hai-Jun Zhou. Social cycling and conditional responses in the rock-paper-scissors game. Scientific Reports, 4(1), jul 2014. doi:10.1038/srep05830.</p>","contentLength":3130,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Broader Insights into Exploitable Strategies in Zero-Sum Games","url":"https://hackernoon.com/broader-insights-into-exploitable-strategies-in-zero-sum-games?source=rss","date":1737738024,"author":"Algorithmic Bias","guid":278,"unread":true,"content":"<p>(1) Avrim Blum, Toyota Technological Institute at Chicago, IL, USA;</p><p>(2) Melissa Dutz, Toyota Technological Institute at Chicago, IL, USA.</p><h2>5.1 Other Behaviorally-Biased Strategies</h2><p>A natural question to ask is, what kinds of behaviorally-biased strategies can we exploit to win nearly every round of a permissible game (Definition 1)? Clearly, if we can predict the opponent’s actions and learn best responses to those actions the opponent plays, we can achieve this goal.</p><p>\\\n<strong>Predicting the Opponent’s Actions</strong></p><p>\\\nThe more challenging question is which deterministic strategies we can exploit to learn best responses for any action the opponent might play. Note that we cannot do this for every deterministic strategy; consider a very simple opponent who always plays the same action a. In this case, the opponent’s play does not reveal any information about a best response to a.</p><p>\\\n<em>It is not always possible to exploit a known deterministic strategy to guarantee winning any rounds.</em></p><p>\\\nNote that not every reasonable behavioral strategy has this property; several of the biased opponents we discussed earlier do not: the Gambler’s Fallacy opponent, the Tie-Stay variant of Win-Stay Lose-Shift opponent, and the Highest Average Payoff opponent.</p>","contentLength":1239,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How Behavioral Biases Shape Gameplay Without Payoff Visibility","url":"https://hackernoon.com/how-behavioral-biases-shape-gameplay-without-payoff-visibility?source=rss","date":1737738022,"author":"Algorithmic Bias","guid":277,"unread":true,"content":"<p>(1) Avrim Blum, Toyota Technological Institute at Chicago, IL, USA;</p><p>(2) Melissa Dutz, Toyota Technological Institute at Chicago, IL, USA.</p><ol start=\"4\"><li>Strategies for Beating Behaviorally Biased Opponents</li></ol><p>Gameplay under various forms of uncertainty has been widely studied. Feldman et al. [8] studied a particularly low-information setting in which one observes the opponent’s actions but no payoffs, not even one’s own, and introduced an algorithm which guarantees one’s payoff nonetheless approaches the minimax optimal value (i.e., zero) in a symmetric zero-sum game. Against an opponent playing a minimax-optimal strategy, approaching the value of the game is the best one can hope to guarantee. However, a wealth of research in behavioral economics shows that people often do not make perfectly rational, optimal decisions. Here we consider whether it is possible to actually win in this setting if the opponent is behaviorally biased. We model several deterministic, biased opponents and show that even without knowing the game matrix in advance or observing any payoffs, it is possible to take advantage of each bias in order to win nearly every round (so long as the game has the property that each action beats and is beaten by at least one other action). We also provide a partial characterization of the kinds of biased strategies that can be exploited to win nearly every round, and provide algorithms for beating some kinds of biased strategies even when we don’t know which strategy the opponent uses.</p><p>Game theory has traditionally assumed all agents are perfectly rational utility maximizers [14], but behavioral economics shows this assumption is often unsound; people often deviate from “optimal” behavior in predictable ways, exhibiting behavioral biases such as loss aversion (exhibiting a higher sensitivity to losses than equivalent gains) and confirmation bias (interpreting information in a way which favors existing beliefs) [10, 4]. These insights initiated the study of behavioral game theory, which has demonstrated that people employ consistent “irrational” strategies in wide-ranging strategic settings (see [3]). Given the evidence that people often use behavioral strategies in games, it is important to understand the implications of this in algorithmic interactions (see, e.g., [9, 1, 6, 12]).</p><p>\\\nIn this work, we are interested in the extent to which behavioral biases are vulnerable to exploitation in competitive games. To study this, we consider symmetric, repeated, two-player, zero-sum games, and find that even an uninformed opponent who does not know the game or observe any payoffs can take advantage of a wide variety of biased strategies to beat the biased player in nearly every round.</p><p>\\\nThe setting we consider here is based on work by Feldman et al. [8]. Gameplay under various forms of uncertainty is a focus of much research interest; for example, the bandit setting, in which a player observes payoffs after each round but not the opponent’s play, has been widely studied (see [2, 5]). Feldman et al. introduced a complementary setting, in which the player observes the opponent’s play but no payoffs. No assumptions are made about the opponent, who may have full knowledge of the game. In particular, Feldman et al. consider symmetric, two-player, repeated games. They introduce a “copycat” algorithm which guarantees a payoff approaching the value of the game, which is the best bound one could hope to achieve against an opponent playing a minimax-optimal strategy. For a symmetric zero-sum game, the value of the game is zero, so their algorithm guarantees a payoff approaching zero in that case. The Copycat algorithm basically works by ensuring that for any pair of actions a1 and a2, the number of rounds in which the uninformed player plays a1 and the opponent plays a2 is not very far from the number of rounds in which the player plays a2 and the opponent plays a1. In this way, the uninformed player is able to achieve roughly the value of the game without knowing (or learning) anything about payoffs.</p><p>\\\nThe setting introduced by Feldman et al. [8] is a particularly interesting setting in which to study behavioral bias, because it allows us to consider to what extent one can exploit an opponent’s biases when the opponent’s behavior is essentially the only information one has. We consider the same basic setting, with a few additional restrictions. Like Feldman et al., we consider repeated, two-player, zero-sum, symmetric games in a setting where one does not have a priori knowledge of the game matrix and does not observe payoffs, but does observe the opponents actions. We also assume the opponent is deterministic and plays according to some behaviorally-biased strategy. For simplicity, we consider games where payoffs are limited to {1, 0, -1} (just wins, ties and losses). We assume no action is unbeatable and each action beats at least one other action.</p><p>\\\nThere are two technical components to beating a biased opponent in this setting: one needs to learn to predict the opponent’s actions, and one needs to learn a best response to those actions the opponent plays. We note that it is not sufficient to just be able to predict accurately. For example, one natural idea which does not work (even if one is willing to take exponential time) is to simply find the lexicographically first game matrix consistent with all the opponent’s actions so far and their behavioral strategy, and then play a best response to the action predicted by that game matrix. It is possible that two game matrices, M1 and M2, could be consistent with the opponent’s play, but playing best responses with respect to M1 could result in losing most rounds (and tying in the remaining rounds) if the true game matrix is M2. We show such an example in section 3.</p><p>\\\nWe model several deterministic, behaviorally-biased opponents, and show how to exploit each bias to win nearly every round. We also give a partial characterization of the kinds of behavioral strategies we can exploit in general, and show that in some cases, we can also win nearly every round against a biased opponent even if we do not know which behavioral strategy they use.</p><p>\\\nThis work highlights the danger of using behaviorally-biased strategies in competitive settings. We might expect that, while such strategies are not minimax optimal, some seemingly reasonable ones might do well enough, particularly against an uninformed opponent. However, our work shows that some behavioral biases can be exploited even by a player without prior knowledge of the game matrix entries who does not observe payoffs.</p>","contentLength":6634,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Methods for Decoding Opponent Actions and Optimizing Responses","url":"https://hackernoon.com/methods-for-decoding-opponent-actions-and-optimizing-responses?source=rss","date":1737738019,"author":"Algorithmic Bias","guid":276,"unread":true,"content":"<p>(1) Avrim Blum, Toyota Technological Institute at Chicago, IL, USA;</p><p>(2) Melissa Dutz, Toyota Technological Institute at Chicago, IL, USA.</p><h2>3. Preliminaries and Intuition</h2><p>While the strategy of playing action i against action j roughly as many times as we play action j against action i (for all i, j) employed by the Copycat algorithm in Feldman et al. [8] is sufficient to roughly tie in a symmetric zero-sum game, we’d like to go further and win nearly every round. To do this, we will learn to predict the opponent’s actions and learn best responses to those actions the opponent plays. It turns out that predicting the opponent’s actions is the “easy” part, and the main challenge will be learning best responses. We discuss each of these at a high level below.</p><h3><strong>Predicting the Opponent’s Actions</strong></h3><p>It is possible to learn to predict any of our opponents’ actions using a simple halving algorithm (see [11]). Recall that in our setting, an opponent’s choice of action is deterministic and induced by their known biased strategy, their tie-breaking mechanism, the unknown game matrix, and the history of play. Consider all possible combinations of the opponent’s known biased strategy with a potential tie-breaking mechanism to be a family of deterministic strategies. Then, consider all possible pairs including a deterministic strategy from that family and a game matrix of the appropriate size. Predict the opponent’s next action by taking the majority vote over the predictions corresponding to these pairs and the play history. Then, eliminate all pairs that did not correspond to a correct prediction. Each time a mistake is made, at least half of the remaining pairs must have predicted incorrectly, so at least half of the remaining pairs are eliminated. Given a finite number of possible tiebreaking mechanisms, this algorithm clearly results in a finite number of prediction errors. However, it is inefficient: even with our assumption of only 3 possible payoff values, there are roughly 3 n 2 possible game matrices, and for each game matrix, there may be many tiebreaking mechanisms to consider: throughout this paper we generally assume the opponent breaks ties according to some fixed ordering over actions, in which case there are n!. We will give more efficient prediction algorithms for each of the opponents we introduced above by taking further advantage of their specific strategies.</p><p>\\\nIt may seem like being able to predict generally is sufficient to learn best responses, but this is not the case. For example, a general (exponential) algorithm which does not work is to find the lexicographically first game matrix and action ordering pair consistent with all the opponent’s actions so far and their behavioral strategy, and then play a best response to the action predicted by that pair according to the corresponding game matrix. However, even for the simplest opponent we consider, the Myopic Best Responder, and identical orderings over actions, there could be two game matrices M and M∗ which are consistent with the opponent’s play, but playing best responses with respect to M could result in losing most rounds (and tying in the remaining rounds) if the true game matrix is M∗ (see the example below). Instead, we will more actively exploit the opponent’s particular strategy to elicit best responses.</p><p>\\\n<strong>Example: Playing Optimally According to a Consistent Game Matrix and Action Ordering is Not Sufficient to Win</strong></p><p>\\\nAction Ordering Ω: R, P, S, R’, P’, S’</p><p>\\\nSuppose we are playing a game M∗ against the Myopic Best Responder, whose ordering over actions is Ω. Suppose that we predict the Myopic Best Responder’s actions according to the correct action ordering Ω but a slightly different game matrix M, and play best responses according to M. Both games are like an expanded version of rock-paper-scissors, in which the interactions among R, P, S and among R’,P’, S’ respectively are the same as in standard rock-paper-scissors, but the interactions between those two sets of actions differs between M and M∗ ; the differing entries are bolded for convenience. Consider the following sequence of play, which is consistent with M∗ , M, Ω, and the strategy of the Myopic Best Responder, and optimal according to M:</p><p>\\\nThe sequence shown in the first three rounds will repeat indefinitely as long as we continue to play the same best responses with respect to M, leading us to lose or tie in every round.</p><p>\\\nNote that it is possible to construct very similar, larger games in which we lose to the Myopic Best Responder an arbitrarily large fraction of the time (depending on the number of actions in the game), since we only need to tie against the first action in the opponent’s action ordering to avoid discovering any inconsistency.</p>","contentLength":4807,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Key to Defeating Win-Stay, Lose-Shift Opponent Variants","url":"https://hackernoon.com/the-key-to-defeating-win-stay-lose-shift-opponent-variants?source=rss","date":1737738017,"author":"Algorithmic Bias","guid":275,"unread":true,"content":"<p>(1) Avrim Blum, Toyota Technological Institute at Chicago, IL, USA;</p><p>(2) Melissa Dutz, Toyota Technological Institute at Chicago, IL, USA.</p><h2>4.3 Win-Stay, Lose-Shift Opponent</h2><p>Recall that the Win-Stay Lose-Shift opponent plays the same action immediately following a win, and switches to the next action in its action ordering immediately following a loss. The Tie-Shift variant of this opponent treats a tie like a loss and shifts, and the Tie-Stay variant treats a tie like a win and stays.</p><p>\\\n. In the first phase, we record the correct action ordering: the opponent starts by playing the first action in their action ordering and always shifts to the next action in the ordering, so by observing n − 1 shifts we observe all n actions in the correct order. Because we play each action in succession against the opponent’s current action, they are guaranteed to shift after at most n − 1 rounds, since their action must tie with itself and lose to at least one other action.</p><p>\\\nAt the start of phase 4, we correctly predict the opponent’s next action: we know we won the last round, so we know that the opponent will shift to the next action in its action order (which we have recorded correctly, as shown above). We showed above that we correctly recorded a best response to each action, so we win by playing the recorded best response to the predicted action. At the start of the next round, the same conditions hold (and will hold after each round), so we will win all subsequent rounds.</p><p>The main difference in beating the Tie-Stay variant compared to the Tie-Shift variant is that we can find a best response to each action by simply playing each action in succession until the opponent switches, since they only switch following a loss. For the algorithm, theorem and proof see A.1 in the Appendix.</p>","contentLength":1801,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Hydra Achieves 1 Million TPS, Validating Cardano as the Fastest Blockchain","url":"https://hackernoon.com/hydra-achieves-1-million-tps-validating-cardano-as-the-fastest-blockchain?source=rss","date":1737738014,"author":"Jon Stojan Journalist","guid":274,"unread":true,"content":"<p>\\\nThe Hydra Doom Tournament is a high-stakes gaming event, held both online and live, that highlights the classic game Doom while demonstrating the scalability and capabilities of the Hydra solution on the Cardano blockchain. The first stages of the tournament have delivered decisive results, with  being crowned the fastest blockchain, achieving an unprecedented 1 million Transactions Per Second (TPS).</p><p>\\\nThis significant milestone positions Cardano at the forefront of blockchain scalability and could set a new precedent for the industry. Most importantly, Cardano has proven its capability for high scalability without compromising security or decentralization, reflecting the blockchain’s readiness to support high-demand applications across industries.</p><p>\\\nBeyond the gaming industry, the Hydra Doom engine could transform P2P applications and business-to-business systems in all areas of tech.</p><h3><strong>The Stress Test of the Hydra Doom Tournament</strong></h3><p>The Hydra Doom Tournament has served as a real-world stress test that pushed Hydra’s capabilities to the limit within a competitive environment. The players competed in regional qualifiers and semi-finals, and the tournament will conclude with an in-person finale held in Las Vegas.</p><p>\\\nThe large scale of the tournament showcased Hydra’s ability to process vast amounts of data in real-time transactions.</p><h3><strong>Superior Tech Applications in Data Processing</strong></h3><p>Within the Hydra Doom Tournament, game data from players was submitted as smart contract transactions to individual Hydra heads. Each Hydra head then validated transactions using smart contracts that contained a subset of game logic and tracked the game state, including player scores.</p><p>\\\nProviding this information via the blockchain made it possible to populate leaderboards and distribute prizes through verified smart contracts. Although video game competitions can typically take weeks to distribute prize money to winners, the Hydra Doom Tournament managed it within seconds.</p><h3><strong>A Proving Ground for Scalability</strong></h3><p>The Hydra Doom Tournament demonstrates Hydra’s scalability prowess under live conditions. During the qualifier on December 3rd, thousands of players competed for spots, so the Hydra team decided to further supplement traffic with additional games running bot-vs-bot simulations.</p><p>\\\nThe number of transactions surpassed the previous total of 106 million over 78 hours during the Rare Evo event, reaching 15.5 billion transactions in just 24 hours. The semi-finals, held December 8–18, featured Player-Vs-Player death matches as competitors vied for spots in the finals.</p><h3>A Major Milestone for Blockchain Technology</h3><p>Hydra’s success, proven by how rapidly it handled transactions throughout the Doom Tournament, has made Cardano much faster and more efficient. Hydra has distinguished itself from other blockchain systems through a number of advantages inherited from Cardano, including the EUTxO model, native assets, deterministic transaction execution, and high-assurance smart contracts.</p><p>\\\nThese benefits are taken to a new level with the application of the temporary head model.</p><h3><strong>The Power of the Hydra Heads</strong></h3><p>Hydra’s strength lies in its horizontal scaling capacity, in which as many Hydra heads as needed can be deployed in parallel. This grants Hydra the capability to take on large volumes, as proven on the Hydra Doom Tournament grounds.</p><p>\\\nTheoretically, there is no upper limit to its scaling capacity for applications in this design type. The collaboration of multiple engineering teams and designers, including Sundae Labs, Adam Dean, DripDropz, and the Hydra team, has allowed for Hydra’s true potential to be unlocked and run in real time.</p><p>\\\nWhat truly sets Hydra apart is the ingenuity of the temporary head model. Each Hydra head operator can enact trade-offs that wouldn’t be possible for persistent systems, such as setting transaction fees to zero, which allows for significantly larger and more complex transactions if needed.</p><p>\\\nPerhaps most impressively, of the roughly 15.5 billion transactions processed within 24 hours on December 3, not a single one failed. This unprecedented reliability could set new benchmarks for the tech industry, with applications spanning multiple sectors.</p><h3><strong>The Potential Applications of Cardano Hydra</strong></h3><p>Hydra has already proven its potential in gaming through the Hydra Doom Tournament. Beyond processing transactions for these kinds of tournaments, it could also process microtransactions during gameplay with advanced speed and efficiency.</p><p>\\\nThese capabilities can be taken outside the gaming world as well, as it is uniquely suited for P2P applications within business-to-business systems. Broadening the category from the gaming angle, it can also be applied to “information gathering” applications, where the primary purpose is not to handle people’s assets but to collect cryptographically verified information such as signed messages.</p><p>\\\nFurthermore, Hydra’s abilities could be utilized for banking and global payments, breaking financial barriers with faster cross-border transactions. Within the world of DeFi, Hydra could power decentralized applications to improve the user experience among a wide variety of other blockchain use cases.</p><h3><strong>The Future Implications of Blockchain Progression</strong></h3><p>Each milestone of blockchain progression increases the accessibility of blockchain technology for users and use cases. As this technology reaches new levels of sophistication, so does its potential to transform industries across tech.</p><p>\\\nIn terms of Hydra, it can be employed as a “friction remover” for practical day-to-day use. In its initial deployment phase, it can operate in a centralized model, then gradually change its structure to involve more node operators. Although Hydra is not the ultimate solution for every tech case, it can be combined with other products in the ecosystem to boost value for businesses and organizations.</p><h3><strong>The Road Ahead for Cardano Hydra</strong></h3><p>The next step for Hydra’s team is the conclusion of the Hydra Doom Tournament, which will take place on January 24, 2025 during the  at the Hyper X Arena in Las Vegas. In a final showdown, top players will compete for a total of $50,000 in prizes. This showcase event will place Hydra’s scalability on the global stage in true esports fashion.</p><p>\\\nBeyond the tournament, the  team looks forward to the system’s official version 1 node launch. They also have numerous applications in the works that they will build with Hydra, including notable applications aimed at empowering DeFi use cases with Gummiworm from Sundae Labs and Delta DeFi.</p><p>\\\nWith the capabilities that Cardano Hydra has demonstrated so far, it is poised to take top spots in blockchain applications. Like its namesake, the multi-headed mythical beast, Hydra’s decentralized mode of operation makes it an exciting example of what DeFi has to offer.</p>","contentLength":6841,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Strategies to Exploit Myopic and Gambler’s Fallacy Opponents","url":"https://hackernoon.com/strategies-to-exploit-myopic-and-gamblers-fallacy-opponents?source=rss","date":1737738010,"author":"Algorithmic Bias","guid":273,"unread":true,"content":"<p>(1) Avrim Blum, Toyota Technological Institute at Chicago, IL, USA;</p><p>(2) Melissa Dutz, Toyota Technological Institute at Chicago, IL, USA.</p><h2>4. Strategies for Beating Behaviorally Biased Opponents</h2><h3>4.1 Myopic Best Responder</h3><p>\\\n<em>Playing Algorithm 2 against the Myopic Best Responder in a permissible game (Definition 1) results in winning every round after the first n + 1 rounds.</em></p><p>\\\n. The Myopic Best Responder plays a best response to our previous action, so we record a correct best response to each action during the first n + 1 rounds. The Myopic Best Responder always plays the same best response (the first one in its action ordering) following any given action, so we correctly predict the action it will play from round n + 2 onward. Therefore we win every round from round n + 2 onward, since we correctly predict the opponent’s action and play a valid best response to it.</p><h3>4.2 Gambler’s Fallacy Opponent</h3><p>\\\n<em>Playing Algorithm 3 against the Gambler’s Fallacy opponent in a permissible game (Definition 1) results in winning every round from round 3n onward.</em></p>","contentLength":1056,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Algorithm 8’s Approach to Countering the Highest Average Payoff Opponent","url":"https://hackernoon.com/algorithm-8s-approach-to-countering-the-highest-average-payoff-opponent?source=rss","date":1737738008,"author":"Algorithmic Bias","guid":272,"unread":true,"content":"<p>(1) Avrim Blum, Toyota Technological Institute at Chicago, IL, USA;</p><p>(2) Melissa Dutz, Toyota Technological Institute at Chicago, IL, USA.</p><h2>A.4 Highest Average Payoff Opponent</h2><p>We assume the opponent initializes each action with an average payoff of 0.</p><p>\\\nFor this opponent, our high-level strategy will be to learn a best response to each action, and then use the well-known ellipsoid algorithm to predict the opponent’s actions while playing best responses to the predicted actions.</p><p>\\\nThe round preceding such a switch must have been a loss for the opponent: its net payoff must have gone down during that round for the average payoff to go from non-negative to negative. We showed that the opponent will proceed through each of the n actions in order when it switches during phase 1, so as long as we can reliably force the opponent to switch actions, we correctly record a best response to each of the first n − 1 actions in phase 1.</p>","contentLength":932,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A Guide to Exploiting Unknown Strategies From a Known Bias Set","url":"https://hackernoon.com/a-guide-to-exploiting-unknown-strategies-from-a-known-bias-set?source=rss","date":1737738005,"author":"Algorithmic Bias","guid":271,"unread":true,"content":"<p>(1) Avrim Blum, Toyota Technological Institute at Chicago, IL, USA;</p><p>(2) Melissa Dutz, Toyota Technological Institute at Chicago, IL, USA.</p><h2>5.2 Exploiting an Unknown Strategy from a Known Set of Strategies</h2><p>Another natural extension is to consider the scenario where we know the opponent uses some strategy from a known set of biased strategies B, but we don’t know which one. Again, we assume strategies in B are deterministic when parameterized with one of t possible deterministic tie-breaking mechanisms.</p><p>\\\n<strong>Predicting the Opponent’s Actions</strong></p><p>\\\nThe challenge, again, is to learn best responses. Generally, any time we can use the same algorithm to learn best responses given any strategy in B, this extension is trivial. For example if all strategies in B have the natural property discussed above (in 5.1) that after we play an action “enough” times, the opponent will eventually play a best response to it, we can use the same algorithm from 5.1 to learn best responses (using the maximum value required by any strategy as “enough”).</p><p>\\\n<em>If all strategies in B have property that the opponent plays a best response to an action if it is played “enough” times in a row, and we know the maximum upper bound on “enough”, we can learn best responses as described in 5.1.</em></p><p>\\\nIf it is not possible to use the same algorithm to learn best responses given any strategy in B, it might instead be possible to first distinguish between strategies which need different best-response algorithms, and then learn best responses. As a very simple example, if we know the opponent uses one of the Tie-Stay variant or the Tie-Shift variant of the WinStay, Lose-Shift strategy, we cannot use the strategy mentioned above because the Tie-Stay variant does not have the property in question. However, we can distinguish between the two strategies by checking whether the opponent “stays” after we play the same action as it (since a permissible game is symmetric, this must be a tie. We can check this within n rounds by playing the same action a until either the opponent switches to playing a, or stays on some other action b. If the opponent stays on b, we can then play b to check their tie behavior). Then, knowing our opponent’s strategy, we can use the corresponding algorithm from Section 4.3 to learn best responses (and in this case, to predict efficiently as well).</p><p>\\\nNote, however, that it is not always possible to distinguish between deterministic strategies. As a simple example, consider playing a 3-action game against either the Myopic Best Responder, who plays a best response to our last action, or another opponent, call them Myopic Worst Responder, who plays a worst response to our last action. No matter how we play, the Myopic Best Responder with respect to rock-paper-scissors behaves identically to the Myopic Worst Responder with respect to a reverse version of rock-paper-scissors where the wins and losses are switched. Since both games are possible, we cannot distinguish whether the opponent is playing Myopic Best Response or Myopic Worst Response. Moreover, best responses with respect to one scenario are worst responses with respect to the other. Either of these opponents, if known, would be easy to exploit. However, in this case we cannot guarantee an average payoff greater than zero: if we play a best responses with respect to either opponent in a given round, it is a loss with respect to the other so our expected payoff for that round is 0.</p><p>\\\n<em>There exist collections of pairs of game matrices and strategies such that it is not possible to guarantee a positive average payoff, even if we could exploit any of the individual strategies if known to win nearly every round.</em></p>","contentLength":3709,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Video Friday: Hottest on the Ice","url":"https://spectrum.ieee.org/video-friday-hottest-on-the-ice","date":1737738004,"author":"Evan Ackerman","guid":81,"unread":true,"content":"<p>Your weekly selection of awesome robot videos</p>","contentLength":45,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTg0NDI1Ni9vcmlnaW4uZ2lmIiwiZXhwaXJlc19hdCI6MTc5MTY0NzQ3NH0.MbdrAvpEyrn6vdwYXCgvooEg29fWn0v8EDZIS5Ve1Xk/image.gif?width=600","enclosureMime":"","commentsUrl":null},{"title":"Techniques to Beat the Tie-Stay Variant of Win-Stay, Lose-Shift","url":"https://hackernoon.com/techniques-to-beat-the-tie-stay-variant-of-win-stay-lose-shift?source=rss","date":1737738002,"author":"Algorithmic Bias","guid":270,"unread":true,"content":"<p>(1) Avrim Blum, Toyota Technological Institute at Chicago, IL, USA;</p><p>(2) Melissa Dutz, Toyota Technological Institute at Chicago, IL, USA.</p><h2>A.1 Win-Stay Lose-Shift Variant: Tie-Stay</h2><p>\\\n. Recall that the Tie-Stay variant of the Win-Stay Lose-Shift opponent plays the same action immediately following a win or a tie, and switches to the next action in its action ordering immediately following a loss. Because each action is beaten by at least one other action, the opponent must switch after one of the actions we play in response to its current action in phase 1 (since we play each action in succession). If the opponent shifts to play a new action in round r, we won round r − 1, so the best response we record is correct. Since the opponent always shifts to the next action in its action ordering, over n shifts, they will shift through every action before finally shifting back to the first action in its action ordering. Through this process we therefore record a best response to every action, and we record the correct action ordering in step 1. We play at most n actions in response to each action the opponent plays to make it shift, and one of them must beat the opponent’s action, so we incur no more than n(n − 1) losses or ties in this phase.</p><p>\\\nAt the end of the above, the opponent will have shifted back to the first action of their action ordering. However, we don’t generally know in advance when this shift will occur, so the action we played (some a) may or may not have been a best response to it and we therefore can’t be sure whether the opponent will stay or shift. By playing a repeatedly, the opponent will eventually play some action twice; this will happen within n rounds since each action is beaten by at least one other action and ties with itself. However, while the opponent is shifting we must be winning, so we only incur 2 losses or ties here, when the opponent finally plays some action b twice in a row.</p><p>\\\nSince we finished round 2 with the opponent tying or winning, they will repeat their action (b) again in the next round; we win that round by playing the recorded best response to b (which we showed was correct) in phase 3.</p><p>\\\nAt the start of phase 4, we predict correctly because we won the previous round and know the opponent will shift to the next action in its order (which we showed we recorded correctly). We showed earlier that we recorded correct best responses, so we win by playing the recorded best response to the predicted action. The same conditions hold for every remaining round, so we win all remaining rounds.</p>","contentLength":2572,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Sony To End Blu-ray Media Production After 18 Years","url":"https://hardware.slashdot.org/story/25/01/24/1649223/sony-to-end-blu-ray-media-production-after-18-years?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737737340,"author":"msmash","guid":232,"unread":true,"content":"Sony will cease production of recordable Blu-ray discs at its last factory in February, ending an 18-year manufacturing run amid declining demand for physical media. The Japanese electronics giant will also halt production of MiniDiscs and MiniDV cassettes. The company had already stopped making consumer recordable Blu-ray and optical disks in mid-2024, maintaining production only for business clients.","contentLength":405,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"NVIDIA GeForce RTX 5090 Linux GPU Compute Performance Benchmarks","url":"https://www.phoronix.com/review/nvidia-geforce-rtx5090-linux","date":1737736577,"author":"Michael Larabel","guid":658,"unread":true,"content":"<article>While there have been a lot of GeForce RTX 5090 Windows gaming benchmarks since the review embargo lift yesterday, for those more fascinated by this high-end Blackwell desktop graphics card for its GPU compute potential on Linux, this article is for you. Up today are my very initial GPU compute benchmarks for the GeForce RTX 5090 Founders Edition on Linux with NVIDIA graphics card comparisons across the prior RTX 20, RTX, 30, and RTX 40 series too.</article>","contentLength":452,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Several Linux DRM Drivers Orphaned Due To Developer Health","url":"https://www.phoronix.com/news/Several-Linux-DRM-Orphaned","date":1737731173,"author":"Michael Larabel","guid":657,"unread":true,"content":"<article>Several of the upstream Linux Direct Rendering Manager (DRM) drivers have become orphaned due to the unfortunately declining health of their lone driver maintainer...</article>","contentLength":166,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.14 Delivering Better Read Performance For CIFS","url":"https://www.phoronix.com/news/Linux-6.14-Faster-CIFS-Reads","date":1737727066,"author":"Michael Larabel","guid":656,"unread":true,"content":"<article>The Common Internet File System (CIFS) as an implementation of the SMB protocol for commonly sharing files with Windows systems will enjoy better read performance with the Linux 6.14 kernel...</article>","contentLength":192,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"GNOME Showtime Video Player Won't Be Ready Until GNOME 49","url":"https://www.phoronix.com/news/GNOME-49-Showtime-Plan","date":1737720301,"author":"Michael Larabel","guid":655,"unread":true,"content":"<article>While there are many exciting new features in the GNOME 48 Alpha as well as a new app with Decibels becoming the official audio player, there isn't a new official video player for this desktop release...</article>","contentLength":203,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"XFS Code For Linux 6.14 Improves Realtime Device Support","url":"https://www.phoronix.com/news/Linux-6.14-XFS","date":1737719465,"author":"Michael Larabel","guid":654,"unread":true,"content":"<article>In addition to the Bcachefs features and new Btrfs code for Linux 6.14, the XFS file-system changes were merged on Thursday for this next version of the Linux kernel...</article>","contentLength":168,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"NVIDIA Maxwell, Pascal & Volta Support Looks Like It Will Soon Move To A Legacy Driver","url":"https://www.phoronix.com/news/Maxwe--Pascal-Volta-Legacy-Near","date":1737719084,"author":"Michael Larabel","guid":653,"unread":true,"content":"<article>Now that NVIDIA is rolling out the \"Blackwell\" GPU driver support, it looks like the NVIDIA Maxwell, Pascal, and Volta generations will soon be moving to a legacy driver branch...</article>","contentLength":179,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Fedora Preparing For A Data Center Move For More Power & Space For Possible RISC-V","url":"https://www.phoronix.com/news/Fedora-2024-Data-Center-Move","date":1737717537,"author":"Michael Larabel","guid":652,"unread":true,"content":"<article>It's not only AI start-ups running into space and power capacity bottlenecks but the Fedora Project has been pushing the limits of its main data center and is preparing for a move to a new data center to allow for more physical space and power capacity. In turn one item mentioned is allowing space for possible RISC-V build systems for Fedora...</article>","contentLength":346,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"GNOME 48 Alpha Released With Many New Features","url":"https://www.phoronix.com/news/GNOME-48-Alpha","date":1737716728,"author":"Michael Larabel","guid":651,"unread":true,"content":"<article>The GNOME 48 Alpha release was issued this morning for helping to test this updated desktop environment debuting as stable in March...</article>","contentLength":134,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Oracle Linux 10 Developer Preview Released With UEK-Next Based On Linux 6.12","url":"https://www.phoronix.com/news/Oracle-Linux-10-DP","date":1737682399,"author":"Michael Larabel","guid":650,"unread":true,"content":"<article>Building off last month's release of Red Hat Enterprise Linux 10.0 beta, Oracle today published the Oracle Linux 10 Developer Preview for a first glimpse at this next RHEL10-derived operating system...</article>","contentLength":201,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Backdoor infecting VPNs used “magic packets” for stealth and security","url":"https://arstechnica.com/security/2025/01/backdoor-infecting-vpns-used-magic-packets-for-stealth-and-security/","date":1737675749,"author":"Dan Goodin","guid":321,"unread":true,"content":"<p>When threat actors use backdoor malware to gain access to a network, they want to make sure all their hard work can’t be leveraged by competing groups or detected by defenders. One countermeasure is to equip the backdoor with a passive agent that remains dormant until it receives what’s known in the business as a “magic packet.” On Thursday, researchers revealed that a never-before-seen backdoor that quietly took hold of dozens of enterprise VPNs running Juniper Network’s Junos OS has been doing just that.</p><p>J-Magic, the tracking name for the backdoor, goes one step further to prevent unauthorized access. After receiving a magic packet hidden in the normal flow of TCP traffic, it relays a challenge to the device that sent it. The challenge comes in the form of a string of text that’s encrypted using the public portion of an RSA key. The initiating party must then respond with the corresponding plaintext, proving it has access to the secret key.</p><p>The lightweight backdoor is also notable because it resided only in memory, a trait that makes detection harder for defenders. The combination prompted researchers at Lumin Technology’s Black Lotus Lab to sit up and take notice.</p>","contentLength":1197,"flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2022/02/backdoor2.jpeg","enclosureMime":"","commentsUrl":null},{"title":"x86 32-bit Operating Systems Aren't Dead Yet: New Linux Patches Improve 32-bit PAE","url":"https://www.phoronix.com/news/Linux-2025-Improving-32-bit-PAE","date":1737663522,"author":"Michael Larabel","guid":649,"unread":true,"content":"<article>The Linux x86 32-bit PAE kernel support for Physical Address Extensions allows addressing more than 4GB of memory for those still running 32-bit processors or otherwise opting to still run a 32-bit OS. While the Linux x86 32-bit specific code rarely sees new improvements in the past number of years, a set of patches were posted today in looking to enhance the x86 32-bit PAE mode...</article>","contentLength":384,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Driverless Buses Provide New Routes for Robotaxi Tech","url":"https://spectrum.ieee.org/driverless-bus","date":1737658803,"author":"Willie D. Jones","guid":80,"unread":true,"content":"<p>Level 3 autonomy is already making inroads in public transportation</p>","contentLength":67,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTc5OTI2NS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc0NDkwNjEyOX0.Nk1ya3A7Nc9yD9vqbNQbXifmv6SlnWBXLWR0Ijl-N2M/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"KDE Plasma 6.3 Beta 2 Improves systemd-homed Support","url":"https://www.phoronix.com/news/KDE-Plasma-6.3-Beta-2","date":1737654540,"author":"Michael Larabel","guid":648,"unread":true,"content":"<article>Earlier this month was the release of the KDE Plasma 6.3 beta while today a second beta was issued...</article>","contentLength":101,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.14 Power Management: \"Dominated By AMD P-State Driver Changes\"","url":"https://www.phoronix.com/news/Linux-6.14-Power-Management","date":1737653472,"author":"Michael Larabel","guid":647,"unread":true,"content":"<article>All of the power management feature updates for the in-development Linux 6.14 kernel were sent out earlier this week and subsequently merged. As we've been seeing with recent Linux kernel releases, AMD continues investing a lot into their AMD P-State CPU frequency scaling driver for better power efficiency on Ryzen processors and since the prior kernel also now being used with the new 5th Gen AMD EPYC server processors too...</article>","contentLength":429,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Redis 8.0-M3 Brings Async I/O Threading, 12x Speed-Up With New AVX2 Code Path","url":"https://www.phoronix.com/news/Redis-8.0-M3-Async-IO-Threads","date":1737648337,"author":"Michael Larabel","guid":646,"unread":true,"content":"<article>For those making use of the source-available Redis in-memory key-value database, the upcoming Redis 8.0 will offer better performance on today's high core count systems and servers...</article>","contentLength":183,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Debian 15 Is Codenamed \"Duke\"","url":"https://www.phoronix.com/news/Debian-15-Duke","date":1737644680,"author":"Michael Larabel","guid":645,"unread":true,"content":"<article>With Debian 13 freeze dates announced and that Debian 13.0 \"Trixie\" release working its way toward release likely around August, it's then to be followed by beginning development on Debian 14 codenamed as \"Forky\". Yesterday when announcing the Debian Trixie freeze dates, the Debian 15 codename was also announced...</article>","contentLength":316,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Quiz: What Happened to Previous Top Tech Predictions?","url":"https://spectrum.ieee.org/top-tech-quiz","date":1737644404,"author":"IEEE Spectrum","guid":79,"unread":true,"content":"<p>Did Intel’s great leap end in a splat? Did solar geoengineering take off?</p>","contentLength":75,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTgwNDA1NC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTc2ODU4MzY1MX0.omzUnoRGDpvvLqyEPazyjqNHRqCYZUdZY7qm2lNdbfY/image.png?width=600","enclosureMime":"","commentsUrl":null},{"title":"NVIDIA GeForce RTX 5090 Linux Benchmarks: Stay Tuned","url":"https://www.phoronix.com/news/GeForce-RTX-5090-Linux-Driver","date":1737640800,"author":"Michael Larabel","guid":644,"unread":true,"content":"<article>Following the unboxing embargo earlier this week for the NVIDIA GeForce RTX 5090, today the review embargo lifts for the GeForce RTX 5090 Founders Edition...</article>","contentLength":157,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Faster AES-GCM & AES-XTS Crypto Performance For AMD CPUs With Linux 6.14","url":"https://www.phoronix.com/news/Linux-6.14-Crypto","date":1737639425,"author":"Michael Larabel","guid":643,"unread":true,"content":"<article>The crypto subsystem updates were sent out today for the Linux 6.14 kernel. Notable this time are new x86_64-specific optimizations for the AES-GCM and AES-XTS algorithms. Benefiting the most from these new x86_64 optimizations are recent AMD processors...</article>","contentLength":256,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Worry About Sentient AI—Not for the Reasons You Think","url":"https://spectrum.ieee.org/sentient-ai","date":1737637202,"author":"Eliza Strickland","guid":78,"unread":true,"content":"<p>Philosopher Jonathan Birch is just as concerned about humans harming AI</p>","contentLength":71,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTY0Njg5Ni9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc5MDE4NTI4OH0.U0UbSb2YMubJhc6HxDU64o60rWzrpZkXW8BjPOEAxa0/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"Data breach hitting PowerSchool looks very, very bad","url":"https://arstechnica.com/security/2025/01/students-parents-and-teachers-still-smarting-from-breach-exposing-their-info/","date":1737635457,"author":"Dan Goodin","guid":320,"unread":true,"content":"<p>Parents, students, teachers, and administrators throughout North America are smarting from what could be the biggest data breach of 2025: an intrusion into the network of a cloud-based service storing detailed data of millions of pupils and school personnel.</p><p>The hack, which came to light earlier this month, hit PowerSchool, a Folsom, California, firm that provides cloud-based software to some 16,000 K–12 schools worldwide. The schools serve 60 million students and employ an unknown number of teachers. Besides providing software for administration, grades, and other functions, PowerSchool stores personal data for students and teachers, with much of that data including Social Security numbers, medical information, and home addresses.</p><p>On January 7, PowerSchool <a href=\"https://www.powerschool.com/security/sis-incident/\">revealed</a> that it had experienced a network intrusion two weeks earlier that resulted in the “unauthorized exportation of personal information” customers stored in PowerSchool’s Student Information System (SIS) through PowerSource, a customer support portal. Information stolen included individuals’ names, contact information, dates of birth, medical alert information, Social Security Numbers, and unspecified “other related information.”</p>","contentLength":1219,"flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2021/04/data-leak-1000x648.jpeg","enclosureMime":"","commentsUrl":null},{"title":"Researchers say new attack could take down the European power grid","url":"https://arstechnica.com/security/2025/01/could-hackers-use-new-attack-to-take-down-european-power-grid/","date":1737633642,"author":"Dan Goodin","guid":319,"unread":true,"content":"<p>Late last month, researchers revealed a finding that’s likely to shock some people and confirm the low expectations of others: Renewable energy facilities throughout Central Europe use unencrypted radio signals to receive commands to feed or ditch power into or from the grid that serves some 450 million people throughout the continent.</p><p>Fabian Bräunlein and Luca Melette stumbled on their discovery largely by accident while working on what they thought would be a much different sort of hacking project. After observing a radio receiver on the streetlight poles throughout Berlin, they got to wondering: Would it be possible for someone with a central transmitter to control them en masse, and if so, could they create a city-wide light installation along the lines of <a href=\"http://blinkenlights.net/\">Project Blinkenlights</a>?</p><img width=\"1500\" height=\"465\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/01/project-blinkenlights-throughout-the-years.jpg\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/01/project-blinkenlights-throughout-the-years.jpg 1500w, https://cdn.arstechnica.net/wp-content/uploads/2025/01/project-blinkenlights-throughout-the-years-640x198.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/01/project-blinkenlights-throughout-the-years-1024x317.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/01/project-blinkenlights-throughout-the-years-768x238.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/01/project-blinkenlights-throughout-the-years-980x304.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/01/project-blinkenlights-throughout-the-years-1440x446.jpg 1440w\" sizes=\"auto, (max-width: 1500px) 100vw, 1500px\">\n      Images showing Project Blinkenlights throughout the years.\n        Credit:\n          Positive Security\n      \n<p>The first Project Blinkenlights iteration occurred in 2001 in Berlin, when the lights inside a large building were synchronized to turn on and off to give the appearance of a giant, low-resolution monochrome computer screen.</p>","contentLength":1136,"flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2025/01/euripean-ripple-attack-flipper-zero-1152x648.jpg","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.14 Adds Support For The Microsoft Copilot Key Found On New Laptops","url":"https://www.phoronix.com/news/Linux-6.14-Input","date":1737633365,"author":"Michael Larabel","guid":642,"unread":true,"content":"<article>Newer laptops pre-loaded with Microsoft Windows have begun adding a \"Copilot\" key for launching Microsoft's Copilot AI assistant or other \"chatbot\" software. With the upcoming Linux 6.14 kernel, that key will be mapped out correctly so that user-space software can determine the behavior for handling that key's action on the Linux desktop...</article>","contentLength":342,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Red Hat Preparing Tuned 2.25 Daemon For Linux Monitoring & Adaptive Performance Tuning","url":"https://www.phoronix.com/news/Red-Hat-Tuned-2.25-RC","date":1737633117,"author":"Michael Larabel","guid":641,"unread":true,"content":"<article>The Tuned software from Red Hat is a daemon for Linux monitoring and adaptive performance tuning as an alternative to the likes of power-profiles-daemon. Tuned ships with various profiles and allows different features for tuning the Linux system performance for HPC compute, enterprise storage, balanced battery for laptops, and dozens of other scenarios. Red Hat this week debuted the first release candidate of the upcoming Tuned 2.25...</article>","contentLength":439,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Minor Benefit Observed For Caching Symlink Lengths Within inodes On Linux 6.14","url":"https://www.phoronix.com/news/Linux-6.14-Cache-Symlink-Length","date":1737632589,"author":"Michael Larabel","guid":640,"unread":true,"content":"<article>Along with other VFS pull requests for Linux 6.14 to introduce STATX_DIO_READ_ALIGN, adding a new mountinfo program, VirtualBox guest support for ARM64 VMs, and faster /proc/kcore reading, another VFS pull for this new kernel brings a minor performance optimization...</article>","contentLength":268,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"PanVK Driver Now Exposing Vulkan 1.1 For Arm Mali Valhall v10 GPUs","url":"https://www.phoronix.com/news/PanVK-Valhall-Vulkan-1.1","date":1737631089,"author":"Michael Larabel","guid":639,"unread":true,"content":"<article>With the newest code merged for Mesa 25.0, the Panfrost PanVK driver is exposing Vulkan 1.1 support on Arm Valhall \"v10\" graphics processors...</article>","contentLength":143,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}]}