{"id":"368La1qZAv72idE55Whuffkk2TBtHuSndX6iNywdUkLBDxxx55cLvowsw5Rj5VbHUHjCYUBR5tHfX6BAYFQZS3af","title":"top scoring links : europe","displayTitle":"News - Reddit - Europe","url":"https://www.reddit.com/r/europe/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/europe/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Serbian protesters today blocked key bridge, roads to mark 100 days since deadly canopy collapse and fight against the populist government of Aleksandar Vucic","url":"https://www.reddit.com/r/europe/comments/1ilgm78/serbian_protesters_today_blocked_key_bridge_roads/","date":1739113438,"author":"/u/die_mannequin","guid":581,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Comparison of prices for goods. Lithuania and France (minimum salary in Lithuania 777 netto)","url":"https://www.reddit.com/r/europe/comments/1ilf930/comparison_of_prices_for_goods_lithuania_and/","date":1739109458,"author":"/u/taktak_taktak","guid":580,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Baltic nations disconnect from Russian power grid to avoid power being used 'as a weapon'","url":"https://www.abc.net.au/news/2025-02-09/baltic-nations-disconnect-from-russia-power-grid/104915528","date":1739105151,"author":"/u/PoiHolloi2020","guid":585,"unread":true,"content":"<p>Three Baltic nations have disconnected their electricity systems from Russia's power grid as part of a plan designed to further integrate with the European Union and boost security.</p><p>Estonia, Latvia and Lithuania disconnected from the network in a move to block Russia's ability to geopolitically \"blackmail\" them via the electricity system.</p><p>If all goes as planned, the power system will merge with the European energy networks on Sunday afternoon local time through several links with Finland, Sweden and Poland.</p><p>All three countries are former Soviet republics that are now in the European Union and NATO.</p><p>\"We have removed any theoretical possibility of Russia using energy [grid] control as a weapon,\" Lithuanian Energy Minister Zygimantas Vaiciunas said.</p><p>The Baltic countries spent nearly 1.6 billion euros ($2.6 billion) since 2018 to upgrade grids to prepare for the switch.</p><p>The EU's foreign policy chief Kaja Kallas said this is a \"victory for freedom\".</p><p>\"Russia can no longer use energy as a tool of blackmail,\" she added.</p><h2 data-component=\"Heading\">'No European country should be dependent on Russia'</h2><p>The European Commissioner for Energy, Dan Jorgensen, said: \"This is indeed a historic day.\"</p><p>\"I like the light better when there's no Russian electrons involved,\" he told reporters in Estonian capital Tallinn.</p><div data-component=\"EmphasisedText\"><p>\"It's important to underline that this is about security … no European country should be dependent on Russia for anything,\" he added.</p></div><p>The operators from all three nations successfully undertook frequency management trials before disconnecting.</p><p>\"The system is stable, the process is happening smoothly, no one is noticing that something changed,\" Latvia's Energy Minister Kaspars Melnis said.</p><p>Lithuanian Energy Minister Zygimantas Vaiciunas said there are contingency plans whereby some heavy energy users, such as factories, could be temporarily disconnected from the grid in the event of power shortages.</p><p>\"We've reached the goal we strived for, for so long,\" Mr Vaiciunas told a press conference.</p><figure data-print=\"inline-media\" data-component=\"Figure\" data-uri=\"coremedia://imageproxy/104915614\"><figcaption><p data-component=\"Typography\">Latvian Energy Minister Kaspars Melnis was on the ground for the power grid disconnection.</p></figcaption></figure><p>In Latvia, immediately after disconnecting, workers used a crane to reach the high-voltage wires in Vilaka, 100 metres from the Russian border, and cut them.&nbsp;</p><p>Staff handed out chopped wire as keepsakes to cheering observers.</p><p>\"We will never use it again. We are moving on,\" Latvia's Energy Minister Kaspars Melnis told Reuters in Vilaka.</p><h2 data-component=\"Heading\">Russia cooperates with cut off</h2><p>Authorities were on guard on Saturday for any potential sabotage or other risks linked to the grid switch from Russia.</p><figure data-print=\"inline-media\" data-component=\"Figure\" data-uri=\"coremedia://imageproxy/104915604\"><figcaption><p data-component=\"Typography\">The decision to swith to the European power grid has been long in the making.</p></figcaption></figure><p>Latvian grid operator AST said no disruptions had been recorded so far, showing no provocation.</p><p>\"They disconnected power to the same line also from their side, with the biggest surprise today being that there are no surprises,\" AST CEO Rolands Irklis said.</p><p>Lithuania's state-run grid operator Litgrid also said Russia fully cooperated during the disconnection process.</p><p>Litgrid chief Rokas Masiulis pointed out that \"when you are part of the same (electricity) system, you cannot harm the other without harming yourself\".</p><p>For Russia, the decoupling means its Kaliningrad exclave, located between Lithuania, Poland and the Baltic Sea, is cut off from Russia's main grid, leaving it to maintain its power system alone.</p><p>Kremlin spokesman Dmitry Peskov dismissed all concerns.</p><figure data-print=\"inline-media\" data-component=\"Figure\" data-uri=\"coremedia://imageproxy/104915598\"><figcaption><p data-component=\"Typography\">Kremlin spokesman Dmitry Peskov lends an ear to Vladimir Putin.<cite>()</cite></p></figcaption></figure><p>Asked about the cut-off last week, he said: \"We have taken all measures to ensure the uninterrupted reliable operation of our unified energy system.\"</p><h2 data-component=\"Heading\">Power grid was the last link to Soviet overlord</h2><p>Plans for the Baltics to decouple from the grid of their former Soviet imperial overlord has been debated for decades and was finally signed in 2018.</p><p>The grid was the final remaining link to Russia for the three countries, which re-emerged as independent nations in the early 1990s at the fall of the Soviet Union.</p><p>All three joined the European Union and NATO in 2004.</p><figure data-print=\"inline-media\" data-component=\"Figure\" data-uri=\"coremedia://imageproxy/104915646\"><figcaption><p data-component=\"Typography\">The deal to disconnect from Russia's power grid was signed by Baltic leaders in 2018.<cite>()</cite></p></figcaption></figure><p>The three staunch supporters of Kyiv stopped purchases of power from Russia following Moscow's invasion of Ukraine in 2022, but have relied on the Russian grid to control frequencies and stabilise networks to avoid outages.</p><p>\"By ending the energy dependence of the Baltic states on Russia, we are leaving the aggressor without the option of using energy as a weapon against us,\" Estonian Foreign Minister Margus Tsahkna said.</p><p>Despite there being no provocation so far, nations in the area are increasing security on their power grids.</p><p>In Estonia, police and volunteer defence corps will man critical electrical infrastructure until next weekend because of the perceived sabotage risk.</p><p>Lithuania was also guarding infrastructure, launching its armed forces in a region bordering Poland to secure the energy link.</p><figure data-print=\"inline-media\" data-component=\"Figure\" data-uri=\"coremedia://imageproxy/104915638\"><figcaption><p data-component=\"Typography\">Security around the power grids has been increased.</p></figcaption></figure><p>An army truck was seen at the Rezekne power substation near the Latvia-Russia border, and officers with guns were patrolling the vicinity.</p><h2 data-component=\"Heading\">Region on high alert to shadow warfare</h2><p>The Baltic Sea region is on high alert after power cable, telecom links and gas pipeline outages.</p><p>All were believed to have been caused by ships dragging anchors along the seabed following Russia's invasion of Ukraine.</p><p>Russia has denied any involvement.</p><p>The NATO alliance fears that Russia is targeting cables as part of a wider campaign of so-called \"hybrid warfare\" to destabilise European nations helping Ukraine.</p><p>Without specifically blaming Russia, NATO Secretary-General Mark Rutte said \"hybrid means sabotage\".</p><figure data-print=\"inline-media\" data-component=\"Figure\" data-uri=\"coremedia://imageproxy/104915628\"><figcaption><p data-component=\"Typography\">NATO Secretary General Mark Rutte has concerns over hybrid warfare in the region.</p></figcaption></figure><p>\"Hybrid means cyber-attacks. Hybrid means sometimes even assassination attacks, attempts, and in this case, it means hitting on our critical undersea infrastructure,\" he added.</p><p>German Chancellor Olaf Scholz and Danish Prime Minister Mette Frederiksen have said that the <a href=\"https://www.abc.net.au/news/2025-01-28/russia-sabotage-attacks-feared-on-baltic-sea/104869430\" data-component=\"Link\" data-uri=\"coremedia://article/104869430\">slate of incidents in the Baltic Sea</a> must be assumed to be part of a hybrid strategy from Russia that is threatening European countries.</p>","contentLength":6135,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1ildy7w/baltic_nations_disconnect_from_russian_power_grid/"},{"title":"Thousands cheer Denmark's Fourth Time in a Row Handball World Champions!","url":"https://www.reddit.com/r/europe/comments/1ilbc9q/thousands_cheer_denmarks_fourth_time_in_a_row/","date":1739094389,"author":"/u/Drahy","guid":582,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The (so)self-proclaimed 'EU Patriots' took a selfie at the 'Patriots' summit in Madrid 8 Feb. (from sx Orban, Wilders, Le Pen and Salvini)","url":"https://www.reddit.com/r/europe/comments/1il1wle/the_soselfproclaimed_eu_patriots_took_a_selfie_at/","date":1739060338,"author":"/u/hashing_nonces","guid":583,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Germany's Left Party wants to halve billionaires' wealth","url":"https://www.dw.com/en/germanys-left-party-wants-to-halve-billionaires-wealth/a-71550347","date":1739055206,"author":"/u/Several_Print4633","guid":587,"unread":true,"content":"<p>Two weeks before <a href=\"https://www.dw.com/en/german-election-2025/t-70794502\">national elections in Germany</a>, the struggling <a href=\"https://www.dw.com/en/left-party/t-17439669\">Left Party</a> (die Linke) has laid out a new tax plan targeting the superrich. The declared&nbsp;goal is to cut the wealth of billionaires in half within a decade.</p><p>\"We believe there should not be any billionaires,\" the paper from party co-chair Jan van Aken states, before going on to outline a five-point plan designed to make this position a reality.&nbsp;</p><h2>What are the Left's new tax plans?&nbsp;</h2><p>The party proposes reintroducing Germany's \"wealth tax\" which was abolished after the Constitutional Court deemed it unconstitutional in 1995.&nbsp;</p><p>This tax was not focusing on income, but on people's accrued wealth.&nbsp;</p><p>The party proposes a sliding scale, 1% for fortunes in excess of €1 million ($1.03 million), 5% for those higher than €50 million, and 12% for those higher than €1 billion.</p><p>Next, the party calls for a one-off fee for the richest 0.7% of citizens, starting at 10% for those with more than €2 million, and rising as high as 30% for larger sums.&nbsp;</p><p>The party also aims for a higher&nbsp;inheritance tax for larger estates, and higher rates of income tax for top earners. This would include a&nbsp;60% income tax on salaries above €250,000 and 75% for those over €1 million.&nbsp;</p><p>Finally, capital gains taxes should no longer be a flat 25% fee, but rather should operate on a sliding scale like income tax depending on the extent of the gains on assets.</p><h2>Party co-leader van Aken draws parallels to new 'super-rich' US government</h2><p>When launching the new proposal, van Aken alluded to <a href=\"https://www.dw.com/en/donald-trump/t-19434433\">Donald Trump</a>'s new administration in the US.&nbsp;</p><p>\"The new government is made up of the super-rich and the right, who are doing everything to secure their fortune and their power,\" he said.</p><p>In Germany, too, van Aken argued, the very wealthy used their fortunes to secure unreasonable political influence.&nbsp;</p><p>The Left Party&nbsp;had been struggling in the polls in recent years amid the rise of the far-right <a href=\"https://www.dw.com/en/alternative-for-germany-afd/t-17455253\">AfD</a>. While the Left Party draws political roots from the former socialist regime in the now-defunct GDR, this region is now a stronghold of the AfD.&nbsp;</p><div><h2 aria-label=\"Embedded video — Left Party candidate calls German migration debate awful \">Left Party candidate calls German migration debate awful </h2></div><p><em>Edited by: Darko Janjevic</em></p>","contentLength":2161,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1il02pv/germanys_left_party_wants_to_halve_billionaires/"},{"title":"Anti-Nazi protests : Berlin 16/12/1931","url":"https://www.reddit.com/r/europe/comments/1ikxc1u/antinazi_protests_berlin_16121931/","date":1739047904,"author":"/u/anon58588","guid":588,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Robert Fico was allegedly heard saying he doesn't know how to continue","url":"https://dennikn.sk/4452581/ficova-streda-ked-neprisiel-na-vladu-sa-skoncila-emotivnou-vecerou-kde-odhalil-svoje-obavy-z-buducnosti/","date":1739039013,"author":"/u/g46152","guid":584,"unread":true,"content":"<p>Premiér Robert Fico (Smer) má za sebou stredu, ktorá sa vymyká z&nbsp;bežnej politickej prevádzky. Prekvapil už dopoludnia, keď sa neukázal na rokovaní vlády. Jeho ministri ani tlačový odbor doteraz nevysvetlili prečo. Niektorí rovno priznávajú, že ani nevedia, kde v&nbsp;čase rokovania premiér bol.</p><p>Deň predsedu vlády pokračoval popoludní, keď si Fico na diaľku vymieňal odkazy s&nbsp;českým premiérom Petrom Fialom, a&nbsp;nepriamo sa obviňovali z&nbsp;klamstva o&nbsp;tom, či spolu hovorili v&nbsp;pondelok počas samitu EÚ v&nbsp;Bruseli.</p><p>Napriek výraznému ochladeniu vzťahov medzi českou a&nbsp;slovenskou vládou nie je bežné, aby lídri dvoch spojeneckých krajín takýmto spôsobom vzájomne komentovali svoje výroky cez statusy na sociálnych sieťach.</p><p>Netradične vyzeral aj premiérov večer. O&nbsp;piatej sa na úrade vlády konala večera s&nbsp;</p>","contentLength":855,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1iktuxf/robert_fico_was_allegedly_heard_saying_he_doesnt/"},{"title":"Canada seeks stronger EU trade ties in face of Trump tariffs","url":"https://www.reuters.com/world/americas/canada-seeks-stronger-eu-trade-ties-both-regions-threatened-by-trump-tariffs-2025-02-08/","date":1739038132,"author":"/u/die_mannequin","guid":579,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1iktidm/canada_seeks_stronger_eu_trade_ties_in_face_of/"},{"title":"Munich today! Demonstration for Democracy.","url":"https://www.reddit.com/r/europe/comments/1iktd9o/munich_today_demonstration_for_democracy/","date":1739037783,"author":"/u/TheAwfulCrow66","guid":586,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["news","reddit"]}