{"id":"368La1qZAv72idE55Whuffkk2TBtHuSndX6iNywdUkLBDxxx55cLvowsw5Rj5VbHUHjCYUBR5tHfX6BAYFQZS3af","title":"top scoring links : europe","displayTitle":"News - Reddit - Europe","url":"https://www.reddit.com/r/europe/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/europe/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Zelenskyy: \"Let's be honest now we can't rule out the possibility that America might say \"no\" to Europe on issues that threaten it. (...) We must build the armed forces of Europe so that Europe's future depends only on Europeans.\"","url":"https://v.redd.it/o3a52qli8aje1","date":1739616339,"author":"/u/UNITED24Media","guid":653,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1ipyuzu/zelenskyy_lets_be_honest_now_we_cant_rule_out_the/"},{"title":"JD Vance accused of spreading shameless misinformation about buffer zones","url":"https://greens.scot/news/jd-vance-accused-of-spreading-shameless-misinformation-about-buffer-zones","date":1739609395,"author":"/u/Wagamaga","guid":645,"unread":true,"content":"<div>  Abortion rights are human rights.</div><p><strong>US Vice President JD Vance has been accused of spreading shocking and shameless misinformation about safe access zones in Scotland by Scottish Green MSP Gillian Mackay.</strong></p><p><a href=\"https://eur03.safelinks.protection.outlook.com/?url=https%3A%2F%2F9j9uh.r.a.d.sendibm1.com%2Fmk%2Fcl%2Ff%2Fsh%2F6rqJfgq8dINmODiDidpI54KihOP%2Fl1tSYc_K_nO5&amp;data=05%7C02%7CAndrew.Smith%40Parliament.scot%7C217031c2e7374be525e708dd4d16899c%7Cd603c99ccfdd4292926800db0d0cf081%7C0%7C0%7C638751481406043562%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=%2BostpWPJrv5jQZJbMWRkyO0TZFL6KinouhuQaqj1MfA%3D&amp;reserved=0\" rel=\"noopener noreferrer\" target=\"_blank\" title=\"Original URL: https://9j9uh.r.a.d.sendibm1.com/mk/cl/f/sh/6rqJfgq8dINmODiDidpI54KihOP/l1tSYc_K_nO5. Click or tap if you trust this link.\">In a speech this morning</a>, VP Vance claimed that people in Scotland were told that private prayer in their own homes would be against the law within a safe access zone and that people were encouraged to report anyone they thought guilty of “thought crime.” This has never been true.</p><p>Ms Mackay introduced the bill that secured 200 metre wide safe access zones, or buffer zones, around abortion service providers to stop the intimidating anti-choice protests that were taking place across Scotland. Private prayer at home has never been impacted by this Act.</p><blockquote><p>“This is shocking and shameless misinformation from VP Vance, who is either very badly informed about what my Act has done or he is knowingly misrepresenting it.&nbsp;</p><p>\"He is one of the most powerful people in the world but he is peddling total nonsense and dangerous scare mongering.</p><p>“Nobody should be intimidated or harassed when accessing healthcare, and I am proud that my Act has put a stop to the graphic banners and the protests that far too many people were being forced to pass in order to access healthcare.</p><p>“I was proud that our Parliament voted to back safe access zones so overwhelmingly, and that they stood against the cynical lies and misrepresentation of the kind that Mr Vance is promoting.\"</p></blockquote><blockquote><p>“The government that Mr Vance represents is a clear threat to reproductive rights. He has a shocking record on abortion and many other issues. He has supported calls to reduce access to healthcare and has even argued for a national ban on abortion rights across the US.</p><p>“Abortion rights are human rights and they are healthcare. Today and every day I will stand with the millions of people across the US who oppose the misogynistic and anti-choice agenda of Donald Trump and JD Vance.”</p></blockquote>","contentLength":1959,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1ipxcti/jd_vance_accused_of_spreading_shameless/"},{"title":"Revised UNITED-poster from earlier, added some countries I forgot and couple honorary additions.","url":"https://www.reddit.com/r/europe/comments/1ipx2gi/revised_unitedposter_from_earlier_added_some/","date":1739608064,"author":"/u/EEVERSTI","guid":649,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Finns protesting against Russification measures in 1899","url":"https://www.reddit.com/r/europe/comments/1iptmfu/finns_protesting_against_russification_measures/","date":1739593712,"author":"/u/hodgkinthepirate","guid":647,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"After a four day march Serbian students from Belgrade, Novi Sad and Nis are welcomed in the old capital of Kragujevac for celebration of Statehood day","url":"https://v.redd.it/q1w29w2is6je1","date":1739574765,"author":"/u/Landrayi","guid":646,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1ipnsor/after_a_four_day_march_serbian_students_from/"},{"title":"European unity is now more needed than ever. So I decided to do a new version of the classic United Nations poster.","url":"https://www.reddit.com/r/europe/comments/1ipmvdo/european_unity_is_now_more_needed_than_ever_so_i/","date":1739572170,"author":"/u/EEVERSTI","guid":650,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Zelensky refuses to sign document on transfer of 50% of Ukrainian mineral resources to the US - WP | УНН","url":"https://unn.ua/en/news/zelensky-refuses-to-sign-document-on-transfer-of-50percent-of-ukrainian-mineral-resources-to-the-us-wp","date":1739569791,"author":"/u/RGV_KJ","guid":648,"unread":true,"content":"<p>A delegation of the US Congress in Munich wanted President of Ukraine Volodymyr Zelenskyy to sign a document that would give the US rights to 50% of Ukraine's future mineral resources, but he refused. This was reported by The Washington Post journalist Josh Rogin in X,  reports.</p><blockquote><p>Several lawmakers here in Munich have told me that a US Congressional delegation handed Zelenskiy a paper they wanted him to sign giving the US rights to 50% of Ukraine's future mineral resources&nbsp;</p></blockquote><p>According to him, the Ukrainian leader politely refused to sign it.</p><p>Zelenskyy has previously said that he supports a strategic partnership with the United States in rare earths mining, which could be part of an agreement on economic support and security guarantees for Ukraine.</p><p>On February 11, Donald Trump <a href=\"https://unn.ua/news/tramp-ukraina-faktychno-pohodylas-nadaty-ssha-dostup-do-mineraliv-na-500-mlrd-dolariv-za-viiskovu-dopomohu\">said</a>that Ukraine had \"effectively\" agreed to give the United States access to $500 billion worth of rare earth minerals in return for Washington's military aid.</p>","contentLength":941,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1iplyz3/zelensky_refuses_to_sign_document_on_transfer_of/"},{"title":"Zelenskyy: Trump told me Putin wants to end the war. I told him Putin is a liar.","url":"https://www.politico.eu/article/ukraine-war-volodymyr-zelenskyy-donald-trump-putin-liar-peace/","date":1739561843,"author":"/u/die_mannequin","guid":652,"unread":true,"content":"<div><p>The U.S. and Ukraine are back-and-forthing on a deal to exploit Kyiv’s rare earths in return for Washington’s support.</p></div>","contentLength":122,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1ipixzp/zelenskyy_trump_told_me_putin_wants_to_end_the/"},{"title":"US Vice President Vance meets far-right AfD’s leader ahead of Germany snap elections","url":"https://www.firstpost.com/world/us-vice-president-vance-meets-far-right-afds-leader-ahead-of-snap-elections-13863450.html","date":1739561604,"author":"/u/Affectionate_Cat293","guid":644,"unread":true,"content":"<p>US Vice President JD Vance Friday (February 14) met with the leader of Alternative for Germany (AfD), Germany’s far-right party which previously saw backing from billionaire Elon Musk.</p><p>For his meeting with Alice Weidel, the AfD’s top candidate in February 23 elections, Vance went outside of the Munich Security Conference venue as the former was not invited to the conference, reported Associated Press, citing public broadcaster ZDF.</p><h2><strong>Elon Musk’s support for AfD</strong></h2><p>Elon Musk, a top ally of US President Donald Trump, has openly backed the AfD party ahead of February elections, drawing criticism from the government of Chancellor Olaf Scholz and accusations of meddling in Germany’s elections.</p><p>In January, Musk even attended a campaign for the AfD party virtually and addressed its 4,500 supporters.</p><p>Musk in his speech said that “children should not be guilty of the sins of their parents, let alone their great-grandparents,” in an apparent reference to the Nazi Germany.</p><p>“It’s good to be proud of German culture, German values, and not to lose that in some sort of multiculturalism that dilutes everything,” Musk told the crowd.</p><p>Musk also declared that AfD was Germany’s “best hope” in the elections.</p><p>AfD has witnessed its support base swell over the past months, with the party becoming the first right-wing bloc to win a state election in Germany since the Nazi era and performing well in opinion polls for the upcoming election.</p><p>The German government has responded by accusing Musk of interfering in the elections.</p><p>“And speaking up and expressing opinions isn’t election interference, even when people express views outside your own country, and even when those people are very influential,” Vance said.</p><p>Musk, the world’s richest and arguably the most influential person, has openly thrown his weight behind far-right parties in Europe, such as AfD in Germany and Reform UK.</p><p>Musk even went after British Prime Minister Keir Starmer, calling for new elections and suggesting America should “liberate” Britain. Starmer later fired back at Musk and accused him of “spreading lies and misinformation as far and as wide as possible.”</p><p><em>(With inputs from agencies)</em></p>","contentLength":2187,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1ipiupn/us_vice_president_vance_meets_farright_afds/"},{"title":"German defense minister says Vance speech in Munich ‘not acceptable’","url":"https://www.timesofisrael.com/liveblog_entry/german-defense-minister-says-vance-speech-in-munich-not-acceptable/","date":1739551573,"author":"/u/Affectionate_Cat293","guid":651,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1ipevkz/german_defense_minister_says_vance_speech_in/"}],"tags":["news","reddit"]}