{"id":"368La1qZAv72idE55Whuffkk2TBtHuSndX6iNywdUkLBDxxx55cLvowsw5Rj5VbHUHjCYUBR5tHfX6BAYFQZS3af","title":"top scoring links : europe","displayTitle":"News - Reddit - Europe","url":"https://www.reddit.com/r/europe/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/europe/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"France's answer to recent Russian behavior, Sent VADOR Airborne ''designation'', observation and reconnaissance tactical plane vector around Kaliningrad.","url":"https://www.reddit.com/r/europe/comments/1i59mf8/frances_answer_to_recent_russian_behavior_sent/","date":1737322153,"author":"/u/UpgradedSiera6666","guid":530,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Leaked memo reveals alarming German warnings over Trump","url":"https://www.politico.eu/article/donald-trump-leaked-memo-germany-us-trade-nato-military-defense/","date":1737313509,"author":"/u/Not_the-kind","guid":525,"unread":true,"content":"<div><p>“Germany as a whole isn’t currently seen as a driving force for peace policy in Europe, and honestly that pains me,” Foreign Minister Annalena Baerbock told POLITICO.</p></div>","contentLength":172,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1i56419/leaked_memo_reveals_alarming_german_warnings_over/"},{"title":"Over a hundred Slovak psychiatrists and psychologists are calling on Prime Minister Fico to change his behavior and are urging him to consider leaving politics. They have spoken out because they fear a threat to democracy in Slovakia","url":"https://dennikn.sk/minuta/4415692/","date":1737313325,"author":"/u/FinancialGandhi","guid":526,"unread":true,"content":"<p><strong>Vyše stovka psychiatrov a&nbsp;psychológov vyzýva premiéra Fica na zmenu správania a&nbsp;žiada ho, aby zvážil aj odchod z&nbsp;politiky.</strong> Ozvali sa, lebo majú obavu o&nbsp;ohrozenie demokracie na Slovensku, a&nbsp;premiéra v&nbsp;otvorenom liste obviňujú, že šíri konšpirácie a&nbsp;klamstvá, čím polarizuje spoločnosť.</p><p>Podľa autorov listu, ktorými sú profesori Jozef Hašto a&nbsp;Anton Heretik, sa premiérova agresívnosť a&nbsp;emočná výbušnosť vo verejnom vystupovaní zvýraznila po atentáte.</p><p>Psychiatri ďalej upozorňujú na to, že jeho politické správanie vedie k&nbsp;frustrácii a&nbsp;nespokojnosti veľkej časti obyvateľov Slovenska. Čoraz viac ľudí preto uvažuje o&nbsp;odchode z&nbsp;krajiny, a&nbsp;to aj z&nbsp;osobných dôvodov, lebo nechcú žiť tam, kde sa štátna politika vyznačuje takou mierou pohŕdania, výsmechu a&nbsp;útočnosti.</p><p>Podobný list <a data-link=\"ext\" href=\"https://www.komorapsychologov.sk/2025/01/18/3590/\">adresovala</a> občanom a&nbsp;politikom aj Slovenská komora psychológov. Okrem iného v&nbsp;ňom upozorňujú na nebezpečnú normalizáciu násilia. Pripomínajú, že ak ho politici schvaľujú alebo tolerujú, ukazujú, že takéto správanie je v&nbsp;spoločnosti v&nbsp;poriadku.</p><p>Vážený pán premiér,&nbsp;obraciame sa na Vás otvoreným listom ako občania a&nbsp;profesionáli v&nbsp;oblasti psychiatrie a&nbsp;psychológie.</p><p>Ohrozenie demokracie na Slovensku a&nbsp;medzinárodného postavenia nášho štátu nás vedie k&nbsp;tomu, aby sme sa vyjadrili k&nbsp;Vášmu politickému správaniu a&nbsp;verejnému vystupovaniu. Vopred zdôrazňujeme, že nechceme hodnotiť Vašu osobnosť a&nbsp;sústredíme sa len na správanie z&nbsp;verejne dostupných zdrojov.</p><p>Vaše politické správanie sa vyznačuje čoraz väčšou mierou mocensko-autoritatívneho štýlu, manipuláciou s&nbsp;faktami, klamaním, zhadzovaním a&nbsp;útokmi na politických oponentov, žurnalistov i&nbsp;bežných občanov, ktorí prejavia nesúhlas s&nbsp;Vašou politikou. Neštítite sa útokov na rodiny predstaviteľov opozície, ako to bolo v&nbsp;prípade Šimečkovcov.</p><p>Dehonestujúco sa vyjadrujte k&nbsp;mladým ľuďom, ktorí oponujú Vašej politike, posmešne hodnotíte pleť mladého muža, posielate na diaľku „výchovné facky“ študentovi, ktorý odmietol podať ruku politickému predstaviteľovi, ktorého si neváži. Práve Vy, ktorý ste na svojich politických manifestáciách so svojim straníkmi povzbudzovali dav k&nbsp;vulgárnym označeniam vtedajšej prezidentky.</p><p>Vaše politické správanie a&nbsp;proklamované postoje polarizujú spoločnosť a&nbsp;ovplyvňujú v&nbsp;nej emočnú atmosféru. Vedú k&nbsp;frustrácii a&nbsp;nespokojnosti veľkej časti obyvateľov Slovenska. Čoraz viac ľudí uvažuje o&nbsp;odchode z&nbsp;krajiny, nielen z&nbsp;pracovných či študijných, ale aj z&nbsp;osobných dôvodov. Nechcú žiť v&nbsp;krajine, kde sa štátna politika vyznačuje takou mierou pohŕdania, výsmechu a&nbsp;útočnosti.</p><p>Vaša vnútroštátna politika smeruje hlavne k&nbsp;posilneniu Vašej moci, Vašich straníkov a&nbsp;koaličných partnerov. V&nbsp;krajine, ktorá tak zaostáva v&nbsp;budovaní infraštruktúry. V&nbsp;krajine, kde je zlý stav školstva a&nbsp;zdravotníctva, v&nbsp;oblastiach, v&nbsp;ktorých sme profesijne pôsobili celý život, ale Vám nestoja za to, aby ste ich považovali za „premiérske témy“. Podporujete ľudí, ktorí šíria konšpirácie, osočovanie a&nbsp;klamstvá a&nbsp;devastujú našu kultúru.</p><p>Ešte viac sme zhrození Vašimi zahraničnopolitickými iniciatívami, ktoré sú často v&nbsp;priamom rozpore s&nbsp;politikou EU a&nbsp;NATO, ktorých je Slovensko členom. Vo vojne Ruska proti Ukrajine nejasne vyjadrujete, kto je brutálny agresor a&nbsp;kto brániaca sa obeť.</p><p>Znevažujúco hovoríte o&nbsp;demokraticky zvolenom prezidentovi Ukrajiny, ktorá už tretí rok vedie nerovnú vojnu proti okupantom. Neváhate vycestovať do Moskvy a&nbsp;podávať ruku ruskému prezidentovi, ktorý nesie politickú a&nbsp;morálnu zodpovednosť za smrť desaťtisícov ľudí. Nielen vojakov, ale aj civilistov vrátane detí a&nbsp;ich únosov. Rusko devastuje infraštruktúru krajiny, útočí na civilné obydlia, školy, nemocnice a&nbsp;divadlá. K&nbsp;podobným ústretovým krokom voči ruskému imperializmu povzbudzujete aj spolustraníkov a&nbsp;koaličných partnerov.</p><p>Zdá sa, že agresívnosť a&nbsp;emočná výbušnosť vo Vašom verejnom vystupovaní sa zvýraznila po atentáte na Vašu osobu. Tento čin ako prejav politického násilia jednoznačne odsudzujeme. Prežili ste nepochybne život ohrozujúci stres, ktorý môže mať dosah aj na Vaše fungovanie v&nbsp;budúcnosti.</p><p>Predpokladáme, pán premiér, že viete o&nbsp;tom, že toto nie je prvý list odborníkov na mentálne zdravie premiérovi krajiny. 12. mája 1998 podpísala drvivá väčšina účastníkov Slovenského psychiatrického zjazdu v&nbsp;Košiciach list Vladimírovi Mečiarovi. Mnohé z&nbsp;výhrad k&nbsp;jeho politike, ktoré list obsahoval, sa týkali podobných tém, najmä ohrozenia demokracie a&nbsp;zaradenia krajiny do európskych a&nbsp;transatlantických štruktúr.</p><p>V&nbsp;súčasnej politickej situácii nechceme čakať na konanie ďalšieho psychiatrického zjazdu. Posielame náš otvorený list aj vedeniu Slovenskej psychiatrickej spoločnosti, Slovenskej lekárskej spoločnosti a&nbsp;Slovenskej komory psychológov. Požiadame, aby ho zverejnili na svojich stránkach a&nbsp;umožnili svojim členom vyjadriť sa k&nbsp;obsahu a&nbsp;v&nbsp;prípade súhlasu sa mohli pripojiť k&nbsp;jeho zneniu.</p><p>Dúfame v&nbsp;schopnosť Vašej sebareflexie a&nbsp;možnosti korekcie Vášho politického správania vrátane zváženia odchodu z&nbsp;vrcholovej politiky.</p><p>prof. MUDr. Jozef Hašto, PhD.\nprof. PhDr. Anton Heretik, PhD.</p><p>P. S.: Autori listu vyhlasujú, že nie sú a&nbsp;ani nikdy neboli členmi politickej strany či hnutia.</p>","contentLength":5600,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1i5618v/over_a_hundred_slovak_psychiatrists_and/"},{"title":"Berlin Spotted - Tesla Regrets","url":"https://www.reddit.com/r/europe/comments/1i508jb/berlin_spotted_tesla_regrets/","date":1737298650,"author":"/u/gigglesbb","guid":533,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Europe's oldest road on the island of Crete. Over 3500 years old","url":"https://www.reddit.com/r/europe/comments/1i4xz5v/europes_oldest_road_on_the_island_of_crete_over/","date":1737291830,"author":"/u/EUstrongerthanUS","guid":528,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Tesla owners react to Elon Musk's controversies: 3 in 10 consider selling their cars","url":"https://nltimes.nl/2025/01/19/tesla-owners-react-elon-musks-controversies-3-10-consider-selling-cars","date":1737290102,"author":"/u/Wagamaga","guid":531,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1i4xhge/tesla_owners_react_to_elon_musks_controversies_3/"},{"title":"Dutch liberal leader Jetten seeks to increase military spending to 3% GDP and establish the European Army. He urges the creation of the Energy Union to prevent states from buying gas from the enemy. Energy/defence policy should be led by EU, not states","url":"https://v.redd.it/5op8657ixxde1","date":1737288146,"author":"/u/EUstrongerthanUS","guid":529,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1i4wzoz/dutch_liberal_leader_jetten_seeks_to_increase/"},{"title":"Russian trainee pilots appear to be hunting Ukrainian civilians","url":"https://www.economist.com/europe/2025/01/18/russian-trainee-pilots-appear-to-be-hunting-ukrainian-civilians","date":1737280748,"author":"/u/HydrolicKrane","guid":527,"unread":true,"content":"<p data-component=\"paragraph\"> capital in southern Ukraine, endured eight months of Russian occupation before <a href=\"https://www.economist.com/europe/2025/01/16/a-french-sponsored-ukrainian-army-brigade-has-been-badly-botched\">Ukrainian forces</a> liberated it in November 2022. The Russians retreated to the other side of the Dnieper river, but have indiscriminately shelled the city ever since. In June 2023 they blew up the nearby <a href=\"https://www.economist.com/interactive/europe/2024/06/05/russias-explosion-of-a-huge-ukrainian-dam-had-surprising-effects\">Kakhovka dam</a>, flooding low-lying areas of Kherson. Now the city’s 80,000 inhabitants, down from a prewar population of 280,000, face a new sort of misery. For six months <a href=\"https://www.economist.com/europe/2024/12/12/amid-russian-bombing-ukraine-is-planning-more-nuclear-reactors\">Russian drones</a> have been attacking civilians daily, chasing cars and pedestrians through the streets in what locals call a “safari”.</p>","contentLength":591,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1i4v8eu/russian_trainee_pilots_appear_to_be_hunting/"},{"title":"According to reputable sources, the ongoing anti-corruption/anti-government protests are the largest in Serbia in 25 years, since the overthrow of Milosevic","url":"https://www.reddit.com/r/europe/comments/1i4ui7a/according_to_reputable_sources_the_ongoing/","date":1737277462,"author":"/u/Porodicnostablo","guid":532,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Christmas treats around Europe","url":"https://www.reddit.com/r/europe/comments/1i4ubt1/christmas_treats_around_europe/","date":1737276685,"author":"/u/gorillaz0e","guid":524,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}]}