{"id":"368La1qZAv72idE55Whuffkk2TBtHuSndX6iNywdUkLBDxxx55cLvowsw5Rj5VbHUHjCYUBR5tHfX6BAYFQZS3af","title":"top scoring links : europe","displayTitle":"News - Reddit - Europe","url":"https://www.reddit.com/r/europe/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/europe/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"600 Kilometers of Courage: The Baltic Way Protest","url":"https://www.reddit.com/r/europe/comments/1mxutym/600_kilometers_of_courage_the_baltic_way_protest/","date":1755933346,"author":"/u/Brilliant-Nerve12","guid":634,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Draghi “From Ukraine to Gaza, the EU has been a mere spectator”","url":"https://www.italpress.com/draghi-from-ukraine-to-gaza-the-eu-has-been-a-mere-spectator/","date":1755900208,"author":"/u/Affectionate_Cat293","guid":637,"unread":true,"content":"<p>RIMINI (ITALPRESS/MNA) – “For years the EU believed that its economic weight, with 450 million consumers, would automatically translate into geopolitical power and influence in trade relations. This year will be remembered as the one in which that illusion came to an end. We had to accept U.S. tariffs, and we were pushed by our own ally to increase military spending – a decision perhaps necessary, but not in this form or at this pace.”Speaking at the 46th Meeting in Rimini, former Prime Minister Mario Draghi continued, “the EU played only a marginal role in peace negotiations over Ukraine. It was a mere spectator even as Iranian nuclear sites were bombed and the massacre in Gaza escalated.”<p>According to Draghi, “Europe must move from being a spectator, or at best a supporting actor, to becoming a protagonist. That means reshaping its political organization, which is inseparable from its ability to meet economic and strategic goals. Economic reforms remain essential.”</p>“Europe is the best opportunity we have for a future of peace and security. And as a democracy, it is you, it is us, the Europeans who set the priorities,” Draghi said.<p>On fiscal policy, Draghi repeated his distinction between “good debt and bad debt,” but warned that in some areas national-level borrowing is no longer sufficient. He argued that only common European debt can finance large-scale projects in defense, energy, and emerging technologies.</p>The former ECB president also pointed to a “brutal wake-up call” from Donald Trump, which he said reshaped relations with the U.S. “There is now a political, social, and psychological climate that gives hope for a new kind of political organization. We must learn to cooperate. Rigidity and passivity breed inaction – and that, as wève seen over the last 10-15 years, is Europès worst enemy.”<p>“It is not surprising that skepticism toward Europe has reached new heights,” Draghi added. “But it is worth asking what lies at the heart of this skepticism. In my view, it is not directed at the values on which Europe was founded, but rather at the EU’s ability to defend those values. And that skepticism is partly justified: political structures are designed to address the challenges of their time, and when those challenges change, the structures themselves must change”.</p></p><div>Vuoi pubblicare i contenuti di Italpress.com sul tuo sito web o vuoi promuovere la tua attività sul nostro sito e su quelli delle testate nostre partner? Contattaci all'indirizzo <a href=\"https://www.italpress.com/cdn-cgi/l/email-protection#7d14131b123d14091c110d0f180e0e531e1210\"></a></div>","contentLength":2527,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1mxjvfb/draghi_from_ukraine_to_gaza_the_eu_has_been_a/"},{"title":"“I’m very angry. You’re my great friend,” Trump replied to Orban’s complaints about the Druzhba pipeline attack. “I don’t like to hear this. I’m very angry. Tell this to Slovakia. You’re my great friend,” Trump wrote to the Hungarian prime minister.","url":"https://www.reddit.com/r/europe/comments/1mxb41o/im_very_angry_youre_my_great_friend_trump_replied/","date":1755879905,"author":"/u/BkkGrl","guid":636,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"4chan will refuse to pay daily UK fines, its lawyer tells BBC","url":"https://www.bbc.com/news/articles/cq68j5g2nr1o","date":1755878460,"author":"/u/ByGollie","guid":639,"unread":true,"content":"<div data-component=\"text-block\"><p>A lawyer representing the online message board 4chan says it won't pay a proposed fine by the UK's media regulator as it enforces the Online Safety Act.</p><p>According to Preston Byrne, managing partner of law firm Byrne &amp; Storm, Ofcom has provisionally decided to impose a £20,000 fine \"with daily penalties thereafter\" for as long as the site fails to comply with its request.</p><p>\"Ofcom's notices create no legal obligations in the United States,\" he told the BBC, adding he believed the regulator's investigation was part of an \"illegal campaign of harassment\" against US tech firms.</p><p>Ofcom has declined to comment while its investigation continues.</p></div><div data-component=\"text-block\"><p>\"4chan has broken no laws in the United States - my client will not pay any penalty,\" Mr Byrne said.</p><p>Then in August, it said it had issued 4chan with \"a provisional notice of contravention\" for failing to comply with two requests for information.</p><p>Ofcom said its investigation would examine whether the message board was complying with the act, including requirements to protect its users from illegal content.</p><p>4chan has often been at the heart of online controversies in its 22 years, including misogynistic campaigns and conspiracy theories.</p><p>Users are anonymous, which can often lead to extreme content being posted.</p></div><div data-component=\"text-block\"><p>In a statement posted on X, law firms Byrne &amp; Storm and Coleman Law said 4chan was a US company incorporated in the US, and therefore protected against the UK law.</p><p>\"American businesses do not surrender their First Amendment rights because a foreign bureaucrat sends them an email,\" they wrote.</p><p>\"Under settled principles of US law, American courts will not enforce foreign penal fines or censorship codes. </p><p>\"If necessary, we will seek appropriate relief in US federal court to confirm these principles.\"</p><p>They said authorities in the US had been \"briefed\" on their response to Ofcom's investigation.</p><p>The statement concludes by calling on the Trump administration to invoke all diplomatic and legal levers to protect American businesses from \"extraterritorial censorship mandates\".</p><p>Ofcom has previously said the Online Safety Act only requires services to take action to protect users based in the UK.</p></div><div data-component=\"text-block\"><p>Some American politicians - particularly the Trump administration, its allies and officials - have pushed back against what they regard as overreach in the regulation of US tech firms by the UK and EU. </p><p>A perceived impact of the Online Safety Act on free speech has been a particular concern, but other laws have also been the source of disagreement.</p><p>On 19 August, US Director of National Intelligence Tulsi Gabbard said the UK had withdrawn its controversial demand for a \"backdoor\" in an Apple data protection system - saying she worked with the President and Vice President to get the UK to abandon its plan.</p><p>Two days later, US Federal Trade Commission chairman Andrew Ferguson warned big tech firms they could be violating US law if they weakened privacy and data security requirements by complying with international laws such as the Online Safety Act.</p><p>\"Foreign governments seeking to limit free expression or weaken data security in the United States might count on the fact that companies have an incentive to simplify their operations and legal compliance measures by applying uniform policies across jurisdictions,\" he said.</p><p>If 4chan does successfully fight the fine in the US courts, Ofcom may have other options.</p><p>\"Enforcing against an offshore provider is tricky,\" Emma Drake, partner of online safety and privacy at law firm Bird and Bird, told the BBC. </p><p>\"Ofcom can instead ask a court to order other services to disrupt a provider's UK business, such as requiring a service's removal from search results or blocking of UK payments.</p><p>\"If Ofcom doesn't think this will be enough to prevent significant harm, it can even ask that ISPs be ordered to block UK access.\"</p></div>","contentLength":3813,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1mxagp7/4chan_will_refuse_to_pay_daily_uk_fines_its/"},{"title":"Air Force Roundels of European Countries [OC]","url":"https://www.reddit.com/r/europe/comments/1mx9pqk/air_force_roundels_of_european_countries_oc/","date":1755876748,"author":"/u/forummapping","guid":640,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Swedish startup unveils Starlink alternative — that Musk can’t switch off","url":"https://thenextweb.com/news/swedish-starlink-alternative-ru1-military-communications","date":1755875105,"author":"/u/Goodlucksil","guid":635,"unread":true,"content":"<p>A new pocket-sized Starlink alternative promises secure military communications — safe from interference by billionaire CEOs.</p><p>The system, named the RU1, was unveiled today by Swedish startup TERASi. It’s billed as the world’s smallest and lightest mm-Wave radio, a form of communications that offers blazing-fast speeds and huge bandwidth.</p><div><div><a href=\"https://thenextweb.com/spaces/book-a-tour\" data-event-category=\"Article\" data-event-action=\"In Article Block\" data-event-label=\"TNW City Coworking space - Where your best work happens\" target=\"_blank\"><p>TNW City Coworking space - Where your best work happens</p><p>A workspace designed for growth, collaboration, and endless networking opportunities in the heart of tech.</p></a></div></div><h2>Military control conflicts</h2><p><a href=\"https://www.reuters.com/investigations/musk-ordered-shutdown-starlink-satellite-service-ukraine-retook-territory-russia-2025-07-25/\" target=\"_blank\" rel=\"nofollow noopener\"></a></p><p><a href=\"https://www.wsj.com/world/russia/musk-putin-secret-conversations-37e1c187?\" target=\"_blank\" rel=\"nofollow noopener\"></a></p>","contentLength":531,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1mx8zi3/swedish_startup_unveils_starlink_alternative_that/"},{"title":"Warsaw (Poland) in the morning","url":"https://www.reddit.com/r/europe/comments/1mx8bb3/warsaw_poland_in_the_morning/","date":1755873558,"author":"/u/woronicz","guid":642,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ukraine attacks pipeline that sends Russian oil to Hungary and Slovakia","url":"https://www.theguardian.com/world/2025/aug/22/ukraine-attacks-pipeline-that-sends-russian-oil-to-hungary-and-slovakia","date":1755871279,"author":"/u/Currency_Cat","guid":643,"unread":true,"content":"<p>Ukraine has hit a key pumping station on the Druzhba oil pipeline bringing fuel to Europe from Russia, knocking out supplies to Hungary and <a href=\"https://www.theguardian.com/world/slovakia\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Slovakia</a>, the only remaining EU member states still receiving Russian oil.</p><p>As <a href=\"https://www.theguardian.com/world/ukraine\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Ukraine</a> targets infrastructure crucial to Moscow’s war effort in response to the Russian onslaught, the commander of Ukraine’s Unmanned Systems Forces, Robert Brovdi, announced the attack on the Unecha pumping station in the Bryansk region.</p><p>Bryansk’s premier, Alexander Bogomaz, said in a Telegram post that Ukraine fired <a href=\"https://www.theguardian.com/world/2022/jun/01/himars-what-are-the-advanced-rockets-us-is-sending-ukraine\" data-link-name=\"in body link\">Himars rockets</a> and drones at the region in a combined attack.</p><p>The Hungarian and Slovakian governments wrote to the European Commission, the EU executive, saying that Russian oil supplies could be suspended for at least five days owing to the damage.</p><p>“The physical and geographical reality is that without this pipeline, the safe supply of our countries is simply not possible,” their foreign ministers, Péter Szijjártó and Juraj Blanár, said in a letter.</p><p>The Ukrainian strike drew an angry reaction from Budapest, which gets more than half its crude oil from the Druzhba pipeline. Szijjártó wrote on Facebook it had been attacked “for the third time in a short time”.</p><p>“This is another attack on the energy security of our country. Another attempt to drag us into war,” he said.</p><p>Hungary’s prime minister, Viktor Orbán, has refused to join EU partners in backing Kyiv with political, economic and military support. Orbán visited Moscow last year for talks with the country’s president, <a href=\"https://www.theguardian.com/world/vladimir-putin\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Vladimir Putin</a>, on a rare trip to Russia by a European leader.</p><p>“Hungary supports Ukraine with electricity and petrol, in return they bomb pipeline that supply us,” Orbán wrote in English. “Very unfriendly move! We wish President Trump every success in his pursuit for peace!”</p><p>Below the text was a handwritten message <a href=\"https://www.facebook.com/photo/?fbid=1350322856454259&amp;set=a.438430827643471\" data-link-name=\"in body link\">apparently written and signed by Trump</a>: “Viktor – I do not like hearing this – I am very angry about it. Tell Slovakia,” it read. “You are my great friend – Donald.”</p><p>The EU aims to phase out Russian oil and gas entirely by the end of 2027 but Budapest and Bratislava oppose such a move, arguing that Russian energy supplies are vital to their national economies.</p><p>Despite a push by Trump to reach a deal to end the conflict, the three-and-a-half-year war continued unabated this week as Russia launched an air attack near Ukraine’s border with the EU on Thursday and continued its <a href=\"https://www.theguardian.com/world/2025/aug/18/trump-ukraine-crimea-nato-zelesnkyy-washington-meeting\" data-link-name=\"in body link\">devastating assault on Ukrainian cities</a>.</p><p>Ukraine has repeatedly pounded Russian oil refineries among other targets, sending Russian wholesale petrol prices soaring to record highs in recent days. Moscow routinely targets Ukraine’s gas infrastructure, crucial for winter heating and as fuel for essential industries.</p><p>The Druzhba pipeline begins in Russia and transports oil through Belarus and Ukraine to Slovakia and Hungary. It was the second time that supplies to the EU countries were interrupted this week.</p><p>The Soviet-era pipeline, which runs through Belarus and Ukraine, also ships oil from Kazakhstan to Germany but its economy ministry said supplies of Kazakh oil were unaffected by the latest strike.</p><p>Slovakia’s Moscow-friendly prime minister, <a href=\"https://www.theguardian.com/world/robert-fico\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Robert Fico</a>, has adopted Kremlin lines and sided with Orbán as a pro-Russian voice in the EU.</p><p><em>Reuters and the Associated Press contributed to this report</em></p>","contentLength":3370,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1mx7ckb/ukraine_attacks_pipeline_that_sends_russian_oil/"},{"title":"Norway, Sweden, Denmark, and Belgium will halt parcel shipments to the US starting August 23","url":"https://www.businessinsider.com/some-european-postal-services-sellers-are-suspending-us-bound-shipments-2025-8","date":1755866364,"author":"/u/World_of_Warshipgirl","guid":641,"unread":true,"content":"<p>If you have been eyeing something from overseas, you may want to click \"buy now\" today.</p><p>Postal services operated by Norway, Sweden, Denmark, and Belgium — Posten Bring, PostNord, and bpost — said they will suspend parcel shipments to the US ahead of the end of <a target=\"_self\" href=\"https://www.businessinsider.com/ways-brands-reduce-tariff-costs-bonded-warehouse-de-minimis-ends-2025-4\" data-track-click=\"{&quot;element_name&quot;:&quot;body_link&quot;,&quot;event&quot;:&quot;tout_click&quot;,&quot;index&quot;:&quot;bi_value_unassigned&quot;,&quot;product_field&quot;:&quot;bi_value_unassigned&quot;}\" rel=\"\">a customs exemption</a> that allows low-value packages to enter the country duty-free.</p><p>The conundrum facing postal operators comes as the Trump administration prepares to suspend the \"<a target=\"_self\" href=\"https://www.businessinsider.com/de-minimis-is-over-higher-prices-longer-waits-trumps-tariffs-2025-5\" data-track-click=\"{&quot;element_name&quot;:&quot;body_link&quot;,&quot;event&quot;:&quot;tout_click&quot;,&quot;index&quot;:&quot;bi_value_unassigned&quot;,&quot;product_field&quot;:&quot;bi_value_unassigned&quot;}\" rel=\"\">de minimis</a>\" exemption starting on August 29. The exemption used to allow international shipments under $800 to cross the border with minimal paperwork and no duties.</p><p>Now, these shipments will face tariffs, and not every operator can handle the customs declaration paperwork, have a payment mechanism in place, or be responsible for returns should a receiver refuse to pay tariffs. It's unclear when the temporary freeze on shipments will resume.</p><p>\"Due to the short timeframe to adapt to the new specific requirements, PostNord will temporarily halt shipments to the United States and Puerto Rico until a compliant solution has been developed and implemented,\" wrote the operator owned by the Swedish and Danish governments in a statement on Wednesday.</p><p>Separately, Posten Bring, Norway's primary postal provider operated by the government, said in a statement that postal services have not been given clear instructions and solutions on how the duties will be paid or who would be responsible for returns. Therefore, Posten Bring sees suspension as the \"only option.\"</p><p>All three European postal services will suspend shipments starting August 23, which applies to all packages other than letters. This means that if you have a pending purchase that is not shipped by the deadline, your seller may need to cancel your order or arrange alternatives. </p><p>But even if you're not purchasing from these specific European countries, your shopping options might still dwindle and <a target=\"_self\" href=\"https://www.businessinsider.com/companies-raising-prices-increases-trump-tariffs-2025\" data-track-click=\"{&quot;element_name&quot;:&quot;body_link&quot;,&quot;event&quot;:&quot;tout_click&quot;,&quot;index&quot;:&quot;bi_value_unassigned&quot;,&quot;product_field&quot;:&quot;bi_value_unassigned&quot;}\" rel=\"\">become more costly</a>.</p><p><a target=\"_self\" href=\"https://www.businessinsider.com/scaled-etsy-shop-48k-profit-in-four-months-using-data-2025-3\" data-track-click=\"{&quot;element_name&quot;:&quot;body_link&quot;,&quot;event&quot;:&quot;tout_click&quot;,&quot;index&quot;:&quot;bi_value_unassigned&quot;,&quot;product_field&quot;:&quot;bi_value_unassigned&quot;}\" rel=\"\">Etsy</a>, the US e-commerce giant and a <a target=\"_self\" href=\"https://www.businessinsider.com/love-money-yarn-rise-etsy-husbands-wives-entrepreneurs-online-shopping-2025-6\" data-track-click=\"{&quot;element_name&quot;:&quot;body_link&quot;,&quot;event&quot;:&quot;tout_click&quot;,&quot;index&quot;:&quot;bi_value_unassigned&quot;,&quot;product_field&quot;:&quot;bi_value_unassigned&quot;}\" rel=\"\">hub for independent crafters</a>, posted a notice Wednesday that&nbsp;shipping label purchases for Australia Post, Canada Post, Evri, and Royal Mail for US-bound packages will be temporarily suspended starting August 25.</p><p>Etsy wrote in a statement that these operators are unable to support prepaid duties at the moment, which may result in a large number of rejected packages due to unpaid duties and surprise costs for buyers not listed at checkout.</p><p>Across social media platforms, many independent sellers based in the UK are also announcing that they can no longer support orders to the US, citing the introduction of an $80 flat fee plus handling charges for using Royal Mail to ship parcels to the US.</p><p>\"We hope to resume shipping as soon as we can, but we really don't want our customers to be hit with an $80+ fee,\" <a target=\"_blank\" href=\"https://www.instagram.com/p/DNDWSRqseKF/\" data-track-click=\"{&quot;click_type&quot;:&quot;other&quot;,&quot;element_name&quot;:&quot;body_link&quot;,&quot;event&quot;:&quot;outbound_click&quot;}\" rel=\" nofollow\">wrote the Citrine Circle</a>, a UK-based crystal shop, on Instagram. \"It feels like the world is getting smaller and smaller.\"</p><p>The White House did not immediately respond to a request for comment.</p>","contentLength":2960,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1mx5dyf/norway_sweden_denmark_and_belgium_will_halt/"},{"title":"A Kosovo Albanian woman is evacuated with her newborn daughter in a column of refugees, 1999.","url":"https://www.reddit.com/r/europe/comments/1mx3sny/a_kosovo_albanian_woman_is_evacuated_with_her/","date":1755861768,"author":"/u/holyrs90","guid":638,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["news","reddit"]}