{"id":"368La1qZAv72idE55Whuffkk2TBtHuSndX6iNywdUkLBDxxx55cLvowsw5Rj5VbHUHjCYUBR5tHfX6BAYFQZS3af","title":"top scoring links : europe","displayTitle":"News - Reddit - Europe","url":"https://www.reddit.com/r/europe/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/europe/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"France deploys its aircraft carrier to eastern Mediterranean as tensions escalate","url":"https://www.aa.com.tr/en/europe/france-deploys-its-aircraft-carrier-to-eastern-mediterranean-as-tensions-escalate/3845637","date":1772397038,"author":"/u/BasedBalkaner","guid":638,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1ri865y/france_deploys_its_aircraft_carrier_to_eastern/"},{"title":"British destroyer integrates with French carrier group","url":"https://ukdefencejournal.org.uk/british-destroyer-integrates-with-french-carrier-group/","date":1772388862,"author":"/u/Due_Ad_3200","guid":632,"unread":true,"content":"<h4>HMS Dauntless has been operating alongside the French Navy during exercise ORION 26, joining the carrier strike group centred on the aircraft carrier Charles de Gaulle.</h4><p>The Type 45 destroyer has been working with the French Air Defence Frigate Amiral Ronarc’h to refine over-the-horizon targeting, integrating her sensors and combat systems with a Wildcat helicopter from 815 Naval Air Squadron. In a post during the exercise, the ship described <em>“impressive interoperability in #ORION2026”</em> as the British and French vessels conducted joint targeting activity.</p><p>The French Navy confirmed that Dauntless had joined the Charles de Gaulle carrier group for the exercise, describing the deployment as part of wider Franco-British cooperation.</p><p>In a further demonstration of multinational integration, French fleet tanker Jacques Stosskopf conducted a double underway replenishment at sea, simultaneously supporting HMS Dauntless and the Royal Netherlands Navy frigate De Ruyter. The manoeuvre, described by the French as highly technical, underscored the level of coordination between the French, British and Dutch navies.</p><p>Exercise ORION 26 forms part of a broader programme of high-end allied training designed to strengthen interoperability, sustain carrier strike operations and rehearse complex multi-domain warfare alongside European partners.</p><p>Dauntless is the second of the Royal Navy’s six Daring-class guided missile destroyers, designed primarily to provide area air defence for carrier strike groups. Displacing between 8,000 and 8,500 tonnes and measuring over 152 metres in length, the class is built around the Sea Viper air defence system. This combines the SAMPSON multi-function radar and S1850M long-range surveillance radar with Aster 15 and Aster 30 missiles housed in 48 Sylver vertical launch cells.</p><p>The ships are powered by an integrated electric propulsion system driven by Rolls-Royce WR-21 gas turbines and diesel generators, delivering speeds in excess of 30 knots and a range of more than 7,000 nautical miles at cruising speed. A complement of around 190 personnel operate the vessel, with accommodation available for additional embarked staff.</p><p>Beyond her primary anti-air role, Dauntless carries a 4.5-inch Mark 8 naval gun, 30mm cannons, Phalanx close-in weapon systems and heavy machine guns. Anti-ship capability is set to transition to the Naval Strike Missile following the retirement of Harpoon. The class is also undergoing progressive upgrades, including the Sea Viper Evolution programme, which will enhance ballistic missile defence capability, and the introduction of Sea Ceptor to replace Aster 15 in due course.</p>","contentLength":2647,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1ri4gs6/british_destroyer_integrates_with_french_carrier/"},{"title":"Denmark becomes first country in the EU to eliminate mother-to-child transmission of HIV and syphilis","url":"https://www.who.int/news/item/27-02-2026-denmark-becomes-first-country-in-the-european-union-to-eliminate-of-mother-to-child-transmission-of-hiv-and-syphilis","date":1772388075,"author":"/u/Above-and_below","guid":639,"unread":true,"content":"<p>The World Health Organization (WHO) has certified Denmark for the elimination of mother-to-child transmission (EMTCT) of HIV and syphilis, recognizing the country's sustained commitment to ensuring every child is born free of these infections. </p><p>“The elimination of mother-to-child transmission of HIV and syphilis marks a major public health achievement for Denmark,” said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. “This milestone demonstrates that with strong political commitment and consistent investment in primary care and integrated maternal and child health services, countries can protect every pregnant woman and newborn from these diseases.”</p><p>The validation, based on an assessment by WHO's Regional Validation Committee in June 2025 and Global Validation Advisory Committee (GVAC) in August 2025, confirms that Denmark met all required targets from 2021 to 2024, including low transmission rates and high coverage of prenatal testing and treatment for pregnant women.</p><p>\"As the first European Union country to achieve this public health milestone, Denmark's success is a testament to the strength of its maternal health system and its long-standing commitment to reaching every pregnant woman with the care she needs,\" said Dr Hans Henri P. Kluge, WHO Regional Director for Europe. \"Elimination means testing and treating&nbsp;at least&nbsp;95&nbsp;out of every 100&nbsp;pregnant women&nbsp;– and keeping new infant infections below 50 per 100&nbsp;000 births, year after year. Denmark has met these benchmarks through strong antenatal care, reliable data&nbsp;systems&nbsp;and respect for women's rights. We will support Denmark as it works toward full triple&nbsp;elimination, when&nbsp;it adds hepatitis B.\"&nbsp;</p><p>Reaching this milestone reflects decades of sustained commitment by clinical and public health professionals, underpinned by strong health systems and universal health coverage including integrated screening during pregnancy. Denmark’s exemplary data systems, robust laboratory capacity, and high human rights standards have been essential to this success.&nbsp;&nbsp; </p><p>\"This validation by WHO is a proud moment for Denmark and the result of decades of work by our health-care professionals, midwives, and public health teams to ensure that every pregnant woman receives the screening and care she needs,” said Sophie Løhde, Minister for the Interior and Health, Denmark. “Denmark's universal health system&nbsp;– built on equal access for all&nbsp;– has been the foundation of this achievement. Being the first country in the European Union to reach this milestone is both an honour and a responsibility. We hope our experience can inspire and support other countries on their path to elimination, and we look forward to completing the journey with the addition of hepatitis B to achieve full triple elimination.\" </p><p>Denmark’s experience demonstrates what is possible when rights‑based policies, high‑quality services, and strong data systems come together, providing a powerful model and motivator for other countries seeking to strengthen their EMTCT programmes. The country is also on track towards validating hepatitis B virus elimination. WHO is working with Denmark in advancing the triple elimination validation process. </p><p>Denmark joins 22 other countries and territories validated by WHO for the elimination of mother-to-child transmission of HIV, syphilis or hepatitis B virus, or certified on the path to elimination, along with Anguilla, Antigua and Barbuda, Armenia, Belarus, Belize, Bermuda, Brazil, Botswana, Cayman Islands, Cuba, Dominica, Jamaica, Malaysia, Maldives, Montserrat, Namibia, Oman, Republic of Moldova, Saint Vincent and the Grenadines, Sri Lanka, St. Kitts and Nevis, and Thailand.</p><p>Denmark has low rates of HIV and syphilis among pregnant women. About 5950 people are living with HIV, and less than 0.1% of pregnant women are affected. Routine testing and treatment have reduced mother-to-child transmission to zero. For hepatitis B, the prevalence of chronic infection is estimated at around 0.2–0.3%,&nbsp;mainly among&nbsp;migrants from endemic regions.&nbsp;Congenital syphilis (syphilis passed from mother to baby) is also uncommon due to systematic prenatal screening and care. In 2024, 626 cases of syphilis were reported overall, mostly in men (524) and fewer in women (102). These low infection rates highlight the effectiveness of Denmark’s public health efforts and comprehensive prenatal care.&nbsp;</p>","contentLength":4422,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1ri43z1/denmark_becomes_first_country_in_the_eu_to/"},{"title":"Norway moving against enshittification of digital services. Letter send to the EU council, cosigned by 29 civil societal organisations. More info on https://www.forbrukerradet.no/breakingfree. The video they made is hilarious and well worth a watch! Thank you Norway!","url":"https://www.youtube.com/watch?v=T4Upf_B9RLQ","date":1772382866,"author":"/u/Cynical_Dad-Gamer","guid":634,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1ri1s2j/norway_moving_against_enshittification_of_digital/"},{"title":"Ukraine and Netherlands Expand Drone Line Project With Goal of Eliminating 50,000 Russian Troops Monthly","url":"https://united24media.com/latest-news/ukraine-and-netherlands-expand-drone-line-project-with-goal-of-eliminating-50000-russian-troops-monthly-16377","date":1772382183,"author":"/u/UNITED24Media","guid":635,"unread":true,"content":"<p>Ukraine is&nbsp;expanding its “Drone Line” initiative in&nbsp;partnership with the Netherlands, aiming to&nbsp;institutionalize drone regiments across all military corps and maintain high attrition rates on&nbsp;the frontline. </p><div><div><p>We bring you stories from the ground. <b>Your support keeps our team in the field.</b></p></div><a href=\"https://united24media.com/donate?banner_variant=article_small\" target=\"_blank\">DONATE NOW</a></div><p>According to&nbsp;official statements <a href=\"https://x.com/FedorovMykhailo/status/2027790407761793026\" rel=\"external noopener nofollow\" target=\"_blank\">released</a> by&nbsp;Ukrainian Minister of&nbsp;Defense Mykhailo Fedorov on&nbsp;February 28, 2026, a&nbsp;high-level meeting with the Dutch Deputy Prime Minister and Minister of&nbsp;Defense, Dilan Yeşilgöz-Zegerius, resulted in&nbsp;an&nbsp;agreement to&nbsp;secure additional resources for the project. </p><p>The initiative, which currently integrates over 1,000 specialized crews, has become a&nbsp;cornerstone of&nbsp;Ukraine’s asymmetric warfare strategy.</p><p>The “Drone Line” has demonstrated significant kinetic impact during the first two months of&nbsp;2026. Minister Fedorov reported that in&nbsp;January and February, these crews were responsible for destroying every third Russian soldier on&nbsp;the front. </p><p>The Ukrainian defense leadership is&nbsp;now transitioning from decentralized drone units to&nbsp;a&nbsp;more structured military hierarchy. Fedorov stated that the ministry has already begun financing the creation of&nbsp;drone regiments and is&nbsp;scaling this experience to&nbsp;all corps.</p><p>This expansion is&nbsp;part of&nbsp;a&nbsp;broader strategic calculation to&nbsp;offset Russian manpower advantages. According to&nbsp;data provided by&nbsp;the Ministry of&nbsp;Defense, Ukraine aims for 50,000 enemy losses per month as&nbsp;a&nbsp;core component of&nbsp;its war plan. </p><p>On&nbsp;specific sectors of&nbsp;the front, Russian forces have reportedly lost up&nbsp;to&nbsp;170&nbsp;personnel for every kilometer of&nbsp;territorial gain. In&nbsp;January 2026, Russian combat losses exceeded the number of&nbsp;newly mobilized personnel entering the force.</p><p>Beyond unmanned systems, the discussions between Fedorov and Yeşilgöz-Zegerius covered several critical pillars of&nbsp;Ukraine’s defense infrastructure. A&nbsp;primary focus remains the F-16 program and the continued supply of&nbsp;long-range artillery ammunition. </p><p>The Netherlands has confirmed several key support measures, including the transfer of&nbsp;PAC-3 missiles for Patriot systems, joint efforts to&nbsp;counter the Russian shadow fleet in&nbsp;international waters, the development of&nbsp;a&nbsp;comprehensive radar field to&nbsp;enhance airspace monitoring, and funding for the PURL program aimed at&nbsp;enhancing specific defense capabilities.</p><p>Earlier, Ukraine and Denmark <a href=\"https://united24media.com/war-in-ukraine/denmark-and-ukraine-launch-eur33-million-military-training-overhaul-16264\" target=\"_self\">launched</a> a&nbsp;€33 million project to&nbsp;modernize a&nbsp;key military training center into a&nbsp;national center of&nbsp;excellence. This initiative builds on&nbsp;the “Danish model,” which has already funneled $3 billion into Ukraine’s defense industry. The partnership is&nbsp;now evolving into “Danish Model 2.0,” facilitating Ukrainian defense production directly within Denmark.</p>","contentLength":2785,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1ri1hdq/ukraine_and_netherlands_expand_drone_line_project/"},{"title":"The sea harbour of Porto Flavia, built in 1924. Sulcis-Iglesiense, Sardinia, Italy","url":"https://www.reddit.com/r/europe/comments/1rhv9f5/the_sea_harbour_of_porto_flavia_built_in_1924/","date":1772365317,"author":"/u/Socmel_","guid":637,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Russian Spy Ship Busted Red-Handed Launching Drone at French Aircraft Carrier","url":"https://united24media.com/latest-news/russian-spy-ship-busted-red-handed-launching-drone-at-french-aircraft-carrier-16375","date":1772364955,"author":"/u/UNITED24Media","guid":640,"unread":true,"content":"<p>Following the recent interception of&nbsp;a&nbsp;Russian unmanned aerial vehicle (UAV) in&nbsp;the port of&nbsp;Malmö, the Swedish Ministry of&nbsp;Defense has released specific operational details regarding the failed surveillance mission against the French aircraft carrier Charles de&nbsp;Gaulle. </p><div><div><p>We bring you stories from the ground. <b>Your support keeps our team in the field.</b></p></div><a href=\"https://united24media.com/donate?banner_variant=article_small\" target=\"_blank\">DONATE NOW</a></div><p>According to&nbsp;, the drone was <a href=\"https://%20https//www.reuters.com/world/europe/sweden-drone-french-aircraft-carrier-2026-02-27/\" rel=\"external noopener nofollow\" target=\"_blank\">launched</a> from the Russian Baltic Fleet’s reconnaissance vessel Zhigulevsk (Project 503R) while it&nbsp;was maneuvering in&nbsp;the Baltic&nbsp;Sea.</p><p>The Swedish patrol boat HSwMS Rapp, a&nbsp;Tapper-class vessel, had been tracking the Zhigulevsk prior to&nbsp;the drone’s deployment. </p><p>According to&nbsp;, the Swedish crew was <a href=\"https://defence-ua.com/news/rozkrito_detali_jak_rf_nahabno_shpiguvala_za_jedinim_avianostsem_frantsiji_i_chi_vdalosja_schos_zrobiti_iz_dronom-22011.html\" rel=\"external noopener nofollow\" target=\"_blank\">able</a> to&nbsp;document the exact moment of&nbsp;the UAV’s launch, providing visual and technical evidence that the surveillance attempt originated from the Russian naval asset.</p><p>While Swedish officials have not disclosed whether the drone was downed kinetically or&nbsp;via electronic warfare (EW), Vice Admiral Ewa Skoog Haslum confirmed that the spy equipment was fully neutralized upon approaching the French flagship.</p><p>“We&nbsp;monitored this vessel during its transit and were able to&nbsp;promptly take countermeasures when the drone was detected,” Vice Admiral Haslum stated, according to&nbsp;Defense Express.</p><h3><b>The role of&nbsp;modernized Swedish assets</b></h3><p>According to&nbsp;Reuters, the successful interception highlights the 2020&nbsp;modernization of&nbsp;Sweden’s Tapper-class fast patrol boats. </p><p>These vessels, which were nearly decommissioned in&nbsp;2014, were upgraded with advanced sensors specifically designed to&nbsp;detect small-scale reconnaissance drones even when operating in&nbsp;radio-silence mode.</p><p>The Swedish Defense Minister, Pål Jonson, confirmed on&nbsp;February 27, 2026, via social media that technical analysis verified the drone’s Russian origin. </p><p>According to&nbsp;Defense Express, the Zhigulevsk is&nbsp;part of&nbsp;the 72nd Separate Division of&nbsp;Special Purpose Ships and regularly conducts intelligence-gathering missions in&nbsp;the Baltic region.</p><p>The incident has resulted in&nbsp;the following developments:</p><ul><li><p>Intelligence analysis: NATO specialists are currently examining the recovered technical data and the drone’s hardware to&nbsp;assess Russian surveillance capabilities;</p></li><li><p>Heightened surveillance: following the breach, Baltic Sea nations have further intensified their maritime and coastal monitoring;</p></li><li><p>Operational security: the Charles de&nbsp;Gaulle has continued its scheduled participation in&nbsp;strategic exercises under a&nbsp;reinforced security umbrella.</p></li></ul><p>According to&nbsp;Reuters, the failure of&nbsp;the Russian operation reflects the high level of&nbsp;NATO naval readiness in&nbsp;the Baltic Sea. </p><p>Earlier, on&nbsp;February 4, <a href=\"https://united24media.com/latest-news/russias-spy-satellites-may-have-hijacked-european-signals-intelligence-warns-15622\" target=\"_self\">reported</a> that Russian Luch-1 and Luch-2 satellites likely hijacked unencrypted signals from over a&nbsp;dozen European spacecraft. German military space command told Financial Times that these maneuvers targeted sensitive government and military data, warning that Russia could potentially spoof commands to&nbsp;deorbit or&nbsp;crash older, unencrypted satellites.</p>","contentLength":3021,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1rhv5qc/russian_spy_ship_busted_redhanded_launching_drone/"},{"title":"“If It Swims Like a Duck and Cuts Cables Like a Duck…” Estonian Grid Operator Elering Has No Doubt Baltic Sea Seabed Infrastructure Damage Has Been Intentional","url":"https://balticsentinel.eu/8425028/if-it-swims-like-a-duck-and-cuts-cables-like-a-duck-estonian-grid-operator-elering-has-no-doubt-baltic-sea-seabed-infrastructure-damage-has-been-intentional","date":1772364067,"author":"/u/The_Baltic_Sentinel","guid":633,"unread":true,"content":"<h2><strong>How to protect Elering’s infrastructure against the drone threat?</strong></h2><p><i>General (R) Martin Herem, former Commander of the Estonian Defense Forces:</i></p><p>The “from the air” threat to Elering’s infrastructure is multi-layered and requires a differentiated approach depending on the type and reach of the attack platform.</p><p>Large, so-called LOWA-type drones can reach virtually anywhere in Estonia. Their early detection must fall under the air force’s competence, and under the current circumstances, kinetic or other active countermeasures must remain the responsibility of the defense forces.</p><p>In the longer term, however, Elering could still have an organic countermeasure capability of its own, activated in coordination with national operational plans. Such capability would not replace national air defense, but would supplement it as an additional, object-based layer of protection, provided they are integrated into the national command and permitting system.</p><p>The threat posed by small drones is geographically more limited, but still significant. The realistic operating radius of FPV drones is about 20 kilometers, and loitering aerial munitions up to 50 kilometers from the state border. At the same time, it must be borne in mind that within that same depth, the adversary may also use other means — KAB bombs, artillery, LOWAs, ballistic or cruise missiles. Even so, it makes sense to prepare specifically for a scenario involving the mass use of small drones, because they are cheap, readily available, and tactically flexible.</p><p>Ukraine’s experience shows that layered defense works against small drones — including drone swarms.</p><p>First, engineer fortification. This ranges from drone nets to concrete structures and sandbags.</p><p>Industrial nets are produced, for example, in China, and can be ordered according to the desired color, strength, and mesh size. The price level may be on the order of €2–4 per square meter. If positioned correctly, these nets can also partially help against larger drones by deflecting them off target or causing detonation before they reach a critical component.</p><p>Concrete fortification of substations in Ukraine has also been carried out by Nordecon; it would be possible to review those fortified sites and their statistical impact assessments on location. Even if such fortification does not prevent the destruction of a site, it reduces the scale of damage, speeds up restoration, and raises the attacker’s cost base.</p><p>Second, electronic warfare (EW) tools—both detection and countermeasures. In Ukrainian practice, one comparable static object is protected with solutions worth roughly $25,000. Presentations by the Unmanned Systems Forces Command have given examples of a concept for protecting drone teams that is, in principle, transferable to substation defense. The advantage of a static object is that power supply and control links are permanent, and the system can be operated remotely or partially automated: a sensor detects an attack and activates an effector (e.g., a jammer). A detailed analysis is required of the temporary effects EW solutions may have on other systems at the moment an attack is being repelled; in principle, this should not be a significant issue, but it must be technically validated.</p><p>Third, kinetic close-in defense using smoothbore firearms. Ukraine’s experience shows that after two weeks of training, teams can hit small drones with a probability of over 90% at an effective firing distance of up to about 50 meters. Safety for the surrounding environment can be increased through prepared firing angles, designation of danger areas, and public notification. Deploying such teams should take place in coordination with national operational plans.</p><p>In Kherson Oblast, about 250 kilometers from the border of the occupied territories, roughly 40 such teams are operating. They are composed not only of military personnel, but also representatives of territorial defense, the police, and other agencies.</p><p>In sum, there is no “silver bullet.” Effective protection requires a layered approach: early detection at the national level, object-based EW capability, physical fortification, and, if necessary, close-in defense teams. Even if there is no complete protection against larger threats — such as missile strikes — engineer fortification reduces the extent of destruction, simplifies restoration, and forces the attacker to expend significantly greater resources to achieve the objective.</p>","contentLength":4472,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1rhuwvs/if_it_swims_like_a_duck_and_cuts_cables_like_a/"},{"title":"Just a random cat living better than me — Cyprus","url":"https://www.reddit.com/r/europe/comments/1rhu29b/just_a_random_cat_living_better_than_me_cyprus/","date":1772361059,"author":"/u/relaxncoffee","guid":631,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Belgium, France seize Russian 'shadow fleet' tanker in the North Sea","url":"https://www.france24.com/en/europe/20260301-belgium-france-seize-russian-shadow-fleet-tanker-in-north-sea","date":1772361007,"author":"/u/HighDeltaVee","guid":636,"unread":true,"content":"<p>Deputy Prime Minister Maxime Prévot said the vessel was intercepted in the North Sea during an overnight operation.</p><p>\"Today, a vessel from Russia's shadow fleet was intercepted in the North Sea,\" Prévot wrote on X, thanking Belgian special forces for their \"exceptional professionalism and courage\".</p><p>Belgian Defence Minister Theo Francken said the intercepted tanker was \"being escorted to the port of Zeebrugge, where it will be seized\".</p><p>French President <a href=\"https://www.france24.com/en/tag/emmanuel-macron/\" target=\"_self\">Emmanuel Macron</a> confirmed on X that French naval forces assisted in the operation, calling it a \"major blow\" to Russia's so-called shadow fleet.</p><div data-xtwitter-script=\"\"><div><div><p>To display this content from X (Twitter), you must enable advertisement tracking and audience measurement.</p></div></div></div><p>Russia has used a flotilla of ageing tankers of opaque ownership to get around restrictions on its lucrative crude exports imposed over its 2022 all-out invasion of Ukraine.</p><p>The European Union has blacklisted hundreds of vessels in a bid to sap Moscow's war chest.</p><p>\"Sanctions only matter if they are enforced. Today, we enforced them,\" Prévot said.</p><p>Francken told Reuters that the seized vessel was suspected of sailing with a \"false flag ⁠and false documents\".</p><p>Maritime tracking site VesselFinder reports the Ethera is sailing under a Guinean flag.</p><p>The operation was carried out alongside Belgium's G7, Nordic and Baltic partners and in coordination with France, he added.</p><p>Russia has called the seizure of its tankers or ⁠vessels carrying its ​cargoes an act of piracy.</p><p><em>(FRANCE 24 with AFP and Reuters)</em></p>","contentLength":1506,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1rhu1qc/belgium_france_seize_russian_shadow_fleet_tanker/"}],"tags":["news","reddit"]}