{"id":"368La1qZAv72idE55Whuffkk2TBtHuSndX6iNywdUkLBDxxx55cLvowsw5Rj5VbHUHjCYUBR5tHfX6BAYFQZS3af","title":"top scoring links : europe","displayTitle":"News - Reddit - Europe","url":"https://www.reddit.com/r/europe/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/europe/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Donald Trump in fiery call with Denmark’s prime minister over Greenland","url":"https://www.ft.com/content/ace02a6f-3307-43f8-aac3-16b6646b60f6","date":1737742134,"author":"/u/Affectionate_Cat293","guid":608,"unread":true,"content":"<div aria-hidden=\"true\" data-offer-type=\"print\"><ul></ul></div>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1i91tt7/donald_trump_in_fiery_call_with_denmarks_prime/"},{"title":"Massive protests in Slovakia against the current government","url":"https://www.reddit.com/r/europe/comments/1i91ovz/massive_protests_in_slovakia_against_the_current/","date":1737741794,"author":"/u/g46152","guid":609,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Right now, ongoing protest against pro Russian government in Slovakia / Bratislava","url":"https://www.reddit.com/r/europe/comments/1i90li8/right_now_ongoing_protest_against_pro_russian/","date":1737739140,"author":"/u/vladoportos","guid":612,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Massive protests against pro-Russia Fico government all over Slovakia right now","url":"https://v.redd.it/zvgabwzbzyee1","date":1737736681,"author":"/u/skamaz11","guid":605,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1i8zlp4/massive_protests_against_prorussia_fico/"},{"title":"Belgrade around noon, 15 min of silence for the 15 ppl killed","url":"https://v.redd.it/ukktzgpo7yee1","date":1737727383,"author":"/u/Flinty984","guid":603,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1i8w2nf/belgrade_around_noon_15_min_of_silence_for_the_15/"},{"title":"Serbia's Foreign Ministers captured looking on the massive anti-govt. protests across Belgrade (and Serbia) today","url":"https://www.reddit.com/r/europe/comments/1i8v52l/serbias_foreign_ministers_captured_looking_on_the/","date":1737724589,"author":"/u/Porodicnostablo","guid":604,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Europe can import disillusioned talent from Trump’s US, says Lagarde","url":"https://www.ft.com/content/b6a5c06d-fa9c-4254-adbc-92b69719d8ee","date":1737723993,"author":"/u/Affectionate_Cat293","guid":607,"unread":true,"content":"<div aria-hidden=\"true\" data-offer-type=\"print\"><ul></ul></div>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1i8uy5m/europe_can_import_disillusioned_talent_from/"},{"title":"Today, a General Strike in Serbia.","url":"https://v.redd.it/sg2sthalrxee1","date":1737721981,"author":"/u/vuxeee","guid":606,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1i8ubxg/today_a_general_strike_in_serbia/"},{"title":"Reddit is banning X links. Could Europe be next?","url":"https://www.newsweek.com/reddit-banning-x-links-2019994","date":1737713662,"author":"/u/newsweek","guid":611,"unread":true,"content":"<p>European officials continue to discuss punishments against X, formerly <a href=\"https://www.newsweek.com/topic/twitter\" data-sys=\"1\">Twitter</a>, including the possibility of a ban while <a href=\"https://www.newsweek.com/topic/elon-musk\" data-sys=\"1\">Elon Musk</a>'s controversial gesture at the presidential inauguration prompted a boycott of the platform by some communities on popular message board site <a href=\"https://www.newsweek.com/topic/reddit\" data-sys=\"1\">Reddit</a>.</p><p> reached out to X and the European Commission for comment by email on Thursday morning.</p><p>Elon Musk has stirred no end of controversy in recent months following the election of President <a href=\"https://www.newsweek.com/topic/donald-trump\" data-sys=\"1\">Donald Trump</a> to a second term in office. Musk played a major role in financially backing Trump and also promoting him on X.</p><p>Additionally, Musk stirred controversy this week when he made a gesture that <a href=\"https://www.newsweek.com/musk-germany-salute-nazi-2019503\" target=\"_blank\" rel=\"noopener\">many have interpreted as a Nazi salute</a>, which Musk has denied and wholesale rejected as an attack by \"radical leftists.\" Those who have denied the gesture as a Nazi salute instead argued that Musk was trying to \"send my heart\" to the crowd or was making a Roman salute.</p><p>However, some different Reddit sub-pages have taken the decision to <a href=\"https://www.newsweek.com/elon-musk-reddit-ban-subreddit-list-2018763\" target=\"_blank\" rel=\"noopener\">ban users from posting X links</a> as a form of protest against Musk: The Formula 1 subreddit is the highest-profile group to adopt the ban, followed by the PC gaming subreddit and the pro-Ukraine subreddit NAFO.</p><p>As a \"very large platform\" with over 45 million users <a rel=\"nofollow\" href=\"https://digital-strategy.ec.europa.eu/en/policies/dsa-vlops\">per the DSA classification</a>, X is required (among other things) to \"identify, analyze, and assess systemic risks that are linked to their services,\" particularly illegal context, risks to fundamental rights (including freedom of expression), risks to public security and electoral processes, and gender-based violence, public health and well being of minors.</p><p>Some officials in Europe believe that X has failed to adhere to these commitments, but whether they can take action against the platform, and what action they can take, remains a complicated question.</p><p>Jean Cattan, general secretary of France's National Digital Council (Cnum) has warned that trying to ban X is \"not at all a simple path\" while insisting that it remains \"realistic but extreme,\" according to the AFP.</p><p>In order to pursue any such ban, the E.U. would rely on either the Digital Services Act (DSA) or the Digital Markets Act (DMA), which came into effect in 2024. Former European Commissioner Thierry Breton argued that these two acts would allow the 27-member bloc to enforce a ban across all member states.</p><p>Through the powers of the DSA, the <a href=\"https://www.newsweek.com/topic/european-union\" data-sys=\"1\">European Union</a> opened an investigation into X in 2023 over allegations the platform failed to address \"illicit content and disinformation\" following a significant decrease in X content moderation, according to .</p><figure data-gtm-category=\"Related In-Text A\" data-gtm-action=\"Click\"></figure><p>The AFP noted, however, that the DSA has \"no provision ... for a platform to be banned for good,\" with a \"maximum penalty\" that can be ordered by a judge. A suspension would be a last resort after a fine of up to 6 percent of the platform's worldwide annual revenue.</p><p>X is forecast to record around $2 billion in global ad revenue in 2024—a significant drop from its $4.5 billion revenue in 2022, according to British business magazine 's Asia branch.</p><p>Cattan complained about the mechanism, telling the AFP that the recent troubles involving an alleged <a href=\"https://www.newsweek.com/topic/tiktok\" data-sys=\"1\">TikTok</a> campaign backed by Russia to boost a far-right candidate proved \"the DSA does not allow us to react swiftly enough.\"</p><p>French Foreign Minister Jean-Noel Barrot earlier this month urged the European Commission to either apply \"as strictly as possible the laws we've passed to protect our public space\" or \"agree to return the capacity to do this to the member states.\"</p><p>Any action might have to happen through regulators in Ireland, where X has its European headquarters.</p><p><strong>Jordan Bardella, President of the French far-right party National Rally, </strong></p><p>In the video, Bardella suggested that French Foreign Minister Jean-Noel Barrot wanted a ban on X.  determined that leaders have not called for a ban but have alluded to \"action\" against the platform if it has been deemed to have violated the DSA.</p><p><strong>Florian Philippot, leader of French nationalist and Eurosceptic party The Patriots</strong>, on X criticized Bardella for not voting against the DSA and accused the E.U. of \"killing freedom of expression a little more every day.\"</p><p>However, <strong>Chloe Ridel, European Member of Parliament for the Socialist Party, </strong><a rel=\"nofollow\" href=\"https://x.com/ChloeRidel/status/1879114020122173440\">wrote on X</a>: \"Freedom of expression applies within the limits of the law, but it is not respected on X who: - rigs the algorithm to boost certain posts over others. - ⁠ allows hate speech to flourish. What is at stake is our sovereignty: would you therefore accept that an American billionaire puts up millions of election posters without control in France?\"</p><p>The investigation into X will continue, especially in light of Musk's repeated attacks against European officials over perceived violations of free speech. The European Commission just last week announced new steps to the investigation, with pressure increasing on investigators after Musk's chat with AfD leader Alice Weidel.</p><p>There will also be increased scrutiny on X as the upcoming German election draws near, which is set to occur on February 23, 2025.</p><p><em>Correction on 01/24/2025 at 9:20 a.m. ET. Corrects that the ban on X links is by some groups on Reddit</em></p>","contentLength":5142,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1i8s90o/reddit_is_banning_x_links_could_europe_be_next/"},{"title":"Today, Croatia is boycotting stores because of inflation","url":"https://www.reddit.com/r/europe/comments/1i8s8ig/today_croatia_is_boycotting_stores_because_of/","date":1737713601,"author":"/u/DefinitionPerfect575","guid":610,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}]}