{"id":"368La1qZAv72idE55Whuffkk2TBtHuSndX6iNywdUkLBDxxx55cLvowsw5Rj5VbHUHjCYUBR5tHfX6BAYFQZS3af","title":"top scoring links : europe","displayTitle":"News - Reddit - Europe","url":"https://www.reddit.com/r/europe/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/europe/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Nazi flags spotted in Sweden on Hitler's Birthday","url":"https://www.reddit.com/r/europe/comments/1k3wvb8/nazi_flags_spotted_in_sweden_on_hitlers_birthday/","date":1745184122,"author":"/u/Antique-Entrance-229","guid":617,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Zelenskyy says Russian artillery fire has not subsided despite announced truce","url":"https://tvpworld.com/86264734/ukrainian-official-says-russian-forces-still-open-fire-despite-ceasefire","date":1745172975,"author":"/u/dat_9600gt_user","guid":614,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1k3sux3/zelenskyy_says_russian_artillery_fire_has_not/"},{"title":"Fox News labels Kyiv a Russian city, Ukraine calls for 'apology and investigation'","url":"https://kyivindependent.com/ukraines-foreign-ministry-calls-out-fox-news-for-labeling-kyiv-a-russian-city/","date":1745169237,"author":"/u/tyw7","guid":615,"unread":true,"content":"<p>Ukraine's Foreign Ministry has called out Fox News for labeling Kyiv a \"Russian city\" during its news broadcast.</p><p>During its coverage of Easter services on April 20, Fox News aired footage of religious services from around the world, including the service Russian President Vladimir Putin <a href=\"https://kyivindependent.com/putin-attends-easter-service-in-moscow-as-fighting-in-ukraine-continues-despite-ceasefire/\">attended in Moscow</a>. </p><p>Simultaneously, the right-wing news network broadcast live images from Easter religious services in Kyiv, <a href=\"https://kyivindependent.com/kyiv-not-kiev-how-ukrainians-reclaimed-their-capital-and-their-future/\">misidentifying the Ukrainian capital</a> as a Russian city. The error reportedly remained on screen for 20 minutes. </p><p>\"If this was a mistake rather than a deliberate political statement, there should be an apology and an investigation into who made the mistake,\" Foreign Ministry spokesperson Heorhii Tykhyi wrote on X, formerly known as Twitter, on April 20.</p><p>Although he didn't mention them by name, President Volodymyr Zelensky appeared to also criticize Fox News at the end of a statement on April 20 in which he reported multiple Russian ceasefire violations across the front line since an <a href=\"https://kyivindependent.com/putin-announces-easter-ceasefire-calls-on-ukraine-to-follow/\">Easter ceasefire</a> was declared. </p><p>\"Instead of broadcasting religious service from Moscow, the focus should be on pressuring Moscow to genuinely <a href=\"https://kyivindependent.com/ukraine-proposes-extending-truce-beyond-easter-sunday/\">commit to a full ceasefire</a>,\" Zelensky wrote.</p><p>\"We thank all the media, podcasters, bloggers, and everyone sharing the truth about what is happening.\"</p>","contentLength":1288,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1k3rffo/fox_news_labels_kyiv_a_russian_city_ukraine_calls/"},{"title":"EU considers stripping Hungary of voting rights!","url":"https://euromaidanpress.com/2025/04/20/eu-considers-stripping-hungary-of-voting-rights-over-ukraine-obstruction/","date":1745161049,"author":"/u/SPXQuantAlgo","guid":621,"unread":true,"content":"<p>European Union member states are considering removing Hungary’s voting rights after its persistent attempts to block support for Ukraine, The Guardian <a href=\"https://www.theguardian.com/world/2025/apr/19/orban-ukraine-hungary-eu-relations-kyiv\" target=\"_blank\">reports</a>. This potential action comes as pro-Russian Prime Minister Viktor Orbán faces his most serious political challenge in years from opposition leader Péter Magyar.</p><div>Russian President Putin’s ally Orbán has opposed military aid to Ukraine since Russia’s 2022 invasion, pushing for peace talks that would freeze the war and solidify Moscow’s control of occupied territories.&nbsp;</div><p>Posters are appearing throughout Hungary with the slogan <em>“Let’s not allow them to decide for us,</em>” featuring Ukrainian President Volodymyr Zelenskyy, European Commission President Ursula von der Leyen, and European People’s Party leader Manfred Weber as villains in Hungarian government propaganda, The Guardian says.</p><p>The campaign centers on a referendum asking citizens: “Do you support Ukraine becoming a member of the EU?”&nbsp;After launching the campaign, PM Orbán urged citizens to vote against membership, claiming that <em>“we would have to spend all Hungary’s money on Ukraine.</em>” The government has also made unsubstantiated claims that “” from Ukraine would take Hungarian jobs and that epidemics would spread due to insufficient vaccination rates among Ukrainians.</p><p>László Andor, Hungary’s EU commissioner from 2010 to 2014, told The Guardian that the governing Fidesz party recognized “<em>there is a sentiment against Hungary’s involvement in the war</em>” and has “” this sentiment <em>“to deny proper support to Ukraine</em>.”</p><h2>Voting ban considerations</h2><p>Not only has Hungary under Orbán never sent military aid to Ukraine, but рфі also vetoed the release of €6 billion in funds meant to reimburse other EU countries providing military aid to Ukraine and has refused to sign two EU declarations supporting its invaded neighbor. Moreover, Budapest has repeatedly attempted to block EU sanctions against Russia, although it eventually backed down.</p><p data-start=\"0\" data-end=\"150\">Hungary’s behavior has intensified discussions among EU countries about invoking Article 7, the treaty mechanism that could suspend its voting rights.</p><p>Any such move, however, faces a major hurdle: unanimous backing from the other 26 member states. That level of agreement has proven elusive in the past, with Poland previously blocking action. Attention has now turned to Slovakia, where Prime Minister Robert Fico is seen as the most likely to shield Hungary from potential penalties.</p><p data-start=\"0\" data-end=\"307\">A potential flashpoint is approaching on 31 July, when Hungary could block the renewal of EU sanctions against Russia. The package includes the freeze on €210 billion in Russian central bank assets, with profits helping to finance Ukraine’s defense and the principal seen as vital for future reconstruction.</p><p data-start=\"309\" data-end=\"695\">While Hungary has a history of retreating from such veto threats, diplomats remain cautious.</p><blockquote><p data-start=\"309\" data-end=\"695\"><em>“If the past is predictive for the future, we should be OK. But it would be foolish to assume that</em>,” one senior diplomat told The Guardian, noting that contingency plans are already in motion to circumvent a possible Hungarian block.</p></blockquote><p>Dutch Green MEP Tineke Strik, who leads the European Parliament’s efforts on Hungary and rule-of-law matters, told The Guardian:</p><blockquote><p><em>“Member states really are getting fed up with Orbán.”</em></p></blockquote><p>According to her, 19 governments appear willing to advance the Article 7 process, even if only through measures that stop short of suspending voting rights. However, she noted a key obstacle remains: they still lack “<em>a strategy on how to get the rest of the member states on board</em>.”</p><p>Last week, Strik led a cross-party delegation that found Hungary’s democratic standards were “going rapidly in the wrong direction.” The forthcoming report will highlight state-controlled media, politicized courts, and rising LGBTQ+ restrictions, including a constitutional Pride ban.</p><div><div><strong>You could close this page. Or you could join our community and help us produce more materials like this.&nbsp;</strong>\n\nWe keep our reporting open and accessible to everyone because we believe in the power of free information. This is why our small, cost-effective team depends on the support of readers like you to bring deliver timely news, quality analysis, and on-the-ground reports about Russia's war against Ukraine and Ukraine's struggle to build a democratic society.\n\nA little bit goes a long way: for as little as the cost of one cup of coffee a month, you can help build bridges between Ukraine and the rest of the world, plus become a co-creator and vote for topics we should cover next. <a href=\"https://www.patreon.com/euromaidanpress\" target=\"_blank\"></a>or see other ways to <a href=\"https://www.patreon.com/bePatron?u=36526209\" target=\"_blank\" data-patreon-widget-type=\"become-patron-button\">Become a Patron!</a></div></div>","contentLength":4626,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1k3odpq/eu_considers_stripping_hungary_of_voting_rights/"},{"title":"Charles De Gaulle warned us 62 (!) years ago","url":"https://www.reddit.com/r/europe/comments/1k3lt9w/charles_de_gaulle_warned_us_62_years_ago/","date":1745153315,"author":"/u/sandyWB","guid":623,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Action Committee for the United States of Europe sent a letter to EU officials urging to establish a European Defense System [link in comments]","url":"https://www.reddit.com/r/europe/comments/1k3k18c/the_action_committee_for_the_united_states_of/","date":1745146712,"author":"/u/EUstrongerthanUS","guid":619,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Nearly 300 scientists apply for French academic program amid Trump cuts in U.S.","url":"https://www.opb.org/article/2025/04/18/amid-trump-cuts-nearly-300-u-s-based-scientists-seek-french-program/","date":1745142559,"author":"/u/Necessary_Pie2464","guid":618,"unread":true,"content":"<figure><figcaption><p>Students, researchers and demonstrators rally during a protest against the Trump administration's funding cuts on research, health and higher education at the University of California Los Angeles on April 8.</p><p><em>Robyn Beck / AFP via Getty Images</em></p></figcaption></figure><p>A French university courting U.S.-basedacademics said it has already received nearly 300 applications for researchers seeking “refugee status” amid President Trump’s elimination of funding for several scientific programs.</p><p>Last month, Aix-Marseille University, one of the country’s oldest and largest universities, announced it was accepting applications for its <a href=\"https://www.univ-amu.fr/en/public/actualites/safe-place-science-aix-marseille-universite-ready-welcome-american-scientists\" target=\"_blank\">Safe Place For Science program</a>, which it said offers “a safe and stimulating environment for scientists wishing to pursue their research in complete freedom.”</p><p>This week, Aix-Marseille said it had received 298 applications, and 242 of them are eligible and currently up for review. Of the eligible applicants, 135 are American, 45 have a dual nationality, 17 are French and 45 are from other countries, the university said.</p><p>“I am pleased that this request for the creation of scientific refugee status has found both media and political traction,”university President Éric Berton said <a href=\"https://www.univ-amu.fr/en/system/files?file=2025-04/Note%20aux%20redac%20-%20Safe%20Place%20For%20Science%20amU.pdf\" target=\"_blank\">in a statement</a>.</p><p>The public research university said there is an even split between male and female applicants, with backgrounds from various prestigious U.S. institutions including Johns Hopkins University, NASA, the University of Pennsylvania, Columbia, Yale and Stanford. About 20 Americans will be accepted into the program to begin in June.</p><p>“We at Aix-Marseille University are convinced that mobilization to address the challenges facing scientific research must be collective in France and Europe,” Berton said.</p><p>The Trump administration has prioritized aggressive spending cuts and federal workforce reduction, leading to a battle for America’s best and brightest.</p><p>Already, <a href=\"https://www.npr.org/2025/02/10/nx-s1-5292161/trump-administration-makes-deep-cuts-to-science-funding\" target=\"_blank\">for example</a>, universities and medical research facilities are set to lose billions in federal funding under the National Institutes of Health. And rollbacks on federal diversity, equity and inclusion programs have compromised research ranging from <a href=\"https://www.npr.org/2025/03/21/g-s1-55090/trump-dei-trees-removal-climate-change\" target=\"_blank\">climate change</a> to <a href=\"https://www.npr.org/sections/shots-health-news/2025/01/27/nx-s1-5276342/nsf-freezes-grant-review-trump-executive-orders-dei-science\" target=\"_blank\">biomedical research</a>.</p><p>Aix-Marseille is not the only European institution hoping to capitalize on America’s brain drain.</p><p>Last month, France’s CentraleSupélec announced a $3.2 million grant to help finance American research that had been halted in the states. And Netherlands Minister of Education, Culture and Science<a href=\"https://www.reuters.com/world/europe/netherlands-creates-fund-attract-top-foreign-scientists-2025-03-20/\" target=\"_blank\"> Eppo Bruins</a> wrote in a letter to parliament that he requested to set up a fund aimed at bringing top international scientists to the Netherlands.</p><p>There is some evidence that these entreaties are reaching curious ears.</p><p>Last month in the journal , <a href=\"https://www.nature.com/articles/d41586-025-00938-y\" target=\"_blank\">more than 1,200 respondents</a> identifying as scientists cited Trump’s funding cuts as reasons they were considering moving to Canada or Europe.</p><p>Discussion boards <a href=\"https://www.npr.org/2025/04/04/nx-s1-5347480/academics-in-the-u-s-seek-jobs-elsewhere\" target=\"_blank\">reviewed by NPR</a> show academics reaching the same conclusions.</p>","contentLength":2932,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1k3j3e0/nearly_300_scientists_apply_for_french_academic/"},{"title":"Few remaining independent news channels in Turkey broadcasting the opposition rally.","url":"https://www.reddit.com/r/europe/comments/1k3it4y/few_remaining_independent_news_channels_in_turkey/","date":1745141241,"author":"/u/CreepyKraken","guid":620,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Budapest sends letters urging Hungarians to vote against Ukraine's EU accession, vows to treat result as binding","url":"https://www.pravda.com.ua/eng/news/2025/04/19/7508270/","date":1745137038,"author":"/u/schmeckfest","guid":616,"unread":true,"content":"<p>The Hungarian government has begun distributing ballots for a national consultation asking citizens whether they support Ukraine's accession to the European Union. Budapest is openly urging voters to oppose it.</p><p> a letter from the Hungarian government's information centre dated 19 April, seen by European Pravda</p><p> In the letter, the Hungarian government calls for a vote against supporting Ukraine's accession to the EU, as, according to Budapest, this will \"cause Hungary enormous losses\".</p><p>\"It will cost every Hungarian family hundreds of thousands of forints a year, jeopardise pensions and support for farmers, and pose risks to security and the labour market,\" the letter says.</p><p>Budapest also argues that \"accelerating Ukraine's accession in the current circumstances will destroy the Hungarian economy\".</p><p>\"We, the Hungarians, cannot accept that such an important issue is being resolved before our eyes. In the coming weeks, the government will provide detailed information on issues related to Ukraine's accession,\" the letter reads.</p><p>The Hungarian government has pledged that it will treat the results of the vote as binding.</p><p>The letter urges Hungarian citizens to \"take part in the vote\" and \"make a responsible decision\".</p><p>Ballots will be delivered by the end of May.</p><ul><li aria-level=\"1\">On 5 March, Hungarian Prime Minister Viktor Orbán <a href=\"https://www.pravda.com.ua/eng/news/2025/03/18/7503419/\">announced</a> a poll in Hungary on support for Ukraine's membership in the EU.</li><li aria-level=\"1\">Polish Foreign Minister Radosław Sikorski sarcastically <a href=\"https://www.pravda.com.ua/eng/news/2025/03/8/7501918/\">commented</a> on Orbán's initiative.</li></ul><p><strong>Support Ukrainska Pravda on </strong><a href=\"https://www.patreon.com/pravdaua\" target=\"_blank\"></a></p>","contentLength":1506,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1k3hvtq/budapest_sends_letters_urging_hungarians_to_vote/"},{"title":"Pope Sends Deputy to Lecture Vance on Compassion at Vatican","url":"https://www.thedailybeast.com/pope-snubs-vance-and-gets-deputy-to-lecture-vp-on-compassion/","date":1745120843,"author":"/u/RGV_KJ","guid":622,"unread":true,"content":"<p><a onclick=\"_sendArticleBodyInlineLinkClickAnalytics('https://www.thedailybeast.com/keyword/pope-francis/')\" href=\"https://www.thedailybeast.com/keyword/pope-francis/\" target=\"_self\" rel=\"\" title=\"https://www.thedailybeast.com/keyword/pope-francis/\">Pope Francis</a> did not attend the Vatican’s official meeting with U.S. Vice President <a onclick=\"_sendArticleBodyInlineLinkClickAnalytics('https://www.thedailybeast.com/keyword/jd-vance/')\" href=\"https://www.thedailybeast.com/keyword/jd-vance/\" target=\"_self\" rel=\"\" title=\"https://www.thedailybeast.com/keyword/jd-vance/\">JD Vance</a> on Saturday, instead having his No. 2 deliver a lecture on compassion, according to a Vatican statement.</p><p>Pope Francis was absent from Vance’s conversation with Cardinal Pietro Parolin. However, the statement <a onclick=\"_sendArticleBodyInlineLinkClickAnalytics('https://apnews.com/article/vatican-vance-pope-migration-a91d0f741cb994faae1e363d38b66c05')\" href=\"https://apnews.com/article/vatican-vance-pope-migration-a91d0f741cb994faae1e363d38b66c05\" target=\"_self\" rel=\"\" title=\"https://apnews.com/article/vatican-vance-pope-migration-a91d0f741cb994faae1e363d38b66c05\">said</a> there was “an exchange of opinions on the international situation, especially regarding countries affected by war, political tensions and difficult humanitarian situations, with particular attention to migrants, refugees, and prisoners.”</p><p>It called for “serene collaboration” between the White House and the Catholic Church in the United States—a seeming hint to the tensions that have brewed between the two since President Donald Trump took office.</p><p>A statement from Vance’s office about the meeting, however, did not include migration among the topics of conversation.</p><p>It said the two discussed “the plight of persecuted Christian communities around the world” as well as Trump’s “commitment to restoring world peace,” Bloomberg <a onclick=\"_sendArticleBodyInlineLinkClickAnalytics('https://www.bloomberg.com/news/articles/2025-04-19/vatican-reports-exchange-of-views-with-vance-about-migration')\" href=\"https://www.bloomberg.com/news/articles/2025-04-19/vatican-reports-exchange-of-views-with-vance-about-migration\" target=\"_self\" rel=\"\" title=\"https://www.bloomberg.com/news/articles/2025-04-19/vatican-reports-exchange-of-views-with-vance-about-migration\">reported</a>.</p><p>Inside Vatican sources <a onclick=\"_sendArticleBodyInlineLinkClickAnalytics('https://news.sky.com/story/jd-vance-has-quick-and-private-meeting-with-the-pope-during-visit-to-rome-13351562?dcmp=snt-sf-twitter')\" href=\"https://news.sky.com/story/jd-vance-has-quick-and-private-meeting-with-the-pope-during-visit-to-rome-13351562?dcmp=snt-sf-twitter\" target=\"_self\" rel=\"\" title=\"https://news.sky.com/story/jd-vance-has-quick-and-private-meeting-with-the-pope-during-visit-to-rome-13351562?dcmp=snt-sf-twitter\">told</a> Sky News that Vance did briefly meet with the pope at his residence, but no details of their conversation have been made public.</p><p>Pope Francis has repeatedly rebuked the president’s mass deportation effort, <a onclick=\"_sendArticleBodyInlineLinkClickAnalytics('https://www.thedailybeast.com/pope-francis-labels-donald-trumps-immigration-plans-a-disgrace/')\" href=\"https://www.thedailybeast.com/pope-francis-labels-donald-trumps-immigration-plans-a-disgrace/\" target=\"_self\" rel=\"\" title=\"https://www.thedailybeast.com/pope-francis-labels-donald-trumps-immigration-plans-a-disgrace/\">calling</a> it a “disgrace” and a “grave sin.”</p><p>The pontiff has also specifically confronted Vance, who is the highest-ranking Catholic in the U.S. government, having converted in 2019. </p><p>Without mentioning the vice president by name, the pope corrected a Catholic concept Vance had invoked to defend the administration’s deportations,  (order of love). In a February letter, Francis pointedly <a onclick=\"_sendArticleBodyInlineLinkClickAnalytics('https://www.thedailybeast.com/pope-appears-to-school-jd-vance-in-letter-rebuking-mass-deportations/')\" href=\"https://www.thedailybeast.com/pope-appears-to-school-jd-vance-in-letter-rebuking-mass-deportations/\" target=\"_self\" rel=\"\" title=\"https://www.thedailybeast.com/pope-appears-to-school-jd-vance-in-letter-rebuking-mass-deportations/\">explained</a>, “Christian love is not a concentric expansion of interests that little by little extend to other persons and groups.”</p><p>Vance <a onclick=\"_sendArticleBodyInlineLinkClickAnalytics('https://apnews.com/article/vice-president-jd-vance-pope-francis-immigration-4f05693320524f9976d3b9ebe31b3f97')\" href=\"https://apnews.com/article/vice-president-jd-vance-pope-francis-immigration-4f05693320524f9976d3b9ebe31b3f97\" target=\"_self\" rel=\"\" title=\"https://apnews.com/article/vice-president-jd-vance-pope-francis-immigration-4f05693320524f9976d3b9ebe31b3f97\">acknowledged</a> the Pope’s criticism, calling himself a “baby Catholic” and admitting that there are “things about the faith that I don’t know.” </p><p>In January, Vance found himself in a tussle with the U.S. Conference of Catholic Bishops after he suggested they were helping “resettle illegal immigrants” to secure funding.</p><p>New York Cardinal Timothy Dolan <a onclick=\"_sendArticleBodyInlineLinkClickAnalytics('https://www.catholicnewsagency.com/news/261889/cardinal-dolan-vance-s-remarks-on-bishops-and-immigration-scurrilous-very-nasty')\" href=\"https://www.catholicnewsagency.com/news/261889/cardinal-dolan-vance-s-remarks-on-bishops-and-immigration-scurrilous-very-nasty\" target=\"_self\" rel=\"\" title=\"https://www.catholicnewsagency.com/news/261889/cardinal-dolan-vance-s-remarks-on-bishops-and-immigration-scurrilous-very-nasty\">fired back</a> that Vance’s remarks were “scurrilous,” “nasty,” and “not true.”</p><p>The pope, 88, <a onclick=\"_sendArticleBodyInlineLinkClickAnalytics('https://www.thedailybeast.com/pope-francis-to-be-released-from-hospital-after-battling-life-threatening-infection/')\" href=\"https://www.thedailybeast.com/pope-francis-to-be-released-from-hospital-after-battling-life-threatening-infection/\" target=\"_self\" rel=\"\" title=\"https://www.thedailybeast.com/pope-francis-to-be-released-from-hospital-after-battling-life-threatening-infection/\">is recovering</a> from a serious bout of pneumonia that kept him in the hospital for more than a month. However, he has resumed his official duties. He was well enough to <a onclick=\"_sendArticleBodyInlineLinkClickAnalytics('https://www.cnn.com/2025/04/10/europe/king-charles-queen-camila-pope-francis-intl-hnk/index.html#:~:text=King%20Charles%20and%20Queen%20Camilla%20paid%20a%20surprise%20visit%20to,dealing%20with%20health%20challenges%20recently.')\" href=\"https://www.cnn.com/2025/04/10/europe/king-charles-queen-camila-pope-francis-intl-hnk/index.html#:~:text=King%20Charles%20and%20Queen%20Camilla%20paid%20a%20surprise%20visit%20to,dealing%20with%20health%20challenges%20recently.\" target=\"_self\" rel=\"\" title=\"https://www.cnn.com/2025/04/10/europe/king-charles-queen-camila-pope-francis-intl-hnk/index.html#:~:text=King%20Charles%20and%20Queen%20Camilla%20paid%20a%20surprise%20visit%20to,dealing%20with%20health%20challenges%20recently.\">meet with</a> King Charles and Queen Camilla when they visited the Vatican last week.</p><p>Vance is spending the Easter weekend in Rome after meeting with Italian Prime Minister Giorgia Meloni. He and his wife, Usha Vance, were in attendance at the Vatican’s Good Friday service, <a onclick=\"_sendArticleBodyInlineLinkClickAnalytics('https://www.politico.com/news/2025/04/18/jd-vance-easter-rome-pope-francis-00299462')\" href=\"https://www.politico.com/news/2025/04/18/jd-vance-easter-rome-pope-francis-00299462\" target=\"_self\" rel=\"\" title=\"https://www.politico.com/news/2025/04/18/jd-vance-easter-rome-pope-francis-00299462\">reported</a>.</p><p><i>Editor’s note: This story has been updated to make clear that the Pope did not snub J.D. Vance.</i></p>","contentLength":2848,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1k3dum7/pope_sends_deputy_to_lecture_vance_on_compassion/"}],"tags":["news","reddit"]}