{"id":"368La1qZAv72idE55Whuffkk2TBtHuSndX6iNywdUkLBDxxx55cLvowsw5Rj5VbHUHjCYUBR5tHfX6BAYFQZS3af","title":"top scoring links : europe","displayTitle":"News - Reddit - Europe","url":"https://www.reddit.com/r/europe/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/europe/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Denmark sets up ‘night watch’ to monitor American threats to seize Greenland","url":"https://www.theguardian.com/world/2025/nov/27/denmark-sets-up-night-watch-to-monitor-trump-since-greenland-row","date":1764300160,"author":"/u/jaymar01","guid":572,"unread":true,"content":"<div><p>The Danish government has set up a “night watch” in the foreign ministry, not to keep out the <a href=\"https://gameofthrones.fandom.com/wiki/Night%27s_Watch\" data-link-name=\"in body link\">wildlings and White Walkers</a> like the Night’s Watch of Game of Thrones, but rather to monitor Donald Trump’s pronouncements and movements while Copenhagen sleeps.</p><p>The night watch starts at 5pm local time each day and at 7am a report is produced and distributed around the Danish government and relevant departments about what was said and took place, the <a href=\"https://politiken.dk/internationalt/art10617201/I-Udenrigsministeriet-sidder-der-hver-nat-en-vagt-og-holder-%C3%B8je-med-Trump\" data-link-name=\"in body link\">Politiken newspaper reported</a>.</p><p>The position is understood to have been introduced in the aftermath of the diplomatic row between Copenhagen and Washington over <a href=\"https://www.theguardian.com/world/greenland\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Greenland</a> this spring, when the US president threatened to take control of the Arctic island.</p><p>Politiken said the initiative was one of several examples of how Danish diplomacy and the country’s civil service have had to adapt to the new reality of the second Trump administration.</p><p>A source close to the foreign office told the Guardian: “It is fair to say that the situation in Greenland and the time difference between <a href=\"https://www.theguardian.com/world/denmark\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Denmark</a> and the United States was quite an important factor introducing this arrangement during the spring.”</p><p>Rather than everybody having to reach immediately for their phones to catch up on news from the US, the foreign office said it had instead made a “collective effort” to stay updated on Trump.</p><p>Jacob Kaarsbo, a former chief analyst at the Danish defence intelligence agency, said the development showed, “as we have always known”, that the idea that the US was Denmark’s largest and most important ally was dead. “Alliances are built on common values and a common threat perception,” Kaarsbo said. “Trump shares neither of those with us and I would argue he doesn’t share it with most Europeans.”</p></div>","contentLength":1758,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1p8kiu8/denmark_sets_up_night_watch_to_monitor_american/"},{"title":"Tonight marks one year of uninterrupted protests by the Georgian people against the current pro-Russian regime.","url":"https://www.reddit.com/r/europe/comments/1p8cox2/tonight_marks_one_year_of_uninterrupted_protests/","date":1764276562,"author":"/u/PjeterPannos","guid":579,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Kasparov at Washington security forum: NATO does not exist, it's fake. Ukraine is the only country doing what Alliance was built for","url":"https://euromaidanpress.com/2025/11/27/kasparov-at-washington-security-forum-nato-doesnt-exist-its-fake-ukraine-is-only-country-doing-what-alliance-was-built-for/","date":1764275239,"author":"/u/A_Lazko","guid":571,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1p8c7ah/kasparov_at_washington_security_forum_nato_does/"},{"title":"'Americans believe everything Putin says,' MEP and former general tells Euronews","url":"https://www.euronews.com/my-europe/2025/11/27/the-americans-believe-everything-that-putin-says-general-mep-tells-euronews","date":1764269621,"author":"/u/IKeepItLayingAround","guid":574,"unread":true,"content":"<p>\"The Americans believe everything that Putin says,\" Estonian MEP Riho Terras (EPP) told Euronews' Europe Today morning show in Strasbourg. </p><p>In his view, the 28-point peace plan promoted by the US administration is \"a Russian plan to make Ukraine capitulate,\" and US President Donald Trump is \"just a week from taking from Putin everything.\"</p><p>\"I am very surprised that Donald Trump runs like an errand boy for Putin's capitulation plan,\" Terras said.</p><p>Last week, a leaked text of a peace settlement seen as too favourable to Moscow sparked concerns among Europeans. </p><p>The plan which has been redrafted but not finalised called for a reduction of the Ukrainian army, sweeping territorial concessions, and the imposition of a NATO membership veto on Kyiv, among other conditions seen as akin to capitulation. </p><p>Representatives of the US government led by Secretary of State Marco Rubio, Ukrainian officials and a European delegation met on Sunday in Geneva to discuss amendments to the plan. Europeans hope their input will buy Kyiv time and sway Trump in their direction. </p><p>On Wednesday, speaking from Strasbourg, European Commission President Ursula von der Leyen warned the \"Russian playbook\" of aggression has not changed, and Ukraine could be just the start. </p><p>To help Kyiv, which will require additional funding next year, the Europeans are debating issuing an unprecedented reparations loan pegged to the Russian frozen assets held in Belgium. </p><p>Sources told Euronews the Commission is preparing further legal work to ensure the proposal can get the green light from the Belgian authorities, as the country holds the assets. The document could be published as early as Thursday. </p><p>There is growing frustration with the Belgians' lack of progress. </p><p>In reaction, MEP Terras said: \"We are already too late, we have to start the financing very quickly\".</p><p>\"Don't tell me that the EU, with a population of 500 million and a GDP of €29 trillion, is not able to support Ukraine with a much smaller amount.\"</p><p>According to Terras, \"European people do not understand the urgency of the situation. It is not only about Ukraine.\"</p>","contentLength":2100,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1p8a0r1/americans_believe_everything_putin_says_mep_and/"},{"title":"Swedish man locked up for plotting chemical terror attack on Eurovision","url":"https://www.politico.eu/article/swedish-man-sentenced-for-planning-terrorist-attack-on-eurovision-2020-rotterdam/","date":1764267688,"author":"/u/LoneWolf_McQuade","guid":570,"unread":true,"content":"<div><p>The proposal will be difficult for Kyiv to swallow, as it includes making serious territorial concessions to Moscow.</p></div>","contentLength":116,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1p8990j/swedish_man_locked_up_for_plotting_chemical/"},{"title":"Morgan Stanley fined €101 million for evading €124 million in Dutch dividend taxes","url":"https://nltimes.nl/2025/11/27/morgan-stanley-fined-eu101-million-evading-eu124-million-dutch-dividend-taxes","date":1764265050,"author":"/u/sr_local","guid":573,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1p88678/morgan_stanley_fined_101_million_for_evading_124/"},{"title":"“When Ukrainian Forces Withdraw from the Territories They Hold—that Is When Hostilities Will Cease. If They Do Not Withdraw—we Will Achieve It by Military Means.” Putin Made a Series of Statements on How to Resolve the War in Ukraine","url":"https://sfg.media/en/a/ukraines-forces-will-withdraw-or-russia-will-use-force/","date":1764252462,"author":"/u/sergeyfomkin","guid":578,"unread":true,"content":"<div><div>\n                Today, November 27, 2025, Vladimir Putin delivered a series of statements on the prospects for resolving the war in Ukraine and on the parameters of Donald Trump’s proposed peace plan.\n            </div></div><div>\n            Vladimir Putin said that a U.S. delegation will arrive in Moscow next week to discuss Donald Trump’s peace plan. According to him, “we are expecting them in the first half of next week”.\n        </div><div>\n            The Russian president stressed that there is still no full draft of a peace agreement. He said the discussions so far concerned only a list of issues proposed for consideration: “There was a set of questions that were proposed for discussion”. Putin also said that after the meeting between U.S. and Ukrainian representatives in Geneva, the 28 points of Trump’s plan were divided into four sections.\n        </div><div>\n            Putin described one of the key issues in the talks with the United States as the international </div><div>\n            He noted that Russia is, in principle, prepared to treat this list as a basis for future agreements to end the Russian-Ukrainian war. At the same time, he said that “everything needs to be put into diplomatic language”. Yet the Russian president argued that “signing documents with the Ukrainian leadership is pointless; they made a strategic mistake when they were afraid to hold elections”.\n        </div><div>\n            According to Putin,  His statement said that at this stage it is “legally impossible” to conclude an agreement with Ukraine. The Russian president stressed that Moscow requires international recognition of any arrangements and of the future status of the territories: “We need our decisions to be internationally recognized by the key global players. It is one thing if the territories are under Russian sovereignty and, in the event of a breach of the agreement, this would constitute an attack on Russia with all the corresponding response measures. It is another if it is seen as an attempt to reclaim territory that legally belongs to Ukraine. That is why we need recognition—but not from Ukraine today”.\n        </div><div>\n            Putin said that Russia is ready to end the war if “Ukraine’s forces withdraw from the territories they hold—only then will the fighting stop. If they do not withdraw—we will achieve this by military means”.\n        </div><div><div><div>\n                  Putin’s statement that hostilities will cease if “Ukraine’s forces withdraw from the territories they hold”.\n                </div></div></div><div>\n            Putin claimed that Whitcoff is being attacked and pushed to continue the fighting by those forces that “want to keep stealing money together with the Ukrainian establishment and fight to the last Ukrainian”.\n        </div><div>\n            “We are ready for this,” Putin said.\n        </div>","contentLength":2812,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1p832d5/when_ukrainian_forces_withdraw_from_the/"},{"title":"European parliament calls for social media ban on under-16s","url":"https://www.theguardian.com/technology/2025/nov/26/social-media-ban-under-16s-european-parliament-resolution","date":1764247115,"author":"/u/D0ML0L1Y401TR4PFURRY","guid":575,"unread":true,"content":"<p>Children under 16 should be banned from using social media unless their parents decide otherwise, the European parliament says.</p><p>MEPs passed a resolution on age restrictions on Wednesday by a large majority. Although not legally binding, it raises pressure for European legislation amid growing alarm about the <a href=\"https://www.theguardian.com/society/ng-interactive/2025/jun/07/jonathan-haidt-anxious-generation-smartphones\" data-link-name=\"in body link\">mental health</a> risks to children of unfettered internet access.</p><p>The European Commission, which is responsible for initiating EU law, is already studying Australia’s <a href=\"https://www.theguardian.com/media/2025/nov/23/australia-under-16-social-media-ban-how-will-it-work-which-platforms-age-verification\" data-link-name=\"in body link\">world-first social-media ban</a> for under-16s, which is due to take effect next month.</p><p>In a speech in September, the commission’s president, <a href=\"https://www.theguardian.com/world/ursula-von-der-leyen\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Ursula von der Leyen</a>, said she would watch the implementation of Australia’s policy. She spoke out against “algorithms that prey on children’s vulnerabilities with the explicit purpose of creating addictions” and said parents felt powerless against “the tsunami of big tech flooding their homes”.</p><p>Von der Leyen promised a panel of experts would be set up by the end of the year to advise on the best approach to protecting children.</p><p>Interest is growing in restricting children’s social media and smartphone access. An expert report commissioned last year by France’s president, Emmanuel Macron, said children should not be allowed to use smartphones <a href=\"https://www.theguardian.com/world/2024/apr/30/stop-children-using-smartphones-until-they-are-13-say-french-experts-in-report\" data-link-name=\"in body link\">until the age of 13</a> and social media, such as TikTok, Instagram and Snapchat, until they were 18.</p><p>Christel Schaldemose, the Danish Social Democrat MEP who drafted the resolution, told reporters that politicians needed to act to protect children: “It is not just parents. Society also needs to step up and make sure that platforms are a safe place for minors to be, but only if they are above a certain age.”</p><p>Her report called for the default disabling of addictive features on internet platforms when used by minors, such as infinite scrolling (endless content as the user scrolls down), videos that automatically play, excessive push notifications and rewards for repeated use of a site.</p><p>The resolution noted that “addictive design features are often inherent to the business model of platforms, notably social media”. An earlier draft of the Schaldemose report cited <a href=\"https://www.europarl.europa.eu/RegData/etudes/STUD/2019/624249/EPRS_STU(2019)624249_EN.pdf\" data-link-name=\"in body link\">a study</a> stating that one in four children and young people displayed “problematic” or “dysfunctional” smartphone use – behavioural patterns mirroring addiction. The resolution said children should be 16 before they could access social media, although parents could give consent from the age of 13.</p><p>The White House is urging the EU to roll back its digital laws and some supporters of a social media ban explicitly framed the vote in this context. At a meeting in Brussels on Monday, Howard Lutnick, the US commerce secretary, said EU rules on tech companies needed to be more “balanced” in exchange for lower US steel and aluminium tariffs.</p><p>Referring to Lutnick’s visit, Stéphanie Yon-Courtin, a French MEP from Macron’s party, said Europe was not “a regulatory colony”. In a statement after the vote, she added: “Our digital laws are not for sale. We will not back down on children’s protections because a foreign billionaire or big tech tells us to.”</p><p>The EU already seeks to protect internet users from online harms, such as disinformation, cyberbullying and illegal content, via its Digital Services Act. But the resolution said this law had gaps and could do more to protect children from addictive design features and online exploitation, such as financial incentives to become influencers.</p><p>Schaldemose said the act, which she co-authored, was strong “but we could go further, especially in areas of addictive design features and harmful dark pattern practices where we are not so specific, not so precise”.</p><figure data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.NewsletterSignupBlockElement\"><a data-ignore=\"global-link-styling\" href=\"https://www.theguardian.com/technology/2025/nov/26/social-media-ban-under-16s-european-parliament-resolution#EmailSignup-skip-link-13\">skip past newsletter promotion</a><p tabindex=\"0\" aria-label=\"after newsletter promotion\" role=\"note\">after newsletter promotion</p></figure><p>Dark patterns refer to app or website design features to influence decision-making, such as countdown timers to encourage users to make purchases, or nagging requests to turn on location trackers and notifications.</p><p>Schaldemose’s resolution was adopted by 483 MEPs and opposed by 92, with 86 abstentions.</p><p>Eurosceptic MEPs criticised the plan, saying the EU would be overreaching if it banned social media access for children. “Decisions about children’s access must be taken as close to families as possible – in the member states, not in Brussels,” said Kosma Złotowski, a Polish member of the European Conservatives and Reformists group.</p><p>The resolution was passed only one week after the <a href=\"https://www.theguardian.com/world/2025/nov/19/european-commission-accused-of-massive-rollback-of-digital-protections\" data-link-name=\"in body link\">commission announced delays </a>to changes to its Artificial Intelligence Act and other digital laws in a push to lighten regulation on companies in the name of “simplification”.</p><p>Schaldemose said she appreciated the need to avoid creating too many laws but added “there is a willingness to do more when it comes to kids and protection of our children in the EU”.</p>","contentLength":4810,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1p8177g/european_parliament_calls_for_social_media_ban_on/"},{"title":"British far right leader Nigel Farage urged to clarify party's ties with Russia","url":"https://www.lemonde.fr/en/international/article/2025/11/26/british-far-right-leader-nigel-farage-urged-to-clarify-party-s-ties-with-russia_6747853_4.html","date":1764239320,"author":"/u/ByGollie","guid":577,"unread":true,"content":"<p>Problems continue to mount for Nigel Farage, the leader of the far-right Reform UK party, who is leading in the polls in the United Kingdom. In mid-November,  published multiple testimonies about racist and antisemitic remarks the 61-year-old Brexit architect allegedly made while attending the private Dulwich College in south London during the 1980s. Twenty former classmates spoke to the newspaper, <a href=\"https://www.theguardian.com/commentisfree/2025/nov/25/dont-believe-nigel-farage-denials-targeted-me-for-being-jewish-and-it-hurt\" target=\"_blank\" rel=\"noopener\" title=\"Nouvelle fenêtre\">including documentary producer Peter Ettedgui</a>, from a family of Holocaust survivors, who recalled, for example, a teenage Farage whispering in his ear, \"Hitler was right,\" and, \"to the gas chambers.\"</p><p>As early as 2013, journalist and author Michael Crick had unearthed a 1981 letter from a teacher at Dulwich College accusing the young Farage of being\"racist\" and \"fascist.\"Crick demanded an explanation, but Farage brushed it off, admitting that \"of course\" he said \"some ridiculous things\" in his youth.</p><p>Media scrutiny is becoming harder to avoid for the MP for Clacton-on-Sea, who is no longer a marginal and provocative figure but a credible candidate for prime minister. His party, Reform UK, is leading the ruling Labour Party by around 10 points in the polls.\"These allegations are entirely without foundation,\"a Reform UK spokesperson said on November 11. On November 24, under pressure from the controversy, Farage broke his silence, telling Sky News he had \"never directly really tried to go and hurt anybody\"with his comments.</p><p><strong>You have 70.84% of this article left to read. The rest is for subscribers only.</strong></p>","contentLength":1515,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1p7yyov/british_far_right_leader_nigel_farage_urged_to/"},{"title":"Europe thinks the unthinkable: Retaliating against Russia","url":"https://www.politico.eu/article/europe-thinks-the-unthinkable-retaliating-against-russia-nato-cyber-hybrid/","date":1764239264,"author":"/u/HydrolicKrane","guid":576,"unread":true,"content":"<div><p>The alliance chief also warned that the threat Moscow poses to Europe will far outlast any peace deal reached with Kyiv. </p></div>","contentLength":121,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1p7yy5j/europe_thinks_the_unthinkable_retaliating_against/"}],"tags":["news","reddit"]}