{"id":"368La1qZAv72idE55Whuffkk2TBtHuSndX6iNywdUkLBDxxx55cLvowsw5Rj5VbHUHjCYUBR5tHfX6BAYFQZS3af","title":"top scoring links : europe","displayTitle":"News - Reddit - Europe","url":"https://www.reddit.com/r/europe/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/europe/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"The President of Finland & the Prime Ministers of Norway, Sweden and Denmark at Mette Frederiksens house. Quote: “We are not alone - We have several close allies with whom we share values”","url":"https://www.reddit.com/r/europe/comments/1iaqpy2/the_president_of_finland_the_prime_ministers_of/","date":1737926304,"author":"/u/Smile_you_got_owned","guid":573,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Europe braces for 'most extreme' military scenario as Trump-Putin 2.0 begins","url":"https://www.nbcnews.com/news/world/trump-putin-europe-war-ukraine-attack-baltic-germany-finland-sweden-rcna187924","date":1737924436,"author":"/u/A_Lazko","guid":566,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1iapvcu/europe_braces_for_most_extreme_military_scenario/"},{"title":"BREAKING: An undersea fiberoptic cable connecting Latvia and Sweden has been destroyed. Foul play is suspected and 2 vessels are viewed as potential culprits. A large NATO operation has been launched in the Baltic Sea today","url":"https://www.reddit.com/r/europe/comments/1ianhlm/breaking_an_undersea_fiberoptic_cable_connecting/","date":1737919083,"author":"/u/gayroma","guid":572,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Lukashenko wins ‘sham’ election in Belarus with 87.6 percent of vote","url":"https://www.politico.eu/article/alexander-lukashenko-wins-sham-election-in-belarus/","date":1737916283,"author":"/u/Antique-Entrance-229","guid":565,"unread":true,"content":"<div><p>“Maybe we would consider doing it again. … Maybe we would have to clean it up a little bit,” Trump tells a rally in Las Vegas.</p></div>","contentLength":132,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1iam7bn/lukashenko_wins_sham_election_in_belarus_with_876/"},{"title":"Danish Special Forces member in Greenland. The \"Slaedepatruljen Sirius\" is considered the best arctic unit in the world","url":"https://www.reddit.com/r/europe/comments/1iag8hn/danish_special_forces_member_in_greenland_the/","date":1737902637,"author":"/u/EUstrongerthanUS","guid":568,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"‘I saw normal people in Auschwitz and I saw sadists there who killed people’ - As Europe faces a new wave of extreme nationalism, one of the last survivors of Auschwitz looks back.","url":"https://www.irishtimes.com/life-style/people/2025/01/25/holocaust-survivor-i-saw-normal-people-in-auschwitz-and-i-saw-sadists-there-who-killed-people/","date":1737902389,"author":"/u/Ok_Solution_7314","guid":567,"unread":true,"content":"<p>Albrecht Weinberg, six weeks shy of his 100th birthday, sits upright and alert as he talks in German – with the occasional jokey English word – about his remarkable centenary of life.</p><p>We are sitting in his former schoolhouse in the town of Leer in <a href=\"https://www.irishtimes.com/tags/germany/\" target=\"_blank\">Germany</a>’s northwest region of East Friesland, near the North Sea coast and Dutch border. As the watery winter light dwindles outside, along with our conversation inside, Weinberg sighs and admits how, for more than 80 years, he has drifted off to sleep dreaming of his murdered family.</p><p>Each morning, despite his failing eyesight, one of the first things he sees is the fading number 116927. He rolls up his sleeve to display the tattoo on his arm – a  souvenir of <a href=\"https://www.auschwitz.org/en/\" target=\"_blank\">Auschwitz</a> and part of his body since April 1943.</p><p>“I only have to wash my face and it’s all there again,” he says.</p><p>Weinberg spent nearly two years in the camp from April 1943. Days before the liberation on January 27th, 1945, he was enlisted in the first of three so-called death marches he endured to other notorious Nazi camps. He survived them all: Dora-Mittelbau, Neuengamme and Bergen-Belsen. It was here that teenage diarist Anne Frank and her sister Margot died of starvation and typhus in the last days of the war in April 1945.</p><p>Four years older than Anne would be now, Weinberg remembers he was “living between the living and the bodies”, when the British soldiers arrived and liberated Bergen-Belsen, near Hanover. He is now one of a dwindling number of survivors of the Nazi extermination of European Jews. Those first 20 years of his life have haunted everything that followed. Even now, in his last years, it won’t let him go.</p><p>“I saw normal people in Auschwitz and I saw sadists there who killed people,” he said. “Why? I cannot explain to you.”</p><p>Eight decades on, the search for answers has taken on an added urgency – and not just for him. As the last survivors leave us, Europe is facing a new wave of extreme nationalism, flirtations with far-right politics and would-be fascist salutes. As memories fade, surveys show a plummeting level of information about the Holocaust. Facts are under attack.</p><p>A 200-year-old observation from German philosopher GWF Hegel sums up the situation. “What experience and history teach is this: that peoples and governments never have learned anything from history, or acted on principles deduced from it,” Hegel argued in a lecture delivered in Berlin in 1822. “Amid the pressure of great events,” he added, “a general principle gives no help.”</p><p>After Nazi Germany was conquered in May 1945, the pressure of its terrible events – including mass murder and mass theft – became clear, and great principles were adopted: never again, never forget.</p><p>The legal struts of these principles were forged in the Allied-run Nuremberg trials of surviving Nazis, including international law and human rights. Germany’s postwar Basic Law or constitution reflects this in its first paragraph: “Human Dignity is inviolable.”</p><p>Weinberg was 11 when he learned that his human dignity was very violable.</p><p>He grew up in a small village of Rhauderfehn, near the Dutch border, with a brother, sister and very different parents: Flora, maternal and observant, and Alfred, a first World War veteran and butcher who just wanted to be German.</p><p>Weeks after the Nazi takeover in 1933, locals renamed the town square Adolf Hitler Platz, raising a swastika flag daily and singing nationalist songs.</p><p>Weinberg was thrown out of school in 1936, aged 11, but the lowest point came three years later. In the early hours of November 9th, 1938, neighbours broke into the Weinberg house, trashed the interior and ordered the shocked family up and out. As locals cheered and chanted “dirty Jews”, Flora and her children, along with other local Jewish women and children, were locked up in a local slaughterhouse.</p><div><blockquote cite=\"\" data-style-direction=\"vertical\" data-style-justification=\"start\" data-style-alignment=\"unset\" data-style-inline=\"false\" data-style-wrap=\"nowrap\"><p>The hate we experienced in our youth, we carried that with us our whole lives</p></blockquote></div><p>The men – including Weinberg’s father Alfred – vanished and were interned in the Sachsenhausen concentration camp outside Berlin.</p><p>The so-called Kristallnacht, a countrywide Nazi-co-ordinated night of violence against German Jews, saw homes, businesses and places of worship destroyed, including the old synagogue in Leer. Local mayor Erich Drescher set fire to the   Torah, shouting: “We want to smoke the wolf from its lair.”</p><p>After that, locals boycotted the Weinberg family butcher. Alfred Weinberg, who had donated meat to poor local families at Christmas, was now “the Jew Weinberg”.</p><p>Like all Jews in East Friesland, the Weinbergs were ordered to leave on February 15th, 1940. Weinberg and his sister Friedel were sent to a farm in the country. Their older brother Dieter was arrested in February 1943. A month later, their parents vanished and most likely were murdered. In April of that year, Weinberg and Friedel were also detained and sent to Auschwitz.</p><p>Weinberg was 18, exhausted and starving, after a horrific rail journey over days in a sealed cattle wagon. Then the train halted and the wagon door was yanked open to a hellscape of skeletal people, barking dogs and barks of “Out! Out!”</p><p>“There were old people, people with handicaps, but no ladder or steps down, so they simply fell out and others trampled over them,” he says. “We had no idea what Auschwitz was.”</p><p>Of the 950 people in the transport, he was one of the few not sent directly to the gas chambers. Instead he became one of 35,000 slave labourers in the Buna-Monowitz labour camp, also known as Auschwitz III, where German chemicals companies produced synthetic rubber and petrol. The life expectancy in the labour camp was three months, and fewer than 5,000 survived it.</p><p>“Every day the guards would watch you,” Weinberg says, “and if you were particularly emaciated or had sores they would write down your  number and, next day, up the chimney you went.”</p><p>By the end of the war he weighed 29kg, “a skeleton covered in skin – more dead than alive”, but Weinberg was reunited with his sister Friedel. After two years of struggle in Germany, they emigrated to the United States and remained close.</p><p>They made their first trip back to Leer, with much hesitation, in 1985. Further trips followed, and they moved back permanently in 2012. Friedel died shortly thereafter. Neither had families, he said, because neither wanted to risk that their children might go through the same again.</p><p>“The hate we experienced in our youth, we carried that with us our whole lives,” he says. “I still just don’t understand it.”</p><p>No one does. Eight decades on – after countless books, films, documentaries, plays and studies – Auschwitz and the Holocaust continue to defy understanding.</p><p>The facts, lined up and given dates and attribution, do not explain it. Not even Rudolf Höss, the Nazi commandant of Auschwitz from 1940 to 1943, could do so. At the Nuremberg war crimes trials, a prosecutor asked him: “Did you yourself ever feel pity with the victims, thinking of your own family and children?” Höss replied: “Yes.”</p><p>So how, he was asked, was it possible for him to carry out these actions in spite of this?</p><p>“In view of all these doubts which I had,” he said, “the only decisive argument was the strict order and the reason given for it by Reichsführer [Heinrich] Himmler.”</p><p>Himmler was second-in-command to <a href=\"https://www.irishtimes.com/tags/adolf-hitler/\" target=\"_blank\">Adolf Hitler</a> and steered the so-called “Final Solution” to murder Europe’s Jewish population.</p><p>In 1943, with the industrialised murder machine up and running, Himmler told SS generals in an audience in Poznan: “We have the moral right, we were obligated to our people to kill this people which wanted to kill us.”</p><p>If the Auschwitz gas chambers and crematorium are the end point, the beginning came two decades previously in a Bavarian prison cell. There, Hitler wrote his Mein Kampf tract, denouncing Jews as a “tyrant over peoples” and “parasite upon the nations” who  tried “to exterminate the national intelligentsia”, ruin national economies and make people “ripe for the slave’s lot”.</p><p>His rabid views tapped into and exploited the widespread anti-Semitism of the era, shaped his political ideology and, once he was in power, were magnified by the Nazi propaganda machine through fear, repetition and volume.</p><p>After the 1938 pogrom against German Jews, Berlin-based Irish diplomat Charles Bewley filed a report to Dublin identifying with key Nazi claims: that Jews dominated the worlds of finance and entertainment and used their influence to instil what he called “anti-Christian, antipatriotic and communistic” thinking.</p><p>Their supposedly corrupting moral influence, wrote Bewley, helps explain the “elimination of the Jewish element from public life”.</p><p>One of the curious moments in Hitler’s confused political tract is how he simultaneously blames international Jewry for perpetrating a “big lie” on an unsuspected western populace – while flagging how he plans to do so himself.</p><p>“The broad masses of a nation are always more easily corrupted in the deeper strata of their emotional nature than consciously or voluntarily,” he wrote. “Thus in the primitive simplicity of their minds they more readily fall victims to the big lie than the small lie, since they themselves often tell small lies in little matters but would be ashamed to resort to large-scale falsehoods.”</p><p>Whether in scapegoating Jews for home-grown ills, or murdering the scapegoats in the name of German honour, the Nazis did so at a vast scale.</p><p>Even at his Nuremberg trial for mass murder, Rudolf Höss reported with a perverse pride of “improvements” he had made to expand the capacity of the “death chambers” – gas chambers concealed as showers – to kill 2,000 people at a time.</p><p>“I used Zyklon B which was a crystallised prussic acid which we dropped into the death chamber from a small opening,” he told the court. “It took from three to 15 minutes to kill the people in the death chamber, depending upon climatic conditions. We know when the people were dead because their screaming stopped.”</p><p>Höss returned to Auschwitz one last time in April 1947 – for his execution. Despite his own testimony, denial of what had happened there – that there  had even been gas chambers at Auschwitz – was already up and running.</p><div><blockquote cite=\"\" data-style-direction=\"vertical\" data-style-justification=\"start\" data-style-alignment=\"unset\" data-style-inline=\"false\" data-style-wrap=\"nowrap\"><p>It’s possible these views were always there and never went away, but are now showing themselves far more openly</p></blockquote></div><p>In 2000, revisionist British historian David Irving failed in his libel case against US historian Deborah Lipstadt for calling Irving a Holocaust denier over his questioning of the existence of the Auschwitz gas chambers.</p><p>But that phenomenon – once the preserve of obscure publishing companies, crank historians and shabby back-room talks – is now thriving online.</p><p>Two years ago, a United Nations report found that 16 per cent of Holocaust-related content on the big social-media platforms denies or distorts the fundamental facts.</p><p>Given that social media is where many people inform themselves, such numbers are alarming. News that <a href=\"https://www.irishtimes.com/tags/meta/\" target=\"_blank\">Meta</a> founder <a href=\"https://www.irishtimes.com/tags/mark-zuckerberg/\" target=\"_blank\">Mark Zuckerberg</a>, himself from a Jewish family, is <a href=\"https://www.irishtimes.com/technology/big-tech/2025/01/07/meta-to-end-third-party-fact-checking-programme/\" target=\"_blank\">rolling back content moderation</a> means the floodgates on Holocaust denial may have just been opened.</p><p>This week the Conference of Jewish Material Claims against Germany, often referred to as the <a href=\"https://www.claimscon.org/rememberthis/\" target=\"_blank\">Claims Conference</a>, launched a new campaign on <a href=\"https://www.irishtimes.com/tags/instagram/\" target=\"_blank\">Instagram</a> with survivors – including Albrecht Weinberg – telling their stories directly.</p><p>“We’re living in an era where social media offers young people optional truth, with no common ground on facts,” said Dr Ruth Kinet, Claims Conference spokeswoman in Berlin. “We are hoping to push back against this ... [When] a survivor speaks personally to a young person, it offers a particular form of intimacy between the user and their smartphone screen.”</p><p>Uncertainty about the future of facts is compounded by wider questions about the next generation of Holocaust education: its form, its educators and its audience. Put simply: in an era of “too-long-didn’t-read”, is it realistic to expect anyone to grasp or maintain an understanding of a complex period such as the Holocaust – even on such important anniversaries as this?</p><p>Many historians see Germany and Europe are at an in-between moment.</p><p>Dr UW Neumärker is director of the <a href=\"https://www.stiftung-denkmal.de/en/memorials/memorial-to-the-murdered-jews-of-europe/\" target=\"_blank\">memorial</a> in Berlin to the murdered Jews of Europe, which marks its 20th anniversary this year and attracts 300,000 people annually to its underground museum. Scores more visit the striking open-air stone memorial above, beside the Brandenburg Gate.</p><p>Such memorials and anniversary events remain important places and rituals, he says, but for many they have become ritualised.</p><p>After 80 years – two full generations on – he sees a struggle to reduce historically complex eras such as the Holocaust to bite-sized, TikTok-friendly posts.</p><p>That medium is ideal, however, for simplistic history, populism, xenophobia and anti-Semitism. Even in Germany, he says, social media is smashing taboos in public discourse.</p><p>Seven years ago a leader of the far-right Alternative for Germany (AfD) described the Nazi era as a splash of “bird shit” on the country’s otherwise glorious history. Next month, in federal elections, the party is likely to attract one in five voters.</p><p>“It’s possible these views were always there and never went away, but are now showing themselves far more openly,” said Dr Neumärker. “I remain firmly convinced of the need to remind people of those murdered in the name of Germany. But my survivor friends are very resigned and say they have never been so depressed at what’s happening.”</p><div><blockquote cite=\"\" data-style-direction=\"vertical\" data-style-justification=\"start\" data-style-alignment=\"unset\" data-style-inline=\"false\" data-style-wrap=\"nowrap\"><p>Someone has to open their mouth finally, in particular politicians, and ask people here: do you really want things again like they once were?</p></blockquote></div><p>Among those concerned survivors is Anita Lasker-Walfish, whose ability to play the cello saved her life in Auschwitz. Now 99 and in poor health, she has passed the torch to her Berlin-based daughter Maya, a therapist, author and documentary film-maker. After decades of public speaking and education, she describes her mother as “deeply concerned and upset” about what is going on.</p><p>“Sometimes she questions whether all her work meant anything,” she said. “My mother has nothing against Germans, but she has a lot against ignorance.”</p><p>As a second-generation representative, Maya Lasker-Walfish spent decades living with the silence and taboos of survival. Now she sees the world at a historical tipping point and senses a “wish to put a full stop, as the [survivor] generation is no longer in the world”.</p><p>Her mother’s life motto was to hope for the best and prepare for the worst. “We are not prepared now for the large denial everywhere about what happened, but I make use of that as best I can  to engage and be more constructive,” said Maya, author of two books and a documentary. Like her mother, she is wary of official events around round-number dates and deeply concerned about political developments across Europe and the US. Her thoughts on <a href=\"https://www.irishtimes.com/tags/elon-musk/\" target=\"_blank\">Elon Musk</a>’s outstretched arm at Donald Trump’s inauguration?</p><p>“He knows what he’s doing,” she said. “Nazis are still here, it’s not history, whatever history is.”</p><p>Back in East Friesland, Albrecht Weinberg agrees that he feels history creeping up on him again in the present. It was there when someone poured paint over the brass plaques or Stolpersteine for his dead relatives, laid in the ground before the former family home. It was there last year when the town’s old Jewish graveyard in Leer was desecrated with swastikas.</p><p>“That was a second Holocaust for me, I said: ‘Get my suitcase; I have to leave again,’” he says.</p><p>And history was there again when, earlier this month, the AfD distributed fake plane tickets to foreign nationals living in southern Germany.</p><p>Weinberg remembers a group of men at the door in 1933, handing his father a handmade cardboard ticket: “Free Ticket to Palestine.”</p><p>“Someone has to open their mouth finally, in particular politicians, and ask people here: do you really want things again like they once were?”</p>","contentLength":16102,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1iag4wp/i_saw_normal_people_in_auschwitz_and_i_saw/"},{"title":"Photos from protests in Athens, Greece regarding the 57 deaths in train crash.","url":"https://www.reddit.com/r/europe/comments/1iafebs/photos_from_protests_in_athens_greece_regarding/","date":1737900457,"author":"/u/SpyrosDemir","guid":569,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"100.000 students protesting against corruption in Serbia","url":"https://www.reddit.com/r/europe/comments/1iadmf7/100000_students_protesting_against_corruption_in/","date":1737895484,"author":"/u/RoyalChris","guid":570,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Trump aims to cut US force in Europe by 20,000, compel subsidies from allies, Italian report says","url":"https://www.stripes.com/theaters/europe/2025-01-24/trump-europe-troop-cuts-16590074.html","date":1737892710,"author":"/u/UpgradedSiera6666","guid":564,"unread":true,"content":"<div><img src=\"https://www.stripes.com/incoming/3bzvrs-270125cutsphoto02.jpg/alternates/LANDSCAPE_910/270125CUTSphoto02.jpg\" alt=\"A US military convoy on a road.\"><div><p>\n\t\t\t\tU.S. soldiers assigned to the 2nd Cavalry Regiment conduct a convoy during an exercise at the Joint Multinational Readiness Center in Hohenfels, Germany, in January 2023. President Donald Trump aims to redeploy 20,000 American troops from Europe, Italy's leading news agency said Jan. 23, 2025. It’s unclear what units would be targeted for cuts. (Micah Wilson/U.S. Army)\n\t\t\t</p></div></div><p>President Donald Trump wants to withdraw 20,000 U.S. troops from Europe and demand a subsidy from allies to pay for the remaining American military presence on the Continent, Italy’s leading news agency reported this week.</p><p>On Thursday, ANSA said Trump has been delivering his troop-cut message to European leaders since taking office Monday.</p><p>Trump “would like financial contributions from European countries because these soldiers are a deterrent, and the costs cannot be borne solely by American taxpayers,” a European diplomat told the news service.</p><p>The Pentagon did not immediately respond Friday to questions about the report.</p><p>Trump has long advocated for a smaller force in Europe, especially in Germany. At the end of his first term, he ordered 12,000 troops out of Germany, with some to be relocated to other areas in Europe and others back to the U.S. </p><div><img src=\"https://www.stripes.com/incoming/brpdml-270125cutsphoto01.jpg/alternates/LANDSCAPE_910/270125CUTSphoto01.jpg\" alt=\"M1A2 Tanks in formation.\"><div><p>\n\t\t\t\tAmerican M1A2 Abrams tanks take up strategic positions during a live fire exercise in Grafenwoehr, Germany, in 2020. President Donald Trump wants to withdraw 20,000 U.S. troops from Europe, according to an Italian news agency report. (Gregory Stevens/U.S. Army National Guard)\n\t\t\t</p></div></div><p>The plan was never put into effect and was later canceled by former President Joe Biden. However, Trump’s new Pentagon team has made clear that the U.S. needs to play a smaller military role in Europe and shift capabilities to the Pacific to counter a growing threat from China.</p><p>The U.S. has about 65,000 troops permanently stationed in Europe and thousands more there on a rotational basis. Since Russia’s 2022 full-scale invasion of Ukraine, the overall force level has been in the range of 100,000 troops.</p><p>It’s unclear what units would be targeted for cuts, but the <a href=\"https://www.stripes.com/theaters/europe/2025-01-22/trump-pentagon-china-europe-16566249.html\" target=\"_blank\">rotation of tank brigades to NATO’s eastern flank</a>, a linchpin of allied deterrence since the 2014 Russian invasion of Ukraine, could bein Trump’s crosshairs.</p><p>Newly installed defense officials have previouslyindicated that such rotations could be an area where the Pentagon could achieve savings. </p><p>Other potential targets are assets that would be of value in deterring China in the Pacific, such as warships,&nbsp;long-range artillery and Patriot missile defense units.&nbsp;</p><p>On Thursday, Trump told an audience of global leaders gathered at an economic forum in Davos, Switzerland, that the current NATO threshold of spending 2% of gross domestic product on defense is insufficient.</p><p>“I’m also going to ask all NATO nations to increase defense spending to 5% of GDP, which is what it should have been years ago,” Trump said, speaking virtually from Washington.</p><p>Trump didn’t directly say the 5% standard would apply to the United States. Washington would have to significantly boost its own defense spending to hit the 5% mark. </p><p>Currently, the U.S. spends about 3.4% of GDP on the defense budget. Going to 5% would push the Pentagon budget of roughly $842 billion to more than $1 trillion.</p>","contentLength":3287,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1iacr29/trump_aims_to_cut_us_force_in_europe_by_20000/"},{"title":"Donald Trump ridicules Denmark and insists US will take Greenland","url":"https://www.ft.com/content/a935f6dc-d915-4faf-93ef-280200374ce1","date":1737892092,"author":"/u/Affectionate_Cat293","guid":571,"unread":true,"content":"<div aria-hidden=\"true\" data-offer-type=\"print\"><ul></ul></div>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1iackpm/donald_trump_ridicules_denmark_and_insists_us/"}],"tags":["news","reddit"]}