{"id":"3MxaK2JpEReqG7uUTfHxTELDZk2vRYBtH7tbJ586soFdUhL","title":"Coding Horror","displayTitle":"Dev - Coding Horror","url":"https://blog.codinghorror.com/rss/","feedLink":"https://blog.codinghorror.com/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":1,"items":[{"title":"Stay Gold, America","url":"https://blog.codinghorror.com/stay-gold-america/","date":1736235724,"author":"Jeff Atwood","guid":302,"unread":true,"content":"<p>We are at an unprecedented point in American history, and I'm concerned we may lose sight of the <a href=\"https://en.wikipedia.org/wiki/American_Dream?ref=blog.codinghorror.com\" rel=\"noreferrer\">American Dream</a>:</p><p>We must act now to keep the dream alive. Our family made <strong>eight $1 million donations</strong> to nonprofit groups working to support those most currently in need:</p><ul><li><a href=\"https://teamrubiconusa.org/?ref=blog.codinghorror.com\" rel=\"noreferrer\">Team Rubicon</a> – Mobilizing veterans to continue their service, leveraging their skills and experience to help Americans prepare, respond, and recover from natural disasters.</li><li><a href=\"https://childrenshungerfund.org/?ref=blog.codinghorror.com\" rel=\"noreferrer\">Children's Hunger Fund</a> – Provides resources to local churches in the United States and around the world to meet the needs of impoverished community members.</li><li><a href=\"https://pen.org/?ref=blog.codinghorror.com\">PEN America</a> – Defends writers against censorship and abuse, supports writers in need of emergency assistance, and amplifies the writing of incarcerated prisoners. (One of my personal favorites; I've seen the power of writing transform our world <a href=\"https://www.weforum.org/stories/2016/03/10-novels-that-changed-the-world/?ref=blog.codinghorror.com\" rel=\"noreferrer\">many times</a>.)</li><li><a href=\"https://www.thetrevorproject.org/?ref=blog.codinghorror.com\" rel=\"noreferrer\">The Trevor Project</a> – Working to change hearts, minds, and laws to support the lives of young adults seeking acceptance as fellow Americans.</li><li><a href=\"https://www.firstgenerationinvestors.com/?ref=blog.codinghorror.com\" rel=\"noreferrer\">First Generation Investors</a> –Introduces high school students in low-income areas to the fundamentals of investing, providing them real money to invest, encouraging long-term wealth accumulation and financial literacy among underserved youth.</li><li><a href=\"https://www.globalrefuge.org/?ref=blog.codinghorror.com\" rel=\"noreferrer\">Global Refuge</a> – Supporting migrants and refugees from around the globe, in partnership with community-based legal and social service providers nationwide, helping rebuild lives in America.</li><li><a href=\"https://www.plannedparenthood.org/?ref=blog.codinghorror.com\" rel=\"noreferrer\">Planned Parenthood</a> – Provides essential healthcare services and resources that help individuals and families lead healthier lives.</li></ul><p>I encourage every American to<strong> contribute soon, however you can, to organizations you feel are </strong><a href=\"https://www.charitynavigator.org/?ref=blog.codinghorror.com\" rel=\"noreferrer\"></a>those most currently in need here in America.</p><p>We must alsowork toward deeper changes that will take decades to achieve. Over the next five years,<strong> my family pledges half our remaining wealth </strong>towards long term efforts ensuring that all Americans continue to have access to the American Dream. </p><p>I never thought my family would be able to do this. My parents are of hardscrabble rural West Virginia and rural North Carolina origins. They barely managed to claw their way to the bottom of the middle class by the time they ended up in Virginia. Unfortunately, due to the demons passed on to them by their parents, my father was an alcoholic and my mother participated in the drinking. She ended up divorcing my father when I was 16 years old. It was only after the divorce that my parents were able to heal themselves, heal their only child, and stop the drinking, which was so destructive to our family. If the divorce hadn't forced the issue, alcohol would have inevitably destroyed us all. <p>My parents may not have done everything right, but they both unconditionally loved me. </p><strong>They taught me how to fully, deeply receive love, and the profound joy of reflecting that love upon everyone around you. </strong></p><p>I went on to attend public school in Chesterfield County, Virginia. In 1992 I graduated from the University of Virginia, founded by <a href=\"https://en.wikipedia.org/wiki/Thomas_Jefferson?ref=blog.codinghorror.com\">Thomas Jefferson</a>.</p><p>During college, I worked at Safeway as a part-time cashier, earning the <a href=\"https://www.dol.gov/agencies/whd/minimum-wage/history?ref=blog.codinghorror.com\" rel=\"noreferrer\">federal minimum wage</a>, scraping together whatever money I could through government Pell grants, scholarships, and other part-time work to pay my college tuition. Even with <a href=\"https://www.salliemae.com/blog/in-state-vs-out-of-state-tuition/?ref=blog.codinghorror.com\" rel=\"noreferrer\">lower in-state tuition</a>, it was rocky. Sometimes I could barely manage tuition payments. And that was in 1992, when tuition was only $3,000 per year. It is now $23,000 per year. <a href=\"https://educationdata.org/average-cost-of-college-by-year?ref=blog.codinghorror.com\" rel=\"noreferrer\">College tuition</a> at a state school increased by 8 times over the last 30 years. These <a href=\"https://uvaro.com/blog/college-costs-vs-inflation-1982-present?ref=blog.codinghorror.com\" rel=\"noreferrer\">huge cost increases</a> for healthcare, education, and housing are not compatible with the American Dream.</p><p>Programmers all over the world helped make an American Dream happen <a href=\"https://web.archive.org/web/20080703183923/http://stackoverflow.com/\" rel=\"noreferrer\">in 2008</a> when we built <a href=\"https://stackoverflow.com/?ref=blog.codinghorror.com\" rel=\"noreferrer\">Stack Overflow</a>, a Q&amp;A website for programmers creating a shared <a href=\"https://creativecommons.org/licenses/by-sa/4.0/deed.en?ref=blog.codinghorror.com\" rel=\"noreferrer\">Creative Commons</a> knowledge base for the world. We did it democratically, because that's the <a href=\"https://en.wikipedia.org/wiki/American_way?ref=blog.codinghorror.com\" rel=\"noreferrer\">American way</a>. We voted to rank questions and answers, and held elections for community moderators using <a href=\"https://en.m.wikipedia.org/wiki/Ranked-choice_voting_in_the_United_States?ref=blog.codinghorror.com\" rel=\"noreferrer\">ranked choice voting</a>. We built a  – of the programmers, by the programmers, for the programmers. <a href=\"https://www.forbes.com/sites/vijaygurbaxani/2021/06/08/the-18-billion-acquisition-of-stack-overflow-aims-to-turbocharge-the-worlds-software-knowhow/?ref=blog.codinghorror.com\" rel=\"noreferrer\">It worked</a>. <p>With the guidance of my co-founder </p><a href=\"https://en.wikipedia.org/wiki/Joel_Spolsky?ref=blog.codinghorror.com\" rel=\"noreferrer\">Joel Spolsky</a>, I came to understand that the digital democracy of Stack Overflow was not enough. We must be brave enough to actively, openly share love with each other. That became the foundation for <a href=\"https://discourse.org/?ref=blog.codinghorror.com\">Discourse</a>, a free, open source tool for constructive, empathetic community discussions that are also Creative Commons. We can disagree in those discussions because Discourse empowers communities to <a href=\"https://frameshiftconsulting.com/2017/09/10/the-intolerable-speech-rule-the-paradox-of-tolerance-for-tech-companies?ref=blog.codinghorror.com\" rel=\"noreferrer\">set boundaries the community agrees on</a>, providing tools to democratically govern and strongly moderate by enforcing these boundaries. <strong>Digital democracy ,</strong> for everyone.</p><p>In order for digital democracy to work, we need to see each other through our screens.</p><p>I've always felt Stack Overflow and Discourse are <a href=\"https://www.bcorporation.net/en-us/?ref=blog.codinghorror.com\" rel=\"noreferrer\">projects for the public good</a> that happen to be <a href=\"https://en.wikipedia.org/wiki/Company?ref=blog.codinghorror.com\" rel=\"noreferrer\">corporations</a>. I probably couldn't have accomplished this in any other country, and I was rewarded handsomely for a combination of hard work and good luck. That's what the <a href=\"https://www.britannica.com/topic/American-Dream?ref=blog.codinghorror.com\" rel=\"noreferrer\">American Dream</a> promises us. </p><p>I recently attended a theater performance of <a href=\"https://en.wikipedia.org/wiki/The_Outsiders_(novel)?ref=blog.codinghorror.com\">The Outsiders</a> at my son's public high school. All I really knew was the famous <a href=\"https://www.youtube.com/watch?v=f46JMzVzSB4&amp;ref=blog.codinghorror.com\" rel=\"noreferrer\">\"stay gold\" line</a> from the 1983 movie adaptation. But as I sat there in the audience among my neighbors, watching the complete story acted out in front of me by these teenagers, I slowly realized what staying gold actually meant: <a href=\"http://blog.asjournal.org/the-american-dream-reconsidered-the-outsiders-1967/?ref=blog.codinghorror.com\" rel=\"noreferrer\"> the American Dream</a>. </p><p>In the printed program, the director wrote:</p><blockquote>This play is a reminder that strength lies not just in overcoming hardships but in staying true to ourselves and lifting up those around us. <p>We hope you feel the raw emotions, sense the camaraderie, and </p><strong>connect with the enduring themes of resilience, empathy, and unity</strong>. Whether you've read this story recently, long ago, or not at all, I hope you are able to find inspiration in the strength and passion of youth. Thank you for being part of this journey with us.<a href=\"https://poets.org/poem/nothing-gold-can-stay?ref=blog.codinghorror.com\">Stay gold</a>.</blockquote><blockquote>We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.</blockquote><p>But the American Dream is not always available to every American. Its meaning can be distorted. Jimi Hendrix <a href=\"https://www.newyorker.com/culture/cultural-comment/rewinding-jimi-hendrixs-national-anthem?ref=blog.codinghorror.com\" rel=\"noreferrer\">captured this distortion</a> so eloquently in his rendition of our national anthem. </p><p>We are still trying to live up to those ideals today. In November 2024, <a href=\"https://en.wikipedia.org/wiki/2024_United_States_presidential_election?ref=blog.codinghorror.com\" rel=\"noreferrer\">enough of us voted</a> for people who interpret the dream in a way that I don't understand.</p><p>I think many of the Americans who did vote are telling us they no longer believe our government is effectively <em>keeping America fair for everyone</em>. Our status as the <a href=\"https://thefulcrum.us/ethics-leadership/democracy-index?ref=blog.codinghorror.com\" rel=\"noreferrer\">world's leading democracy</a> is in question. We should make it easier for more eligible Americans to vote, such as <a href=\"https://www.actforamerica.org/act-now/Make-Election-Day-a-National-Holiday?ref=blog.codinghorror.com\" rel=\"noreferrer\"></a><a href=\"https://tracker.votingrightslab.org/issues/universal-mailed-ballots?ref=blog.codinghorror.com#issues_map\" rel=\"noreferrer\"></a><a href=\"https://fairvote.org/our-reforms/ranked-choice-voting/?ref=blog.codinghorror.com\" rel=\"noreferrer\"></a> so all votes carry more weight. We should also strengthen institutions keeping democracy fair for everyone, such as state and local election boards, as well as the Federal Election Commission.<p>It was only after I attained the dream that I was able to </p><a href=\"https://www.youtube.com/watch?v=QPKKQnijnsM&amp;ref=blog.codinghorror.com\" rel=\"noreferrer\">fully see how many Americans have so very little</a>. This much wealth starts to unintentionally distance my family from other Americans. I no longer bother to look at how much items cost, because . We don't have to think about all these things that are challenging or unreachable for so many others. The more wealth you attain, the more unmistakably clear it becomes how unequal life is for so many of us.<p>Even with the wealth I have, I can't imagine what it would feel like </p><a href=\"https://www.theatlantic.com/politics/archive/2024/11/democrats-harris-billionaire-mistake/680779/?ref=blog.codinghorror.com\" rel=\"noreferrer\">to be a billionaire</a><strong>It is, for lack of a better word, </strong><a href=\"https://www.pewresearch.org/social-trends/2020/01/09/trends-in-income-and-wealth-inequality/?ref=blog.codinghorror.com\" rel=\"noreferrer\"></a></p><p>In 2012, the top 1% of Americans held 24% of our country's wealth. By 2021, the top 1% of Americans held 30%.  So many have so little, while a tiny few have massive, wildly disproportionate wealth, which keeps growing. Now the global top 1% hold nearly twice as much wealth <a href=\"https://www.oxfam.org/en/press-releases/richest-1-bag-nearly-twice-much-wealth-rest-world-put-together-over-past-two-years?ref=blog.codinghorror.com\" rel=\"noreferrer\">as the rest of the world combined</a>.<p>I grew up poor in America, inspired by the promise of the American Dream that I could better myself and my family by building things </p><a href=\"https://credo.library.umass.edu/view/full/mums312-b203-i031?ref=blog.codinghorror.com\" rel=\"noreferrer\">that </a>:</p><blockquote>Work is service, not gain. The object of work is life, not income. The reward of production is plenty, not private fortune. We should measure the prosperity of a nation not by the number of millionaires, but by<strong> the absence of poverty, the prevalence of health, the efficiency of the public schools, </strong>and the number of people who can and do read worthwhile books</blockquote><blockquote>More than 99% of my wealth will go to philanthropy during my lifetime or at death.</blockquote><p>I admire Buffett, but even having only a tiny fraction of his $325 billion fortune, to me this pledge was incomplete. When would this wealth be transferred? </p><p>November 5th <a href=\"https://en.wikipedia.org/wiki/2024_United_States_presidential_election?ref=blog.codinghorror.com\" rel=\"noreferrer\">raised the stakes</a>. It is now time to allocate  I was so fortunate to be dealt within the next five years not just for my own family, but for all my fellow Americans. </p><p>Our government seems to be slower and slower at delivering change due to the <a href=\"https://carnegieendowment.org/research/2023/09/polarization-democracy-and-political-violence-in-the-united-states-what-the-research-says?lang=en&amp;ref=blog.codinghorror.com\" rel=\"noreferrer\">increased polarization of our two party system</a>. The last meaningful constitutional amendment we've managed to pass in the last 60 years was the 26th amendment in 1971, lowering the voting age to 18 and giving more people a voice in our democracy. </p><p>I've always loved <a href=\"https://blog.codinghorror.com/im-loyal-to-nothing-except-the-dream/\" rel=\"noreferrer\">the ideals</a> behind the American Dream, though we continually struggle to live up to them. They are worth fighting for, even if it means making <a href=\"https://blogs.loc.gov/loc/2020/07/remembering-john-lewis-the-power-of-good-trouble/?ref=blog.codinghorror.com\" rel=\"noreferrer\">\"good trouble\"</a>. We must come together and believe in our shared American Dream so deeply that we can improve our democracy... but <a href=\"https://www.rogerebert.com/reviews/great-movie-the-night-of-the-hunter-1955?ref=blog.codinghorror.com\" rel=\"noreferrer\">which dream?</a></p><p>The American Dream contains the <a href=\"https://www.goodreads.com/quotes/376797-returning-hate-for-hate-multiplies-hate-adding-deeper-darkness-to?ref=blog.codinghorror.com\" rel=\"noreferrer\">path of hate</a>, and the <a href=\"https://kinginstitute.stanford.edu/king-papers/documents/loving-your-enemies-sermon-delivered-dexter-avenue-baptist-church?ref=blog.codinghorror.com\" rel=\"noreferrer\">path of love</a>. Throughout our history, one hand is always fighting the other. Which path are we choosing?</p><blockquote>Our family pledges <strong>half our remaining wealth</strong> toward an <strong>American Dream founded on love</strong>.</blockquote><p>Here are some starting points for longer term efforts:</p><ul><li>We can support organizations making it easier for Americans to vote for a new Congress in two years and a new president in four years. My concern is damage to our democratic institutions may happen so quickly that our votes could matter even less within the coming years.</li><li>We could found a new organization loosely based on the original <a href=\"https://en.wikipedia.org/wiki/RAND_Corporation?ref=blog.codinghorror.com\" rel=\"noreferrer\">RAND Corporation</a>, but modernized like <a href=\"https://www.leverforchange.org/?ref=blog.codinghorror.com\" rel=\"noreferrer\">Lever for Change</a>. We can empower the best and brightest to determine a realistic, achievable path toward preserving the American Dream for  working within the current system or outside it.</li><li>We can start with change in our local communities. Vote in your own city, county, and state elections. Support local independent journalism and media. Find a local organization doing work you admire, ask what they need, and help them meet those needs. Listen to the stories of fellow volunteers, listen to the stories of the people you’re serving – that is the heart of Democracy.</li></ul><p>We've already completed the eight $1 million donations <a href=\"https://blog.codinghorror.com/stay-gold-america/#\" rel=\"noreferrer\">listed above</a> to help those most immediately in need. Within the next five years, half of our family wealth will support longer term efforts. There is no single solution, so let's work together. I will gladly advise and working towards the same goal.</p><p>Please join us in <strong>Sharing the American Dream</strong>:</p><ol><li>Support organizations you feel are <a href=\"https://www.charitynavigator.org/?ref=blog.codinghorror.com\" rel=\"noreferrer\">effectively helping</a> those most in need across America right now.</li><li>Within the next five years, also contribute <strong>public dedications of time or funds towards longer term efforts </strong>to keep the American Dream fair and attainable for all our children.</li></ol><small>(I could not have done this without the support of my partner Betsy Burton and the rest of my family. I'd also like to thank <a href=\"https://en.wikipedia.org/wiki/Steve_McConnell?ref=blog.codinghorror.com\">Steve McConnell</a>, whose writing inspired me to start this blog in 2004. So many people from all walks of life generously shared their feedback to improve this post. <a href=\"https://blog.codinghorror.com/on-the-meaning-of-coding-horror/\">We wrote it together</a>. Thank you all.)</small>","contentLength":11588,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}]}