{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Russia must withdraw its troops to February 2022 line, Zelenskyy says","url":"https://www.pravda.com.ua/eng/news/2025/02/15/7498475/","date":1739623452,"author":"/u/Silly-avocatoe","guid":638,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1iq0kli/russia_must_withdraw_its_troops_to_february_2022/"},{"title":"'Time has come': Zelenskyy demands creation of 'armed forces of Europe' - The Times of India","url":"https://timesofindia.indiatimes.com/world/europe/time-has-come-zelenskyy-demands-creation-of-armed-forces-of-europe/articleshow/118276188.cms","date":1739620556,"author":"/u/edw_meow","guid":635,"unread":true,"content":"<div>Ukrainian President Volodymyr Zelenskyy on Saturday called for creating a unified “armed forces of Europe,” arguing that the war between Ukraine and Russia already laid the groundwork for such a force. Speaking at the Munich Security Conference, Zelenskyy warned that Europe must prepare for the possibility that America “might say no to Europe on issues that threaten it”.<p>“I really believe that time has come,” he said, adding that “the armed forces of Europe must be created.” </p>He pointed out that while European leaders have long discussed the need for greater military independence, Ukraine’s three year full scale war has proven the necessity of such a force.The Ukrainian leader also referred to the phone call between former US President Donald Trump and Russian President Vladimir Putin, after which Trump suggested a possible peace negotiation. While Trump later reassured Zelenskyy that Ukraine would be included in the talks, Zelenskyy remained sceptical of any deals made without direct Ukrainian involvement.<p>“Ukraine will never accept deals made behind our backs without our involvement, and the same rule should apply to all of Europe,\" he said. “A few days ago, President Trump told me about his conversation with Putin. Not once did he mention that America needs Europe at the table. That says a lot.”</p>Addressing Nato secretary-general Mark Rutte, he emphasised that his proposal was not intended to replace Nato but rather to ensure that Europe plays an equal role alongside the US in transatlantic security.<p>Earlier, in his address to the conference, Zelenskyy accused US, including the Biden administration of not viewing Ukraine as a Nato member.</p></div>","contentLength":1687,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ipzu0h/time_has_come_zelenskyy_demands_creation_of_armed/"},{"title":"JD Vance breaks taboo by meeting with leader of Germany’s far-right party","url":"https://www.theguardian.com/us-news/2025/feb/14/jd-vance-alice-weidel-meeting-germany-far-right","date":1739592619,"author":"/u/Infidel8","guid":639,"unread":true,"content":"<p>At the meeting in Munich on Friday, the US vice-president and AfD leader, Alice Weidel, reportedly discussed the war in Ukraine, German domestic politics and the so-called , or “firewall against the right”, that prevents ultra-nationalist parties like AfD from joining ruling coalitions in <a href=\"https://www.theguardian.com/world/germany\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Germany</a>.</p><p>Vance did not meet with Olaf Scholz, the German chancellor who should be among the US’ key partners in negotiations with Russia over the future of the war in Ukraine. “We don’t need to see him, he won’t be chancellor long,” one former US official told Politico of the Vance team’s approach.</p><p>Addressing the Munich security conference earlier on Friday, Vance admonished Europe’s leaders for refusing to work with their far-right parties.</p><p>“If you’re running in fear of your own voters, there is nothing America can do for you,” said Vance. “You need democratic mandates to accomplish anything of value in the coming years.”</p><p>The move sent shockwaves through German political circles as the <a href=\"https://www.theguardian.com/us-news/trump-administration\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Trump administration</a> appeared to be making a large bet on some of the continent’s most toxic parties in opposition to the sitting governments in the UK, Germany and other major allies.</p><p>“I expressly reject what US Vice President Vance said at the Munich Security Conference,” said Olaf Scholz, the German chancellor, in a post on X. “From the experience of National Socialism, the democratic parties in Germany have a common consensus: this is the firewall against extreme right-wing parties.”</p><figure data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.NewsletterSignupBlockElement\"><a data-ignore=\"global-link-styling\" href=\"https://www.theguardian.com/us-news/2025/feb/14/jd-vance-alice-weidel-meeting-germany-far-right#EmailSignup-skip-link-9\">skip past newsletter promotion</a><p tabindex=\"0\" aria-label=\"after newsletter promotion\" role=\"note\">after newsletter promotion</p></figure><p>German courts have ruled that the AfD can be classified as a suspected threat to democracy, paving the way for the country’s domestic intelligence agency to spy on the opposition party.</p><p>In a speech likely to further drive a wedge between the US and Europe as they struggle to find a single policy on the war in Ukraine, Vance also accused the European leaders of “hiding behind ugly Soviet-era words like ‘misinformation’ and ‘disinformation’”.</p><p>“Listening to that speech, they try to pick a fight with us and we don’t want to pick a fight with our friends,” said Kaja Kallas, the EU’s foreign policy chief, at the Munich event.</p><p>Boris Pistorius, the German defense minister, said he couldn’t let the speech go without comment.</p><p>“If I understood him correctly, he is comparing conditions in parts of Europe with those in authoritarian regimes. That is unacceptable, and it is not the Europe and not the democracy in which I live and am currently campaigning,” he said.</p>","contentLength":2556,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1iptbgj/jd_vance_breaks_taboo_by_meeting_with_leader_of/"},{"title":"Trump unsure why Modi and Musk met during the Indian PM’s U.S. visit","url":"https://nationalpost.com/news/world/trump-musk-modi-us-visit","date":1739590822,"author":"/u/4920185","guid":634,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ipstaj/trump_unsure_why_modi_and_musk_met_during_the/"},{"title":"Ukraine has low chance of survival without US backing, Zelenskiy says on NBC","url":"https://www.reuters.com/world/europe/ukraine-has-low-chance-survival-without-us-backing-zelenskiy-says-nbc-2025-02-14/","date":1739578160,"author":"/u/die_mannequin","guid":632,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ipoxy3/ukraine_has_low_chance_of_survival_without_us/"},{"title":"Mexico threatens to escalate US gunmakers lawsuit with terror charges","url":"https://www.theguardian.com/world/2025/feb/14/mexico-gunmakers-lawsuit-terror","date":1739573800,"author":"/u/Infidel8","guid":633,"unread":true,"content":"<p>Mexico’s president has warned US gunmakers they could face fresh legal action as accomplices of organized crime if Washington designates the country’s cartels as terrorist groups.</p><p>The Latin American country, which is under mounting pressure from <a href=\"https://www.theguardian.com/us-news/donaldtrump\" data-link-name=\"in body link\">Donald Trump</a> to curb illegal drug smuggling, wants its neighbor to crack down on firearms trafficking in the other direction.</p><p>“If they declare these criminal groups as terrorists, then we’ll have to expand our US lawsuit,” Mexico’s president, <a href=\"https://www.theguardian.com/world/claudia-sheinbaum\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Claudia Sheinbaum</a>, said at a daily press conference.</p><p>A new charge could include alleged complicity of gunmakers with terror groups, she said.</p><p>“The lawyers are looking at it, but they could be accomplices,” Sheinbaum warned.</p><p>She said the US justice department itself has recognized that “74% of the weapons” used by criminal groups in Mexico come from north of the border.</p><p>On Thursday, <a href=\"https://www.nytimes.com/2025/02/12/us/politics/state-dept-terrorist-designation.html\" data-link-name=\"in body link\">the New York Times reported </a>that the US state department plans to classify criminal groups from Mexico, Colombia, El Salvador and Venezuela as “terrorist organizations”.</p><p>Trump signed an executive order on 20 January creating a process for such a designation, saying that the cartels “constitute a national security threat beyond that posed by traditional organized crime”.</p><p>Mexico says that between 200,000 and 750,000 weapons manufactured by US gunmakers are smuggled across the border from the United States every year, many of which are found at crime scenes.</p><p>The suit was thrown out based on a lack of jurisdiction, though Mexico said at the time that its lawsuit against two manufacturers, Smith and Wesson and Interstate Arms, would continue.</p><p>Another suit brought in the border state of Arizona seeks sanctions against dealers that sold guns used in serious crimes over the border.</p><p>Mexico tightly controls firearm sales, making them practically impossible to obtain legally.</p><p>Even so, drug-related violence led to the deaths of about 480,000 people in Mexico since the government deployed the army to combat trafficking in 2006, according to official figures.</p><p>Earlier this month, Sheinbaum angrily rejected an accusation by the United States that her government was allied with drug cartels.</p><p>“We categorically reject the slander made by the White House against the Mexican government about alliances with criminal organizations,” the president wrote on social platform X at the time.</p><p>“If there is such an alliance anywhere, it is in the US gun shops that sell high-powered weapons to these criminal groups,” she added.</p><p>Tensions between the closely connected neighbors soared after the White House said Trump would slap tariffs of 25% on Mexican and Canadian goods because of illegal immigration and drug smuggling.</p><p>The threatened tariffs have since been halted for 30 days.</p>","contentLength":2770,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ipnget/mexico_threatens_to_escalate_us_gunmakers_lawsuit/"},{"title":"Ukraine Could Replace US Troops in Europe, Says Ukrainian Prime Minister","url":"https://www.kyivpost.com/post/47170","date":1739571051,"author":"/u/Ask4MD","guid":637,"unread":true,"content":"<p>Denys Shmyhal, Ukraine’s prime minister, proposed the creation of a singular European army based on Ukraine’s war lessons.</p><p>Shymal said Ukraine’s experience – particularly with drones – could greatly bolster European defenses and “become the backbone of a unified European army,” as “no other country in the European community has such modern military experience.”</p><p>“It is Ukrainians who have done the impossible by building the infrastructure to produce drones – the ‘new artillery of the 21st century’ – almost from scratch. While no more than 5,000 drones were produced in Ukraine in 2022, the end of 2024 saw more than 1 million [first-person view] FPV drones sent to the front line alone,” Shymal wrote in an opinion piece for <a href=\"https://www.politico.eu/article/ukraine-volodymyr-zelenskyy-vladimir-putin-russia-pm-eu-survive-without-us/\">Politico</a>.</p><p>According to Shmyhal, Ukrainian troops can also replace Washington’s 65,000 personnel in Europe, which might be an option as the new administration is looking at scaling back its involvement in Europe.</p><p>“Ukraine’s battle-hardened military could become an alternative to the US army, which currently has over 65,000 troops in the <a href=\"https://www.kyivpost.com/topic/eu\">EU</a>, its largest deployments stationed in Germany, Italy and Spain,” Shmyhal said.</p><p>“In addition to its practical significance, this decision could strengthen relations with the <a href=\"https://www.kyivpost.com/topic/us\">US</a>, as Washington increasingly questions the need for its military to be stationed overseas,” he added.</p><p>On Wednesday, US Defense Secretary Pete Hegseth hinted that the new administration might <a href=\"https://www.theguardian.com/us-news/2025/feb/12/us-no-longer-primarily-focused-on-europes-security-says-pete-hegseth\">shift its resources</a> from Europe to protect its interests in other theaters.</p><p>In the Politico opinion piece, Shmyhal also advocated for Ukraine’s EU membership, saying that Ukraine is filled with resources and is “a country that knows its worth and is honest with its allies.”</p><p>“The EU is our conscious choice, not a temporary whim. And we’re proving the sincerity of our intentions, arms in hand,” he added.</p><p>Creating an EU army is nothing new, with some member states agreeing to form the <a href=\"https://www.pesco.europa.eu/about/\">Permanent Structured Cooperation</a> (PESCO) in 2017, a security initiative that enhances military collaboration among member states by developing joint defense projects and improving interoperability.</p><p>French President Emmanuel Macron has been a strong advocate for the initiative, and he floated the idea of a “<a href=\"https://www.bbc.com/news/world-europe-46108633\">true, European</a>” army during US President Donald Trump’s last presidency in 2018.</p><p>As Ukrainian military news outlet <a href=\"https://mil.in.ua/en/news/the-european-union-is-conducting-its-first-military-exercises/\">Militarnyi</a> noted, the EU also hosted its first joint military exercise in October 2023.</p>","contentLength":2483,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ipmgbn/ukraine_could_replace_us_troops_in_europe_says/"},{"title":"Zelenskyy: Trump told me Putin wants to end the war. I told him Putin is a liar.","url":"https://www.politico.eu/article/ukraine-war-volodymyr-zelenskyy-donald-trump-putin-liar-peace/","date":1739561763,"author":"/u/die_mannequin","guid":640,"unread":true,"content":"<div><p>The U.S. and Ukraine are back-and-forthing on a deal to exploit Kyiv’s rare earths in return for Washington’s support.</p></div>","contentLength":122,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ipiwyg/zelenskyy_trump_told_me_putin_wants_to_end_the/"},{"title":"Zelensky refuses to sign document on transfer of 50% of Ukrainian mineral resources to the US - WP | УНН","url":"https://unn.ua/en/news/zelensky-refuses-to-sign-document-on-transfer-of-50percent-of-ukrainian-mineral-resources-to-the-us-wp","date":1739561490,"author":"/u/EsperaDeus","guid":641,"unread":true,"content":"<p>A delegation of the US Congress in Munich wanted President of Ukraine Volodymyr Zelenskyy to sign a document that would give the US rights to 50% of Ukraine's future mineral resources, but he refused. This was reported by The Washington Post journalist Josh Rogin in X,  reports.</p><blockquote><p>Several lawmakers here in Munich have told me that a US Congressional delegation handed Zelenskiy a paper they wanted him to sign giving the US rights to 50% of Ukraine's future mineral resources&nbsp;</p></blockquote><p>According to him, the Ukrainian leader politely refused to sign it.</p><p>Zelenskyy has previously said that he supports a strategic partnership with the United States in rare earths mining, which could be part of an agreement on economic support and security guarantees for Ukraine.</p><p>On February 11, Donald Trump <a href=\"https://unn.ua/news/tramp-ukraina-faktychno-pohodylas-nadaty-ssha-dostup-do-mineraliv-na-500-mlrd-dolariv-za-viiskovu-dopomohu\">said</a>that Ukraine had \"effectively\" agreed to give the United States access to $500 billion worth of rare earth minerals in return for Washington's military aid.</p>","contentLength":941,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ipit4z/zelensky_refuses_to_sign_document_on_transfer_of/"},{"title":"Mexican president accuses U.S. of harbouring drug cartels - National | Globalnews.ca","url":"https://globalnews.ca/news/11019350/mexico-us-drug-cartel-alliance-slander-harbouring-mexican-president-claudia-sheinbaum-trump/","date":1739560927,"author":"/u/StationAppropriate20","guid":636,"unread":true,"content":"<p>Mexican President <a href=\"https://globalnews.ca/tag/claudia-sheinbaum/\" target=\"_blank\" rel=\"noopener\">Claudia Sheinbaum</a> is accusing the U.S. of harbouring drug cartels, and claims American citizens are working with organized crime groups in Mexico, following U.S. President <a href=\"https://globalnews.ca/tag/donald-trump/\" target=\"_blank\" rel=\"noopener\">Donald Trump’s</a> “slanderous” claims earlier this month that Mexico had joined forces with drug traffickers.</p><img decoding=\"async\" src=\"https://d21y75miwcfqoq.cloudfront.net/70c8fc80\" alt=\"\" referrerpolicy=\"no-referrer-when-downgrade\"><p>“There is also organized crime in the United States and there are American people who come to Mexico with these illegal activities,” Sheinbaum said <a href=\"https://x.com/Claudiashein/status/1890034414903857237\" target=\"_blank\" rel=\"noopener\">during a press conference</a> on Thursday. “Otherwise who would distribute <a href=\"https://globalnews.ca/tag/fentanyl\">fentanyl</a> in the cities of the United States?”</p><p>Sheinbaum was responding to a reporter from the Animal Político news outlet, who mentioned an <a href=\"https://animalpolitico.com/seguridad/narco-detenciones-estadounidenses-mexico-crimen-organizado\" target=\"_blank\" rel=\"noopener\">investigation they published</a> this week that found more than 2,600 U.S. citizens have been arrested in Mexico for offences related to organized crime, including smuggling drugs and firearms, since Mexico’s former president Andrés Manuel López Obrador took office in December 2018.</p><div><div>Story continues below advertisement</div></div><p>“The issue isn’t just that drugs go from Mexico to the United States,” she added.</p><p>Sheinbaum said that Mexico is willing to work with the U.S. government on security issues in Mexico, but she stressed that the U.S. government also has to “do its work” to “avoid the trafficking of drugs in their country.”</p><p>“In the United States, they also have to act,” she said.</p><p>Google changed the name for U.S. users of Google Maps to reflect the decision by the Trump government to rename the Gulf of Mexico.</p><div><div>Story continues below advertisement</div></div><p>Sheinbaum <a href=\"https://globalnews.ca/news/10986479/gulf-of-mexico-renaming-mexican-president-letter-google/\" target=\"_blank\" rel=\"noopener\">has repeatedly decried the move</a>, arguing the “Gulf of Mexico” name has long been recognized internationally. On Thursday, she said Google had not resolved Mexico’s earlier complaints.</p><p>“If necessary, we will file a civil suit,” she said. “Even President Trump isn’t proposing that the entire Gulf of Mexico be called the ‘Gulf of America,’ but only their continental shelf. So Google is wrong.”</p><p>She urged Google to review the decree from the White House, arguing “the only place it was effective was where (the U.S.) has sovereignty, or up to 22 nautical miles from the coast.”</p><div><div>Story continues below advertisement</div></div><p>“We categorically reject the slander made by the White House against the Mexican government about alliances with criminal organizations, as well as any attempt to intervene in our territory,” Sheinbaum wrote <a href=\"https://x.com/Claudiashein/status/1885857655094415528\" target=\"_blank\" rel=\"noopener\">on social media</a>. “If there is such an alliance anywhere, it is in the U.S. gun shops that sell high-powered weapons to these criminal groups.”</p><p>Sheinbaum said the Mexican government has “seized more than 40 tons of drugs in four months,” including “20 million doses of fentanyl,” and has “arrested more than ten thousand people linked to these groups.”</p><p>“If the U.S. government and its agencies want to address the serious fentanyl consumption problem in their country, they could, for example, combat the sale of narcotics on the streets of their major cities — &nbsp;something they do not do — as well as the money laundering generated by this illegal activity, which has caused significant harm to their population,” she added.</p><p>Sheinbaum also suggested that the U.S. could “launch a massive campaign to prevent drug consumption and protect their youth,” like Mexico has done.</p><p>“Drug consumption and distribution occur in their own country, and that is a public health problem they have not addressed. Moreover, the synthetic opioid epidemic in the United States originates from the indiscriminate prescription of these medications, authorized by the Food and Drug Administration (FDA), as demonstrated by the legal case against a pharmaceutical company,” Sheinbaum wrote.</p><div><div>Story continues below advertisement</div></div><p>“Mexico does not seek confrontation. We believe in collaboration between neighbouring countries. Mexico does not want fentanyl to reach the United States — or anywhere else. Therefore, if the United States truly wants to combat the criminal groups that traffic drugs and fuel violence, we must work together in a comprehensive manner, but always under the principles of shared responsibility, mutual trust, collaboration, and, above all, respect for sovereignty — which is non-negotiable. Coordination, yes; subordination, no.”</p><p>On Feb. 2, the governors of Mexico’s 31 states and Mexico City backed Sheinbaum in a joint statement.</p><p>“We energetically condemn the accusations that suggest there is a link between our government and narco-trafficking cartels,” it said. “These claims are not only baseless, they also ignore the major, verifiable efforts Mexico has made to combat organized crime,” the statement read.</p><p>Marcelo Ebrard, Mexico’s economy minister, <a href=\"https://x.com/m_ebrard/status/1886055727862804671\" target=\"_blank\" rel=\"noopener\">said on X</a>&nbsp;that Trump is hurting himself.</p><div data-shortcode=\"traffickers\">“Accusing the Mexican government of being an ally of narco [traffickers] is — apart from an insult to our country – a pretext to distract US public opinion from the tremendous mistake of imposing disruptive tariffs on Mexico and North American companies that operate here. Shooting oneself in the foot,” Ebrard wrote.</div>","contentLength":5054,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ipil64/mexican_president_accuses_us_of_harbouring_drug/"}],"tags":["news","reddit"]}