{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Colombia's President Responds to Trump's 50% Tariffs with Equal Counter Tariffs and Vows to Boost Trade With China","url":"https://www.latintimes.com/colombia-retalitory-tariffs-trump-deportation-flight-petro-573538","date":1737946666,"author":"/u/Mikaela_Side","guid":594,"unread":true,"content":"<p>\"Your blockade does not scare me... I am informed that you're imposing a 50% import tariff on us; I do the same,\" the Colombian President wrote on social media.</p><p>Petro's announcement came attached to a lengthy letter addressed to Trump in which he extensively criticized the United States, claiming he would \"resist.\" Petro described Trump and other American leaders as \"slaveholders\" who saw Colombians as an \"inferior race.\"</p><p>\"I survived torture, and I will resist you,\" he wrote. \"Make me fall, President, and the Americas and humanity will respond.\"</p><p>The dispute broke out after Petro denied the entry of two American aircraft carrying Colombian migrants, claiming he would only accept them once the U.S. government \"establishes protocols that guarantee dignity and rights to the deportees.\"</p><p>According to Secretary Marco Rubio, Petro had initially authorized the aircraft to land in Colombia but canceled his authorization once the airplanes were en route.</p><p>Trump responded to Petro's decision by announcing tariffs of up to 50% on Colombian imports and immediate visa sanctions for people associated with the Colombian government.</p><p>\"These measures are just the beginning,\" Trump wrote. \"We will not allow the Colombian Government to violate its legal obligations with regard to the acceptance and return of the criminals they forced into the United States!\"</p><p>According to Trump, both repatriation flights carried a \"large number of illegal criminals.\" The Republican president also suggested Petro's denial of the flights \"jeopardized the National Security and Public Safety of the United States.\"</p><p>Petro later said he would be sending his presidential plane to pick up deportees with dignity. He also pointed out the 15,660 U.S. citizens \"established in Colombia\" without proper documentation, calling on them to regularize their status.</p><p>While some social media users applauded Petro, claiming he was \"standing up to Trump\" on behalf of Latin America, others, particularly Colombians, criticized him for not thinking twice about the consequences before acting.</p><div><p>© 2024 Latin Times. All rights reserved. Do not reproduce without permission.</p></div>","contentLength":2128,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1iaxzk5/colombias_president_responds_to_trumps_50_tariffs/"},{"title":"Colombia to send presidential plane to Honduras to pick up migrants from US flights","url":"https://thehill.com/policy/international/5107740-colombia-presidential-plane-honduras-us-deportation-flights/","date":1737927543,"author":"/u/Disastrous_Role_202","guid":591,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1iar9rx/colombia_to_send_presidential_plane_to_honduras/"},{"title":"Sweden Says Has Seized Ship Suspected Of Baltic Sea 'Sabotage'","url":"https://www.barrons.com/news/sweden-says-has-seized-ship-suspected-of-baltic-sea-sabotage-13ff82f2","date":1737925641,"author":"/u/Peter-Pair","guid":592,"unread":true,"content":"<p>Swedish authorities on Sunday seized a ship suspected of having sabotaged a fibre-optic cable in the Baltic Sea, the prosecutors' office announced.</p><p>Prosecutors have opened an investigation for \"aggravated sabotage\" after the undersea cable running between Sweden and Latvia was damaged, said the statement.</p>","contentLength":305,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1iaqf50/sweden_says_has_seized_ship_suspected_of_baltic/"},{"title":"Trump vows to impose heavy U.S. sanctions, tariffs on Colombia after it turns away deportation planes","url":"https://www.cbc.ca/news/world/trump-colombia-migrant-repatriation-flights-1.7442038","date":1737918842,"author":"/u/ClassOptimal7655","guid":595,"unread":true,"content":"<p>The White House claimed victory in a showdown with Colombia over accepting flights of deported migrants from the U.S. on Sunday, hours after President Donald Trump threatened steep tariffs on imports and other sanctions on the longtime U.S. partner.</p><p>Long close partners in anti-narcotics efforts, the U.S. and Colombia clashed Sunday over the deportation of migrants and imposed tariffs on each other's&nbsp;goods in a show of what other countries could face if they intervene in the Trump administration's crackdown on illegal immigration.</p><p>The White House held up the episode as a warning to other nations who might seek to impede his plans.</p><p>Earlier, the U.S. president had ordered visa restrictions, 25 per cent tariffs on all Colombian incoming goods, which would be raised to 50 per cent&nbsp;in one week, and other retaliatory measures sparked by President Gustavo Petro's decision to reject two Colombia-bound U.S. military aircraft carrying migrants after Petro accused Trump of not treating immigrants with dignity during deportation.</p><p>Petro also announced a retaliatory 25 per cent&nbsp;increase in Colombian tariffs on U.S. goods.&nbsp;</p><p>Trump said the measures were necessary because Petro's decision \"jeopardized\" national security in the U.S. by blocking the deportation flights.</p><p>\"These measures are just the beginning,\" Trump wrote on his social media platform Truth Social. \"We will not allow the Colombian Government to violate its legal obligations with regard to the acceptance and return of the Criminals they forced into the United States.\"</p><p>Press secretary Karoline Leavitt said in a late-Sunday statement that the \"Government of Colombia has agreed to all of President Trump's terms, including the unrestricted acceptance of all illegal aliens from Colombia returned from the United States, including on U.S. military aircraft, without limitation or delay.\"</p><p>Leavitt said the tariff orders will be \"held in reserve, and not signed,\" but&nbsp;Trump would maintain visa restrictions on Colombian officials and enhanced customs inspections of goods from the country, \"until the first planeload of Colombian deportees is successfully returned.\"</p><p>In a statement late on Sunday,&nbsp;Colombian Foreign Minister Luis Gilberto Murillo said: \"We have overcome the impasse with the U.S. government.\"</p><p>U.S. Secretary of State Marco Rubio announced he was authorizing the visa restrictions on Colombian government officials and their families \"who were responsible for the interference of U.S. repatriation flight operations.\"</p><p>They were being imposed on top of the State Department's move to suspend the processing of visas at the U.S. Embassy in Colombia's capital, Bogota.</p><h2>'U.S. cannot treat Colombian migrants as criminals'</h2><p>The U.S. president declared illegal immigration a national emergency and imposed a sweeping crackdown since taking office on Monday, directing the U.S. military to help with border security, issuing a broad ban on asylum and taking steps to restrict citizenship for children born on U.S. soil.</p><p>Colombia's Petro condemned the U.S. practice of repatriation using military aircraft, suggesting it treated migrants like criminals. In a post on social media platform X, he&nbsp;said Colombia would welcome home deported migrants on civilian planes.</p><p>\"The U.S. cannot treat Colombian migrants as criminals,\" he wrote.</p><div><em><strong>WATCH | Trump's promised immigration raids, deportations underway:</strong></em></div><p>Petro said even though there were 15,660 Americans without legal immigration status in Colombia, he would never carry out a raid to return handcuffed Americans to the U.S.</p><p>\"We are the opposite of the Nazis,\" he wrote.</p><p>Mexico also refused a request last week to let a U.S. military aircraft land with migrants.</p><p>Trump did not take similar action against Mexico, its largest trading partner, but has said he was thinking about imposing 25 per cent duties on imports from <a href=\"https://www.cbc.ca/news/politics/trump-canada-comments-north-carolina-1.7440999\">Canada </a>and Mexico on Feb. 1 over illegal immigrants and fentanyl crossing into the U.S.</p><p>The U.S. is Colombia's largest trading partner, largely due to a 2006 free-trade agreement, with $33.8 billion US worth of two-way trade in 2023 and a rare $1.6 billion US trade surplus, according to U.S. Census Bureau data.</p><p>The biggest U.S. imports from Colombia that year were crude oil, gold, coffee&nbsp;and cut roses.</p><p>Petro's comments add to the growing chorus of discontent in Latin America as Trump's week-old administration starts mobilizing for mass deportations.</p><p>Brazil's Foreign Affairs Ministry late on Saturday condemned \"degrading treatment\" of Brazilians after migrants were handcuffed on a commercial deportation flight. Upon arrival, some of the passengers also reported mistreatment during the flight, according to local news reports.</p><p>The plane, which was carrying 88 Brazilian passengers, 16 U.S. security agents&nbsp;and eight crew members, had been originally scheduled to arrive in the city of&nbsp;Belo Horizonte, in the southeastern state of Minas Gerais.</p><p>However, at an unscheduled stop due to technical problems in Manaus, capital of the state of Amazonas, Brazilian officials ordered the removal of the handcuffs, and President Luiz Inácio Lula da Silva designated a Brazilian Air Force flight to complete their journey, the government said in a statement on Saturday.</p><div><strong><em>WATCH | Deportation flights spark&nbsp;tariffs threats between U.S. and Colombia:</em></strong></div><p>The commercial charter flight was the second this year from the U.S. carrying undocumented migrants deported back to Brazil and the first since Trump's inauguration, according to Brazil's federal police.</p><p>Officials from the U.S. State Department, Pentagon, U.S. Department of Homeland Security and U.S. Immigration and Customs Enforcement did not immediately reply to requests for comment.</p><p>The use of U.S. military aircraft to carry out deportation flights is part of the Pentagon's response to Trump's national emergency declaration on immigration issued on Monday.</p><p>In the past, U.S. military aircraft have been used to relocate individuals from one country to another, such as during the U.S. withdrawal from Afghanistan in 2021.</p><p>U.S. military aircraft carried out two similar flights, each with about 80 migrants, to Guatemala on Friday.</p>","contentLength":6107,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1iandp7/trump_vows_to_impose_heavy_us_sanctions_tariffs/"},{"title":"New cable damaged in the Baltic Sea","url":"https://www.dw.com/en/latvia-undersea-cable-likely-damaged-by-external-influence/a-71416470","date":1737913432,"author":"/u/Gjrts","guid":587,"unread":true,"content":"<p>An undersea fiber optic cable between <a href=\"https://www.dw.com/en/latvia/t-39446029\">Latvia</a> and <a href=\"https://www.dw.com/en/sweden/t-66053585\">Sweden</a> belonging to&nbsp;Latvia State Radio and Television Center (LVRTC) was damaged in the <a href=\"https://www.dw.com/en/baltic-sea/t-38447622\">Baltic Sea</a> on Sunday. The cable linked the Latvian town of Ventspils with Sweden's Gotland island.</p><p>\"We have determined that there is most likely external damage and that it is significant,\" Latvian Prime Minister Evika Silina told reporters following an extraordinary government meeting.</p><p>\"We are working together with our Swedish Allies and NATO on investigating the incident, including to patrolling the area, as well as inspecting the vessels that were in the area,\" Silina wrote later on X, adding that the cable was damaged in Sweden's exclusive economic zone.</p><p>Swedish Prime Minister Ulf Kristersson said his country is working closely with Latvia and NATO. \"Sweden will contribute important capabilities to the ongoing effort to investigate the suspected incident,\" he wrote on X.</p><p>&nbsp;The cable is believed to be severely damaged.</p><p>\"Given that the cable lies at a depth exceeding 50 meters (164 feet), the exact nature of the damage can only be determined once cable repair work begins,\" LVRTC said in <a rel=\"noopener nofollow\" target=\"_blank\" href=\"https://www.lvrtc.lv/en/news/jaunumi/lvrtc-submarine-optical-fiber-cable-damaged/\" title=\"External link — a statement\">a statement</a>.</p><p>LVRTC stated that it continues to provide services via alternative data&nbsp;transmission routes. \"Currently, there may be delays in data transmission speeds, but for the most part this does not impact end users in Latvia,\" the center said.</p><div><h2 aria-label=\"Embedded video — NATO moves to protect Baltic sea cables\">NATO moves to protect Baltic sea cables</h2></div><h2>NATO takes action in the Baltic Sea</h2><p>NATO said last week <a href=\"https://www.dw.com/en/nato-unveils-baltic-sentry-pipeline-cable-security-mission/a-71292043\">it was launching a security mission</a>&nbsp;called \"Baltic Sentry\" in which it would deploy frigates, patrol aircraft and naval drones in the Baltic Sea to help protect critical infrastructure. The alliance reserved the right to take action against vessels suspected of posing a security threat.</p><p>Last month, Finnish police seized a tanker carrying Russian oil. The ship is suspected of damaging the Finnish-Estonian Estlink 2 power line and four telecommunications cables by dragging its anchor across the seabed.</p><p>ess, dh/wd, dj (Reuters, AFP, AP)</p>","contentLength":2017,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1iakw5y/new_cable_damaged_in_the_baltic_sea/"},{"title":"EU rejects election in Belarus and threatens new sanctions","url":"https://www.yahoo.com/news/eu-rejects-election-belarus-threatens-155127173.html","date":1737908456,"author":"/u/Snowfish52","guid":590,"unread":true,"content":"<div data-article-body=\"true\"><p>BRUSSELS (AP) — The European Union rejected <a href=\"https://apnews.com/article/belarus-lukashenko-election-crackdown-opposition-putin-ae937352a1340ad5ca02ab55744487e0\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:the election in Belarus;elm:context_link;itc:0;sec:content-canvas\">the election in Belarus</a> on Sunday as illegitimate and threatened <a href=\"https://apnews.com/article/eu-belarus-sanctions-repression-crackdown-lukashenko-7b619344dc75830e7e1a4b8f844c967b\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:new sanctions;elm:context_link;itc:0;sec:content-canvas\">new sanctions</a>.</p><p>Belarus held an orchestrated vote virtually guaranteed to give <a href=\"https://apnews.com/article/belarus-lukashenko-crackdown-43bb792426aa072ff45cb44a89a695a1\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:70-year-old autocratic President Alexander Lukashenko;elm:context_link;itc:0;sec:content-canvas\">70-year-old autocratic President Alexander Lukashenko</a> yet another term on top of his three decades in power.</p><p>“Today’s sham election in Belarus has been neither free, nor fair,” EU foreign policy chief Kaja Kallas and EU enlargement commissioner Marta Kos said in a joint statement.</p><p>“The relentless and unprecedented repression of human rights, restrictions to political participation and access to independent media in Belarus, have deprived the electoral process of any legitimacy,\" Kallas and Kos said.</p><p>They urged the Belarusian government to release political prisoners, estimating their number at more than 1,000, including an employee of the EU delegation in Belarus' capital, Minsk.</p><p>Kallas and Kos said that the decision to invite observers from the Organization for Security and Cooperation in Europe only 10 days ago prevented the group from monitoring the full electoral process.</p><p>“For these reasons, as well as the involvement of the Belarusian regime in Russia’s war of aggression against Ukraine and its hybrid attacks against its neighbours, the EU will continue imposing restrictive and targeted measures” against the Belarusian government, the EU officials said.</p><p>They didn't elaborate on what eventual new sanctions would target, or provide a time frame.</p><p>Kallas and some EU foreign ministers are expected to meet Belarusian opposition leader Sviatlana Tsikhanouskaya on Sunday night in Brussels for an informal, closed-door dinner.</p></div>","contentLength":1640,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1iaiovi/eu_rejects_election_in_belarus_and_threatens_new/"},{"title":"Brazil slams US after dozens of deportees arrive handcuffed","url":"https://www.yahoo.com/news/brazil-slams-us-dozens-deportees-065725467.html","date":1737906067,"author":"/u/KiraCosmicGod","guid":589,"unread":true,"content":"<p>Brazil's government expressed outrage on Saturday after dozens of immigrants deported from the United States arrived by plane in handcuffs, calling it a \"flagrant disregard\" for their rights.</p><p>The foreign ministry said it would demand an explanation from Washington over the \"degrading treatment of passengers on the flight\".</p><p>The spat comes as Latin America grapples with US President Donald Trump's return to power bringing a hard-line anti-immigration agenda, promising crackdowns on irregular migration and mass deportations.</p><p>When the plane landed in the northern city of Manaus, Brazilian authorities ordered US officials to \"immediately remove the handcuffs,\" the justice ministry said in a statement.</p><p>Justice Minister Ricardo Lewandowski told President Luiz Inacio Lula da Silva of \"the flagrant disregard for the fundamental rights of Brazilian citizens,\" the statement said.</p><p>Brazil will request \"explanations from the US government about the degrading treatment of passengers\" on the Friday night flight, the foreign ministry said on X.</p><p>The government said 88 Brazilians were aboard the aircraft.</p><p>Edgar Da Silva Moura, a 31-year-old computer technician, was on the flight, after seven months in detention in the United States.</p><p>\"On the plane they didn't give us water, we were tied hands and feet, they wouldn't even let us go to the bathroom,\" he told AFP.</p><p>\"It was very hot, some people fainted.\"</p><p>Luis Antonio Rodrigues Santos, a 21-year-old freelancer, recounted the \"nightmare\" of people with \"respiratory problems\" during \"four hours without air conditioning\" due to technical issues on the plane.</p><p>\"Things have already changed (with Trump), immigrants are treated as criminals,\" he said.</p><p>The flight was originally destined for the southeastern city of Belo Horizonte, but encountered a technical issue forcing it to land in Manaus.</p><p>A government source told AFP the deportation flight was not directly linked to any immigration orders issued by Trump upon taking office Monday, but rather stemmed from a 2017 bilateral agreement.</p><p>Brazil's Minister of Human Rights, Macae Evaristo, told journalists that \"children with autism ... who went through very serious experiences\" were also on the flight.</p><p>Footage on Brazilian television showed some passengers descending from the civilian aircraft, with their hands handcuffed and their ankles shackled.</p><p>\"Upon learning of the situation, President Lula ordered that a Brazilian Air Force (FAB) aircraft be mobilized to transport the Brazilians to their final destination, in order to ensure that they could complete their journey with dignity and safety,\" the justice ministry said.</p><p>Trump promised a crackdown on illegal immigration during the election campaign and began his second term with a flurry of executive actions aimed at overhauling entry to the United States.</p><p>On his first day in office he signed orders declaring a \"national emergency\" at the southern US border and announced the deployment of more troops to the area while vowing to deport \"criminal aliens.\"</p><p>Several deportation flights since Monday have garnered public and media attention, though such actions were also common under previous US presidents.</p><p>In a break with prior practice, however, the Trump administration has begun using military aircraft for repatriation flights, with at least one landing in Guatemala this week.</p><p>The plane which landed in Manaus was not a military aircraft, AFP journalists in the city confirmed.</p><p>A Brazilian government source said that the deportees who arrived in Manaus traveled \"with their documents\", which shows that they agreed to return home.</p><p>There are an estimated 11 million undocumented migrants in the United States, according to the Department of Homeland Security statistics.</p><p>The United States also expelled 265 migrants to Guatemala on Friday.</p>","contentLength":3787,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1iahngt/brazil_slams_us_after_dozens_of_deportees_arrive/"},{"title":"Trump floats reversing decision to leave WHO","url":"https://www.politico.eu/article/trump-floats-reversing-decision-to-leave-who/","date":1737901295,"author":"/u/doopityWoop22","guid":593,"unread":true,"content":"<div><p>It “would send a strong signal and could contribute to stability in the region,” Robert Brieger, head of the EU’s highest military body, tells Welt am Sonntag.</p></div>","contentLength":165,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1iafpol/trump_floats_reversing_decision_to_leave_who/"},{"title":"Elon Musk's call for Germany to 'move beyond' Nazi guilt is dangerous, Holocaust memorial chair says","url":"https://www.nbcnews.com/news/world/elon-musks-call-germany-move-nazi-guilt-dangerous-holocaust-memorial-c-rcna189316","date":1737899645,"author":"/u/nbcnews","guid":596,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1iaf374/elon_musks_call_for_germany_to_move_beyond_nazi/"},{"title":"US restricts Switzerland's access to AI chips","url":"https://www.swissinfo.ch/eng/multinational-companies/us-restricts-switzerlands-access-to-ai-chips/88781270?utm_source=multiple&amp;utm_medium=website&amp;utm_campaign=news_en&amp;utm_content=o&amp;utm_term=wpblock_highlighted-compact-news-carousel","date":1737891140,"author":"/u/BezugssystemCH1903","guid":588,"unread":true,"content":"<div><p>\n        Switzerland is excluded by the US from the group of allied countries which have unlimited access to chips required for artificial intelligence (AI).    </p></div><p>The US recently changed the rules for the export of products related to artificial intelligence. Only countries that are considered allies are now allowed to access these computer chips. And Switzerland is not one of them.</p><p>Only 18 countries are considered trustworthy allies in the US, including France, Germany and Japan. According to Washington, these nations are worthy of unrestricted access to these very powerful computer chips, which are manufactured exclusively by US companies.</p><p>This new regulation will come into force in four months. After that, Switzerland will still be able to import these chips, but will be subject to a limited quota in the coming years.</p><p>Experts are already expressing their concerns, as these chips are used extensively in academic research as well as by many companies.</p><p>These technologies are already present in many areas and will be omnipresent in the coming months to years, says Olga Baranova on Swiss public television, RTS. She is Secretary General of the CH++ association, a citizens’ lobby to strengthen scientific and technological expertise in politics.</p><p>Baranova also points out that the US largely dominates the market, which makes alternative supply difficult.</p><p>It is not entirely clear why Switzerland is not one of the allied countries. The official US Department of Commerce document lists those countries they trust to protect their technology and have no restrictions. However, no individual statements were made regarding the excluded countries.</p><p>Nevertheless, it seems clear that the main aim of this regulation is to deny rival countries, especially China, access to this cutting-edge technology. The US is not only trying to curb exports, but also to prevent Chinese companies from circumventing the restrictions by setting up subsidiaries abroad.</p><p>Baranova is therefore calling on the Swiss government to show the US that Switzerland meets the criteria to be considered a trustworthy partner. “It is clearly up to Switzerland to demonstrate its reliability and provide the US with additional guarantees.”</p><p>The State Secretariat for Economic Affairs (SECO) is currently analysing the document and its potential impact on companies and research institutions. According to SECO, discussions have already begun with the US authorities to ensure that this regulation does not hinder research or innovation in Switzerland.</p><p>SECO also points out that Switzerland is home to US companies and their research centres that make heavy use of these chips, such as Google.</p><p><em>Translated from German by DeepL/ds</em></p><div aria-label=\"Infobox\" x-bind:class=\"isOpen &amp;&amp; '--is-open'\" x-data=\"infobox({isOpen: false})\"><div x-show=\"isOpen\" x-collapse=\"\" x-bind:aria-hidden=\"!isOpen\"><p>This news story has been written and carefully fact-checked by an external editorial team. At SWI swissinfo.ch we select the most relevant news for an international audience and use automatic translation tools such as DeepL to translate it into English. Providing you with automatically translated news gives us the time to write more in-depth articles.</p><p>If you want to know more about how we work, have a look&nbsp;<a href=\"https://www.swissinfo.ch/eng/about-swi\">here</a>, if you want to learn more about how we use technology, click&nbsp;<a href=\"https://www.swissinfo.ch/eng/about-us/principles-and-framework-conditions/47918744\">here</a>, and if you have feedback on this news story please write to&nbsp;<a href=\"mailto:english@swissinfo.ch\">english@swissinfo.ch</a>.</p></div></div>","contentLength":3266,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1iacaf8/us_restricts_switzerlands_access_to_ai_chips/"}],"tags":["news"]}