{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Hegseth Said to Have Shared Attack Details in Second Signal Chat","url":"https://www.nytimes.com/2025/04/20/us/politics/hegseth-yemen-attack-second-signal-chat.html?unlocked_article_code=1.BE8.D1kU.h9IDC29wBTiE&amp;smid=nytcore-ios-share&amp;referringSource=articleShare","date":1745184275,"author":"/u/rawa27","guid":606,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k3wx8y/hegseth_said_to_have_shared_attack_details_in/"},{"title":"End of USAID in Sudan causing mass starvation.","url":"https://www.nytimes.com/2025/04/19/world/africa/sudan-usaid-famine.html?smid=nytcore-ios-share&amp;referringSource=articleShare","date":1745169799,"author":"/u/Culinaryhermit","guid":612,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k3rn88/end_of_usaid_in_sudan_causing_mass_starvation/"},{"title":"Chinese ambassador warns US not to repeat tariff mistakes of the Great Depression era","url":"https://www.scmp.com/news/china/diplomacy/article/3307223/chinese-ambassador-warns-us-not-repeat-tariff-mistakes-great-depression-era?module=top_story&amp;pgtype=homepage","date":1745159515,"author":"/u/Saltedline","guid":611,"unread":true,"content":"<p datatype=\"p\" data-qa=\"Component-Component\">China’s ambassador to the United States Xie Feng has said that the United States should avoid the mistakes from the Great Depression of the 1930s amid the escalating tariff war between the two countries.</p><p datatype=\"p\" data-qa=\"Component-Component\">Xie was speaking at a Traditional Chinese Medicine open-day event at the embassy in Washington, but he drew on ancient lore as a metaphor for the current trade dispute.</p><p datatype=\"p\" data-qa=\"Component-Component\">He cited the philosophy of addressing causes rather than just symptoms, calling for joint efforts to grow the global economy rather than fighting over the existing spoils.</p><p datatype=\"p\" data-qa=\"Component-Component\">“You can’t just treat a headache by just focusing on the head or foot pain by only targeting the feet,” Xie said. “And you certainly shouldn’t prescribe medicine to others when you’re the one who’s sick.”</p><p datatype=\"p\" data-qa=\"Component-Component\">More specifically, he cited the lessons from US protectionist policies – including the tariff-heavy Smoot-Hawley Act, which is widely accepted to have worsened the Great Depression and is now used as cautionary tale by economic historians.</p><p datatype=\"p\" data-qa=\"Component-Component\">“The lesson of the Smoot-Hawley Act is still fresh today,” Xie said.</p><p datatype=\"p\" data-qa=\"Component-Component\">The Act was designed to protect US agriculture and manufacturing and imposed tariffs of between 59 and 75 per cent on some imported goods such as car parts and wool, but it led to a dramatic fall in global trade that helped prolong the Great Depression.</p>","contentLength":1330,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k3nu0n/chinese_ambassador_warns_us_not_to_repeat_tariff/"},{"title":"EU considers stripping Hungary of voting rights over Ukraine obstruction","url":"https://euromaidanpress.com/2025/04/20/eu-considers-stripping-hungary-of-voting-rights-over-ukraine-obstruction/","date":1745152837,"author":"/u/inspirationalpink","guid":610,"unread":true,"content":"<p>European Union member states are considering removing Hungary’s voting rights after its persistent attempts to block support for Ukraine, The Guardian <a href=\"https://www.theguardian.com/world/2025/apr/19/orban-ukraine-hungary-eu-relations-kyiv\" target=\"_blank\">reports</a>. This potential action comes as pro-Russian Prime Minister Viktor Orbán faces his most serious political challenge in years from opposition leader Péter Magyar.</p><div>Russian President Putin’s ally Orbán has opposed military aid to Ukraine since Russia’s 2022 invasion, pushing for peace talks that would freeze the war and solidify Moscow’s control of occupied territories.&nbsp;</div><p>Posters are appearing throughout Hungary with the slogan <em>“Let’s not allow them to decide for us,</em>” featuring Ukrainian President Volodymyr Zelenskyy, European Commission President Ursula von der Leyen, and European People’s Party leader Manfred Weber as villains in Hungarian government propaganda, The Guardian says.</p><p>The campaign centers on a referendum asking citizens: “Do you support Ukraine becoming a member of the EU?”&nbsp;After launching the campaign, PM Orbán urged citizens to vote against membership, claiming that <em>“we would have to spend all Hungary’s money on Ukraine.</em>” The government has also made unsubstantiated claims that “” from Ukraine would take Hungarian jobs and that epidemics would spread due to insufficient vaccination rates among Ukrainians.</p><p>László Andor, Hungary’s EU commissioner from 2010 to 2014, told The Guardian that the governing Fidesz party recognized “<em>there is a sentiment against Hungary’s involvement in the war</em>” and has “” this sentiment <em>“to deny proper support to Ukraine</em>.”</p><h2>Voting ban considerations</h2><p>Not only has Hungary under Orbán never sent military aid to Ukraine, but рфі also vetoed the release of €6 billion in funds meant to reimburse other EU countries providing military aid to Ukraine and has refused to sign two EU declarations supporting its invaded neighbor. Moreover, Budapest has repeatedly attempted to block EU sanctions against Russia, although it eventually backed down.</p><p data-start=\"0\" data-end=\"150\">Hungary’s behavior has intensified discussions among EU countries about invoking Article 7, the treaty mechanism that could suspend its voting rights.</p><p>Any such move, however, faces a major hurdle: unanimous backing from the other 26 member states. That level of agreement has proven elusive in the past, with Poland previously blocking action. Attention has now turned to Slovakia, where Prime Minister Robert Fico is seen as the most likely to shield Hungary from potential penalties.</p><p data-start=\"0\" data-end=\"307\">A potential flashpoint is approaching on 31 July, when Hungary could block the renewal of EU sanctions against Russia. The package includes the freeze on €210 billion in Russian central bank assets, with profits helping to finance Ukraine’s defense and the principal seen as vital for future reconstruction.</p><p data-start=\"309\" data-end=\"695\">While Hungary has a history of retreating from such veto threats, diplomats remain cautious.</p><blockquote><p data-start=\"309\" data-end=\"695\"><em>“If the past is predictive for the future, we should be OK. But it would be foolish to assume that</em>,” one senior diplomat told The Guardian, noting that contingency plans are already in motion to circumvent a possible Hungarian block.</p></blockquote><p>Dutch Green MEP Tineke Strik, who leads the European Parliament’s efforts on Hungary and rule-of-law matters, told The Guardian:</p><blockquote><p><em>“Member states really are getting fed up with Orbán.”</em></p></blockquote><p>According to her, 19 governments appear willing to advance the Article 7 process, even if only through measures that stop short of suspending voting rights. However, she noted a key obstacle remains: they still lack “<em>a strategy on how to get the rest of the member states on board</em>.”</p><p>Last week, Strik led a cross-party delegation that found Hungary’s democratic standards were “going rapidly in the wrong direction.” The forthcoming report will highlight state-controlled media, politicized courts, and rising LGBTQ+ restrictions, including a constitutional Pride ban.</p><div><div><strong>You could close this page. Or you could join our community and help us produce more materials like this.&nbsp;</strong>\n\nWe keep our reporting open and accessible to everyone because we believe in the power of free information. This is why our small, cost-effective team depends on the support of readers like you to bring deliver timely news, quality analysis, and on-the-ground reports about Russia's war against Ukraine and Ukraine's struggle to build a democratic society.\n\nA little bit goes a long way: for as little as the cost of one cup of coffee a month, you can help build bridges between Ukraine and the rest of the world, plus become a co-creator and vote for topics we should cover next. <a href=\"https://www.patreon.com/euromaidanpress\" target=\"_blank\"></a>or see other ways to <a href=\"https://www.patreon.com/bePatron?u=36526209\" target=\"_blank\" data-patreon-widget-type=\"become-patron-button\">Become a Patron!</a></div></div>","contentLength":4626,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k3lo8a/eu_considers_stripping_hungary_of_voting_rights/"},{"title":"'Evil may have its hour, but God will have his day': Zelenskyy's Easter message after accusing Russia of ceasefire violations","url":"https://timesofindia.indiatimes.com/world/europe/evil-may-have-its-hour-but-god-will-have-his-day-zelenskyys-easter-message-after-accusing-russia-of-ceasefire-violations/articleshow/120451289.cms","date":1745150206,"author":"/u/BreakfastTop6899","guid":613,"unread":true,"content":"<div>Ukrainian President Volodymyr Zelenskyy wrote a message of unity and faith on the occasion of Easter Sunday, as he accused Russian forces of breaching a temporary ceasefire, earlier declared by Russian President Vladimir Putin.“Evil may have its hour, but God will have His day,” Zelenskyy posted on X. In the post, he invoked the suffering and resurrection of Christ to inspire hope for peace and victory. “May evil’s hour end. May the day of life arrive. The day of peace. The day of Ukraine. The day that lasts for centuries,” he wrote. “Christ is Risen! He is Risen Indeed!”, he further wrote.His message came as both sides accused each other of violating the 30-hour ceasefire announced by Moscow from Saturday, 6:00 pm to Sunday midnight. Despite the declaration, Zelenskyy said Russian troops continued shelling and launched assaults along the front.In a separate post, Zelenskyy wrote that Ukraine recorded at least 387 shelling incidents and 19 assaults from Saturday evening until midnight. On Easter morning, another 59 shelling cases and five Russian assaults were logged across the Donetsk, Starobilsk, and Zaporizhzhia sectors. Dozens of FPV drone strikes were also reported.“In some areas, Russia is still continuing isolated attempts to advance and inflict losses on Ukraine,” Zelenskyy wrote on Sunday, citing a frontline report from Commander-in-Chief Syrskyi.<p>Zelenskyy reiterated that Ukraine had proposed a 30-day ceasefire extension, which “remains on the table.” He stressed that Kyiv would continue to act based on “the actual situation on the ground.” The Ukrainian President also warned against trusting Moscow’s ceasefire promises, noting Russia’s previous rejection of Kyiv’s offer for a full, unconditional truce.</p>Putin had attended an Easter service in Moscow just hours after announcing the ceasefire. However, there were no details from the Kremlin on how it would be enforced or monitored, and Russian officials in occupied Kherson accused Ukraine of violating the truce.<p>Soldiers and civilians on both sides remained sceptical. AFP quoted Ukrainian frontline soldiers who doubted the sincerity of Moscow’s truce, while some Russian civilians felt there was no need for restraint.</p>Despite the clashes, Easter Sunday saw a rare exchange of prisoners of war. As per AFP, 246 soldiers were swapped on each side in a UAE-mediated deal, bringing the total number of returned Ukrainian POWs to 4,552.<p>In his address, Zelenskyy underlined Ukraine’s ongoing fight for peace and freedom, saying, “We are united in this… We fight for Ukraine together. And we pray for Ukraine together.”</p></div>","contentLength":2646,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k3kx9g/evil_may_have_its_hour_but_god_will_have_his_day/"},{"title":"Zelenskyy says Russia is trying to create an ‘impression of a ceasefire’ as attacks continue","url":"https://www.cnbc.com/2025/04/20/zelenskyy-says-russia-is-trying-to-create-impression-of-a-ceasefire.html","date":1745145281,"author":"/u/Userinterface1","guid":607,"unread":true,"content":"<div data-test=\"InlineImage\"><div><div><div>Ukraine's President Volodymyr Zelenskyy speaks during a press conference, amid Russia's attack on Ukraine, in Kyiv, Ukraine March 25, 2025.&nbsp;</div><div>Valentyn Ogirenko | Reuters</div></div></div></div><div><p>Ukrainian President Volodymyr Zelenskyy accused&nbsp;Russia&nbsp;on Sunday of creating a false appearance of honoring an Easter ceasefire, saying Moscow continued to launch attacks overnight after Russian President Vladimir Putin announced&nbsp;<a href=\"https://www.cnbc.com/2025/04/19/putin-russia-ceasefire-ukraine-easter.html\">a unilateral temporary truce in Ukraine.</a></p><p>\"As of Easter morning, we can say that the Russian army is trying to create a general impression of a ceasefire, but in some places, it does not abandon individual attempts to advance and inflict losses on Ukraine,\" Zelenskyy said in a post on X.</p><p>Despite&nbsp;<a href=\"https://apnews.com/article/russia-ukraine-war-kursk-drones-3c940cf913f22eb21803841b4d026db8\" target=\"_blank\">Putin's declaration of an Easter ceasefire</a>&nbsp;on Saturday, Zelenskyy said Ukrainian forces had recorded 59 instances of Russian shelling and five assaults by units across various areas along the front line, as well as \"dozens\" of drone strikes.</p><p>Zelenskyy emphasized that Russia must fully adhere to the ceasefire conditions and reiterated Ukraine's offer to extend the truce for 30 days, starting Sunday midnight.</p><p>He said the proposal \"remains on the table\" and that \"we will act in accordance with the actual situation on the ground.\"</p><p>Late on Saturday, Russia-installed officials in the partially occupied Ukrainian region of Kherson said Ukrainian forces continued their attacks.</p><p>\"Ukrainian troops continue to strike peaceful cities in the Kherson region, violating the Easter truce,\" Moscow-appointed governor Vladimir Saldo wrote on his Telegram channel.</p><p>Just hours after the Russian president announced the ceasefire, he attended an Easter service late Saturday at Moscow's Cathedral of Christ the Saviour led by Patriarch Kirill, head of the Russian Orthodox Church and a vocal supporter of Putin and the war in Ukraine.</p><p>Putin announced the temporary ceasefire, citing humanitarian reasons. According to the Kremlin, the ceasefire will last from 6 p.m. Moscow time (1500 GMT) on Saturday to midnight (2100 GMT) following Easter Sunday.</p><p>Putin offered no details on how the ceasefire would be monitored or whether it would cover airstrikes or ongoing ground battles that rage around the clock.</p><p>His ceasefire announcement came after U.S. President&nbsp;Donald Trump&nbsp;said Friday negotiations between Ukraine and Russia are \"coming to a head\" and insisted that neither side is \"playing\" him in his&nbsp;push to end the grinding three-year war.</p></div>","contentLength":2423,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k3jp7a/zelenskyy_says_russia_is_trying_to_create_an/"},{"title":"RAF intercepted Russian jets to defend Nato airspace","url":"https://www.telegraph.co.uk/news/2025/04/20/raf-british-typhoons-intercepts-russian-jets-nato-baltic/","date":1745136510,"author":"/u/TheTelegraph","guid":608,"unread":true,"content":"<div data-test=\"article-body-text\"><p>Russia has become increasingly aggressive in its probing of Nato countries’ air defences since its invasion of Ukraine began three years ago.</p><p>Two jets from Lossiemouth had to be scrambled in November to intercept a Russian bomber over the North Sea that was approaching UK airspace.</p><p>Then in February, the Norwegian air force sent up F-35 jets to intercept two Kremlin bombers and their fighter escorts in the Arctic Circle.</p><p>European nations are scrambling to bolster their own air defence after Mr Trump signalled a weakening of US military support for the continent.</p><p>The latest Russian incursions come with the White House and the Kremlin still locked in talks over a potential ceasefire and Ukraine peace deal.</p><p>Last month, Putin rejected a US proposed ceasefire, which was accepted by Kyiv, and has since then continued to bomb Ukrainian civilians.</p><p>On Saturday, Putin announced that he had ordered Russian troops to respect a 30-hour pause in the fighting in Ukraine, dubbed an “<a href=\"https://www.telegraph.co.uk/world-news/2025/04/19/russia-ukraine-zelensky-putin-war-latest-news-easter/\">Easter truce</a>”.</p><p>Britain and other European and Western nations have formed a “<a href=\"https://www.telegraph.co.uk/world-news/2025/04/11/coalition-of-the-willing-talks-failing-says-eu-chief/\">coalition of the willing</a>” to station peacekeepers to Ukraine should a deal be struck.</p><p>Under the agreement troops from the UK and fellow allies would be stationed in Ukraine to deter Russia from attempting to re-invade the country.</p><p>Sir Keir Starmer, the Prime Minister, is trying to persuade the US to provide a “backstop” to the plan, meaning that it would intervene in the event of a further Russian attack.</p></div>","contentLength":1471,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k3hrqm/raf_intercepted_russian_jets_to_defend_nato/"},{"title":"Attacks continue despite Putin's 'Easter truce' pledge, Zelensky says","url":"https://www.bbc.com/news/articles/c787v5gxny7o","date":1745134479,"author":"/u/Lotr_fan1995","guid":605,"unread":true,"content":"<div data-component=\"text-block\"><p>Ukrainian President Volodymyr Zelensky has accused Russia of creating an \"impression\" of a ceasefire while still taking military actions in some places in Ukraine.</p><p>In the first six hours of the \"Easter truce\" - as ordered by Russian President Vladimir Putin - Zelensky said there had been 387 shellings and 19 assaults by Russian forces, and drones used 290 times. There are no reports of casualties.</p><p>Putin ordered his forces to \"stop all military activity\" in Ukraine from 18:00 Moscow time (16:00 BST) on Saturday until midnight on Sunday. Kyiv said it would also adhere.</p><p>Russia's defence ministry insisted all Russian forces had been adhering to the truce and accused Ukraine's army of breaking it.</p></div><div data-component=\"text-block\"><p>Russia said Ukrainian units fired at the positions of Russian troops 444 times, carried out 900 strikes with unmanned aerial vehicles (UAV), 12 shellings, 33 strikes by UAVs and seven drops of munitions. The ministry said there were dead and wounded among the civilian population. It did not give any details.</p><p>Zelensky on Sunday morning said Moscow was \"trying to create a general impression of a ceasefire, but in some places it does not abandon individual attempts to advance and inflict losses on Ukraine.\"</p><p>Accusing Russia of specific military actions, Zelensky added that\"everywhere our warriors are responding as the enemy deserves, based on the specific combat situation.\"</p><p>Because Putin's ceasefire was announced minutes before it was due to take effect, an immediate, complete pause was always unlikely, but the BBC in Ukraine reports it has been quieter on the front lines.</p><p>Before Zelensky said there had been continued attacks in some areas, at midnight on Saturday there were no reported Russian drones or fighter jets in Ukrainian skies. </p><p>The only report was that a Russian ship with missile launchers had been deployed to the Black Sea. </p><p>In the southern city of Odesa, it was silent. On Friday, before Moscow's announcement, air defences crackled throughout the night as Russian drones flew in from the direction of occupied Crimea.</p><p>Late on Saturday - hours into the truce - Zelensky had said: \"If Russia is now suddenly ready to truly engage in a format of full and unconditional silence, Ukraine will act accordingly - mirroring Russia's actions.\" </p><p>\"Our actions are and will be symmetrical. The proposal for a full and unconditional 30-day silence remains on the table — the answer to it must come from Moscow,\" he wrote on X. </p><p>Zelensky said Ukraine would be ready to extend a truce beyond 20 April, seemingly referring to an earlier proposal from the US for a 30-day ceasefire which Ukraine had already agreed to. </p><p>It seems now both Moscow and Kyiv want to show Washington they are serious about peace. The question of whether the Kremlin accepts Zelensky's offer to turn this truce from a 30-hour one to a 30 day one is central to any potential path to peace.</p><p>Few Ukrainians think that is remotely possible.</p></div><div data-component=\"text-block\"><p>Putin had announced the temporary truce at a meeting with his chief of general staff, Valery Gerasimov.</p><p>\"Based on humanitarian considerations... the Russian side announces an Easter truce. I order a stop to all military activities for this period,\" Putin told Gerasimov.</p><p>\"We assume that Ukraine will follow our example. At the same time, our troops should be prepared to repel possible violations of the truce and provocations by the enemy, any aggressive actions.\"</p><p>The Russian defence ministry said its troops would adhere to the ceasefire provided it was \"mutually respected\" by Ukraine.</p><p>It is not the first time a pause in fighting has been suddenly announced - a previous attempt at a ceasefire during Orthodox Christmas in January 2023 fell apart after both sides failed to agree on a proposal. </p><p>Reacting to the recent truce announcement, a UK Foreign Office spokesperson said: \"Now is the moment for Putin to truly show he is serious about peace by ending his horrible invasion and committing to a full ceasefire, as the Ukrainian government has called for - not just a one day pause for Easter.\"</p></div><div data-component=\"text-block\"><p>Russia launched a full-scale invasion of Ukraine on 24 February 2022. It is estimated that hundreds of thousands of people - the vast majority of them soldiers - have been killed or injured on all sides. </p><p>The US has been directly talking to Russia as part of its efforts to end the war, but has struggled to make major progress. </p><p>Last month, Moscow came up with a long list of conditions in response to a full and unconditional ceasefire that had been agreed by the US and Ukraine.</p><p>US President Donald Trump on Friday warned Washington would \"take a pass\" on brokering further talks on ending the war in Ukraine unless there was quick progress.</p><p>He was speaking after Secretary of State Marco Rubio said the US was not \"going to continue with this endeavour for weeks and months on end\", as it had \"other priorities to focus on\".</p><p>\"We need to determine very quickly now - and I'm talking about a matter of days - whether or not this is doable,\" he added. </p><p>\"If it's not going to happen, then we're just going to move on.\"</p></div>","contentLength":5021,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k3hawc/attacks_continue_despite_putins_easter_truce/"},{"title":"Boeing jet returns to US from China, a victim of Trump's tariff war","url":"https://m.economictimes.com/news/international/global-trends/boeing-jet-returns-to-us-from-china-a-victim-of-trumps-tariff-war/articleshow/120447338.cms","date":1745129943,"author":"/u/Jaded-Bookkeeper-807","guid":609,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k3g7k0/boeing_jet_returns_to_us_from_china_a_victim_of/"},{"title":"Hong Kong’s oldest pro-democracy party is shutting down as Beijing leaves no room for dissent","url":"https://www.cnn.com/2025/04/19/asia/hong-kong-democratic-party-disbands-china-intl-hnk/index.html","date":1745112630,"author":"/u/BreakfastTop6899","guid":604,"unread":true,"content":"<p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjd3d9002p26qj9cwx0grl@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\"><a href=\"https://www.cnn.com/world/asia/hong-kong\">Hong Kong’s</a> oldest and largest pro-democracy political party is moving to disband as Beijing’s sweeping crackdown on the city leaves even moderate opposition groups with no room to operate.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i00023b6o98z9tjbg@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            The Democratic Party, one of the leading voices of opposition in the semi-autonomous city for the past three decades, has started the process of dissolution following recent warnings from Chinese government officials, two of its veteran members told CNN.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i00033b6oolf76q3d@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “The message was that the party has to be disbanded or there will be consequences,” said one of them, Yeung Sum, a former Democratic Party chairman.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9mgv75r00003b6oavl1d25k@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Fred Li, a former lawmaker, said a Chinese official told him that the party should not remain until the end of this year, when an election will be held.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i00043b6odd6tpjij@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Founded by liberal lawyers and academics three years before the former British colony’s 1997 handover to China, the Democratic Party had campaigned for universal suffrage and on matters from labor rights to conservation during a period when such issues were openly discussed in the city.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i00053b6oq89ha67p@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Widely seen as moderates willing to work with Beijing, Democratic Party leaders had spearheaded a significant voting bloc in the city’s legislature and were regularly afforded space to critique local government policy, until <a href=\"https://www.cnn.com/2019/11/15/asia/hong-kong-protests-explainer-intl-hnk-scli/index.html\">mass pro-democracy protests in 2019</a> ushered in a new and more restrictive political era.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i00063b6oawyqwg5k@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Beijing’s crackdown in the years since, including the prosecution and jailing of pro-democracy leaders, has left the once-influential party rudderless as it contends with <a href=\"https://www.cnn.com/2020/06/29/china/hong-kong-national-security-law-passed-intl-hnk/index.html\">sweeping national security legislation</a> and “patriots only” electoral reforms enacted in 2021 that make it nearly impossible for opposition candidates to stand for the city’s legislature.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i00073b6obz51xsp2@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Democratic Party chairman Lo Kin-hei told a news conference last Sunday that 90% of about 110 party members had voted to delegate power to a committee to start the dissolution process, adding he hoped a final vote would take place in the coming months.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i00083b6odkb24u8c@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “I hope Hong Kong’s political parties… will continue to work for the people,” Lo said. “We have always hoped to serve the Hong Kong people, and to do things that are good for society.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i00093b6oz560ngbz@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            The Democrats’ move to disband demonstrates Beijing’s unwillingness to allow even the mildest of dissenting voices to be heard in Hong Kong, say analysts.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000a3b6o6lzz80cy@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            John Burns, emeritus professor at the University of Hong Kong (HKU), said the party had “symbolized the promise of some kind of democratic development in Hong Kong, leading to universal suffrage as promised in the Basic Law,” referring to the city’s mini-constitution.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000b3b6oxwjzuw7e@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “A dissolution of the party reflects official Hong Kong’s turn away from popular participation, locally accountable government, and increased transparency toward more authoritarian rule,” Burns said.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000c3b6oyoenhyfb@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Eric Lai, a research fellow at the Georgetown Center for Asian Law, said the Democrats’ move “shows there are no more feasible ways for groups to exist as an opposition party.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000d3b6oza29kkj0@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “It’s self-conflicting for the government to suggest that nothing has changed,” he said.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000e3b6o5ntteh1c@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            In a statement to CNN, a city government spokesperson said decisions by individual groups “to disband or suspend operation are completely unrelated to the freedom or rights enshrined in Hong Kong law.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000f3b6o4bpg6tju@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Criticism of the government remains permitted in Hong Kong, “however strong, vigorous or critical” it may be, so long as it is “based on facts,” the spokesperson said. The Hong Kong government would “continue to resolutely discharge the duty of safeguarding national security,” they added.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000h3b6osg7nmg9u@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            The Democrats had enjoyed relative political freedom following Hong Kong’s return to Chinese rule, even holding more seats than any other party in the mostly pro-Beijing legislature until 2004.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000i3b6ogwkrmfng@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            The party’s leaders were often the figureheads of major demonstrations, including an annual June 4 vigil to commemorate the <a href=\"https://www.cnn.com/2022/06/03/asia/hong-kong-june-4-tiananmen-nsl-intl-mic-hnk/index.html\">Tiananmen Square massacre</a> and a well-attended pro-democracy march held every July. (Neither event would be permitted on the Chinese mainland, and both are now effectively banned in Hong Kong).\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000j3b6ohu6307pl@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            But support for the Democrats plunged in 2010 after its leaders negotiated directly for universal suffrage with officials from Beijing’s liaison office in Hong Kong – a move seen as a betrayal by other pro-democracy groups.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000k3b6o7qy2r76o@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            The party was then pushed further to the sidelines by the emergence of a new generation of pro-democracy leaders and student activists during months-long protests for universal suffrage in 2014.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000l3b6os5ucjxhm@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            However, when anti-government demonstrators returned to Hong Kong’s streets en masse in 2019, the Democrats’ popularity resurged as many of its leaders stood on the front lines of the massive – and sometimes violent – protests that rocked the financial hub.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000m3b6oc31ncuaz@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Later that year, the Democratic Party was the biggest winner in local district council elections. But its participation in the protests also drew the ire of Hong Kong authorities and Beijing, paving the way for its demise.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000n3b6o2cjzo2ce@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “The party made mistakes when it failed to draw a clear line between itself and radical separatists calling for Hong Kong’s independence from 2014-2020,” said Burns, from HKU. “Authorities have punished the party, jailing and chasing out Democratic Party leaders.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000o3b6octrzswly@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Over the past five years, the space for the Democrats to maneuver has been increasingly squeezed by Chinese authorities.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000p3b6oljb50x0b@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            In 2020, Beijing imposed a sweeping national security law on Hong Kong, introducing the maximum sentence of life imprisonment for four main crimes of secession, subversion, terrorism and collusion with foreign forces.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000q3b6ov977vxzz@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\"><a href=\"https://www.cnn.com/2021/06/29/asia/hong-kong-nsl-one-year-intl-hnk-dst/index.html\">A year later</a>, the Chinese government rewrote Hong Kong’s electoral rules to require candidates to seek nomination from pro-Beijing groups, essentially excluding the opposition from elections. A legislature filled with Beijing loyalists last year unanimously passed a law <a href=\"https://www.cnn.com/2024/03/19/china/hong-kong-second-national-security-law-passed-intl-hnk/index.html\">expanding the scope of national security offenses.</a></p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000r3b6ohz5ljbw3@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Beijing and the Hong Kong government argued that the electoral changes had enhanced democracy and have repeatedly defended the security laws as restoring order and returning prosperity to the city. But critics say they have curtailed freedoms and had a “chilling effect” on civil society, including independent institutions and the media.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000s3b6on6yf7iry@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Steve Tsang, director of the China Institute at SOAS University of London, said political and social protests seen as challenging state security are “becoming increasingly if not well-nigh impossible.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000t3b6o8vqi3h50@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “Many other elements of civil rights, including that of speech and organizing political parties have also been severely curtailed,” he added.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000u3b6ovq7gpv1b@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Last year, five former Democratic Party lawmakers were among <a href=\"https://www.cnn.com/2023/02/06/asia/hong-kong-national-security-law-subversion-trial-explainer-intl-hnk/index.html\">45 opposition figures</a> sentenced to prison terms of up to 10 years after they were found guilty of subversion for taking part in an election primary in 2020.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000v3b6o9dktk1fm@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            National security police have also placed HK$1 million ($129,000) bounties on pro-democracy activists who fled overseas, including an Australia-based former Democratic Party lawmaker accused of secession, subversion and collusion with a foreign country.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000w3b6o01au60w4@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Meanwhile, the trial of media tycoon and outspoken democracy supporter <a href=\"https://www.cnn.com/2023/12/21/china/hong-kong-nsl-trials-impact-explainer-intl-hnk/index.html\">Jimmy Lai</a> is ongoing, more than four years after he was detained on charges of colluding with foreign forces, which he denies.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000x3b6oq2o576ht@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            The Democratic Party’s announcement last weekend follows the dissolution of almost 100 civil and pro-democracy organizations in Hong Kong in the wake of Beijing’s crackdown.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000y3b6o286af8ri@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            The party had tried to survive as a civic group in recent years but struggled to raise funds as multiple private venues canceled their events, often at the last minute.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i000z3b6oha03qc2k@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Former Democratic Party lawmaker Emily Lau said the party’s move to disband was “very sad.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i00103b6o17i8827d@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “We’ve been around for over 30 years, and we’ve got the support of many Hong Kong people,” she told CNN outside court in February, before another former party lawmaker was jailed on charges of rioting during the 2019 protests.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm9jjem1i00113b6o97j5ufjz@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “I don’t know what they are thinking in Beijing. We have demonstrated, not just words, but by action, that we are reasonable. We are willing to talk, to negotiate, to compromise, reach a deal and go forward.”\n    </p>","contentLength":8826,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k3bj8b/hong_kongs_oldest_prodemocracy_party_is_shutting/"}],"tags":["news","reddit"]}