{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZUrxgZ6XNcyUn6fFxkgS1aSWJWwPwaqFp34erWr8NxVvd6jro8uiaPvDUjw","title":"top scoring links : kubernetes","displayTitle":"Reddit - Kubernetes","url":"https://www.reddit.com/r/kubernetes/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/kubernetes/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"How are operators used with CRDs, CRs?","url":"https://www.reddit.com/r/kubernetes/comments/1i9dzce/how_are_operators_used_with_crds_crs/","date":1737775653,"author":"/u/SeeTheUntruth_Ad7178","guid":570,"unread":true,"content":"<p>I’m relatively new to Kubernetes world. I followed instructions on installing an open source app via operator. Steps are simple - install operator with helm, then apply CRs with kubectl.</p><p>The problem is when I install the operator it also creates the resource. when I apply the CR file, the changes are applied only once. Every other modification in that file, does not get applied. I can’t figure out if this is a bug with the operator or I just don’t know how to use them operators. </p><p>Does an operator “magically” look for a CR file and uses it as part of its install? </p><p>What is the proper way of applying modifications to a CR file? </p><p>When I run k apply and none of the changes are actually applied, I start deleting pods, then deployments and at the end up deleting everything and starting over. </p><p>Any k8s wisdom or simple example would be greatly appreciated. (There aren’t many resource on this specifically. There are many tutorials on how to write your own operator and crd, but I’m not looking for that. )</p>","contentLength":1018,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Best rootless kubernetes distribution for production or production-scale demo?","url":"https://www.reddit.com/r/kubernetes/comments/1i959yv/best_rootless_kubernetes_distribution_for/","date":1737750898,"author":"/u/BosonCollider","guid":571,"unread":true,"content":"<p>I'm in an environment where machines not earmarked for production may be extremely locked down with no ability to install packages globally, and rootless podman as the only preinstalled container runtime.</p><p>What's the way to go here? I normally like k3s and Talos. The options I see are:</p><p>* rootless k3d (doubly experimental) * kind * usernetes v2</p><p>Does anyone have experience with these? My main requirement is to easily be able to helm install operators and use hostpath volumes for proof of concept deployments with minimal friction.</p>","contentLength":529,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Kubernetes Backup - Tooling and recommendations","url":"https://www.reddit.com/r/kubernetes/comments/1i919r0/kubernetes_backup_tooling_and_recommendations/","date":1737740794,"author":"/u/flxptrs","guid":569,"unread":true,"content":"<p>I would love to hear your input on kubernetes backups. We run a multi tenant cluster. Most of the services are based on operators, so the tenants deploy and operate whatever they need. Pretty nice in terms of platform operations. </p><p>The only weak spot is our backup strategy. We use velero, but we are not happy. There are multiple issues and shortcomings for multi tenancy, but also other bugs which make it a ongoing pain. </p><p>So my question is: what do you use for backups and what's your strategy? Any recommendations especially for multi tenant scenarios? </p>","contentLength":554,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How do people deploy a prometheus stack?","url":"https://www.reddit.com/r/kubernetes/comments/1i8z5xa/how_do_people_deploy_a_prometheus_stack/","date":1737735580,"author":"/u/HardChalice","guid":573,"unread":true,"content":"<p>I'm running a homelab on microk8s just to get experience with kubernetes. Currently have Traefik setup as my ingress with their IngressRoutes with a gitea and argocd instance for my CI/CD.</p><p>I've been looking into deploying a prometheus/loki/grafana stack and I'm torn on the best way to deploy it. I know there is the kube-peometheus operator but that would circumvent my argoCD. There is a helm chart for it but that's community maintained and not official. Or do I implement them all from scratch for the experience? </p><p>So I wanted to see how others have implemented in both production and homelab-like environments. </p>","contentLength":614,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"What platforms should I be considering?","url":"https://www.reddit.com/r/kubernetes/comments/1i8wi4q/what_platforms_should_i_be_considering/","date":1737728611,"author":"/u/jaymef","guid":572,"unread":true,"content":"<p>Bit of context. Old school sysadmin with number of years experience. I'm fairly comfortable with containers, Linux administration, networking/security etc. but have never ventured into Kubernetes. </p><p>I'm looking to run some form of container platform onprem, mostly to be used to support our companies web development/staging environments. The majority of our production workloads are cloud based.</p><p>I want to do containers onprem but I'd like to avoid deploying an overly complex system that nobody understands. It does not have to be mission critical, but some high availability for system patches/reboots etc. would be preferred.</p><p>I would like to start with maybe three bare metal servers and go from there.</p><p>I've been doing some research and it looks like K3s might be an option. I've also come across Nomad, OpenShift and its upstream OKD, Rancher, MicroK8s, Talos, K0S and a bunch of other products.</p><p>For Openshift/OKD, I'm a bit weary because I don't want vendor lock in and Red Hat screwed us with killing RHEV/oVirt platform. Nomad I feel somewhat similar, not sure about getting in bed with Hashicorp.</p><p>I'm not looking for someone to make a decision for me, but would appreciate some help with being pointed in the right direction at what solutions might be a good fit so I can start setting up POC's. I'd like a platform with a lot of community support.</p>","contentLength":1350,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Do you use helmfile? Why or why not?","url":"https://www.reddit.com/r/kubernetes/comments/1i8r8t9/do_you_use_helmfile_why_or_why_not/","date":1737709021,"author":"/u/singhalkarun","guid":574,"unread":true,"content":"<p>How do you structure your helm packages installation? How do you manage upgrades? Do you have CI/CD for upgrades?</p>","contentLength":113,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}]}