{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Pentagon tells Congress no sign that Iran was going to attack US first, sources say","url":"https://www.reuters.com/world/us/pentagon-tells-congress-no-sign-that-iran-was-going-attack-us-first-sources-say-2026-03-02/","date":1772427166,"author":"/u/Yournewbestfriend_01","guid":595,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1rijnl7/pentagon_tells_congress_no_sign_that_iran_was/"},{"title":"Israel launches barrage of strikes on Lebanon's capital Beirut after Hezbollah's offensive","url":"https://m.economictimes.com/news/defence/israel-launches-barrage-of-strikes-on-lebanons-capital-beirut-after-hezbollahs-offensive/amp_articleshow/128932615.cms","date":1772414482,"author":"/u/5-minutes-more","guid":592,"unread":true,"content":"Israel launched a barrage of strikes on Lebanon's capital, Beirut, after the Lebanese militant group Hezbollah fired missiles across the border early Monday. It was the first time in more than a year that Hezbollah has claimed a strike against Israel. The Israeli military said it intercepted a projectile that crossed the border and that several others fell in open areas. No injuries or damage were reported.<p> Hezbollah said in a statement that the strikes were carried out in retaliation for the killing of Iran's supreme leader, Ali Khamenei, and for \"repeated Israeli aggressions.\"</p>The U.S. and Israel pounded targets across Iran on Sunday, dropping massive bombs on the country's ballistic missile sites and wiping out warships as part of an intensifying military campaign following the killing of Supreme Leader Ayatollah Ali Khamenei. Blasts rattled windows across the country and sent plumes of smoke high into the sky above Tehran. More than 200 people have been killed since the start of the strikes that killed Khamenei and other senior leaders, Iranian leaders have said.<p> Iran vowed revenge, firing missiles at Israel and Gulf Arab states in a counteroffensive that the U.S. military said resulted in the deaths of three service members - the first known American casualties from the conflict. Israeli rescue services said strikes had hit several locations, including Jerusalem and a synagogue in the central town of Beit Shemesh, where nine people were killed and 28 wounded, bringing the overall death toll in the country to 11. Eleven people were still missing after the strike, police said.</p> But the attacks on Iran showed no signs of relenting as the U.S. and Israel took aim at key military, political and intelligence targets in what appeared to be a widening war that carried the potential for a prolonged conflict that could envelop the Middle East and destabilize it. The strikes represented a startling show of military might for an American president who swept into office on an \"America First\" platform and pledged to keep out of \"forever wars.\"<p> Trump vows vengeance for US deaths U.S. President Donald Trump said in a video posted to social media that the U.S. would \"avenge\" the deaths of the service members and that \"there will likely be more\" killed before the conflict ends.</p> Israel, which had pledged \"nonstop\" strikes, said it was increasing its attacks, with 100 fighter jets simultaneously striking targets in Tehran, Brig. Gen. Effie Defrin told reporters at a briefing. The targets included buildings belonging to Iran's air force, its missile command and its internal security force, which violently quashed anti-government protests in January.<p> The U.S. military, meanwhile, said B-2 stealth bombers struck Iran's ballistic missile facilities with 2,000-pound bombs. Trump said on social media that nine Iranian warships had been sunk and that the Iranian navy's headquarters had been \"largely destroyed.\"</p> Europe has mostly stayed out of the war and pressed for diplomacy, but in an indication that the conflict could draw in other nations, Britain, France and Germany said Sunday they were ready to work with the U.S. to help stop Iran's attacks.<p> Prime Minister Keir Starmer said Britain would allow the United States to use its bases to strike Iranian missile sites. The U.K. maintains nearby bases on Cyprus and the Chagos Islands, a British archipelago in the Indian Ocean.</p> The weekend attacks were the second time in eight months that the U.S. and Israel had combined against Iran. In the 12-day war last June, Israeli and American strikes greatly weakened Iran's air defenses, military leadership and nuclear program. But the killing of Khamenei, who ruled Iran for more than three decades, creates a leadership vacuum, increasing the risk of regional instability.<p> Trump, who a day earlier had encouraged Iranians to \"take over\" their government, signaled Sunday that he was open to dialogue with Iran's new leadership.</p><p> \"They want to talk, and I have agreed to talk, so I will be talking to them,\" he told The Atlantic.</p><p> Iranian strikes extend beyond US and Israel In the Gulf, Iran's retaliatory strikes went beyond U.S. and Israeli targets, pushing the conflict into cities that have long marketed themselves as regional safe havens.</p><p> The foreign ministers of Qatar, Saudi Arabia, the United Arab Emirates, Kuwait, Oman and Bahrain said Sunday that their countries retain \"the legal right to respond and the right to self-defense\" after Iranian strikes hit hotels, airports and other sites in multiple cities throughout the Gulf.</p><p> In the United Arab Emirates, authorities said most Iranian missiles and drones were intercepted. But some either got through or fell as debris, killing three people, injuring others and causing significant damage.</p><p> Bahrain and Kuwait said Iranian strikes in both countries hit civilian targets.</p><p> Streets of Tehran are largely deserted In Tehran, there was little sign that Iranians had heeded Trump's call for an uprising against the government.</p><p> The streets were largely deserted as people sheltered during airstrikes, witnesses told The Associated Press, speaking anonymously for fear of retribution. The paramilitary Basij, which has played a central role in crushing protests, set up checkpoints across the city, they said.</p><p> Two powerful explosions were heard in Tehran's Niavaran neighborhood late Sunday.</p><p> An eyewitness in the city told AP that the windows of their apartment shook violently, and residents came out onto the streets fearing it was too dangerous to stay inside. The witness spoke on condition of anonymity for fear of reprisals. Video footage from Tehran showed plumes of smoke filling the skyline, and the official IRNA news agency reported that parts of the building of the Islamic Republic of Iran Broadcasting (IRIB) were struck Sunday.</p><p> In southern Iran, at least 165 people were killed Saturday when a girls' school was struck, and dozens more were wounded, IRNA reported. The Israeli military said it was not aware of strikes in the area. The U.S. military said it was looking into the reports.</p><p> New Iranian leadership is in place As supreme leader, Khamenei had final say on all major policies since 1989. He led Iran's clerical establishment and the Revolutionary Guard, the two main centers of power in the governing theocracy.</p><p> The CIA had been tracking the movements of senior Iranian leaders, including Khamenei, for months, according to a person familiar with the operation who was not authorized to comment publicly and spoke on condition of anonymity. The intelligence was shared with Israeli officials, and the timing of the strikes was adjusted in part because of that information, the person said.</p><p> Iranian President Masoud Pezeshkian said in a prerecorded message that a new leadership council had begun its work. The country's foreign minister, Abbas Araghchi, said a new supreme leader would be chosen in \"one or two days.\"</p><p> Araghchi wrote Sunday in a letter to the United Nations that the attacks on Iran by the U.S. and Israel - including the strike on Khamenei - \"recklessly open a dangerous Pandora's box, eroding the bedrock of sovereign equality and the stability of the international system.\"</p><p> Iran promises revenge for Khamenei killing As word spread of Khamenei's death, some in Tehran could be seen cheering from rooftops, witnesses said. Others mourned as a black flag was raised over the Imam Reza shrine in Mashhad.</p><p> An Iranian medical professional in northern Iran said he and colleagues spent the early hours of Sunday celebrating Khamenei's death indoors because armed security forces are still heavily deployed in his city.</p><p> There were forces stopping and interrogating people celebrating in their cars, but there was no gunfire, said the doctor, who spoke on condition of anonymity for fear of reprisal.</p><p> \"It was one of the best nights, if not the best night of our lives,\" the doctor said in a voice message from the city of Rasht. In fact, \"it was actually my first time ever smoking a cigarette. It was a very, very nice time. We didn't sleep at all. And we don't even feel tired.\"</p><p> Araghchi, Iran's foreign minister, blamed the U.S. and Israel for starting the war. He said he had spoken to his counterparts in the Gulf countries and urged them to pressure the U.S. and Israel to end it.</p><p> \"You have crossed our red line and must pay the price,\" Iran's parliamentary speaker, Mohammad Bagher Qalibaf, said in a televised address. \"We will deliver such devastating blows that you yourselves will be driven to beg.\"</p><p> In a social media post, Trump warned against any retaliation, saying \"IF THEY DO, WE WILL HIT THEM WITH A FORCE THAT HAS NEVER BEEN SEEN BEFORE!\"</p><p> Chance to kill senior leaders was a 'golden opportunity' An Israeli military official described Saturday's mission against the Iranian leadership as the result of months of \"extremely high coordination\" with the U.S. The official, speaking on condition of anonymity to discuss a covert operation, said a variety of factors created a \"golden opportunity.\" Those factors included weeks of training and monitoring the movements of senior figures, along with \"real time intelligence\" that the targets were gathered together.</p><a href=\"https://whatsapp.com/channel/0029Vb6dOI1EKyZPPqpH7I0y\"><img height=\"90\" width=\"400\" src=\"https://img.etimg.com/photo/111576466.cms\" alt=\"Whatsapp Banner\"></a> The results, the official said, were near-simultaneous strikes, within 60 seconds of one another, in three locations 1,000 miles (1,609 kilometers) from Israel that killed Khamenei and some 40 senior figures, including the head of the Revolutionary Guard and the country's defense minister.","contentLength":9491,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1rif9jy/israel_launches_barrage_of_strikes_on_lebanons/"},{"title":"UK will allow US to use bases to strike Iranian missile sites, says Starmer","url":"https://www.bbc.co.uk/news/articles/cqj9g11p1ezo","date":1772401293,"author":"/u/Alarming-Safety3200","guid":598,"unread":true,"content":"<p>The US and Israel began attacking Iran early on Saturday, with Trump encouraging the Iranian people to remove the country's government.</p><p>The Iranian regime has responded with attacks on US assets and countries in the region with a US military presence, including Bahrain, Qatar, the United Arab Emirates, Kuwait and Iraq.</p><p>Sir Keir had said UK aircraft were \"in the sky\" in the Middle East as part of a defensive operation to protect its allies and citizens in the region, but said the UK \"played no role\" in the strikes.</p><p>On Sunday, he said British aircraft had successfully intercepted Iranian strikes, but added: \"Our partners in the Gulf have asked us to do more to defend them and it's my duty to protect British lives.\"</p><p>He began the statement by saying it \"remains the case\" that the UK is \"not involved in the strikes on Iran\". </p><p>At least 200,000 British citizens are in the region - including residents, those on holidays and passengers in transit, Sir Keir said - and the government \"will continue to do all we can to support\" them. </p><p>British people, including members of the armed forces, as well as allies, were being put at \"huge risk\" from Iranian strikes, he said, accusing the regime of \"becoming even more reckless\". </p><p>Iranian strikes have \"hit airports and hotels where British citizens are staying\", and on Saturday \"hit a military base in Bahrain, narrowly missing British personnel\", Sir Keir said.</p><p>He added: \"The only way to stop the threat is to destroy the missiles at source, in their storage depots, or the launchers which are used to fire the missiles.</p><p>\"The United States has requested permission to use British bases for that specific and limited defensive purpose.</p><p>\"We have taken the decision to accept this request to prevent Iran firing missiles across the region, killing innocent civilians, putting British lives at risk, and hitting countries that have not been involved.\"</p><p>The Foreign Office has asked British nationals in Bahrain, Israel, Kuwait, the Palestinian territories, Qatar and UAE to register their presence to receive updates.</p>","contentLength":2053,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ria0mz/uk_will_allow_us_to_use_bases_to_strike_iranian/"},{"title":"Iran taps general linked to 1994 Buenos Aires Jewish center bombing as new IRGC chief","url":"https://www.ynetnews.com/article/ryzkfywtbl","date":1772400804,"author":"/u/PjeterPannos","guid":591,"unread":true,"content":"<div data-block=\"true\" data-editor=\"6lcln\" data-offset-key=\"7l0j6-0-0\"><div data-offset-key=\"7l0j6-0-0\"><a href=\"https://www.ynetnews.com/article/bkim8d8ga\" target=\"_blank\"></a></div></div><div data-block=\"true\" data-editor=\"6lcln\" data-offset-key=\"9inc1-0-0\"><div data-offset-key=\"9inc1-0-0\"><a href=\"https://www.ynetnews.com/article/rjfjkg8wr\" target=\"_blank\"></a></div></div>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ri9t17/iran_taps_general_linked_to_1994_buenos_aires/"},{"title":"France Orders Aircraft Carrier Charles de Gaulle to Eastern Mediterranean Amid Escalating Regional Conflict","url":"https://www.kurdistan24.net/en/story/897253/france-orders-aircraft-carrier-charles-de-gaulle-to-eastern-mediterranean-amid-escalating-regional-conflict","date":1772396644,"author":"/u/WayOutbackBoy","guid":594,"unread":true,"content":"<p>France has ordered its nuclear-powered aircraft carrier, the Charles de Gaulle, to cut short its deployment in the North Atlantic and Baltic Sea and head immediately toward the Eastern Mediterranean, marking a significant strategic shift amid intensifying regional tensions.</p><p>The move follows an emergency session of the Defense and National Security Council convened by President Emmanuel Macron at the Élysée Palace on Sunday.</p><p>The carrier strike group had recently been visiting Malmö, Sweden, as part of “Mission Lafayette 26,” before being redirected to provide what French authorities described as “regional stability and protection of French interests.”</p><p>Earlier in the day, Macron stated that France was “neither informed nor involved” in the initial U.S.-Israeli strikes. However, subsequent Iranian retaliatory attacks on Gulf states, including a strike on the Al-Salam Naval Base in Abu Dhabi, prompted a French military response.</p><p>Although France, Germany, and the United Kingdom have officially called for a “negotiated solution,” NATO’s top commander in Europe, Gen. Alexus Grynkewich, confirmed that the alliance is “adjusting its force posture” to defend against potential ballistic missile threats originating from the region.</p><p>The Charles de Gaulle, Europe’s only nuclear-powered aircraft carrier, carries Rafale M fighter jets capable of delivering the ASMP air-to-ground nuclear-tipped cruise missile. Its redeployment to the Eastern Mediterranean is seen as serving three core objectives: deterrence against further escalation targeting European assets, preparation for potential non-combatant evacuation operations for French and EU citizens in Lebanon and the UAE, and reinforcement of NATO’s southern flank through expanded radar and air defense coverage.</p><p>“France stands alongside its partners affected by the Iranian response,” Macron said. “Our absolute priority is the safety of our citizens and the prevention of a total regional collapse.”</p><p>Military observers note that the arrival of a French carrier strike group alongside the USS Abraham Lincoln represents one of the most concentrated Western naval presences in the Middle East since the 1991 Gulf War, underscoring the seriousness of the unfolding crisis.</p>","contentLength":2263,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ri7zre/france_orders_aircraft_carrier_charles_de_gaulle/"},{"title":"Kazakhstan plants tens of thousands of trees in giant effort to reintroduce tigers","url":"https://www.livescience.com/animals/cats/kazakhstan-plants-tens-of-thousands-of-trees-in-giant-effort-to-reintroduce-tigers","date":1772385880,"author":"/u/hion_8978","guid":597,"unread":true,"content":"<p><a data-analytics-id=\"inline-link\" href=\"https://www.livescience.com/27441-tigers.html\" data-url=\"https://www.livescience.com/27441-tigers.html\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\" data-before-rewrite-localise=\"https://www.livescience.com/27441-tigers.html\"></a> will soon roam Kazakhstan for the first time in over 70 years as conservationists undertake a gargantuan effort to restore part of their lost habitat.</p><p>The last of Kazakhstan's Caspian tigers disappeared in the late 1940s, after years of hunting, habitat loss and declines in prey numbers. Now, the Central Asian country has an ambitious plan to reintroduce the world's largest cats to their historic lands.</p><p aria-hidden=\"true\">So far, two captive tigers (a male and a female) are already in Kazakhstan as part of a breeding-and-release project, while the country is expecting its first wild tigers to be transported from Russia in the first half of 2026. However, for the program to be a success, the tigers need plenty of places to live. That's where an enormous tree-planting project comes in.</p><p>Last year, the Kazakhstan tiger reintroduction program — led by the government of Kazakhstan with support from the World Wildlife Fund (WWF) and the United Nations Development Programme — planted 37,000 seedlings and cuttings near a giant lake in southeast Kazakhstan's South Balkhash region, where tigers used to live, according to <a data-analytics-id=\"inline-link\" href=\"https://www.wwfcentralasia.org/en/?20664391/Record-Breaking-Tugai-Forest#\" target=\"_blank\" data-url=\"https://www.wwfcentralasia.org/en/?20664391/Record-Breaking-Tugai-Forest#\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a>. This adds to the 50,000 seedlings planted between 2021 to 2024.</p><p>Tree planting is a key part of Kazakhstan's massive ongoing greening initiative. The country has planted around 1.4 billion trees since 2021, and officials say they are on track to <a data-analytics-id=\"inline-link\" href=\"https://qazinform.com/news/2-billion-trees-to-be-planted-in-kazakhstan-by-2027-45db9b\" target=\"_blank\" data-url=\"https://qazinform.com/news/2-billion-trees-to-be-planted-in-kazakhstan-by-2027-45db9b\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"><u>reach 2 billion trees by 2027</u></a>.</p><p>In South Balkhash, newly planted trees serve as a foundation for recovering ecosystems that sit alongside already-forested lands. The trees provide shelter and water access, as well as food for the tiger's prey: hooved mammals (ungulates) like boar and Bukhara deer (<em>Cervus elaphus bactrianus,</em> also called Bactrian deer).</p><p>\"Already, wild ungulates have been seen foraging on the restored sites, indicating that the ecosystem is beginning to function,\" a spokesperson for WWF Central Asia told Live Science in an email. \"Each planted seedling is therefore a direct contribution to the future of the tiger in Kazakhstan.\"</p><p>The planting zone encompasses around 2.5 miles (4 kilometers) of shoreline along <a data-analytics-id=\"inline-link\" href=\"https://science.nasa.gov/earth/earth-observatory/lake-balkhash-91230/\" target=\"_blank\" data-url=\"https://science.nasa.gov/earth/earth-observatory/lake-balkhash-91230/\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a>, which covers roughly 6,500 square miles (17,000 square km) and is the largest lake in Central Asia and the 15th-largest lake in the world. The new vegetation — which includes 30,000 narrow-leaf oleaster seedlings, 5,000 willow cuttings and 2,000 turanga poplar seedlings — creates growing \"islands\" of forest that regulate the flow of water to stabilize floods and overflows.</p><figure data-bordeaux-image-check=\"\"><figcaption itemprop=\"caption description\"></figcaption></figure><p>WWF Central Asia attributes the increase in planting in 2025 to the accumulated experience of the staff, as well as to factors like improved planting techniques and expanded partnerships. However, the pace of the ecosystem's recovery and its suitability for tigers will depend on a variety of factors, including the climate, stability of water resources, and growth of vegetation.</p><p>The tigers that used to live in Kazakhstan were part of a now-extinct Central Asian population known as Caspian tigers. However, the living Amur tigers found in the Russian Far East and <a data-analytics-id=\"inline-link\" href=\"https://www.livescience.com/tag/china\" data-auto-tag-linker=\"true\" data-url=\"https://www.livescience.com/tag/china\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\" data-before-rewrite-localise=\"https://www.livescience.com/tag/china\">China</a> (and potentially North Korea) can serve as suitable replacements. A 2009 study published in the journal <a data-analytics-id=\"inline-link\" href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC2624500/\" target=\"_blank\" data-url=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC2624500/\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a> found that Caspian and Amur tigers were <a data-analytics-id=\"inline-link\" href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC2624500/\" target=\"_blank\" data-url=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC2624500/\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"><u>likely part of the same population</u></a> until human activity forced them apart in the 19th century, meaning they're essentially the same animal.</p><p>The reintroduction program welcomed two <a data-analytics-id=\"inline-link\" href=\"https://tigers.panda.org/?15021391/Tigers-Return-to-Kazakhstan-in-Historic-Reintroduction-Effort\" target=\"_blank\" data-url=\"https://tigers.panda.org/?15021391/Tigers-Return-to-Kazakhstan-in-Historic-Reintroduction-Effort\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a> in 2024, and they appear to have adapted well to life in Kazakhstan. These tigers, a female named Bodhana and a male named Kuma, came from an animal sanctuary in the Netherlands in 2024 and are currently living in an enclosure within the Ile-Balkhash Nature Reserve. Bodhana and Kuma are used to life in captivity, so they'll never be released, but the hope is that their offspring will form part of a new founder population of Kazakhstan tigers.</p><p>However, as there's no guarantee that Bodhana and Kuma will breed or produce suitable offspring, so the bulk of the new population will be made up of wild tigers imported from Russia.</p><p>Kazakhstan officials are expecting to receive the first tigers from Russia <a data-analytics-id=\"inline-link\" href=\"https://astanatimes.com/2025/11/kazakhstan-to-welcome-first-amur-tigers-from-russia-in-2026/\" target=\"_blank\" data-url=\"https://astanatimes.com/2025/11/kazakhstan-to-welcome-first-amur-tigers-from-russia-in-2026/\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a>. WWF Central Asia told Live Science that it hasn't been confirmed where the Russian tigers are coming from, but \"based on publicly available information and recent media reports, it is understood that the Amur tigers expected in the first half of 2026 are from the wild.\"</p><p>Reintroducing large predators is a <a data-analytics-id=\"inline-link\" href=\"https://www.livescience.com/animals/bears/bear-kills-jogger-in-italian-alps-what-does-this-mean-for-the-effort-to-bring-bears-back-to-the-region\" target=\"_blank\" data-url=\"https://www.livescience.com/animals/bears/bear-kills-jogger-in-italian-alps-what-does-this-mean-for-the-effort-to-bring-bears-back-to-the-region\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\" data-before-rewrite-localise=\"https://www.livescience.com/animals/bears/bear-kills-jogger-in-italian-alps-what-does-this-mean-for-the-effort-to-bring-bears-back-to-the-region\"><u>delicate and risky process</u></a>, particularly when those predators are capable of harming humans and livestock. But it can be done; a 2024 study published in <a data-analytics-id=\"inline-link\" href=\"https://wildlife.onlinelibrary.wiley.com/doi/10.1002/jwmg.22691\" target=\"_blank\" data-url=\"https://wildlife.onlinelibrary.wiley.com/doi/10.1002/jwmg.22691\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"><u>The Journal of Wildlife Management</u></a> found that a tiger reintroduction attempt in Russia was largely a success. Researchers cared for six orphaned wild cubs and prepared them for re-release into their natural habitat. The tigers caught their own prey and survived.</p><p>However, the study noted that one rehabilitated tiger killed multiple domestic animals, including more than 13 goats in a single event, and failed to demonstrate adequate fear of humans. That tiger was subsequently recaptured and placed in a zoo.</p><p>WWF Central Asia said Kazakhstan's program is prepared to resolve any incidents that involve human conflict with its released tigers. Measures include creating a special team that will continuously track released individuals and respond to any potential human-wildlife conflicts.</p><p>\"The group's main tasks include regular patrols, monitoring tiger movements via satellite collars, early detection of potential approaches to settlements, and rapid response measures,\" the WWF Central Asia spokesperson said.</p><p>The program is also working with local communities to raise awareness about tigers and how to behave in their presence, as well as promoting sustainable development in those communities by offering grants for agriculture and ecotourism, according to WWF Central Asia.</p><p>\"All of this forms part of a long-term strategy for peaceful coexistence between people and predators,\" the spokesperson said. \"A compensation scheme for local residents is also planned in cases where tigers cause livestock losses.\"</p>","contentLength":6037,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ri340h/kazakhstan_plants_tens_of_thousands_of_trees_in/"},{"title":"Nine Israelis killed, 11 missing, dozens injured after Iranian missile hits Beit Shemesh building","url":"https://www.jpost.com/israel-news/article-888332","date":1772385094,"author":"/u/r721","guid":596,"unread":true,"content":"<section><p>An Iranian ballistic missile on Sunday killed nine people, some of whom were in a bomb shelter, left several missing, and wounded dozens, including several children, in Beit Shemesh.</p></section><section><p>There were also some other minor hits in other parts of the country, and along with one woman who died overnight between Saturday and Sunday, the number of Israelis killed by Iranian missile fire has risen to 10, along with nearly 500 wounded, though mostly with light wounds.</p></section><section><p>Up to eight residences and the bomb shelter were destroyed in the attack, with about half of those killed in the shelter when the roof collapsed and the other half killed outside the shelter.</p></section><section><p>Despite the bomb shelter casualties, IDF Home Front Command Chief Maj.-Gen. Shai Kleper urged all Israeli citizens to continue to go to bomb shelters and safe rooms since, short of a direct hit, they provide life-saving protection.</p></section><section><p>Some 30 ambulances from <a href=\"https://www.jpost.com/health-and-wellness/article-879493\">Magen David Adom</a> were dispatched to the scene in Beit Shemesh, while the IDF said that Home Front Command Search and Rescue teams, combined with numerous medical forces and a helicopter to evacuate the wounded, were operating at the scene.</p></section><section><em></em></section><section><p>Hadassah-University Medical Center said that 18 of the wounded, including three children, were evacuated to its campus in Jerusalem’s Ein Kerem. Another 17, including four children, were evacuated to its campus on Mount Scopus.</p></section><section><p>The IDF also said that the early warning system functioned as planned and was activated in the impact area while the situation was being investigated.</p></section><section><p>A rocket also landed in central Israel.</p></section><section><p>In addition, a woman in her 60s died after being evacuated to the emergency department at Sourasky Medical Center’s Ichilov Hospital in Tel Aviv due to experiencing shortness of breath while making her way to a safe room during the <a href=\"https://www.jpost.com/middle-east/iran-news/2026-03-01/live-updates-888324\">first round of sirens</a> early Sunday morning.</p></section><section><p>She was transported by MDA as resuscitation efforts were underway. Despite the medical team’s efforts to save her, doctors were forced to pronounce her dead.</p></section><section><em></em></section><h3><strong>The death of Ayatollah Ali Khamenei</strong></h3><section><p>All of this occurred as Iran increased its volume and pace of <a href=\"https://www.jpost.com/middle-east/iran-news/article-888427\">ballistic missile attacks</a> toward Israel early Sunday, with several rounds of siren warnings ringing out across the country one after another in response to the Islamic Republic admitting the death of its supreme leader, Ayatollah Ali Khamenei.</p></section><section><p>Although it turns out Khamenei was killed likely in the war’s opening moments by around 30 bombs at around 8 am Saturday morning, the more intense response only came later.</p></section><section><p>The Islamic Republic only acknowledged his death after 3 am Sunday morning, and it appeared to take a couple more hours to organize a full coordinated response.</p></section><section><p>While the IDF has still not confirmed the volume of missile attacks, anecdotally, the pace of salvos and the volume of booms Sunday morning were unprecedented for this round of fighting and were more comparable to the worst large rounds of attacks in June 2025, some of which involved up to 200 ballistic missiles.</p></section><section><p>In contrast, on Saturday, if around 150 missiles might have been fired at Israel over the course of the day, the salvos appeared to be limited to a dozen or at most a couple of dozen missiles per salvo, spread across around 10 salvos over 24 hours.</p></section><section><p>In total, Tehran entered this latest round of conflict with around 2,500 ballistic missiles.</p></section><section><p>However, it has also already fired hundreds of missiles on five other Sunni Arab countries in the region with American bases.</p></section><section><p>Likewise, US and American attacks appear to have destroyed at least 100 ballistic missiles, though that number could be significantly higher.</p></section><section><p>In June 2025, Iran had 3,000 ballistic missiles and 400 missile launchers.</p></section><section><p>Israel destroyed around half of the missiles and launchers over 12 days, eventually reducing the Islamic Republic’s ballistic missile volume from 200 per day to around 10 per day.</p></section><section><p>IDF Home Front Command on Sunday morning said that it was far more ready for Iran’s ballistic missile attacks during the z than during the 12 Day War in June.</p></section><section><p>Based on lessons learned from the previous conflict, the Home Front Command credited the military and the civilian population with fewer hits, deaths, and wounded.</p></section><section><p>The procedure of an initial general warning 10-20 minutes before a threat, followed by a siren around 90 seconds before a threat, along with general civilian awareness of staying near safe rooms and bomb shelters, has made the country far safer, the IDF said.</p></section><section><p>Kleper has been in his role since July 2025.</p></section><section><p>There are now more rescue teams – with dozens able to cover the country in the event of large impacts – than there were in June 2025.</p></section><section><p>Most missiles have been fired from Western Iran, the closest part of the country to Israel.</p></section><section><p>The US and Israel have not yet succeeded in pushing ballistic missile launches back toward central and eastern Iran, which eventually started to occur in June 2025.</p></section><section><p>The IDF was hopeful that this tactical shift of pushing the missile firing lines further away from Israel would occur in the coming days.</p></section><section><p>According to the Home Front Command, all air travel to and from Israel will be closed for at least another day, with the situation being re-evaluated on a daily basis going forward.</p></section><section><p>For now, the economy and school system are closed, with only essential services open.</p></section>","contentLength":5267,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ri2rek/nine_israelis_killed_11_missing_dozens_injured/"},{"title":"Saudi prince quietly lobbied Trump for military action on Iran","url":"https://www.moneycontrol.com/world/saudi-prince-quietly-lobbied-trump-for-military-action-on-iran-article-13847240.html","date":1772383611,"author":"/u/jupa300","guid":599,"unread":true,"content":"<p>Saudi Crown Prince Mohammed bin Salman made multiple private phone calls to US President Donald Trump last month, urging him to launch military action against Iran, even as he publicly favoured diplomacy, according to a report by The Washington Post.</p><p>The report said the crown prince pressed for a strike despite earlier public statements in January in which he insisted Saudi Arabia would not allow its airspace or territory to be used for attacks on Iran. At the time, he called for dialogue between Washington and Tehran and said Riyadh respected Iran’s sovereignty.</p><p>The US and Israel went on to carry out joint strikes targeting Iranian military and government sites after nuclear talks stalled and amid claims that Tehran had resumed aspects of its nuclear programme. President Trump said the “heavy and pinpoint bombing” would continue for as long as necessary.</p><p>The escalation quickly widened into a regional confrontation. Iran launched retaliatory attacks on Abu Dhabi and Dubai in the United Arab Emirates, Doha in Qatar, and Riyadh in Saudi Arabia.</p><p>Saudi Arabia’s Foreign Ministry condemned what it described as “blatant and cowardly Iranian attacks,” saying they could not be justified “under any pretext.” The statement added that the attacks came despite Riyadh’s repeated assurances that it would not permit its territory to be used to target Iran.</p><p>According to Arab News, the crown prince subsequently spoke with regional leaders, including UAE President Mohammed bin Zayed Al-Nahyan, Bahrain’s King Hamad bin Isa Al-Khalifa, Qatar’s Emir Tamim bin Hamad Al-Thani, Kuwait’s Emir Mishal Al-Ahmad Al-Jaber Al-Sabah, and Jordan’s King Abdullah II. He expressed solidarity and pledged Saudi Arabia’s readiness to mobilise resources to support them against what he called Iranian aggression.</p><p>The crisis intensified further after Iran’s Supreme Leader Ayatollah Ali Khamenei was killed in the US-Israeli strikes. Iranian state television and IRNA confirmed his death, while President Trump said it offered Iranians their “greatest chance” to reclaim their country.</p><p>In response, the Islamic Revolutionary Guard Corps warned of its “most intense offensive operation” yet, targeting Israel and US bases in the region.</p><p>The reported behind-the-scenes lobbying by the Saudi crown prince adds a new dimension to the conflict, suggesting that regional alignments may be more complex than public statements indicate. With Iran’s top leadership decapitated and retaliatory strikes underway, the Middle East now faces one of its most volatile moments in decades.\n       </p>","contentLength":2600,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ri23p9/saudi_prince_quietly_lobbied_trump_for_military/"},{"title":"Former Iranian president Mahmoud Ahmadinejad reported assassinated","url":"https://www.ynetnews.com/article/b1hymtzt11g","date":1772375344,"author":"/u/Sensitive_Echo5058","guid":600,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1rhymzb/former_iranian_president_mahmoud_ahmadinejad/"},{"title":"First oil tanker attacked in the Strait of Hormuz according to Oman","url":"https://www.euronews.com/business/2026/03/01/first-oil-tanker-attacked-in-the-strait-of-hormuz-according-to-oman","date":1772368389,"author":"/u/Force_Hammer","guid":593,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1rhw699/first_oil_tanker_attacked_in_the_strait_of_hormuz/"}],"tags":["news","reddit"]}