{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Russia's Putin trying to 'manipulate' Trump, says Ukraine","url":"https://www.dw.com/en/russias-putin-trying-to-manipulate-trump-says-ukraine/a-71404340","date":1737763605,"author":"/u/Ok-Somewhere9814","guid":593,"unread":true,"content":"<p><a href=\"https://www.dw.com/en/ukraine/t-17295382\">Ukraine</a> has accused Russian President Vladimir Putin of attempting to \"manipulate\" new <a href=\"https://www.dw.com/en/us-president-donald-trump/t-19434433\">US President Donald Trump</a> in order to bring about an end to the war on his terms and without input from Ukraine or Europe.</p><p>\"[Putin] wants to decide Europe's fate without Europe and he seeks to talk about Ukraine without Ukraine,\" said Andriy Yermak, the head of the Presidential Office in Kyiv, warning that <a href=\"https://www.dw.com/en/russia/t-19065060\">Russia</a> was trying to promote bilateral negotiations with the United States over <a href=\"https://www.dw.com/en/russias-war-in-ukraine/t-60931789\">a war which the Kremlin started</a>.</p><p>Later, reporting from a briefing with security service chiefs, Ukrainian President <a href=\"https://www.dw.com/en/volodymyr-zelenskyy/t-65603134\">Volodymyr Zelenskyy</a> warned of \"Putin's readiness to continue the war and manipulate world leaders.\"</p><p>\"He wants to manipulate the desire of the President of the <a href=\"https://www.dw.com/en/united-states-of-america/t-19065189\">United States of America</a> to achieve peace,\" Zelenskyy said during his daily evening address on social media, but added that he was \"confident that no Russian manipulations will succeed anymore.\"</p><h2>Putin: 'We are ready for these negotiations'</h2><p>The comments out of Kyiv came after Putin had signaled earlier on Friday that he was open to discussing an end to his invasion of Ukraine with Trump.</p><p>\"It is probably better for us to meet and, based on today's realities, talk calmly about all areas that are of interest to both the US and Russia,\" he told Russian state television, claiming: \"We have always said, and I want to emphasize this once again, that we are ready for these negotiations on Ukrainian issues.\"</p><div><h2 aria-label=\"Embedded video — Europeans uncertain about Trump role on Ukraine\">Europeans uncertain about Trump role on Ukraine</h2></div><p>During his reelection campaign, Trump promised that he could end the war in Ukraine within 24 hours of returning to the White House, boasting of his good relationship with Putin.</p><p>Speaking to reporters just a few hours after his inauguration on Monday, Trump said he was eager to talk to his Russian counterpart, only to threaten Russia on Wednesday with more \"taxes, tariffs and sanctions\" if Putin did not end his \"ridiculous war\" soon.</p><p>Praising Trump as a \"smart\" and \"pragmatic\" leader, he said: \"I cannot but agree with him that if he had been president – if his victory hadn't been stolen in 2020  then maybe there would not have been the crisis in Ukraine that emerged in 2022.\"</p>","contentLength":2182,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i9a1zb/russias_putin_trying_to_manipulate_trump_says/"},{"title":"Mexico refuses to accept a U.S. deportation flight","url":"https://www.nbcnews.com/politics/immigration/mexico-refuses-accept-us-deportation-flight-rcna189182","date":1737757474,"author":"/u/MothersMiIk","guid":602,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i97tfj/mexico_refuses_to_accept_a_us_deportation_flight/"},{"title":"'Utter bulls***' — Ukraine rejects Russia's demand to abandon NATO membership promise","url":"https://kyivindependent.com/utter-bul-it-ukraine-rejects-russias-demand-to-abandon-nato-membership-promise/","date":1737755044,"author":"/u/Yveliad","guid":594,"unread":true,"content":"<p>Ukraine's Foreign Ministry dismissed Russia's demand to cancel NATO's 2008 promise of eventual membership for Ukraine, calling it \"utter bul***it\" in a Jan. 24 statement.</p><p>The response comes after Russian Deputy Foreign Minister Alexander Grushko <a href=\"https://kyivindependent.com/moscow-names-ban-on-ukraines-nato-accession-key-demand-in-potential-talks/\">criticized</a> NATO's 2008 Bucharest Summit declaration, calling it \"catastrophic for European security.\"</p><p>\"Aw shucks, North Korea's ally issuing ultimatums to NATO. Utter bul***it,\" said Foreign Ministry spokesperson Heorhii Tykhyi in <a href=\"https://t.me/Ukraine_MFA/4704\">response</a> to Grushko's remarks. \"Moscow has no say here.\"</p><p>Instead, the ministry praised <a href=\"https://kyivindependent.com/tag/nato/\">NATO's</a> decision at the time and reiterated Kyiv's commitment to joining the alliance.</p><p>\"European security architecture is built on protection from Russia,\" Tykhyi said.</p><p>Ukraine officially applied to join NATO in September 2022 following Russia's <a href=\"https://kyivindependent.com/tag/war/\">full-scale invasion</a>. While NATO members pledged at the 2024 Washington Summit that Ukraine's path to membership is \"<a href=\"https://kyivindependent.com/nato-leadership-clarifies-ukraines-irreversible-path-toward-membership/\">irreversible</a>,\" they have yet to extend a formal invitation.</p><p>Russian officials, as well as Western intellectuals with a track record of anti-Ukraine narratives have repeatedly cited Ukraine's potential NATO membership as a justification for the invasion. </p><p>President <a href=\"https://kyivindependent.com/ukraines-nato-prospects-depend-on-trump-zelensky-says/\">Volodymyr Zelensky</a> has acknowledged opposition from several NATO members, including the U.S., Germany, Hungary, and Slovakia, but expressed hope that U.S. President <a href=\"https://kyivindependent.com/tag/donald-trump/\">Donald Trump</a> could sway support for Kyiv's entry.</p><p>There is little evidence that the new administration would be more open to Ukraine's <a href=\"https://kyivindependent.com/ukraine-hopes-washington-will-support-kyivs-nato-bid-after-elections-as-opposition-in-europe-persists/\">NATO membership</a> than former U.S. President Joe Biden.</p><p>Trump has previously criticized NATO and <a href=\"https://kyivindependent.com/i-could-understand-their-feelings-trump-blames-bidens-ukraine-nato-stance-for-provoking-russias-invasion/\">blamed Biden</a> for allegedly supporting Ukraine's aspirations and provoking Russia's invasion.</p>","contentLength":1668,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i96vca/utter_bulls_ukraine_rejects_russias_demand_to/"},{"title":"Trump berates Danish PM over Greenland in ‘horrendous’ phone call","url":"https://www.thetimes.com/us/news-today/article/trump-wants-to-buy-greenland-frederiksen-jvx0zt9mv","date":1737753945,"author":"/u/Miserable-Lizard","guid":600,"unread":true,"content":"<p>Donald Trump repeated his demand to be given control of Greenland in a “horrendous” phone call with the prime minister of Denmark.</p><p>The US president spoke to Mette Frederiksen for 45 minutes last week and became aggressive when he was told that Greenland was not for sale, the Financial Times <a href=\"https://www.ft.com/content/ace02a6f-3307-43f8-aac3-16b6646b60f6\" target=\"_blank\">reported</a>. Trump again threatened to impose punitive tariffs on Denmark if it refused to give up its autonomous territory in the Arctic.</p><p>Frederiksen offered closer co-operation with the US on military bases and mineral exploitation on the island, but senior European officials said Trump baulked at the offer, demanding full US control.</p><p>“It was horrendous,” one source told the newspaper. “He was very firm,” another said. “Before, it was hard to take it seriously.</p>","contentLength":767,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i96ga2/trump_berates_danish_pm_over_greenland_in/"},{"title":"More underweighted meat uncovered as big grocers hit with class action lawsuit","url":"https://www.cbc.ca/news/business/meat-weigh-grocers-1.7440150","date":1737744354,"author":"/u/Isacobs_35160_LHM","guid":595,"unread":true,"content":"<p dir=\"ltr\">After Deborah Eakins read the recent <a href=\"https://www.cbc.ca/news/business/grocers-customers-meat-underweight-1.7405639\"></a> about Loblaw, Sobeys and Walmart grocery stores overcharging customers by selling underweighted meat, she weighed her ground beef.</p><p>To her surprise, the meat, bought at Sobeys-owned Pete's Frootique in the Halifax area, appeared to have been weighed with the hard plastic packaging.</p><p>CBC&nbsp;News purchased three packages of ground beef from the same store and got the same results. The calculated overcharge was $1.23 — six per cent on the $21.29 bill.</p><p><a href=\"https://inspection.canada.ca/en/food-labels/labelling/industry/general-principles#a21\">Under federal regulations</a>, posted net weights for packaged food — and prices based on that weight —&nbsp;can't include the packaging.&nbsp;</p><p>\"It makes me angry,\" said Eakins, who sent an online complaint to the store. \"I really don't like to think that I'm paying for packaging. Grocery prices have gotten horrendous over the last couple of years.\"</p><p>CBC's investigation has sparked anger among shoppers who are grappling&nbsp;with high food prices.</p><p>It also prompted NDP Leader Jagmeet Singh to ask the Competition Bureau to \"hold these giant corporations accountable\" and provide better protections for shoppers.</p><p>Meanwhile, the big grocers are making efforts to convince customers there's no need for concern.&nbsp;</p><p dir=\"ltr\">In November 2024,&nbsp;CBC&nbsp;News found underweighted meat at a Sobeys-owned FreshCo store in Toronto. At the time, Sobeys said it was addressing the matter.&nbsp;</p><p>In response to the Halifax&nbsp;case, Sobeys spokesperson Karen White-Boswell thanked CBC&nbsp;News for alerting the grocer.</p><p>\"On the rare occasions when an error occurs, we respond immediately… so that it can be corrected,\" she said in an email.&nbsp;</p><p>Eakins said a Pete's Frootique representative offered her compensation for being \"mischarged.\" &nbsp;</p><p>\"I said, 'I actually don't want to be compensated. What I want is the assurance that every package of meat I buy from now on, I won't be paying for the packaging.'\"</p><p>White-Boswell says Sobeys has followed up with the store and reinforced its meat-weighing procedures and policies.</p><p>Loblaw customer&nbsp;Iris Griffin also wants assurance the meat she's buying has been weighed properly.&nbsp;</p><p>In late 2023, Griffin complained to the Canadian Food Inspection Agency (CFIA) about underweighted meat she bought at a Loblaw-owned Superstore. The grocer said it sold \"a small number\" of underweighted meat products across 80 stores due to an error involving a change in packaging.&nbsp;</p><p>The CFIA says it issued no penalties because Loblaw said it&nbsp;fixed the problem.&nbsp;</p><p>Close to one year later, CBC News found underweighted meat in two Loblaw stores.&nbsp;In response, Loblaw apologized to customers, and said it fixed the error and refreshed in-store training.&nbsp;</p><p>Following her experience, Griffin says she was \"pleasantly surprised\" to learn that a proposed class-action lawsuit has been filed in Federal Court.&nbsp;</p><p>The suit alleges Loblaw, Sobeys and Walmart misrepresented the weight of meat products by including the weight of the packaging, or by \"other similarly deceptive means.\"</p><p>The suit has yet to be certified. Nevertheless, Griffin hopes it sends a message.&nbsp;</p><p>\"It gives people a sense that something is being done and that the retailer is being held accountable for the money that they've taken from consumers,\" she said.&nbsp;</p><p>Loblaw and Sobeys did not comment on the lawsuit.&nbsp;</p><p>Walmart also did not respond directly to the suit. But the retailer, in response to CBC News's earlier&nbsp;investigation&nbsp;— which found a Richmond, B.C., location sold underweighted meat&nbsp;— said&nbsp;that the third party responsible&nbsp;had immediately corrected the problem.</p><p>That third party confirmed&nbsp;that the issue had been \"limited to select products\" and only happened \"during a two-week period in December 2024,\" said Walmart spokesperson&nbsp;Stephanie Fusco.</p><p>But CBC News spoke with a customer who complained on social media back in October — two months earlier — that the beef steak she bought at the store had been weighed with the packaging. A photo she took of her weighing the meat showed that it&nbsp;was packaged on Oct. 8, 2024.</p><p>In response, Fusco said that Walmart is looking into the matter. She added that while this issue \"has been limited to third-party packaging,\" Walmart is reviewing its weighing systems to ensure it remains compliant.&nbsp;</p><h2>Investigation by phone and email</h2><p dir=\"ltr\">Griffin says she was surprised to learn that when the CFIA investigated her complaint about underweighted beef sold by Loblaw,&nbsp;the agency&nbsp;didn't inspect any stores&nbsp;but, instead, conducted the&nbsp;investigation by phone and email.&nbsp;</p><p dir=\"ltr\">Jay Jackson inspected consumer products, including food&nbsp;— for a predecessor&nbsp;of the CFIA&nbsp;— from 1983 to 1987. He says, during this period, a complaint like Griffin's would automatically prompt onsite inspections.&nbsp;</p><div dir=\"ltr\"><em><strong>WATCH | Proposed class-action lawsuit filed:</strong></em></div><p dir=\"ltr\">\"We would pick up our scales and go to the place and check not only the product in question, but the entire meat counter to see if this is a systemic problem,\" he said. Jackson added that inspectors would also immediately remove any meats that violated the regulations.</p><p>The CFIA&nbsp;says it didn't need to visit any Loblaw stores because the grocer reported it had fixed the error.</p><p><a href=\"https://inspection.canada.ca/en/inspect-and-protect/food-safety/under-weight-and-under-filled-food-products\"></a> about food weight accuracy, launched by the CFIA&nbsp;this week, the agency says its inspectors \"regularly go on site\" for investigations.</p><p>Jackson also says that when he was on the job, inspectors frequently did routine inspections in grocery stores to ensure food was weighed accurately. He and several other former CFIA inspectors told CBC News the agency now does too few of these types of inspections.</p><p>\"It's not a great time for rigorous oversight of consumer fraud protection,\" said Jackson, who is now director of policy and strategy with the Consumers Council of Canada.</p><p>CFIA spokesperson Patrick Girard said in an email that the agency \"works every day to protect consumers\" from mislabelled food by doing inspections, surveillance, responding to complaints and raising awareness.</p><p>The CFIA said that it did 125 planned inspections in the past year for weight accuracy. When asked how many of them were done in grocery&nbsp;stores, the agency replied that such data isn't available.</p>","contentLength":6055,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i92ps7/more_underweighted_meat_uncovered_as_big_grocers/"},{"title":"Russia says it will not allow NATO dominance in Baltic Sea","url":"https://www.yahoo.com/news/russia-says-not-allow-nato-132913887.html","date":1737729705,"author":"/u/jbound00001","guid":597,"unread":true,"content":"<div data-article-body=\"true\"><p>A senior Russian official has said that Moscow will counter any moves by Western military alliance NATO to dominate the Baltic Sea.</p><p>Deputy Foreign Minister Alexander Grushko told the Russian television channel Rossiya-24 on Friday that the Western alliance's decision to increase patrols around the Baltic was further proof of NATO's \"desire to turn the Baltic Sea into a NATO lake.\"</p><p>\"This will not happen for many reasons, and one of the main reasons is, of course, that the Russian Federation will not allow it.\"</p><p>Russia's position on the Baltic Sea has been weakened by the accession of Finland and Sweden to NATO. The air link to its Kaliningrad exclave on the coast runs through a narrow international air corridor.</p><p>The two NATO neighbours have said they will step up patrols by their air and naval forces.</p><p>The decision came in response to several incidents of damage to power supply cables on the seabed, with Russia suspected of being behind the vandalism.</p><p>In addition, Western allies say that a \"shadow fleet\" of unregistered tankers is operating in the Baltic Sea, apparently intended to circumvent Western sanctions targeting the Russian oil trade.</p></div>","contentLength":1151,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i8ww9e/russia_says_it_will_not_allow_nato_dominance_in/"},{"title":"WHO freezes hiring, restricts travel after US withdrawal","url":"https://www.politico.eu/article/who-freezes-hiring-restricts-travel-after-u-s-withdrawal/","date":1737716704,"author":"/u/doopityWoop22","guid":599,"unread":true,"content":"<div><p>U.S. President Donald Trump signed an executive order to withdraw from the World Health Organization.</p></div>","contentLength":101,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i8syob/who_freezes_hiring_restricts_travel_after_us/"},{"title":"Trump suggests Ukraine shouldn't have fought back against Russia","url":"https://www.nbcnews.com/politics/white-house/trump-suggests-ukraine-not-fought-back-russia-rcna189071","date":1737716433,"author":"/u/M795","guid":601,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i8sw2w/trump_suggests_ukraine_shouldnt_have_fought_back/"},{"title":"Zelensky reveals he was given Kremlin ‘ultimatum’ to step down in favour of pro-Russian politician","url":"https://novayagazeta.eu/articles/2025/01/23/zelensky-reveals-he-was-given-kremlin-ultimatum-to-step-down-in-favour-of-pro-russian-politician-en-news","date":1737715784,"author":"/u/Silly-avocatoe","guid":596,"unread":true,"content":"<p>During the initial days of the war, Moscow issued Ukrainian President Volodymyr Zelensky with an ultimatum demanding that he stand down in favour of disgraced pro-Kremlin politician Viktor Medvedchuk as Ukraine’s president, Zelensky <a href=\"https://www.youtube.com/watch?v=sNzmqKBgUqI\" rel=\"noopener\" target=\"_blank\" title=\"https://www.youtube.com/watch?v=sNzmqKBgUqI\">claimed</a> during an event at the World Economic Forum in the Swiss town of Davos on Wednesday.</p><p>“Some people from Ukraine” came to him shortly after the invasion began on 24 February 2022, Zelensky said, to deliver a message from Vladimir Putin. “They told me I should step down, that they would replace me with the pro-Russian Medvedchuk, and I’d no longer be president,” he continued.</p><p>Russia also demanded that Kyiv relinquish control over Donbas, reduce its troop numbers to 50,000, enshrine its neutrality in a re-written constitution, give up most of its long-range weapons, and make a commitment not to join NATO, Zelensky said.</p><p>The same demands had also been made by Russia at the unsuccessful peace talks held in Istanbul between February and April 2022, Zelensky continued, while stressing that “there were no talks” in Istanbul, only “an ultimatum from a murderer”.</p><p>A key Kremlin ally who claims to be close to Vladimir Putin, Viktor Medvedchuk headed the pro-Kremlin party Opposition Platform — For Life until it was outlawed in Ukraine shortly after the full-scale Russian invasion. </p><p>Medvedchuk, who was under house arrest in Kyiv pending treason charges when the Russian invasion began, was caught attempting to flee the country by the Security Service of Ukraine in April 2022. He was eventually swapped in a prisoner exchange with Russia later that year, however.</p><p>Putin has referred to what he termed the Istanbul Accords several times in his public statements, <a href=\"https://novayagazeta.eu/articles/2024/12/19/putin-holds-annual-call-in-show-in-moscow-en\" target=\"_blank\" title=\"https://novayagazeta.eu/articles/2024/12/19/putin-holds-annual-call-in-show-in-moscow-en\">saying</a> in December that a deal with Ukraine had “nearly” been reached in Istanbul in 2022, but that it had ultimately fallen apart after former UK Prime Minister Boris Johnson urged Kyiv to fight “to the last Ukrainian”, a claim <a href=\"https://www.unian.net/politics/voyna-v-ukraine-zelenskiy-otreagiroval-na-ultimatumy-putina-12858267.html\" rel=\"noopener\" target=\"_blank\" title=\"https://www.unian.net/politics/voyna-v-ukraine-zelenskiy-otreagiroval-na-ultimatumy-putina-12858267.html\">disputed</a> by Zelensky, who has said that the accords simply “never existed”.</p>","contentLength":2039,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i8sqmm/zelensky_reveals_he_was_given_kremlin_ultimatum/"},{"title":"Trump accuses Russia of stealing US hypersonic missile plans","url":"https://www.pravda.com.ua/eng/news/2025/01/24/7495061/","date":1737704107,"author":"/u/Tiny-Potato-Peeler","guid":598,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i8q6s2/trump_accuses_russia_of_stealing_us_hypersonic/"}]}