{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Senior Taliban official urges reversal of education ban on Afghan girls","url":"https://www.abc.net.au/news/2025-01-20/taliban-deputy-criticises-education-ban-afghan-girls-education/104836558?utm_source=abc_news_app&amp;utm_medium=content_shared&amp;utm_campaign=abc_news_app&amp;utm_content=other","date":1737335908,"author":"/u/StopTheGregSign","guid":500,"unread":true,"content":"<p>In a rare public rebuke, a senior Taliban figure has called on the group's leadership to end the ban on education for women and girls in Afghanistan.</p><p>Afghan foreign ministry political deputy Sher Abbas Stanikzai made the remarks in a speech on Saturday in south-eastern Afghanistan's Khost province.</p><p>He told an audience at a religious school ceremony there was no reason to deny education to women and girls, \"just as there was no justification for it in the past and there shouldn't be one at all\".</p><figure data-print=\"inline-media\" data-component=\"Figure\" data-uri=\"coremedia://imageproxy/104836734\"><figcaption><p data-component=\"Typography\">The Taliban has banned women from higher education at institutions like Kabul University.</p></figcaption></figure><p>Mr Stanikzai asserted the ongoing prohibition against female education had no religious justification.</p><p>\"We are committing an injustice against 20 million people out of a population of 40 million, depriving them of all their rights,\" Mr Stanikzai said in a video shared by his official account on social media.</p><p>\"This is not in Islamic law, but our personal choice or nature.\"&nbsp;</p><h2 data-component=\"Heading\">Comments dismissed as bid to 'rebrand' Taliban</h2><p>Mr Stanikzai was once the head of the Taliban team in talks that led to the complete withdrawal of foreign troops from Afghanistan.</p><p>It is not the first time he has said that women and girls deserve an education.</p><p>He made similar remarks in September 2022, a year after schools closed for girls and months before the introduction of a university ban.</p><figure data-print=\"inline-media\" data-component=\"Figure\" data-uri=\"coremedia://imageproxy/104836630\"><figcaption><p data-component=\"Typography\">Activists have warned that true progress can only come when there is the full restoration of women's rights in Afghanistan.<cite>()</cite></p></figcaption></figure><p>\"We call on the leadership again to open the doors of education,\" he said, marking the first call for a change in policy and a direct appeal to Taliban leader Hibatullah Akhundzada.</p><p>However, Afghan women's rights advocates warned against viewing it as a turning point.</p><p>Zubaida Akbar, an activist with the women's human rights organisation Femena, said the remarks were likely a strategic move to bolster credibility for the Taliban internationally.</p><div data-component=\"EmphasisedText\"><p>\"The Taliban deputy's remarks about there being no excuse for the education bans on Afghan women and girls reflects desperation,\" Ms Akbar told the ABC.</p></div><p>\"They think making these statements is a strategic move to rebrand themselves as progressive.\"</p><figure data-print=\"inline-media\" data-component=\"Figure\" data-uri=\"coremedia://imageproxy/104838456\"><figcaption><p data-component=\"Typography\">Deputy Foreign Minister Sher Mohammad Abbas Stanikzai is often criticised by his peers for advocating for women's rights.</p></figcaption></figure><p>Crisis Group analyst Ibraheem Bahiss said Mr Stanikzai had periodically made statements deeming education to be the right of all Afghan women and girls.</p><p>\"However, this latest statement seems to go further in the sense that he is publicly calling for a change in policy and questioned the legitimacy of the current approach,\" Mr Bahiss said.</p><p>Susan Hutchinson, executive director of the NGO Azadi-e Zan (Free Woman), who has helped several women's rights defenders from Afghanistan, said Mr Stanikzai's comments alone are not enough to lead to a lift in the ban.</p><p>\"Mr Stanikzai is one of the more progressive of the Taliban leaders and is often criticised by his peers for his stand on women's freedoms,\" Ms Hutchinson explained.</p><p>\"The lack of educational access is a serious issue for the Afghan economy and overall welfare of the country,\" she added.</p><h2 data-component=\"Heading\">Pressure on Taliban regime over denial of women's rights</h2><p>No country recognises the Taliban as the legitimate rulers of Afghanistan, but countries like Russia have been building ties with them.</p><p>India has also been developing relations with Afghan authorities.</p><figure data-print=\"inline-media\" data-component=\"Figure\" data-uri=\"coremedia://imageproxy/104836756\"><figcaption><p data-component=\"Typography\">Nobel Peace laureate Malala Yousafzai has called on the international community to speak out against the Taliban's ban on women and girls' education.</p></figcaption></figure><p>In Dubai this month, a meeting between India's top diplomat, Vikram Mistri, and Foreign Minister Amir Khan Muttaqi showed their deepening cooperation.</p><p>The United Nations has said that recognition of the Taliban government is almost impossible while bans on female education and employment remain in place and women can't go out in public without a male guardian.</p><p>Nobel Peace Prize laureate Malala Yousafzai this month told a conference hosted by the Organisation of Islamic Cooperation and the Muslim World League that Islamic leaders should challenge the Taliban on women and girls' education.</p><p>Ms Akbar highlighted the broader repression under the Taliban including banning women from work, singing or being heard in public.</p><p>\"Access to education is not meaningful progress if women cannot freely move, speak, or participate in public life,\" Ms Akbar said.</p><p>She called on the international community to remain vigilant against attempts to use partial reforms to win legitimacy.&nbsp;</p><div data-component=\"EmphasisedText\"><p>\"The Taliban negotiator's statements appear to be a calculated effort to present an image of reform within their ranks.\"</p></div><figure data-print=\"inline-media\" data-component=\"Figure\" data-uri=\"coremedia://imageproxy/104836634\"><figcaption><p data-component=\"Typography\">Some activists warn that the Taliban's statements may be a calculated effort to present an image of reform.<cite>()</cite></p></figcaption></figure><p>A statement on behalf of Ambassador Wahidullah Waissi of the Islamic Republic of Afghanistan in Canberra to the ABC echoed these sentiments.</p><p>\"Restoring girls' access to education — an essential and fundamental human right —requires more than superficial policy changes or public discourse; it demands a transformative shift in attitudes to undo the deep damage caused by their oppressive actions,\" said the statement.</p><p>Since the Taliban's forced takeover in August 2021, the Embassy of the Islamic Republic of Afghanistan in Canberra has continued to fulfill its diplomatic responsibilities under the Vienna Convention on Diplomatic Relations of 1961, operating independently of Taliban influence.</p><figure data-print=\"inline-media\" data-component=\"Figure\" data-uri=\"coremedia://imageproxy/104836642\"><figcaption><p data-component=\"Typography\">The Taliban&nbsp;has increasing&nbsp;added&nbsp;restrictions on women&nbsp;since taking power.&nbsp;</p></figcaption></figure><p>Last September, there were reports authorities had also stopped medical training and courses for women.</p><p>In Afghanistan, women and girls can only be treated by female doctors and health professionals.</p><p>Authorities have yet to confirm the medical training ban.</p>","contentLength":5774,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i5elgi/senior_taliban_official_urges_reversal_of/"},{"title":"At least 80 dead, several kidnapped in Colombia after failed peace talks, official says","url":"https://www.cbsnews.com/news/kidnapped-colombia-peace-talks-fail-rebel-national-liberation-army/","date":1737314342,"author":"/u/ChiefFun","guid":506,"unread":true,"content":"<section><p>More than 80 people have been killed in Colombia's northeast region following failed attempts to hold peace talks with the National Liberation Army, a Colombian official said.</p><p>Twenty others have been injured, according to William Villamizar, governor of North Santander, where many of the killings occurred.</p><p>Among the victims are community leader Carmelo Guerrero and seven people who sought to sign a peace deal, according to a report that a government ombudsman agency released late Saturday.</p><p>Officials said the attacks occurred in several towns located in the Catatumbo region near the border with Venezuela, with at least three people who were part of the peace talks being kidnapped.</p><p>Thousands of people are fleeing the area, with some hiding in the nearby lush mountains or seeking help at government shelters.</p><p>Colombia's army rescued dozens of people on Sunday, including a family and their pet dog, whose owner held a pack of cold water against the animal's chest to keep it cool as they evacuated via helicopter.</p><p>Defense Minister Iván Velásquez traveled to the northeast town of Cúcuta on Sunday while officials prepared to send 10 tons of food and hygiene kits for approximately 5,000 people in the communities of Ocaña and Tibú, the majority of them having fled the violence.</p><p>\"Catatumbo needs help,\" Villamizar said in a public address on Saturday. \"Boys, girls, young people, teenagers, entire families are showing up with nothing, riding trucks, dump trucks, motorcycles, whatever they can, on foot, to avoid being victims of this confrontation.\"</p><p>The attack comes after Colombia suspended peace talks with the National Liberation Army, or ELN, on Friday, the second time it has done so in less than a year.</p><p>Colombia's government has demanded that the ELN cease all attacks and allow authorities to enter the region and provide humanitarian aid.</p><p>The ELN has been clashing in Catatumbo with former members of the Revolutionary Armed Forces of Colombia, or FARC, a guerrilla group that disbanded after signing a peace deal in 2016 with Colombia's government. The two are fighting over control of a strategic border region that has coca leaf plantations.</p><p>In a statement Saturday, the ELN said it had warned former FARC members that if they \"continued attacking the population...there was no other way out than armed confrontation.\" The ELN has accused ex-FARC rebels of several killings in the area, including the Jan. 15 slaying of a couple and their 9-month-old baby.</p><p>Army commander Gen. Luis Emilio Cardozo Santamaría said Saturday that authorities were reinforcing a humanitarian corridor between Tibú and Cúcuta for the safe passage of those forced to flee their homes. He said special urban troops also were deployed to municipal capitals \"where there are risks and a lot of fear.\"</p><p>The ELN has tried to negotiate a peace deal with the administration of President Gustavo Petro five times, with talks failing after bouts of violence. ELN demands include that it be recognized as a political rebel organization, which critics have said is risky.</p></section>","contentLength":3053,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i56g9z/at_least_80_dead_several_kidnapped_in_colombia/"},{"title":"Nearly 200,000 Syrian refugees have returned since Assad regime fell, UN says","url":"https://www.timesofisrael.com/nearly-200000-syrian-refugees-have-returned-since-assad-regime-fell-un-says/","date":1737305801,"author":"/u/Straight_Ad2258","guid":502,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i52zik/nearly_200000_syrian_refugees_have_returned_since/"},{"title":"Syria bans goods from Russia, Iran, Israel","url":"https://kyivindependent.com/syria-bans-goods-from-russia-iran-and-israel/","date":1737303376,"author":"/u/Specific-Menu8568","guid":505,"unread":true,"content":"<p>Syria's new administration has banned all Russian, Iranian, and Israeli goods from entering the country in a new decree issued by the country's finance minister on Jan. 17. </p><p>The decision came shortly after the country had restricted entry of Iranian and Israeli passport holders. </p><p>Under the previous regime, Russia had military bases in Syria that it used for operations in Africa and the Middle East. </p><p>Last month, Ukraine's foreign minister Andrii Sybiha visited Syria, marking the first official Ukrainian delegation to Syria in years. During the trip, he said he hoped to increase trade with Syria. </p><p>As the new Syrian government looks to establish itself and reset foreign relations with its former partners and adversaries, the trade ban may exacerbate tensions in the region and impact trade. </p>","contentLength":794,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i521ib/syria_bans_goods_from_russia_iran_israel/"},{"title":"Canada threatens ‘single largest trade blow’ to U.S. if Trump follows through on tariffs","url":"https://www.ctvnews.ca/politics/article/canada-threatens-single-largest-trade-blow-to-us-if-trump-follows-through-on-tariffs/","date":1737300835,"author":"/u/Coolsam2000","guid":508,"unread":true,"content":"<p>Published:&nbsp;<time datetime=\"2025-01-19T10:00:00Z\">January 19, 2025 at 5:00AM EST</time></p>","contentLength":42,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i512bg/canada_threatens_single_largest_trade_blow_to_us/"},{"title":"Protesters storm South Korean court after it extends President Yoon’s detention","url":"https://www.cnn.com/2025/01/18/asia/south-korea-court-extends-yoon-detention-intl-latam/index.html?cid=ios_app","date":1737287501,"author":"/u/perplexed-redditor","guid":501,"unread":true,"content":"<div data-uri=\"cms.cnn.com/_components/source/instances/cm62jnqdp003n26p263pb2h6p@published\" data-component-name=\"source\" data-article-gutter=\"true\"><cite>\n        &nbsp;—&nbsp;\n    </cite></div><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm62jnqdp003o26p27kex58ql@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Hundreds of supporters of South Korea’s arrested president, <a href=\"https://www.cnn.com/2025/01/14/asia/south-korea-yoon-suk-yeol-residence-intl/index.html\">Yoon Suk Yeol,</a> stormed a court building early on Sunday after his detention was extended, smashing windows and breaking inside, an attack the country’s acting leader called “unimaginable.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm62p8qsn000a3b6m46a1pk4v@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Yoon on Wednesday became the first sitting South Korean <a href=\"https://www.cnn.com/2025/01/14/asia/south-korea-yoon-suk-yeol-residence-intl/index.html\">president to be arrested</a> as he faces allegations of insurrection related to his stunning, short-lived December 3 declaration of martial law that has plunged the country into political turmoil.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm62p8qsn000b3b6mne8foycq@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Shortly after the court’s decision was announced around 3 a.m. local time on Sunday, his supporters swarmed the building, overwhelming riot police trying to keep them at bay.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm62p8qsn000c3b6mbcjwpbit@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Protesters blasted fire extinguishers at lines of police guarding the front entrance, then flooded inside, destroying office equipment, fittings and furniture, footage showed.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm631ghc30000356mh781966o@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Police restored order a few hours later, saying they had arrested 46 protesters and vowing to track down others involved.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm631u9hm000p356mlv9th8i6@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “The government expresses strong regret over the illegal violence… which is unimaginable in a democratic society,” acting President Choi Sang-mok said in a statement, adding that the authorities would step up safety measures around gatherings.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm62p8qsn000d3b6mu9b3326b@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Nine police officers were injured in the chaos, Yonhap news agency reported. Police were not immediately available for comment on the injured officers.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm62p8qsn000e3b6m1hr9ivlp@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            About 40 people suffered minor injuries, said an emergency responder near the Seoul Western District Court.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm6320e45000y356m2hhnfolb@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Several of those involved live-streamed the intrusion on YouTube, showing protesters trashing the court and chanting Yoon’s name. Some streamers were caught by police during their broadcasts.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm631zjce000w356m5yni47gp@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            With Yoon refusing to be questioned, investigators facing a deadline on detaining the president asked the court on Friday to extend his custody.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm6320r370011356m8ck6mj5d@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            After a five-hour hearing on Saturday, which Yoon attended, a judge granted a new warrant extending Yoon’s detention for up to 20 days, due to “concern that the suspect may destroy evidence.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm632185r0014356mxpgulzfd@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            South Korean regulations require a suspect detained under a warrant to undergo a physical exam, have a mugshot taken and wear a prison uniform.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm631i1cr0002356mh3z5h5oh@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            The leader is being held in a solitary cell at the Seoul Detention Centre.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm6322ba4001a356m78j5rs53@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            The corruption investigation office leading the probe said it had called Yoon in for further questioning on Sunday afternoon, but the prosecutor-turned-president has so far stonewalled their efforts to interrogate him.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm6322t7p001f356m5gz78gv2@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            His lawyers have argued the arrest is illegal because the warrant was issued in the wrong jurisdiction and the investigating team had no mandate for their probe.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm6322t7p001g356mv5wgu8od@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Insurrection, the crime that Yoon may be charged with, is one of the few that a South Korean president does not have immunity from and is technically punishable by death. South Korea, however, has not executed anyone in nearly 30 years.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm6322s8g001d356muo1w1pdl@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “President Yoon Suk Yeol and our legal team will never give up,” lawyers representing Yoon said in a statement.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm6323btr001o356mogf1u3p7@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “We will do our best in all future judicial procedures to correct the wrong,” the lawyers said, adding that the violence at the court was an “unfortunate” incident.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm6323btr001p356m01xxxxh2@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Separate to the criminal probe that sparked Sunday’s chaos, the Constitutional Court is deliberating whether to permanently remove him from office, in line with parliament’s Dec. 14 impeachment, or restore his presidential powers.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm6323aw9001m356mh6twapyv@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Yoon’s conservative People Power Party called the court’s decision to extend his detention on Sunday a “great pity.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm631j7zm000c356m7brapl63@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “There’s a question whether repercussions of detaining a sitting president were sufficiently considered,” the party said in a statement.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm631j7zm000d356movfjgs24@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            The main opposition Democratic Party called the court’s approval on the warrant a “cornerstone” for rebuilding order and said that “riots” by “far-right” groups would only deepen the national crisis.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm631j7zm000e356mh90qrdu1@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Support for the PPP collapsed after his martial law declaration, which he rescinded hours later in the face of a unanimous vote in parliament rejecting it.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm631j7zm000f356mnn1upw3o@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            But in the turmoil since - in which the opposition-majority parliament also impeached his first replacement and investigators botched an initial attempt to arrest Yoon - the PPP’s support has sharply rebounded.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm631j7zm000g356m3pdxh22q@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            His party has edged ahead of the opposition Democratic Party in support - 39% to 36% - for the first time since August, a Gallup Korea poll showed on Friday.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm6323rc4001s356m8gvta68c@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Thousands gathered for an orderly rally in support of Yoon in downtown Seoul on Sunday morning. Anti-Yoon demonstrations have also taken place across the city in recent days.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cm631j6yx0008356mwa4389me@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\"><em>This story has been updated with additional information.</em></p>","contentLength":5092,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i4wtp2/protesters_storm_south_korean_court_after_it/"},{"title":"Romi Gonen, Emily Damari and Doron Steinbrecher to be first hostages freed","url":"https://www.ynetnews.com/article/6hsyunnr9#autoplay","date":1737286172,"author":"/u/FisherGuy44","guid":504,"unread":true,"content":"<div data-block=\"true\" data-editor=\"dpo6d\" data-offset-key=\"eeha5-0-0\"><div data-offset-key=\"eeha5-0-0\"><a href=\"https://www.ynetnews.com/article/s136gweir\" target=\"_blank\"></a></div></div><div data-block=\"true\" data-editor=\"dpo6d\" data-offset-key=\"8rsic-0-0\"><div data-offset-key=\"8rsic-0-0\"><a href=\"https://www.ynetnews.com/article/s1oeugt8yx\" target=\"_blank\"></a></div></div><div data-block=\"true\" data-editor=\"dpo6d\" data-offset-key=\"f4erc-0-0\"><div data-offset-key=\"f4erc-0-0\"><a href=\"https://www.ynetnews.com/article/hkvam00axyg\" target=\"_blank\"></a></div></div><div data-block=\"true\" data-editor=\"dpo6d\" data-offset-key=\"4hgdv-0-0\"><div data-offset-key=\"4hgdv-0-0\"><a href=\"https://www.ynetnews.com/culture/article/s1snhwb11kx\" target=\"_blank\"></a></div></div><div data-block=\"true\" data-editor=\"dpo6d\" data-offset-key=\"9em75-0-0\"><div data-offset-key=\"9em75-0-0\"><a href=\"https://www.ynetnews.com/article/byibcbbcp\" target=\"_blank\"></a></div></div>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i4whzy/romi_gonen_emily_damari_and_doron_steinbrecher_to/"},{"title":"'No excuse for education ban': Taliban deputy asks leaders to lift restrictions on Afghan women - The Times of India","url":"https://timesofindia.indiatimes.com/world/south-asia/no-excuse-for-education-ban-taliban-deputy-asks-leaders-to-lift-restrictions-on-afghan-women/articleshow/117369801.cms","date":1737284606,"author":"/u/BROWN_MUNDA-","guid":499,"unread":true,"content":"<div>A high-ranking Taliban official, Sher Abbas Stanikzai, has urged the group's leader to scrap education restrictions on Afghan women and girls during a speech at a religious school in Khost province on Saturday. As the political deputy at the Foreign Ministry, he stated there was no valid reason to deny education to females.The current Taliban administration has restricted female education beyond year six. Reports from September indicate that medical training and courses for women have also been halted, though authorities have not officially confirmed this restriction, AP news agency reported.<p>The healthcare system in Afghanistan requires female medical professionals to treat women and girls. Stanikzai, speaking in a video posted on his official X account, emphasised that denying rights to half the population contradicts Islamic law and represents personal preferences rather than religious doctrine.</p>Stanikzai, who previously led Taliban negotiations for foreign troop withdrawal, has advocated for women's education before. His recent statement, however, marks his first direct appeal to Taliban leader Hibatullah Akhundzada for policy change.Crisis Group analyst Ibraheem Bahiss noted that while Stanikzai has consistently supported girls' education, his latest statement more explicitly challenges current policies and their legitimacy.<p>At a recent conference in Islamabad, Malala Yousafzai urged Muslim leaders to confront the Taliban regarding female education. The UN maintains that international recognition remains unlikely while restrictions on women's education, employment and movement persist.</p>Whilst no nation officially recognises the Taliban government, some countries are establishing diplomatic connections. Russia has strengthened its ties, and India continues to develop relations with Afghan authorities, as evidenced by the recent meeting in Dubai between Indian diplomat Vikram Mistri and Foreign Minister Amir Khan Muttaqi.</div>","contentLength":1954,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i4w4bl/no_excuse_for_education_ban_taliban_deputy_asks/"},{"title":"Israel says ceasefire with Hamas begins, after delay","url":"https://gulfnews.com/world/mena/israel-says-ceasefire-with-hamas-begins-after-delay-1.500018785","date":1737279107,"author":"/u/Cr2O3-2H2O","guid":503,"unread":true,"content":"<div><p>JERUSALEM: Israel on Sunday said a truce with Hamas began in Gaza at 0915 GMT, nearly three hours after initially scheduled, following a last-minute delay on the orders of Prime Minister Benjamin Netanyahu.</p></div><div><p>During the delay, Gaza's civil defence agency said Israeli strikes killed eight people.</p></div><div><p>A statement from Netanyahu's office, issued less than an hour before the truce had been set to start at 8:30 am (0630 GMT), said he had \"instructed the IDF (military) that the ceasefire... will not begin until Israel has received the list\" of hostages to be freed.</p></div><div><p>Hamas attributed the delay to \"technical reasons\", as well as the \"complexities of the field situation and the continued bombing\", ultimately publishing at around 10:30 am the names of three Israeli women to be released on Sunday.</p></div><div><p>Israel confirmed it had received the list and was \"checking the details\", before confirming shortly afterwards that the truce would begin at 11:15 am local time.</p></div><div><p>AFPTV live images from northeastern Gaza showed a plume of grey smoke about 30 minutes after the truce was earlier to take effect, and again around 30 minutes later.</p></div><div><p>The Israeli military confirmed it was continuing \"to strike within the Gaza area\" following Netanyahu's directive.</p></div><div><p>Gaza civil defence spokesman Mahmud Bassal said three people were killed in the north of the territory and five in Gaza City, with 25 wounded.</p></div><div><p>AFP images showed displaced Gazans streaming northwards from areas around Gaza City where they had been sheltering, some flashing the victory sign.</p></div><div><p>But others saw their plans to return home thwarted by the delay of the ceasefire.</p></div><div><p>\"I was on my way home with my family when we heard the sound of bombing,\" said Mohammed Baraka, 36.</p></div><div><p>\"We can't reach our house; the situation is dangerous. I don't know what to do. I feel frustrated and devastated.\"</p></div><div><p>The initial exchange was to see three Israeli hostages released from captivity in return for a first group of Palestinian prisoners.</p></div><div><p>A total of 33 hostages taken by militants during Hamas's October 7, 2023 attack on Israel will be returned from Gaza during an initial 42-day truce.</p></div><div><p>Under the deal, hundreds of Palestinian prisoners will be released from Israeli jails.</p></div><div><p>The truce is intended to pave the way for an end to more than 15 months of war sparked by Hamas's attack, the deadliest in Israeli history.</p></div><div><p>It follows a deal struck by mediators Qatar, the United States and Egypt after months of negotiations, and takes effect on the eve of Donald Trump's inauguration as US president.</p></div><div><p>In a televised address on Saturday, Netanyahu called the 42-day first phase a \"temporary ceasefire\" and said Israel had US support to return to war if necessary. </p></div><div><h3>'Playing with our emotions'  </h3></div><div><p>In Gaza City, shortly after the deal was initially meant to go into effect, people were already celebrating, waving Palestinian flags in the street.</p></div><div><p>But as it became clear the hostilities were continuing, the joy gave way to desperation for some.</p></div><div><p>\"I'm dying of despair,\" said Maha Abed, a 27-year-old displaced from Rafah who had been waiting since dawn for her husband to pick her up and take her home. \"He called to tell me we won't be returning today. The drones are firing at civilians.\"</p></div><div><p>\"Enough playing with our emotions - we're exhausted,\" she added. \"I don't want to spend another night in this tent.\"</p></div><div><p>In Deir al-Balah, an AFP journalist observed dozens of Palestinians gathered in front of the Al-Aqsa Martyrs Hospital seeking information about the unfolding events, particularly whether or not they would be able to return to their homes.</p></div><div><p>The Israeli army warned Gaza residents early Sunday not to approach its forces or Israeli territory.</p></div><div><p>\"We urge you not to head towards the buffer zone or IDF forces for your safety,\" military spokesman Avichay Adraee said on Telegram.</p></div><div><p>\"At this stage, heading towards the buffer zone or moving from south to north via Gaza Valley puts you at risk.\"</p></div><div><p>At a rally for the hostages in Tel Aviv the night before, attendees were guarded ahead of the scheduled exchanges.</p></div><div><p>\"I'm really stressed because I don't know about the situation of Ofer, my cousin,\" said Ifat Kaldron, whose cousin is among the hostages.</p></div><div><p>\"I'm just going to be happy whenever I see the last hostage crossing the border.\"</p></div><div><p>Israel has prepared reception centres to provide medical treatment and counselling to the freed hostages before they return to their families after their long ordeal.</p></div><div><p>Israel's justice ministry had previously said 737 Palestinian prisoners and detainees would be freed during the deal's first phase, starting from 4:00 pm (1400 GMT) on Sunday.</p></div><div><p>Egypt on Saturday said more than 1,890 Palestinian prisoners would be freed in the initial phase.</p></div><div><p>Hundreds of trucks waited at the Gaza border, poised to enter from Egypt as soon as they get the all-clear to deliver desperately needed aid.</p></div><div><p>Egyptian Foreign Minister Badr Abdelatty said 600 trucks a day would enter Gaza after the ceasefire takes effect, including 50 carrying fuel.</p></div><div><p>There has been only one previous truce in the war, lasting for one week in November 2023.</p></div><div><p>That ceasefire also saw the release of hostages held by militants in exchange for Palestinian prisoners.</p></div><div><p>Hamas's October 7 attack on Israel resulted in the deaths of 1,210 people, mostly civilians, according to an AFP tally of Israeli official figures.</p></div><div><p>Of the 251 people taken hostage, 94 are still in Gaza, including 34 the Israeli military says are dead.</p></div><div><p>Israel's retaliatory campaign has destroyed much of Gaza, killing at least 46,899 people, most of them civilians, according to figures from the Hamas-run territory's health ministry that the United Nations considers reliable.</p></div><div><p>The truce was to take effect on the eve of Trump's inauguration for a second term as president of the United States.</p></div><div><p>Trump, who claimed credit for the ceasefire deal, after months of effort by the outgoing administration of President Joe Biden, told US network NBC on Saturday that he had told Netanyahu that the war \"has to end\".</p></div><div><p>\"We want it to end, but to keep doing what has to be done,\" he said.</p></div><div><p>Brett McGurk, the pointman for outgoing President Joe Biden, was joined in the region by Trump envoy Steve Witkoff in an unusual pairing to finalise the agreement, US officials said.</p></div><div><p>Under the deal, Israeli forces will withdraw from densely populated areas of Gaza and allow displaced Palestinians to return \"to their residences\", the Qatari prime minister said.</p></div><div><p>Biden said an unfinalised second phase of the agreement would bring a \"permanent end to the war\".</p></div>","contentLength":6446,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i4uv4t/israel_says_ceasefire_with_hamas_begins_after/"},{"title":"Ceasefire officially delayed as Hamas fails to provide names of hostages to be released","url":"https://www.jpost.com/breaking-news/article-838114","date":1737269892,"author":"/u/xKyoshirax","guid":507,"unread":true,"content":"<p>The first three Israeli hostages who will be released from Hamas captivity will be released after 4:00 p.m. local time on Sunday, the Prime Minister's Office announced.</p><p>Hamas provided Israel with a list of the three hostages to be released after a long delay that halted the ceasefire from going into effect, the PMO confirmed on Sunday morning.&nbsp;</p><p>Coordinator for the Hostages and the Missing Brig.-Gen. (Res.) Gal Hirsch has updated the families of the hostages through IDF representatives.</p><p>\"We ask the media and the public to refrain from sharing the details of the list, exercise due caution, and maintain the privacy of the families,\" the PMO shared.</p><h3><strong>Ceasefire initially delayed</strong></h3><p>IDF Chief Spokesperson R.-Adm. Daniel Hagari announced at 8:30 a.m. local time on Sunday that the ceasefire that was meant to go into effect had been delayed as Hamas failed to provide the names of the three hostages that were meant to be released on the same day.</p><figure><figcaption>Orange balloons are brought to the hostage demonstration to mark the second birthday of Kfir Bibas, the youngest hostage, and to urge the government not to abandon the hostage deal on January 18, 2025. (credit: Paulina Patimer)</figcaption></figure><p>This announcement came after a long night of security assessments following delays in the list. <a href=\"https://www.jpost.com/tags/hamas\">Hamas</a> was meant to already provide the list of hostages 24 hours before their release. Three hostages are meant to be released on Sunday, but it is unclear who.</p><p>Shortly after Netanyahu's announcement, the terrorist group released an official statement affirming its commitment to the ceasefire, stating that the delay in the names of the hostages to be released is due to technical issues.</p><p>Earlier reports said that Hamas would reportedly hand over the list on Saturday night.</p><p>Hamas sources told mediators that it would hand over the names of the hostages as soon as they had been transferred to a safe place. It is expected that three female soldiers will be released.</p><section><section><div><div><p>Stay updated with the latest news!</p><p>Subscribe to The Jerusalem Post Newsletter</p></div></div></section></section><p>A Hamas source told  that the group is delaying the release of the names because of technical reasons. He said that \"communication between [Hamas] operatives is done physically by messengers, and it takes them time to agree on the names and location of the hostages while IDF jets are still overhead.\"</p><p>He added, \"The list will only be released after approval from Hamas leader Muhammad Sinwar.\"</p><p>In a statement on Saturday, Hamas revealed that it would publish lists of names the day before each exchange day.</p><p>An Israeli source told KAN that they knew \"Hamas would be manipulative\" in not providing who would be released on Sunday.</p><p>On the seventh day of the deal, four more hostages are expected to be released, and this procedure is expected to occur every week on Saturday for the next six weeks, leading up to the <a href=\"https://www.jpost.com/israel-news/article-838118\">release of 33 more hostages.</a></p><p>A source familiar with the details of the negotiations said that the next 24 hours are critical for the beginning of the implementation of the deal and that Israel feared that Hamas would try to violate it. A spokesperson for the Qatari Foreign Ministry said that \"there has been no violation of the agreement.\"\n\t\t\t\t</p>","contentLength":3163,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1i4srks/ceasefire_officially_delayed_as_hamas_fails_to/"}]}