{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Moldovan Parliament votes to close Russian cultural centre","url":"https://www.reuters.com/world/moldovan-parliament-votes-close-russian-cultural-centre-2025-11-27/","date":1764283812,"author":"/u/twotwo_twentytwo","guid":563,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1p8f8ub/moldovan_parliament_votes_to_close_russian/"},{"title":"The Great Pacific Garbage Patch is now so large that dozens of species call it 'home'","url":"https://www.earth.com/news/great-pacific-garbage-patch-so-large-that-dozens-of-species-call-it-home/","date":1764273130,"author":"/u/seeebiscuit","guid":566,"unread":true,"content":"<p>When we picture the open Pacific, we imagine endless blue water and not much else. Marine researchers, however, are now seeing something very different: places like the Great Pacific Garbage Patch where plastic waste has built a kind of artificial shoreline far from any land.</p><p>In the <a href=\"https://en.wikipedia.org/wiki/North_Pacific_Gyre\" target=\"_blank\" rel=\"noreferrer noopener\">North Pacific Subtropical Gyre</a>, the huge rotating current system between California and Hawaii, floating objects tend to get trapped instead of drifting away. </p><p>That’s where you find what people commonly call the Great Pacific Garbage Patch, a region that now holds tens of thousands of tons of plastic pieces sturdy enough to move around the ocean for years at a time.</p><h2>Old ideas about offshore life</h2><p>For a long time, biologists treated <a href=\"https://www.earth.com/news/coastal-waters-are-acidifying-much-faster-than-scientists-expected/\">coastal waters</a> and the open ocean as two separate neighborhoods. Coastal species were expected to stay on rocks, piers, and shorelines, while <a href=\"https://oceanservice.noaa.gov/facts/pelagic.html\" target=\"_blank\" rel=\"noreferrer noopener\">pelagic</a> species were the ones that belonged offshore. </p><p>People knew that a storm could knock a log or a raft of seaweed loose and carry coastal organisms away from land, but the usual assumption was that those passengers would eventually die because conditions in the open ocean were too harsh.</p><p>A big clue that this view was incomplete came after the <a href=\"https://en.wikipedia.org/wiki/2011_T%C5%8Dhoku_earthquake_and_tsunami\" target=\"_blank\" rel=\"noreferrer noopener\">Great East Japan Tsunami</a>. The huge waves ripped loose docks, boats, and many plastic objects and sent them drifting into the Pacific. </p><p>For years afterward, pieces of that debris landed on beaches in North America and Hawaii. When scientists checked those objects, they found that many Japanese coastal species had stayed alive on them for at least six years as they crossed the ocean. </p><p>That led to a new question: were these coastal species only passing through the open ocean, or were they beginning to form more permanent communities there?</p><h2>Studying the Great Pacific Garbage Patch</h2><p>To explore that question, scientists joined research cruises to the eastern side of the gyre. Standing on deck, crew members watched the sea surface and picked out plastic items at least 6 inches (15 centimeters) long.</p><p>In the end they brought on board 105 pieces of floating plastic, including bottles, buoys, crates, nets, ropes, and buckets, along with a “wildcard” group of especially life‑covered objects. </p><p>Every item was labeled, photographed, and tagged with its position before being set aside for careful study back in the lab.</p><p>Back in the laboratory, taxonomists went through each piece of plastic and looked for invertebrates – animals without backbones. </p><p>They found a wide variety of creatures, such as barnacles, crabs, <a href=\"https://www.earth.com/news/why-the-shores-of-the-red-sea-turn-pink-every-year/\">amphipods</a>, bryozoans, hydroids, and <a href=\"https://www.earth.com/news/sea-anemones-share-a-body-patterning-trick-with-humans/\">sea anemones</a>. </p><p>Altogether they identified 46 different kinds of invertebrates from six major animal groups. Of those 46, 37 were coastal species and 9 were pelagic, which means roughly 80% of the diversity on the debris came from coastal organisms.</p><h2>Life in the Great Pacific Garbage Patch</h2><p>When the team checked the plastic, almost every piece they had picked up was carrying life, mostly invertebrates. </p><p>Invertebrates were present on 98% of the objects. Pelagic species showed up on more than 94% of the pieces, and coastal species on a bit over 70%. </p><p>Many items hosted both coastal and pelagic species at the same time, so these very different organisms were sharing the same floating “islands” in the middle of the ocean.</p><p>On average, each plastic item carried about four to five kinds of organisms, and coastal species were slightly more common than pelagic ones. </p><p>Nets and ropes tended to have especially dense communities, probably because their many strands and small spaces offered plenty of places to hang on and hide.</p><p>One of the biggest questions was whether coastal organisms were just temporary passengers on the plastic or whether they could live out their whole life cycles there. </p><p>The team looked for evidence of reproduction and growth. They searched for brooding females – females carrying eggs or young – in several crustacean groups such as amphipods and crabs, and they did find them. They also saw reproductive structures on <a href=\"https://en.wikipedia.org/wiki/Hydrozoa\" target=\"_blank\" rel=\"noreferrer noopener\">hydroids</a>.</p><p>The scientists also measured individual animals and noted the range of sizes on each piece of debris. </p><p>On some species of sea anemones and amphipods they saw tiny juveniles, medium‑sized individuals, and full‑grown adults all living together on the same plastic surface. </p><p>That pattern suggests that new generations were growing up on these rafts instead of all arriving at the same time from the coast.</p><h2>Why some life thrives on plastic</h2><p>To understand why some species handle this lifestyle better than others, the researchers looked at traits that might be useful on a plastic raft. </p><p>They noted whether adults stayed fixed in place (sessile) or could move around, and they recorded how each species fed – for example, by filtering particles from the water, grazing on surfaces, hunting prey, or using more than one of these methods.</p><p>Many of the coastal species living on the plastic were able to reproduce asexually, essentially cloning themselves. Their larvae also did not need to spend much time drifting freely in the water. </p><p>Young animals could grow right on the same surface as the adults. That kind of life cycle fits well with a small, isolated raft of plastic that slowly circles within the gyre.</p><p>Interestingly, pelagic communities were strongly linked to the type of plastic object, while coastal communities were more tied to when the debris was collected during the cruises.</p><p>The researchers then compared these gyre communities with earlier work on debris from the 2011 tsunami. </p><p>Many of the coastal species found on plastics in the gyre had also been seen on Japanese tsunami debris that later washed ashore in North America and Hawaii. </p><p>However, the groups that were most diverse were not exactly the same, and some coastal groups, such as mollusks, were much less common in the gyre. </p><p>Overall, the gyre debris supported fewer species than the tsunami debris, and the researchers’ analyses suggested that there are probably still coastal species living on plastics in the gyre that scientists have not yet recorded.</p><h2>Great Pacific Garbage Patch lessons</h2><p>Taken together, these results point to the rise of a “neopelagic” community in the open ocean, where “neo” means new and “pelagic” refers to life in the open sea. </p><p>This neopelagic community includes both the usual pelagic rafters and coastal species that can now survive far from land because plastic items act as durable homes.</p><p>In the past, one big reason coastal species stayed near shore was the lack of long‑lasting, floating hard surfaces in the open ocean. </p><p>Human‑made plastics have changed that by adding countless new floating “islands” for coastal life in waters that used to be almost entirely pelagic. </p><p>Plastic pollution is, therefore, not only an eyesore or a trash problem; it also shifts where marine life can live and allows coastal organisms to survive, reproduce, and spread across huge distances.</p><p>This discovery may reshape marine ecosystems and species ranges around the world.</p>","contentLength":6981,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1p8bebc/the_great_pacific_garbage_patch_is_now_so_large/"},{"title":"Putin confuses Ukrainian cities and invents battles in Komsomolsk","url":"https://newsukraine.rbc.ua/news/putin-confuses-ukrainian-cities-and-invents-1764260993.html","date":1764272380,"author":"/u/jackytheblade","guid":562,"unread":true,"content":"<p data-end=\"637\" data-start=\"422\">Putin once again claimed that Pokrovsk and Myrnohrad are surrounded. This time, he insisted that \"70% of Pokrovsk has been captured, and in southern Myrnohrad, Ukrainian forces have already been cut off.\"</p><p data-end=\"971\" data-start=\"639\">\"And then what? If you look at the map, next is Komsomolsk. To the north – Kupiansk, Sloviansk, Siversk. In Komsomolsk, fighting is ongoing inside the town, and advances continue,\" added the Russian President.</p><p data-end=\"971\" data-start=\"639\">Most likely, Putin meant Kostiantynivka, as there is no Komsomolsk in the Ukrainian-controlled part of the Donetsk region.</p><p data-end=\"1171\" data-start=\"973\">A town with a similar name – Komsomolske – is located in the southern part of the Donetsk region near Mariupol, but it has been under occupation since 2014 and was renamed Kalmiuske in 2016 by a Verkhovna Rada decision.</p><p data-end=\"1406\" data-start=\"1173\">The Russian President also stated that 1,700 out of 8,000 buildings in Siversk have come under Russian control. This claim also seems dubious, given that the town had only about 10,800 residents in peacetime.</p>","contentLength":968,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1p8b3ut/putin_confuses_ukrainian_cities_and_invents/"},{"title":"Russia ready to 'fight to the last Ukrainian,' Putin says amid US peace drive","url":"https://abcnews.go.com/International/russia-ready-fight-ukrainian-putin-amid-us-peace/story?id=127927423","date":1764270112,"author":"/u/seeebiscuit","guid":568,"unread":true,"content":"<p>Russian President Vladimir Putin said a U.S. delegation is expected to arrive in Moscow in the first half of next week to discuss the latest American proposal to end the Kremlin's war in Ukraine.</p><p>Speaking at a press conference during a visit to Bishkek, Kyrgyzstan, on Thursday, Putin said no draft peace agreement had been agreed to in recent talks between the U.S. and Ukraine, only a list of issues to be discussed.</p><p>Putin also said it was \"pointless\" to sign any documents with Ukraine's current leadership, alleging that Ukrainian President Volodymyr Zelenskyy lacked legitimacy to do so.</p><p>In a series of hardline statements -- his most extensive comments on the latest U.S.-proposed peace plan to date -- Putin repeated some of Russia's most hardline demands, including that Ukrainian troops must withdraw from territory Moscow claims. Putin ruled out signing any ceasefire deal before Ukrainian troops withdraw.</p><p>\"If Ukraine's troops leave the territory occupied, then military action will stop. If they won't leave then we will achieve that by armed force,\" Putin said.</p><p>He also said recognition of Russia's occupation of Crimea, Donbas and a swath of eastern and southern Ukraine must be part of negotiations with the U.S.</p><p>Putin projected confidence about Russia's battlefield position, claiming there was a \"positive dynamic\" everywhere on the front. The president said Russia was \"ready in principle\" to \"fight to the last Ukrainian.\"</p><p>Ahead of Witkoff's expected trip to Moscow next week, Putin said the latest American peace proposals \"can be the basis for future agreements.\"</p><p>\"Overall, we see that the American side is taking into account our position, which was discussed before Anchorage and after Alaska,\" he added, referring to his August summit with Trump. \"In some areas, we definitely need to sit down and seriously discuss specific issues,\" Putin said.</p><p>Putin also answered questions about a leaked recording of a purported phone call between President Donald Trump's envoy Steve Witkoff and top Kremlin aide Yuri Ushakov, in which Witkoff appeared to be offering Ushakov advice on how Moscow could present its own peace plans to Trump.</p><p>\"This may be some kind of fake news,\" Putin said. \"Maybe they really did eavesdrop. Actually, this is a criminal offense; eavesdropping is illegal in our country. It's not about us. It's about the battle of opinions between the collective West and the U.S. over what needs to be done to end the hostilities.\"</p><p><em>Othon Leyva contributed to this report.</em></p>","contentLength":2490,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1p8a7xl/russia_ready_to_fight_to_the_last_ukrainian_putin/"},{"title":"North Korea makes Russian mandatory in schools","url":"https://www.politico.eu/article/north-korea-russia-mandatory-school-mgimo/","date":1764268839,"author":"/u/archi-mature","guid":567,"unread":true,"content":"<div><p>Russian leader says the use of the assets will be a “theft” and a stress test for Europe’s economy. \n</p></div>","contentLength":107,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1p89pkq/north_korea_makes_russian_mandatory_in_schools/"},{"title":"Putin says US plan could be ‘basis’ of a Ukraine deal but threatens to take land by force if Kyiv doesn’t withdraw","url":"https://www.cnn.com/2025/11/27/europe/putin-trump-ukraine-peace-intl","date":1764268415,"author":"/u/perplexed-redditor","guid":560,"unread":true,"content":"<p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmihi4yu1009o26p298ltfdld@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Russian President Vladimir Putin said that a US plan to end the war in Ukraine could “form the basis for future agreements” but renewed threats to seize more territory by force unless Kyiv withdraws.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmihiqq1r00083b6nql1q7hwv@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Speaking to reporters in Bishkek, in the Central Asian republic of Kyrgyzstan on Thursday, Putin confirmed the Kremlin was expecting a US delegation headed by Special Envoy Steve Witkoff to visit Moscow early next week, adding that the Kremlin was ready for “serious discussion”.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmihiz7as001f3b6n5vg1zv3j@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            But chances of a swift breakthrough appear slim after Putin repeated his maximalist demands, saying the war in Ukraine will only end “once Ukrainian troops withdraw from the territories they occupy.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmihiwxw9000v3b6nacxig2f2@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “If they don’t withdraw, we will achieve this through military means,” the Russian leader said.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmihveiw700003j6oskky0yxk@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Ukrainian President Volodymyr Zelensky said his delegation will also meet with US officials by the end of this week to discuss points set out in Geneva. Speaking in his nightly video address, Zelensky added that next week will see “important negotiations not only for our delegation, but also for me personally,” without providing further details.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmihixvt400163b6nc9q15116@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Russia is occupying some 20% of the territory recognized under international law as part of sovereign Ukraine, including almost all of the Luhansk region, and parts of the Donetsk, Kherson and Zaporizhzhia regions.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmihl2s2r000z3b6nakfg4ruj@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Moscow is demanding Ukraine surrender the entirety of these four regions, which it has annexed but not fully conquered.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmihlbuhg00003b6nqbq55xjv@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Russia has made some gains along the eastern Ukrainian frontline in recent weeks, most significantly around the <a href=\"https://www.cnn.com/2025/11/16/world/pokrovsk-russia-ukraine-tactics-intl\">city of Pokrovsk</a>.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmihmcefv00023b6nuczpo9cr@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Still, the Institute for the Study of War, a US-based conflict monitor, said on Thursday that data on Russian forces’ rate of advance indicates that “a Russian military victory in Ukraine is not inevitable, and a rapid Russian seizure of the rest of Donetsk Oblast is not imminent.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmihjlvv500233b6nu3w8tbek@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Crucially, the area Russia is demanding includes the “fortress belt” of heavily defended towns and cities seen that are seen as vital for Ukrainian security. Kyiv and its European allies have made it clear that territorial concessions are a red line for them.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmihjjerd00213b6nz5hjq5cb@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Putin’s remarks on Thursday were the strongest indication that Russia is not willing to move after US <a href=\"https://www.cnn.com/2025/11/25/politics/dan-driscoll-trump-ukraine-russia-war\">officials</a>, including Trump himself, touted “tremendous progress” being made on their efforts to end the war.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmihjuke4002c3b6ngvy2v61c@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            This came after Ukrainian and European officials strongly opposed and then revised the <a href=\"https://cnn.com/2025/11/21/europe/peace-proposal-russia-ukraine-annotated-intl-vis\">28-point peace plan</a> which was drafted by the US with apparent strong input from Russia.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmihkatzi00093b6nmvkpkpwi@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            The original plan reflected Russia’s extensive wishlist, and included a demand for Ukraine to reduce its army and be barred from joining NATO.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmihjbiuj001s3b6n30p0gu1f@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Putin said on Thursday that he was expecting <a href=\"https://www.cnn.com/2025/04/18/politics/steve-witkoff-trump-defacto-point-man-foreign-policy\">Witkoff</a> to arrive to Moscow early next week, presumably to discuss the new draft of the plan, the exact wording of which is not yet known.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmihk93vp00053b6n3wwblgss@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Putin said he has been informed of the latest discussions and that the plan could “form the basis for future agreements.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmihk82pm00023b6nfcuo7457@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “It would be impolite of me to speak of final agreements now,” Putin added.\n    </p>","contentLength":3363,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1p89jk7/putin_says_us_plan_could_be_basis_of_a_ukraine/"},{"title":"Russia has 'no say' over whether Ukraine can join NATO, Rutte says","url":"https://kyivindependent.com/russia-has-no-say-over-whether-ukraine-can-join-nato-rutte-says/","date":1764267915,"author":"/u/AndroidOne1","guid":569,"unread":true,"content":"<p>NATO Secretary General Mark Rutte said on Nov. 26 that Ukraine's accession to the alliance depends on unanimous agreement among member states — not on Russian demands.</p><p>\"Russia has no say or veto over who can be a NATO member,\" Rutte told Spanish media outlet <a href=\"https://elpais.com/internacional/2025-11-26/mark-rutte-rusia-seguira-siendo-una-amenaza-para-europa-aunque-haya-acuerdo-de-paz-en-ucrania.html\">El Pais</a>. \"But within the Alliance, membership requires unanimity,\" adding that several NATO allies, including the United States, oppose Kyiv's entry.</p><p>Rutte's remarks came amid a week of intense diplomacy, after the United States reinvigorated peace talks with a controversial 28-point plan widely viewed as favoring Russia.</p><p>While the proposal has since been pared down following conversations with Ukraine and Europe following consultations with Ukraine and European partners, the original version reportedly included provisions barring Ukraine's NATO aspirations — effectively stipulating a Russian veto of Ukraine's membership in the alliance.</p><p>Moscow has long claimed that NATO expansion forced it into war, although Ukraine is not a NATO member. Following the invasion, Sweden and Finland both joined the alliance, citing Russia as a security concern.</p><p>He also added that the latest version of the peace plan, which emerged after negotiations in Geneva, provided a \"good foundation for further discussions,\" but added that any proposal will require a \"separate, parallel discussion\" with NATO \"on certain issues.\"</p><p>\"When you look at the peace plan (we) want to ensure that Putin never tries to attack Ukraine again,\" Rutte said. \"If NATO membership is not an option, we must at least provide security guarantees that are strong enough to make Russia never try again.\"</p><p>Rutte also noted that Russia’s offensive progress in 2025 remains minimal, adding that Moscow \"advances only a few meters a day\" and has struggled for 18 months to seize <a href=\"https://kyivindependent.com/ukrainian-army-on-search-and-destroy-missions-to-clear-russians-from-central-pokrovsk/\">Pokrovsk</a>. </p><p>Located in northwestern part of Donetsk Oblast, the city of Pokrovsk has been at the epicenter of fierce fighting along the Russian-Ukrainian line over the past year. Small Russian units, oftentimes lone individuals, have been infiltrating the city, sometimes dressed as civilians, the military has <a href=\"https://kyivindependent.com/russian-forces-fight-in-pokrovsk-using-sabotage-teams-disguise-as-civilians-ukraines-military-says/\">previously reported</a>.</p><p>Regardless of how current peace efforts unfold, Rutte believes that \"Russia will remain a long-term threat for a long time.\"</p><p>\"If a Russian president is willing to sacrifice a million people from his own people for this fallacy of correcting history, we must be prepared,\" he said, adding that this is why \"we must spend much more on our defense.\" Rutte stressed that \"a peace plan does not change the assessment of Russia as a long-term threat to Europe.\"</p>","contentLength":2580,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1p89c9t/russia_has_no_say_over_whether_ukraine_can_join/"},{"title":"Germany Drafts Secret 1,200-Page War Plan to Rush 800,000 NATO Troops East","url":"https://united24media.com/latest-news/germany-drafts-secret-1200-page-war-plan-to-rush-800000-nato-troops-east-13815","date":1764249745,"author":"/u/pyramidworld","guid":564,"unread":true,"content":"<p>Germany has drawn up&nbsp;a&nbsp;sweeping, classified 1,200-page wartime logistics plan detailing how NATO would surge up&nbsp;to&nbsp;800,000 troops across German territory if&nbsp;Russia launched an&nbsp;attack on&nbsp;the alliance,  reported on&nbsp;November&nbsp;27.</p><p>The internal blueprint—<a href=\"https://www.wsj.com/world/europe/germany-russia-war-nato-secret-plan-8ce43a8d\" rel=\"external noopener nofollow\" target=\"_blank\">known</a> as&nbsp;“Operation Plan Germany” or&nbsp;OPLAN DEU—outlines the ports, rail networks, river routes, and highways that would serve as&nbsp;NATO’s main artery to&nbsp;the eastern front.</p><div><div><p>Every article pushes back against disinformation. <b>Your support keeps our team in the field.</b></p></div><a href=\"https://united24media.com/donate?banner_variant=article_small_2\" target=\"_blank\">DONATE NOW</a></div><p>The plan marks Europe’s clearest shift back to&nbsp;a&nbsp;Cold War–style posture, in&nbsp;which civilian infrastructure is&nbsp;expected to&nbsp;function as&nbsp;part of&nbsp;a&nbsp;continent-wide military machine.</p><p>It&nbsp;also reflects a&nbsp;rapidly changing threat environment. German officials and NATO commanders now warn that Russia may be&nbsp;able—and willing—to strike within two to&nbsp;five years. Some fear that if&nbsp;Russia pauses its offensive in&nbsp;Ukraine, it&nbsp;could rebuild and pivot toward a&nbsp;confrontation with NATO sooner.</p><p>“Look at&nbsp;the map,” said Tim Stuchtey, head of&nbsp;the Brandenburg Institute for Society and Security. With the Alps blocking the south, NATO forces “would have to&nbsp;cross Germany … regardless of&nbsp;where [a conflict] might start.”</p><p>The plan’s authors stress that Germany will be&nbsp;the alliance’s central transit&nbsp;hub. But decades of&nbsp;underinvestment have left bridges, railways, ports and autobahns in&nbsp;poor shape—a major vulnerability that Russia already appears willing to&nbsp;exploit through sabotage, cyberattacks and GPS interference across Europe.</p><p>Lt. Gen. Alexander Sollfrank, responsible for preparing the Bundeswehr for large-scale operations, warned earlier this month that Russia “could begin an&nbsp;attack on&nbsp;NATO territory of&nbsp;limited scale as&nbsp;early as&nbsp;tomorrow.”</p><p>One senior Bundeswehr officer involved in&nbsp;writing OPLAN DEU summed up&nbsp;the strategy: “The goal is&nbsp;to&nbsp;prevent war by&nbsp;making it&nbsp;clear to&nbsp;our enemies that if&nbsp;they attack us, they won’t be&nbsp;successful.”</p><p>Earlier, Belgium, Germany, and the Netherlands <a href=\"https://united24media.com/latest-news/belgium-germany-and-netherlands-push-to-reopen-historic-iron-rhine-railway-for-nato-mobility-10773\" target=\"_self\">agreed</a> to&nbsp;reopen the historic Iron Rhine railway to&nbsp;enhance military mobility in&nbsp;Europe amid growing security concerns over Russia.</p>","contentLength":2215,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1p8230k/germany_drafts_secret_1200page_war_plan_to_rush/"},{"title":"European parliament calls for social media ban on under-16s","url":"https://www.theguardian.com/technology/2025/nov/26/social-media-ban-under-16s-european-parliament-resolution","date":1764247152,"author":"/u/D0ML0L1Y401TR4PFURRY","guid":561,"unread":true,"content":"<p>Children under 16 should be banned from using social media unless their parents decide otherwise, the European parliament says.</p><p>MEPs passed a resolution on age restrictions on Wednesday by a large majority. Although not legally binding, it raises pressure for European legislation amid growing alarm about the <a href=\"https://www.theguardian.com/society/ng-interactive/2025/jun/07/jonathan-haidt-anxious-generation-smartphones\" data-link-name=\"in body link\">mental health</a> risks to children of unfettered internet access.</p><p>The European Commission, which is responsible for initiating EU law, is already studying Australia’s <a href=\"https://www.theguardian.com/media/2025/nov/23/australia-under-16-social-media-ban-how-will-it-work-which-platforms-age-verification\" data-link-name=\"in body link\">world-first social-media ban</a> for under-16s, which is due to take effect next month.</p><p>In a speech in September, the commission’s president, <a href=\"https://www.theguardian.com/world/ursula-von-der-leyen\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Ursula von der Leyen</a>, said she would watch the implementation of Australia’s policy. She spoke out against “algorithms that prey on children’s vulnerabilities with the explicit purpose of creating addictions” and said parents felt powerless against “the tsunami of big tech flooding their homes”.</p><p>Von der Leyen promised a panel of experts would be set up by the end of the year to advise on the best approach to protecting children.</p><p>Interest is growing in restricting children’s social media and smartphone access. An expert report commissioned last year by France’s president, Emmanuel Macron, said children should not be allowed to use smartphones <a href=\"https://www.theguardian.com/world/2024/apr/30/stop-children-using-smartphones-until-they-are-13-say-french-experts-in-report\" data-link-name=\"in body link\">until the age of 13</a> and social media, such as TikTok, Instagram and Snapchat, until they were 18.</p><p>Christel Schaldemose, the Danish Social Democrat MEP who drafted the resolution, told reporters that politicians needed to act to protect children: “It is not just parents. Society also needs to step up and make sure that platforms are a safe place for minors to be, but only if they are above a certain age.”</p><p>Her report called for the default disabling of addictive features on internet platforms when used by minors, such as infinite scrolling (endless content as the user scrolls down), videos that automatically play, excessive push notifications and rewards for repeated use of a site.</p><p>The resolution noted that “addictive design features are often inherent to the business model of platforms, notably social media”. An earlier draft of the Schaldemose report cited <a href=\"https://www.europarl.europa.eu/RegData/etudes/STUD/2019/624249/EPRS_STU(2019)624249_EN.pdf\" data-link-name=\"in body link\">a study</a> stating that one in four children and young people displayed “problematic” or “dysfunctional” smartphone use – behavioural patterns mirroring addiction. The resolution said children should be 16 before they could access social media, although parents could give consent from the age of 13.</p><p>The White House is urging the EU to roll back its digital laws and some supporters of a social media ban explicitly framed the vote in this context. At a meeting in Brussels on Monday, Howard Lutnick, the US commerce secretary, said EU rules on tech companies needed to be more “balanced” in exchange for lower US steel and aluminium tariffs.</p><p>Referring to Lutnick’s visit, Stéphanie Yon-Courtin, a French MEP from Macron’s party, said Europe was not “a regulatory colony”. In a statement after the vote, she added: “Our digital laws are not for sale. We will not back down on children’s protections because a foreign billionaire or big tech tells us to.”</p><p>The EU already seeks to protect internet users from online harms, such as disinformation, cyberbullying and illegal content, via its Digital Services Act. But the resolution said this law had gaps and could do more to protect children from addictive design features and online exploitation, such as financial incentives to become influencers.</p><p>Schaldemose said the act, which she co-authored, was strong “but we could go further, especially in areas of addictive design features and harmful dark pattern practices where we are not so specific, not so precise”.</p><figure data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.NewsletterSignupBlockElement\"><a data-ignore=\"global-link-styling\" href=\"https://www.theguardian.com/technology/2025/nov/26/social-media-ban-under-16s-european-parliament-resolution#EmailSignup-skip-link-13\">skip past newsletter promotion</a><p tabindex=\"0\" aria-label=\"after newsletter promotion\" role=\"note\">after newsletter promotion</p></figure><p>Dark patterns refer to app or website design features to influence decision-making, such as countdown timers to encourage users to make purchases, or nagging requests to turn on location trackers and notifications.</p><p>Schaldemose’s resolution was adopted by 483 MEPs and opposed by 92, with 86 abstentions.</p><p>Eurosceptic MEPs criticised the plan, saying the EU would be overreaching if it banned social media access for children. “Decisions about children’s access must be taken as close to families as possible – in the member states, not in Brussels,” said Kosma Złotowski, a Polish member of the European Conservatives and Reformists group.</p><p>The resolution was passed only one week after the <a href=\"https://www.theguardian.com/world/2025/nov/19/european-commission-accused-of-massive-rollback-of-digital-protections\" data-link-name=\"in body link\">commission announced delays </a>to changes to its Artificial Intelligence Act and other digital laws in a push to lighten regulation on companies in the name of “simplification”.</p><p>Schaldemose said she appreciated the need to avoid creating too many laws but added “there is a willingness to do more when it comes to kids and protection of our children in the EU”.</p>","contentLength":4810,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1p817nl/european_parliament_calls_for_social_media_ban_on/"},{"title":"Top U.S. Negotiator Warned Europeans That Russia Is Stockpiling Missiles","url":"https://www.nytimes.com/2025/11/26/world/europe/ukraine-peace-talks-russia-missiles.html","date":1764245555,"author":"/u/archi-mature","guid":565,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1p80pzh/top_us_negotiator_warned_europeans_that_russia_is/"}],"tags":["news","reddit"]}