{"id":"4PaGeZyGUC","title":"Youtube","displayTitle":"Youtube","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":50,"items":[{"title":"Islam’s Greatest Stories of Love | Full Documentary | PBS","url":"https://www.youtube.com/watch?v=QBBjiDKMI6A","date":1755910822,"author":"PBS","guid":113,"unread":true,"content":"<article>A young woman devastated by the loss of her father seeks solace from five of Islam's greatest love stories, which unravel the mysteries of the Taj Mahal, reveal an unsung hero in Malcolm X's life, and show how love can change the world. \n\nMore from this documentary: https://www.pbs.org/show/islams-greatest-stories-of-love/\n\nThis program is made possible by viewers like you. Support your local PBS station: https://www.pbs.org/donate\n\nEnjoy full episodes of your favorite PBS shows anytime, anywhere with the free PBS app: https://to.pbs.org/2QbtzhR\n\nFOLLOW US:\n\nFacebook: https://www.facebook.com/PBS/\nX: https://twitter.com/PBS/\nInstagram: https://www.instagram.com/PBS/\nTikTok: https://www.tiktok.com/@pbs\nThreads: https://www.threads.net/@pbs\n\n#theology #islam #lovestory \n\nIslam's Greatest Stories of Love\nAn extraordinary exploration of love's boundless power to heal, inspire, and transform. At the heart of the film is Ariella, a brilliant young Muslim scholar whose life is upended by the tragic loss of her father. Shattered but determined, she embarks on a bold journey to uncover answers to life's most profound questions: What is love? Can it endure across time and adversity? And how do we rebuild after losing it? Along the way, Ariella is captivated by five astonishing tales from the Islamic tradition — stories that redefine love's meaning.\n\nShe delves into an epic poem of star-crossed love as tragic as Romeo and Juliet and unravels the mysteries of the Taj Mahal. She discovers a largely unknown story about how family love shaped Malcolm X and finds empowerment in the remarkable partnership of the Prophet Muhammad and his wife Khadija. Woven through these rich narratives is Ariella’s own quest to rediscover faith, hope, and the courage to love again. With breathtaking storytelling and universal resonance, Islam’s Greatest Stories of Love invites viewers on a journey as unforgettable as the stories it unveils, reminding us that love is not just an emotion; it is a force.</article>","contentLength":2008,"flags":null,"enclosureUrl":"https://www.youtube.com/v/QBBjiDKMI6A?version=3","enclosureMime":"","commentsUrl":null},{"title":"Andrew Goes to Hobo Convention","url":"https://www.youtube.com/shorts/ql9CTlGqmLA","date":1755903694,"author":"Channel 5 with Andrew Callaghan","guid":433,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"https://www.youtube.com/v/ql9CTlGqmLA?version=3","enclosureMime":"","commentsUrl":null},{"title":"Gaza’s hunger crisis is officially a famine #shorts","url":"https://www.youtube.com/shorts/6DVbgHcklOs","date":1755897287,"author":"Vox","guid":48,"unread":true,"content":"<article>The UN-backed Integrated Food Security Phase Classification (IPC) system — the world’s leading authority on hunger crises — has officially determined that there is a famine in Gaza. Here’s what that means.\n\nSubscribe to our channel and turn on notifications (🔔) so you don't miss any videos: http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com.\n\nWatch our full video catalog: http://goo.gl/IZONyE\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom\nCheck out our articles: https://www.vox.com/\nListen to our podcasts: https://www.vox.com/podcasts</article>","contentLength":684,"flags":null,"enclosureUrl":"https://www.youtube.com/v/6DVbgHcklOs?version=3","enclosureMime":"","commentsUrl":null},{"title":"Aryan Origins: Himmler's Hunt For The Lost City Of Atlantis","url":"https://www.youtube.com/watch?v=IETLORsmAbM","date":1755896413,"author":"Timeline - World History Documentaries","guid":356,"unread":true,"content":"<article>Heinrich Himmler believed that the Aryan race was descended from the Atlanteans. He claimed that the inhabitants of Atlantis fled to the Himalayas when their city sank. So a German expedition was sent to Tibet to prove this.\n\nDo you love uncovering the past, exploring historic sites, and venturing to distant lands? Join History Hit today and stream hundreds of exclusive documentaries, with new releases every week. Plus, enjoy ad-free access to our podcast network for even more history every week.\n\nHead over to https://bit.ly/45CPh5u to embark on your journey through history!\n\nThis channel is part of the Little Dot Studios Network. Any queries, please contact owned-enquiries@littledotstudios.com</article>","contentLength":703,"flags":null,"enclosureUrl":"https://www.youtube.com/v/IETLORsmAbM?version=3","enclosureMime":"","commentsUrl":null},{"title":"Egon Schiele: Great Art Explained","url":"https://www.youtube.com/watch?v=uLHZZmTXhPM","date":1755885975,"author":"Great Art Explained","guid":579,"unread":true,"content":"<article>My book Great Art Explained is ready to pre-order now worldwide \nMy other channel, Great Books Explained here - https://www.youtube.com/@greatbooksexplained371 \nPlease consider supporting this channel on Patreon (and getting exclusive and uncensored content), thanks! https://www.patreon.com/user?u=53686503 \nor if you prefer a one-off donation - https://paypal.me/GreatArtExplained?country.x=GB&amp;locale.x=en_GB \nAlternatively, every video has a \"thanks\" button under it- I appreciate it! \n\nEgon Schiele was one of the most intense and controversial artists of the early 20th century. A shy, reserved child turned rebellious visionary. He scandalised Vienna with raw, often unsettling depictions of the human body. His work is filled with twisted forms and existential angst, reflecting an obsession with mortality, sexuality, and identity - especially his own. \nHis self-portraits are unlike anything that came before them: emaciated, contorted and confrontational. With sunken eyes and twisted limbs - they were not intended to flatter, but to disturb. So, what drove this young artist to depict himself so mercilessly?\n\nIMPORTANT!  \nSubscribe and click the bell icon to be notified! https://www.youtube.com/channel/UCePD... \n\nI would like to thank all my Patreon supporters, in particular Alan Stewart, Alexander Velser, AMSN, Andrei Surei, Anja Zeutschel, Bria Nicole Art, Brian J Rich, David Asabreu, Ed Gobbi, \"Elias', Eric Mann, Francis Song, Griffin Evans, Jemma Theivendran, Joe Kool, Jon Hanzen, Julio Cardenas, Kibibi Shaw, Louise Tait, Matthew Bondaryk, Mitch Kosowski, Monte St Johns, New Curiosity, Paul Ark, Paul Waterman, Daniel Rakovski, Sam Blakelock, Sean Welgemoed, Stephen Beresford, Tanya Moore, Theresa Garfink, and Toni Ko. \n\n\n\"What a brilliant series this is\" - Stephen Fry on Twitter (X) \n\nCREDITS \nScript co-written by Laura Beardsell-Moore Opening \nAnimation and Title Sequence by Brian Adsit (instagram https://instagram.com/brian_vfx?utm_m... and Behance www.behance.com/badsit88) \nAdditional animation (Schiele’s works) by Carlo Vega (http://www.instagram.com/carlovega)\nRecording by Robert Lewis \n\nVIDEOS \nAll the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel do not claim any right over them. \n\nMUSIC \nArnold Schoenberg: Verklärte Nacht\n\nBOOKS \nSchiele: The Midnight Soul of the Artist \nEgon Schiele by Frank. Whitford by Reinhard Steiner \nSchiele: 1890-1918: Desire and Decay by Wolfgang Georg Fischer\nThe Faces of Egon Schiele: Self Portraits by Elizabeth Leoplod and Stefan Kutzenberger\nEgon Schiele: Last Years 1914-1918 by Kerstin Jesse, Jane Kallir, et al.\n\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.</article>","contentLength":2957,"flags":null,"enclosureUrl":"https://www.youtube.com/v/uLHZZmTXhPM?version=3","enclosureMime":"","commentsUrl":null},{"title":"This material gets tougher as you break it","url":"https://www.youtube.com/watch?v=AFXLZ7FEJc4","date":1755882683,"author":"Veritasium","guid":55,"unread":true,"content":"<article>The strange natural material that reshaped the world. Sponsored by Ground News -\nGo to https://groundnews.com/Ve to see through media misconceptions and get all sides of every story. Subscribe to save 40% off the unlimited Vantage Plan through our link.\n\nIf you’re looking for a molecular modelling kit, try Snatoms, a kit I invented where the atoms snap together magnetically - https://ve42.co/SnatomsV\n\n▀▀▀\nA huge thanks to Professor James Busfield, Dr. Katrina Cornish, and Dr. Judit Puskas\n\nWe’re incredibly grateful to Toby Samples and the team at ARDL for their time and expertise. \n\nThanks also to Joe Jackson, Dr. Kevin Krause, Dr. Peter Polyak, Donald Shultz, Professor Robert Weiss for all their help on the project.\n\n▀▀▀\n0:00 Where does rubber come from?\n2:59 What is rubber?\n5:10 Why is rubber so stretchy?\n6:29 The problem with natural rubber\n9:02 Cured Rubber\n15:23 Vulcanisation\n18:41 What rubber is used in tires?\n22:54 How fungi could destroy the world economy\n29:17 Synthetic rubber vs natural rubber\n38:20 Why are some people allergic to latex? \n\n▀▀▀\nReferences: https://ve42.co/RubberRefs\n\nImages &amp; Video: https://ve42.co/RubberImgRefs\n\n▀▀▀\nSpecial thanks to our Patreon supporters:\nAdam Foreman, Albert Wenger, Alex Porter, Alexander Tamas, Anton Ragin, armedtoe, Balkrishna Heroor, Bertrand Serlet, Blake Byers, Bruce, Dave Kircher, David Johnston, David Tseng, Evgeny Skvortsov, Garrett Mueller, Gnare, gpoly, Ibby Hadeed, Jeromy Johnson, Jon Jamison, JT, Juan Benet, Keith England, KeyWestr, Kyi, Lee Redden, Marinus Kuivenhoven, Matthias Wrobel, Meekay, meg noah, Michael Bush, Michael Krugman, Orlando Bassotto, Paul Peijzel, Richard Sundvall, Robert Oliveira, Sam Lutfi, Tj Steyn, Ubiquity Ventures, Walter Flinn, and wolfee.\n\n▀▀▀\nWriters - Sulli Yost &amp; Casper Mebius\nProducer &amp; Director - Sulli Yost\nEditors - Jack Saxon &amp; Peter Nelson\nCamera Operators - Adam Bonomo, Jacob Ruocchio-Cole, Henry van Dyck, Thomas Matheis, Derek Muller &amp; Sulli Yost\nAnimators -  Allama Nandi, Andrew Neet, Emma Wright, Ivy Tello, Fabio Albertelli &amp; Rokas Viksraitis\nIllustrators - Jakub Misiek &amp; Maria Gusakovich\nAssistant Editor - James Stuart\nResearchers - HyoJeong Choi, Callum Cuttle &amp; Gabe Strong\nThumbnail Designers - Ren Hurley, Ben Powell &amp; Abdallah Rabah\nProduction Team - Zoe Heron, Casper Mebius, Josh Pitt, Rob Beasley Spence, Henry van Dyck &amp; Sulli Yost\nExecutive Producers - Casper Mebius &amp; Derek Muller\nAdditional video/photos supplied by Getty Images, Pond5 \nMusic from Epidemic Sound</article>","contentLength":2543,"flags":null,"enclosureUrl":"https://www.youtube.com/v/AFXLZ7FEJc4?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Piece Played at Both JFK's and Stalin's Funerals","url":"https://www.youtube.com/watch?v=xc2TM8VcCVk","date":1755879027,"author":"Ben Laude","guid":566,"unread":true,"content":"<article>The full release of Season 2 Episode 5 is COMING SOON!\n\nThe Chopin Podcast: https://chopinpodcast.com\nChopin Foundation: https://chopin.org\n\n0:00 Chopin's most famous (and morbid) tune\n5:42 IV. Finale: Presto\n9:58 III. \"Marche funèbre\": Lento\n18:13 II. Scherzo\n25:00 I. Grave – Doppio movimento\n35:09 From Miami to Warsaw\n\nCreated and hosted by Ben Laude. Special thanks to Ethan Chilton and Abby Tilton for their assistance in the production of this video.\n\nThis podcast is produced in partnership with the Chopin Foundation of the United States, which presents the National Chopin Competition every 5 years. For more, visit https://chopin.org\n\nThe Chopin Foundation is a national non-profit organization founded by its President, Blanka A. Rosenstiel in 1977, and inspired by the first US Chopin Competition she presented in Miami in 1975. Support the Chopin Foundation: https://chopin.org/donate\n\nAccess uncut interviews with Garrick Ohlsson and other guests:\nhttps://patreon.com/BenLaude\n\nhttps://www.facebook.com/chopinpodcast\nhttps://www.instagram.com/benlawdy</article>","contentLength":1069,"flags":null,"enclosureUrl":"https://www.youtube.com/v/xc2TM8VcCVk?version=3","enclosureMime":"","commentsUrl":null},{"title":"How aid organizations are censoring their language under pressure from Israel | DW Documentary","url":"https://www.youtube.com/watch?v=esnH6FY2tUs","date":1755878477,"author":"DW Documentary","guid":15,"unread":true,"content":"<article>When it comes to Gaza, international aid organizations face an agonizing choice: Tone down their rhetoric or risk being denied the permit they need to support Palestinians. \n \nOver the course of several months, DW reviewed internal emails, messages and guidelines, and corroborated claims by analyzing the organizations’ websites, explainer pages and over 100 public statements. DW Investigations found that several aid organizations have increasingly restricted their advocacy on Gaza - banning entire words and phrases from their public messaging. \n\nIf you have a tip, feel free to contact DW's investigative unit here: https://www.dw.com/en/do-you-have-confidential-information-that-you-want-to-share-with-dw/a-61899300\n\nFor the latest news, visit the DW News channel https://www.youtube.com/dwnews or the DW website: https://www.dw.com/ \n\n#documentary #investigation #reporter #dwstories #dwdocumentary\n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: ‬\n⮞ DW Documentary (English): https://www.youtube.com/dwdocumentary \n⮞ DW Documental (Spanish): https://www.youtube.com/dwdocumental \n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/dwdocarabia\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/dwdochindi\n⮞ DW Doku (German): https://www.youtube.com/dwdoku\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G</article>","contentLength":1997,"flags":null,"enclosureUrl":"https://www.youtube.com/v/esnH6FY2tUs?version=3","enclosureMime":"","commentsUrl":null},{"title":"What Prison Was Like Throughout History | Compilation","url":"https://www.youtube.com/watch?v=BcrUF58bmVI","date":1755871232,"author":"Weird History","guid":603,"unread":true,"content":"<article>Prisons are meant to keep the bad guys locked up. But sometimes even our most beloved celebrities have been locked up. And SOME prisons through history have been so scary they inspire horror stories! Come take a trip with us as we look at all things prisons - the most infamous prisons in history,  Female prison ships, what its like to be in solitary, and even what people experience on Death Row. Oh, hey, you will even find out what it was like to be a prison guard at Alcatraz! Enjoy!\n\nBe sure to subscribe to the Weird History Newsletter: https://bit.ly/WeirdHistoryNews\n\nChapters\n00:00:00 - What It Was Like To Be Held On The Most Dangerous Island Prison Colony In History\n00:10:15 - What It Was Like to Be a Civil War Prisoner\n00:20:28 - What It Was Like To Be A Prison Guard at Alcatraz\n00:31:03 - What It's Like to Live on Death Row\n00:40:48 - What Being a Prisoner In the Tower of London Was Like\n00:49:36 - The Lady Juliana | The 18th-Century All-Women Prison Ship\n00:59:26 - The Scariest Prisons in History\n01:11:09 - What It's Like To Be In Solitary Confinement\n01:22:23 - What It Was Like To Be An Inmate At Alcatraz\n\n#prison #compilation  #weirdhistory</article>","contentLength":1167,"flags":null,"enclosureUrl":"https://www.youtube.com/v/BcrUF58bmVI?version=3","enclosureMime":"","commentsUrl":null},{"title":"\"Residues\" & \"The Architect’s Paradox\" • Barry O'Reilly & Jacqui Read","url":"https://www.youtube.com/watch?v=iDzUXzOYAmE","date":1755867653,"author":"GOTO Conferences","guid":151,"unread":true,"content":"<article>This interview was recorded for the GOTO Book Club.\nhttp://gotopia.tech/bookclub\n\nRead the full transcription of the interview here\n (https://gotopia.tech/episodes/369) \nBarry O'Reilly - Founder at Black Tulip Tech and Author of \"Residues\" &amp; \"The Architect's Paradox\"\nJacqui Read - Software Architect, Speaker &amp; Author of \"Communication Patterns\"\n\nRESOURCES\nBarry\nhttps://bsky.app/profile/technologytulip.bsky.social\nhttps://www.linkedin.com/in/barry-o-reilly-b924657\nhttps://www.blacktulip.se\n\nJacqui\nhttps://bsky.app/profile/tekiegirl.bsky.social\nhttps://jacquiread.com\nhttps://fosstodon.org/@tekiegirl\nhttps://www.linkedin.com/in/jacquelineread\nhttps://github.com/tekiegirl\n\nDESCRIPTION\nIn this GOTO Book Club interview, Jacqui Read discusses with Barry O'Reilly his books \"Residues: Time, Uncertainty, and Change in Software Architecture\" and \"The Architect's Paradox\". He explains how uncertainty defines the architect's role and introduces residuality—a method where architects deliberately stress their conceptual models until they collapse, then optimize the resulting \"residues\" or leftovers to create more resilient systems.\n\nUnlike traditional software engineering approaches, that try to eliminate uncertainty through rigid requirements, residuality embraces random stressors (even far-fetched scenarios like giant lizards) to uncover architectural fault lines.\n\nO'Reilly argues that this playful yet mathematically sound approach produces more robust architectures than conventional methods, and his second book explores how inherited philosophical thinking often undermines software architecture's effectiveness in complex business contexts.\n\nRECOMMENDED BOOKS\nBarry O'Reilly • Residues\n (https://leanpub.com/residuality) Barry O'Reilly • The Architect's Paradox\n (https://leanpub.com/architectsparadox) Jacqui Read • Communication Patterns\n (https://amzn.to/3E37lvv) Anne Currie &amp; Jamie Dobson • The Cloud Native Attitude\n (https://amzn.to/3R0exeT) Gregor Hohpe • The Software Architect Elevator\n (https://amzn.to/3F6d2ax) Gregor Hohpe • Enterprise Integration Patterns, Vol 2 (https://amzn.to/3TNedQ3) \n\n\nBluesky (https://bsky.app/profile/gotocon.com) \nTwitter (https://twitter.com/GOTOcon) \nInstagram (https://www.instagram.com/goto_con) \nLinkedIn (https://www.linkedin.com/company/goto-) \nFacebook (https://www.facebook.com/GOTOConferences) \n\nCHANNEL MEMBERSHIP BONUS\nJoin this channel to get early access to videos &amp; other perks:\nhttps://www.youtube.com/channel/UCs_tLP3AiwYKwdUHpltJPuA/join\n\nLooking for a unique learning experience?\nAttend the next GOTO conference near you! Get your ticket: gotopia.tech (https://gotopia.tech) \n\nSUBSCRIBE TO OUR YOUTUBE CHANNEL (https://www.youtube.com/user/GotoConferences/?sub_confirmation=1)  - new videos posted daily!</article>","contentLength":2792,"flags":null,"enclosureUrl":"https://www.youtube.com/v/iDzUXzOYAmE?version=3","enclosureMime":"","commentsUrl":null},{"title":"How China’s Xiaomi Beat Apple and Is Taking on Tesla","url":"https://www.youtube.com/watch?v=i0Xrj1ILCHw","date":1755849656,"author":"Bloomberg Originals","guid":25,"unread":true,"content":"<article>Chinese smartphone giant Xiaomi may not be a household name globally, but it’s succeeded where Apple failed by launching its own electric car. That’s a feat Apple couldn't accomplish despite a decade of effort and billions of dollars spent. Now, Xiaomi is turning its sights to Tesla.\n\nBloomberg Originals explains why Xiaomi is betting big on EVs.\n\n00:00 Introduction\n01:41 What is Xiaomi \n03:46 Why electric cars?\n04:45 How the tech company did it\n07:00 Why its cars are popular\n08:12 China’s EV ecosystem\n09:00 Xiaomi’s global ambitions \n\n#Xiaomi #EV #China #automotive #SU7 \n\n--------\nLike this video? Subscribe: http://www.youtube.com/Bloomberg?sub_confirmation=1\n\nGet unlimited access to Bloomberg.com for $1.99/month for the first 3 months: https://www.bloomberg.com/subscriptions?in_source=YoutubeOriginals\n\nBloomberg Originals offers bold takes for curious minds on today’s biggest topics. Hosted by experts covering stories you haven’t seen and viewpoints you haven’t heard, you’ll discover cinematic, data-led shows that investigate the intersection of business and culture. Exploring every angle of climate change, technology, finance, sports and beyond, Bloomberg Originals is business as you’ve never seen it. \n\nSubscribe for business news, but not as you've known it: exclusive interviews, fascinating profiles, data-driven analysis, and the latest in tech innovation from around the world.\n\nVisit our partner channel Bloomberg News for global news and insight in an instant.</article>","contentLength":1508,"flags":null,"enclosureUrl":"https://www.youtube.com/v/i0Xrj1ILCHw?version=3","enclosureMime":"","commentsUrl":null},{"title":"Are We Sending NUKES to the MOON??","url":"https://www.youtube.com/shorts/bSsHi_6i4mY","date":1755811760,"author":"StarTalk","guid":371,"unread":true,"content":"<article>Check out our second channel, @StarTalkPlus\n\nGet the NEW StarTalk book, 'To Infinity and Beyond: A Journey of Cosmic Discovery' on Amazon: https://amzn.to/3PL0NFn\n\nSupport us on Patreon: https://www.patreon.com/startalkradio\n\nFOLLOW or SUBSCRIBE to StarTalk:\nTwitter: http://twitter.com/startalkradio\nFacebook: https://www.facebook.com/StarTalk\nInstagram: https://www.instagram.com/startalk\n\nAbout StarTalk: \nScience meets pop culture on StarTalk! Astrophysicist &amp; Hayden Planetarium director Neil deGrasse Tyson, his comic co-hosts, guest celebrities &amp; scientists discuss astronomy, physics, and everything else about life in the universe. Keep Looking Up!\n\n#StarTalk #NeildeGrasseTyson</article>","contentLength":687,"flags":null,"enclosureUrl":"https://www.youtube.com/v/bSsHi_6i4mY?version=3","enclosureMime":"","commentsUrl":null},{"title":"Andrew meets a Juggalo Hobo","url":"https://www.youtube.com/shorts/9q90qGzNqMM","date":1755811176,"author":"Channel 5 with Andrew Callaghan","guid":432,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"https://www.youtube.com/v/9q90qGzNqMM?version=3","enclosureMime":"","commentsUrl":null},{"title":"Why We’re Putting Nuclear Reactors on the Moon","url":"https://www.youtube.com/watch?v=RWL2efggMY0","date":1755810722,"author":"StarTalk","guid":370,"unread":true,"content":"<article>Go to https://ground.news/startalk to stay fully informed on the latest Space and Science news. Save 40% off through our link for unlimited access to the Vantage plan this month.\n\nWhy are we putting nuclear reactors on the moon? Neil deGrasse Tyson breaks down NASA’s plan to put nuclear power on the moon and The Artemis Mission’s plan to establish a base there. Are we in a new space race? \n\nTimestamps:\n00:00 - What’s Up With Nuclear Reactors on the Moon? \n2:10 - The New Space Race\n4:43 - Establishing a Base with the Artemis Program\n8:58 - Why a Station on the Moon? \n10:20 - Why We’re Targetting the South Pole\n\nCheck out our second channel, @StarTalkPlus\n\nGet the NEW StarTalk book, 'To Infinity and Beyond: A Journey of Cosmic Discovery' on Amazon: https://amzn.to/3PL0NFn\n\nSupport us on Patreon: https://www.patreon.com/startalkradio\n\nFOLLOW or SUBSCRIBE to StarTalk:\nTwitter: http://twitter.com/startalkradio\nFacebook: https://www.facebook.com/StarTalk\nInstagram: https://www.instagram.com/startalk\n\nAbout StarTalk: \nScience meets pop culture on StarTalk! Astrophysicist &amp; Hayden Planetarium director Neil deGrasse Tyson, his comic co-hosts, guest celebrities &amp; scientists discuss astronomy, physics, and everything else about life in the universe. Keep Looking Up!\n\n#StarTalk #NeildeGrasseTyson</article>","contentLength":1313,"flags":null,"enclosureUrl":"https://www.youtube.com/v/RWL2efggMY0?version=3","enclosureMime":"","commentsUrl":null},{"title":"Victors And The Defeated | End Of The War In Color Uncensored Episode 05","url":"https://www.youtube.com/watch?v=PAvkOn2mVfI","date":1755810025,"author":"Timeline - World History Documentaries","guid":355,"unread":true,"content":"<article>We look at the aftermath of World War II in Berlin in July 1945, from the destruction of Berlin and the Allied occupation to the struggles of Berliners - especially women - to rebuild their lives amid ruins, rationing, and uncertainty about the city's future. This episode also covers the Soviet victory parade in Moscow and the tense beginning of Allied negotiations at the Potsdam Conference to decide Germany's and Europe's fate.\n\nDo you love uncovering the past, exploring historic sites, and venturing to distant lands? Join History Hit today and stream hundreds of exclusive documentaries, with new releases every week. Plus, enjoy ad-free access to our podcast network for even more history every week.\n\nHead over to https://bit.ly/45CPh5u to embark on your journey through history!\n\nThis channel is part of the Little Dot Studios Network. Any queries, please contact owned-enquiries@littledotstudios.com</article>","contentLength":911,"flags":null,"enclosureUrl":"https://www.youtube.com/v/PAvkOn2mVfI?version=3","enclosureMime":"","commentsUrl":null},{"title":"We Asked the Public Who’s To Blame for the Medieval Plague","url":"https://www.youtube.com/watch?v=zBVpeZe94Fs","date":1755802861,"author":"History Hit","guid":623,"unread":true,"content":"<article>Rats? Children? The Mongols? The Black Death swept across the world with terrifying speed, but who (or what) was really to blame?\n\nLouise Quick, with the help of the public and medieval historians Dr Eleanor Janega and Helen Carr, is on a mission to uncover the true culprit behind one of the deadliest pandemics in human history: the Black Death.\n\n0:00 - What was the Black Death?\n6:58 - The Rat Myth: Were Rodents to Blame?\n12:37 - Poor Hygiene &amp; Medieval Sanitation Myths\n20:34 - How Global Trade Spread the Plague\n27:00 - Ancient Biological Warfare: The Mongol Theory\n34:21 - The Final Verdict: Who was Responsible?\n\nDiscover the past on History Hit with ad-free exclusive podcasts and documentaries released weekly presented by world renowned historians Dan Snow, Suzannah Lipscomb, Lucy Worsely, Mary Beard and more. Watch, listen and read history wherever you are, whenever you want it. Available on all devices: Apple TV, Amazon Prime Video, Android TV, Samsung Smart TV, Roku, Xbox, Chromecast, and iOs &amp; Android.\n\nIf you'd like to watch more great history content like this head on over to History Hit using the following link https://eu1.hubs.ly/H0gW80Z0 to sign up to our History SVOD service.\n\n#WhosToBlame #HistoryHit #BlackDeath #Medieval</article>","contentLength":1253,"flags":null,"enclosureUrl":"https://www.youtube.com/v/zBVpeZe94Fs?version=3","enclosureMime":"","commentsUrl":null},{"title":"🤯 Did #Horowitz play the BEST polonaise of ALL TIME?? 🏆 (ft. @jdistler2)","url":"https://www.youtube.com/shorts/FCfK96BEy6c","date":1755795486,"author":"Ben Laude","guid":565,"unread":true,"content":"<article>🎵: CHOPIN Polonaise in F-sharp minor, Op. 44\n\nLearn more: www.chopinpodcast.com\n\nhttps://patreon.com/BenLaude/\nhttps://instagram.com/benlawdy/\nhttps://benlaude.com/</article>","contentLength":167,"flags":null,"enclosureUrl":"https://www.youtube.com/v/FCfK96BEy6c?version=3","enclosureMime":"","commentsUrl":null},{"title":"Gathering of the Hobos","url":"https://www.youtube.com/watch?v=NJdriaH2Kgw","date":1755795136,"author":"Channel 5 with Andrew Callaghan","guid":431,"unread":true,"content":"<article>Go to https://ground.news/channel5 to stay fully informed with all sides of every story. Subscribe for 40% off the Vantage plan through my link. \n\nIf you'd like to watch 'Gathering of the Twins,' head to our Patreon - https://patreon.com/channel5 ..\n\nAnd if you want tickets to our upcoming tour 'C5 Carnival,' head to  https://channel5.news/pages/carnival</article>","contentLength":356,"flags":null,"enclosureUrl":"https://www.youtube.com/v/NJdriaH2Kgw?version=3","enclosureMime":"","commentsUrl":null},{"title":"Who Has the Right to Vote in America? | Civics Made Easy","url":"https://www.youtube.com/watch?v=regpMUdl_QA","date":1755792081,"author":"PBS","guid":112,"unread":true,"content":"<article>In this episode of Civics Made Easy, Ben Sheehan uncovers the surprising – and often overlooked – true history of voting rights in America. From the founding era to Reconstruction to Civil Rights to today, this is the story that may not have been fully taught in school. Case in point: Americans don’t actually have a constitutional right to vote for president…\n\nWhether you're a history nerd, a civic junkie, or just curious about how our democracy evolved, this deep dive will challenge what you thought you knew.\n\n🔔 Don’t forget to like, subscribe, and hit the bell so you don’t miss future episodes of Civics Made Easy on PBS.\n\nThis program is made possible by viewers like you. Support your local PBS station: https://www.pbs.org/donate\n\nEnjoy full episodes of your favorite PBS shows anytime, anywhere with the free PBS app: https://to.pbs.org/2QbtzhR\n\nFOLLOW US:\n\nFacebook: https://www.facebook.com/PBS/\nX: https://twitter.com/PBS/\nInstagram: https://www.instagram.com/PBS/\nTikTok: https://www.tiktok.com/@pbs\nThreads: https://www.threads.net/@pbs\n\n#votingrights #voting #law \n\nCivics Made Easy\nHosted by Ben Sheehan, breaks down the complex world of American government and civic participation. Each episode transforms intricate concepts into clear, digestible lessons, equipping viewers with the essential knowledge to actively participate in their democracy. Designed to empower and inform, the series makes understanding civics both accessible and engaging for all.</article>","contentLength":1491,"flags":null,"enclosureUrl":"https://www.youtube.com/v/regpMUdl_QA?version=3","enclosureMime":"","commentsUrl":null},{"title":"Superpower laughter - How humor makes us strong | DW Documentary","url":"https://www.youtube.com/watch?v=JWFPr2oaeVQ","date":1755792025,"author":"DW Documentary","guid":14,"unread":true,"content":"<article>We associate laughter with jokes or humor. Laughter is both contagious and a social behavior: people laugh 30 times more often in company. The documentary shows how neuroscience and psychology have discovered that humor makes us stronger.\n\nIn London, neuroscientist Sophie Scott has dedicated herself to researching laughter. \"Laughter plays an important role in building and maintaining social relationships. It reduces stress and relaxes us. It is an important behavior to understand,\" she says.  This is why laughter is also interesting for psychology. A research team at the Alpen-Adria-Universität Klagenfurt is exploring how humor can help in psychotherapy. Humor strengthens the relationship between therapists and patients, which can actually reduce symptoms.\n\nOthers have also discovered the positive interpersonal effect for themselves: the \"Humor hilft heilen\" (\"humor helps to heal”) foundation, founded by German doctor and TV presenter Eckart von Hirschhausen, conducts workshops in hospitals, among other places. Humor trainers teach nursing staff how to cope better with the everyday demands of their jobs. It's not about constantly cracking jokes. Rather, it’s about lightening interactions between nursing staff and patients.\n\n#documentary #dwdocumentary #dwdocs #laughter #laughing \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: ‬\n⮞ DW Documentary (English): https://www.youtube.com/dwdocumentary \n⮞ DW Documental (Spanish): https://www.youtube.com/dwdocumental \n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/dwdocarabia\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/dwdochindi\n⮞ DW Doku (German): https://www.youtube.com/dwdoku\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G</article>","contentLength":2393,"flags":null,"enclosureUrl":"https://www.youtube.com/v/JWFPr2oaeVQ?version=3","enclosureMime":"","commentsUrl":null},{"title":"Can saunas make you live longer? - Max G. Levy","url":"https://www.youtube.com/watch?v=7c-OXc6H7us","date":1755788438,"author":"TED-Ed","guid":134,"unread":true,"content":"<article>Explore how saunas can affect your body, and dig into the health benefits and limitations of this millennia-old tradition.\n\n--\n\nFinnish sauna, Roman balneae, Japanese onsen, and Indigenous American sweat lodges are just a few examples of how cultures across the globe have long considered exposure to extreme temperatures therapeutic. But today scientists are only just beginning to unravel how and why this may be the case. So, what exactly is happening in your body when you feel the heat? Max G. Levy investigates.\n\nLesson by Max G. Levy, directed by Noam Sussman, Ali Kellner, Homework Studio.\n\nSupport Our Non-Profit Mission\n----------------------------------------------\nSupport us on Patreon: http://bit.ly/TEDEdPatreon\nCheck out our merch: http://bit.ly/TEDEDShop\n----------------------------------------------\n\nConnect With Us\n----------------------------------------------\nSign up for our newsletter: http://bit.ly/TEDEdNewsletter\nFollow us on Facebook: http://bit.ly/TEDEdFacebook\nFind us on Twitter: http://bit.ly/TEDEdTwitter\nPeep us on Instagram: http://bit.ly/TEDEdInstagram\n----------------------------------------------\n\nKeep Learning\n----------------------------------------------\nView full lesson: https://ed.ted.com/lessons/can-saunas-make-you-live-longer-max-g-levy\nDig deeper with additional resources: https://ed.ted.com/lessons/can-saunas-make-you-live-longer-max-g-levy/digdeeper\n\nAnimator's website: https://www.homeworkstudio.ca\n----------------------------------------------\n\nThank you so much to our patrons for your support! Without you this video would not be possible! John Hellmann, Poompak Meephian, Chuck Wofford, Adam Pagan, Wes Winn, Conder Shou, ntiger, Noname, Hansan Hu, David D, Mac Hyney, Keith Ellison, robin valero walters, Lynne Truesdale, Gatsby Dkdc, Matthew Neal, Denis Chon, Julian Oberhofer, Monte Carroll, Eddy, Jay M, Constantino Victor Delgado, Andrea Galvagni, Andrew Tweddle, Laurel-Ann Rice, Fernando A. Endo, Helen Lee, pam morgan, sarim haq, Gerardo Castro, Michel-Ange Hortegat, Enes Kirimi, Amaury BISIAUX, ND, Samyogita Hardikar, Vanessa Graulich, Vandana Gunwani, Abdulmohsin Almadi, AJ Lyon, Geoffrey Bultitude, Mi Mi, Thomas Rothert, Brian Elieson, Oge O, Weronika Falkowska, Nevin Spoljaric, Sid Chanpuriya, Anoop Varghese, David Yastremski, and Noah Webb.</article>","contentLength":2321,"flags":null,"enclosureUrl":"https://www.youtube.com/v/7c-OXc6H7us?version=3","enclosureMime":"","commentsUrl":null},{"title":"We Won’t Explore the Galaxy...","url":"https://www.youtube.com/shorts/UNunBadMlHQ","date":1755784855,"author":"Kurzgesagt – In a Nutshell","guid":125,"unread":true,"content":"<article>... but AI will. \n\n#kurzgesagt\n#inanutshell #kurzgesagt_inanutshell #learnwithshorts #science #space #spaceexploration \n\nSources &amp; further reading: \nhttps://sites.google.com/view/kgs-tiktok-sources\n\nFollow us for more sciencey content! 🦆\n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman:        https://kgs.link/youtubeDE\nSpanish:        https://kgs.link/youtubeES\nFrench:          https://kgs.link/youtubeFR\nPortuguese:  https://kgs.link/youtubePT\nArabic:           https://kgs.link/youtubeAR\nHindi:             https://kgs.link/youtubeHI\nJapanese:     https://kgs.link/youtubeJA\nKorean:          https://kgs.link/youtubeKO\n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Products designed with ❤ https://shop.kgs.link/shorts\nBecome a Part of kurzgesagt by joining the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS &amp; SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nInstagram:     https://kgs.link/instagram\nTikTok:           https://kgs.link/tiktok\nReddit:            https://kgs.link/reddit\nDiscord:          https://kgs.link/discord\nTwitter:           https://kgs.link/twitter\nBluesky:          https://kgs.link/bluesky\nFacebook:      https://kgs.link/facebook\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          https://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook</article>","contentLength":2029,"flags":null,"enclosureUrl":"https://www.youtube.com/v/UNunBadMlHQ?version=3","enclosureMime":"","commentsUrl":null},{"title":"How to Get People Excited about Functional Programming • Russ Olsen & James Lewis • GOTO 2024","url":"https://www.youtube.com/watch?v=0SpsIgtOCbA","date":1755777602,"author":"GOTO Conferences","guid":150,"unread":true,"content":"<article>This interview was recorded at GOTO Copenhagen 2024. #GOTOcon #GOTOcph\nhttps://gotocph.com\n\nRuss Olsen - Author of \"Getting Clojure\" &amp; \"Eloquent Ruby\" @russolsen3122 \nJames Lewis - Software Architect &amp; Director at Thoughtworks\n\nRESOURCES\nRuss\nhttps://bsky.app/profile/russolsen.bsky.social\nhttps://hachyderm.io/@russolsen\nhttps://github.com/russolsen\nhttps://www.linkedin.com/in/russolsen\nhttp://russolsen.com\n\nJames\nhttps://bsky.app/profile/boicy.bovon.org\nhttps://linkedin.com/in/james-lewis-microservices\nhttps://github.com/boicy\nhttps://www.bovon.org\n\nTIMECODES\n00:00 Intro\n00:53 How Russ got started with functional programming\n05:55 Russ' new book\n11:05 Clojure\n14:46 Q&amp;A\n24:15 Misconceptions about functional programming\n28:25 To the Moon\n34:20 Q&amp;A\n37:34 Mechanical vs Software Engineering\n38:23 Agile &amp; TDD\n40:28 Outro\n\nRead the full abstract here:\nhttps://gotocph.com/2024/sessions/3522\n\nRECOMMENDED BOOKS\nRuss Olsen • Getting Clojure • https://amzn.to/3J8zI8s\nRuss Olsen • Eloquent Ruby • https://amzn.to/37gOhcG\nRuss Olsen • Design Patterns in Ruby • https://amzn.to/3r2uBjW\nBarry O'Reilly • Unlearn • https://amzn.to/3O3DQeI\nJez Humble, Joanne Molesky &amp; Barry O'Reilly • Lean Enterprise • https://amzn.to/3Cpt6ET\nSarah Wells • Enabling Microservice Success • https://amzn.to/4aa8xrv\nMartin Fowler • Refactoring • https://amzn.to/3EVcHXQ\nMatthew Skelton &amp; Manuel Pais • Team Topologies • http://amzn.to/3sVLyLQ\n\nhttps://bsky.app/profile/gotocon.com\nhttps://twitter.com/GOTOcon\nhttps://www.linkedin.com/company/goto-\nhttps://www.instagram.com/goto_con\nhttps://www.facebook.com/GOTOConferences\n#RussOlsen #JamesLewis #Clojure #lisplang #Agile #TDD #ChaosEngineering #FunctionalProgramming #CategoryTheory #FPvsOOP #Programming #SoftwareEngineering #TodayInTech\n\nCHANNEL MEMBERSHIP BONUS\nJoin this channel to get early access to videos &amp; other perks:\nhttps://www.youtube.com/channel/UCs_tLP3AiwYKwdUHpltJPuA/join\n\nLooking for a unique learning experience?\nAttend the next GOTO conference near you! Get your ticket at https://gotopia.tech\nSign up for updates and specials at https://gotopia.tech/newsletter\n\nSUBSCRIBE TO OUR CHANNEL - new videos posted almost daily.\nhttps://www.youtube.com/user/GotoConferences/?sub_confirmation=1</article>","contentLength":2270,"flags":null,"enclosureUrl":"https://www.youtube.com/v/0SpsIgtOCbA?version=3","enclosureMime":"","commentsUrl":null},{"title":"Was It Even Possible To Shoot Down A B-29?","url":"https://www.youtube.com/shorts/HQm1MFZ9sA8","date":1755774033,"author":"Imperial War Museums","guid":416,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"https://www.youtube.com/v/HQm1MFZ9sA8?version=3","enclosureMime":"","commentsUrl":null},{"title":"Marchfeld, 1278: Europe's Most Decisive Medieval Battle","url":"https://www.youtube.com/watch?v=JlIXPTeknXk","date":1755723620,"author":"Timeline - World History Documentaries","guid":354,"unread":true,"content":"<article>In 1278, a monumental battle occurred between Rudolph of Habsburg, the new German King, and Ottokar II, the Bohemian King of the Přemyslid dynasty, in Eastern Austria. The conflict between Rudolph and Ottokar had been building for five years, representing a final showdown between two powerful rulers who could not coexist. Rudolph's victory marked a turning point in European power dynamics, establishing the Habsburgs as a dominant dynasty with lasting political impact, particularly in Central Europe. Despite the enormous scale of the battle, few traces have been found, but archaeologists hope modern technology will unveil more details.\n\nDo you love uncovering the past, exploring historic sites, and venturing to distant lands? Join History Hit today and stream hundreds of exclusive documentaries, with new releases every week. Plus, enjoy ad-free access to our podcast network for even more history every week.\n\nHead over to https://bit.ly/45CPh5u to embark on your journey through history!\n\nThis channel is part of the Little Dot Studios Network. Any queries, please contact owned-enquiries@littledotstudios.com</article>","contentLength":1122,"flags":null,"enclosureUrl":"https://www.youtube.com/v/JlIXPTeknXk?version=3","enclosureMime":"","commentsUrl":null},{"title":"International adoptions - A global scandal | DW Documentary","url":"https://www.youtube.com/watch?v=pUUaGCP4j5Q","date":1755705692,"author":"DW Documentary","guid":13,"unread":true,"content":"<article>In the last 60 years, over a million \"orphans” have been adopted by Western families. Many of them are now discovering that their past is a lie. International adoptions are at the center of an unprecedented scandal.\n\nThis scandal is far-reaching. It involves children stolen from their mothers during the Pinochet dictatorship, as well as people described as Africa's \"fake orphans”. The film follows investigative journalists, activists and researchers in South Korea, Sweden, France, Chile, Germany and Switzerland. How was this huge, lucrative market able to flourish? And why does it still exist today?\n\nEven today, women are manipulated, threatened or deceived into giving up their babies - often with the blessing of state authorities. The fraudulent practices persist despite the Hague Convention, which has governed international adoption since 1993. That is because the system is flawed and encourages corruption.\n\nIn many cases, these practices come to light mainly due to pressure from adopted children who have grown into adults. After discovering the dubious conditions of their adoptions, they begin to search for their birth parents and demand explanations. These searches are often easier to conduct these days, thanks to social media, the Internet and the availability of genealogy websites.\n\n#documentary #dwdocumentary #dwdocs #adoption #orphans \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: ‬\n⮞ DW Documentary (English): https://www.youtube.com/dwdocumentary \n⮞ DW Documental (Spanish): https://www.youtube.com/dwdocumental \n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/dwdocarabia\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/dwdochindi\n⮞ DW Doku (German): https://www.youtube.com/dwdoku\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G</article>","contentLength":2456,"flags":null,"enclosureUrl":"https://www.youtube.com/v/pUUaGCP4j5Q?version=3","enclosureMime":"","commentsUrl":null},{"title":"We've Never Seen a Comet Do This","url":"https://www.youtube.com/watch?v=WsTuti1ezpc","date":1755705656,"author":"Astrum","guid":440,"unread":true,"content":"<article>Comet 29P keeps exploding, and scientists are trying to figure out why. \nIf you love learning about science as much as I do, head to http://brilliant.org/astrum to start for free. You'll also receive 20% off a premium annual subscription, giving you unlimited access to everything on Brilliant.\n\n▀▀▀▀▀▀\n\nBetween Jupiter and Neptune lurks Centaur 29P, an icy comet that won't stop exploding. Its wild cryovolcanic outbursts can make it flare 300 times brighter in a matter of hours, but the reason for these random eruptions has long been a mystery. Now, recent discoveries from the James Webb Telescope have provided a clue to the secret trigger powering the chaos. Join us as we investigate the strange case of the solar system's most explosive comet.\n\n▀▀▀▀▀▀\n\n0:00 Exploding Comet\n1:13 Centaur 29P\n3:08 Violent Eruptions\n5:19 Cryovolcanism\n7:51 Predicting Eruptions\n9:28 Jets of Gas\n10:54 Amorphous vs Crystalline Ice\n14:48 The Future\n\n▀▀▀▀▀▀\n\nAstrum's newsletter has launched! Want to know what's happening in space? \nSign up here: https://astrumspace.kit.com \n\n▀▀▀▀▀▀\n \nAstrum Displate Posters: https://astrumspace.info/Displates \nAstrum Infographic Artwork: https://electrify.art/collections/astrum  \nAstrum Merch: https://astrum-shop.fourthwall.com/ \n\nJoin us on the Astrum discord: https://discord.gg/TKw8Hpvtv8 \n\nA huge thanks to our Patreons who help make these videos possible. Sign-up here to support the channel: https://bit.ly/4aiJZNF \n\n▀▀▀▀▀▀\n\nAstrum Podcast on Spotify: https://open.spotify.com/show/6jPRrbq3o3dpvBb173ZTKi?si=a90d3efe3b704c83 \n\nAstrum Earth: https://youtube.com/@AstrumEarth \nAstrum Extra: https://www.youtube.com/@astrumextra \n\nAstrum Spanish: https://www.youtube.com/@astrumespanol \nAstrum Portuguese: https://www.youtube.com/channel/UChn_-OwvV63mr1yeUGvH-BQ \n\n▀▀▀▀▀▀\n\nReferences:\n\"Massive eruption from icy volcanic comet detected in solar system\", via livescience.com https://astrumspace.info/29Perupts\n\"CO Gas and Dust Outbursts from Centaur 29P/Schwassmann–Wachmann\", via iop.org https://astrumspace.info/COoutbursts\n\"Our solar system’s centaurs are half-asteroid, half-comet\", via astronomy.com https://astrumspace.info/centaurs\n\"NASA’s Webb Reveals Unusual Jets of Volatile Gas from Icy Centaur 29P\" https://astrumspace.info/unusualjets29P\n\"Centaur 29P/Schwassmann-Wachmann 1 and its near-nucleus environment from a stellar occultation\", via arxiv.org https://astrumspace.info/Centaur29P\n\"MISSION 29P – Centaur comet observing campaign news\", via britastro.org https://astrumspace.info/29Pobservations\n\"This mysterious comet's super-bright outbursts have astronomers puzzled\", via livescience.com https://astrumspace.info/strangeoutbursts\n\"Anatomy of outbursts and quiescent activity of Comet 29P/Schwassmann–Wachmann\", via sciencedirect.com https://astrumspace.info/anatomyofoutbursts\n\"Centaur 29P Outgassing (NIRSpec)\", via webbtelescope.org https://astrumspace.info/JWSTcentaur29P\n\"29P/Schwassmann–Wachmann 1: A Rosetta Stone for Amorphous Water Ice and CO :left_right_arrow: CO2 Conversion in Centaurs and Comets?\", via iop.org https://astrumspace.info/29Picevolcano\n\n\n▀▀▀▀▀▀\n\nCredits:\nWriter: Julia Masselos\nVideo Editor: Matheus L. Heberlê\nResearcher: Edie Abrahams\nScript Editor: Damaris McColgan\nThumbnail Designer: Peter Sheppard\nChannel Manager: Georgina Brenner\nProduction Manager: Raquel Taylor\nHead of Astrum: Jess Jordan\nCreator of Astrum: Alex McColgan\n\nWith special thanks to:\nNASA/ESO/ESA\n\n#Astrum #Space #Comet #Centaur29P</article>","contentLength":3577,"flags":null,"enclosureUrl":"https://www.youtube.com/v/WsTuti1ezpc?version=3","enclosureMime":"","commentsUrl":null},{"title":"Have you tried Alligator? 🐊 #RecipePBS #shorts","url":"https://www.youtube.com/shorts/EIIFdt83Ipo","date":1755705621,"author":"PBS","guid":111,"unread":true,"content":"<article>Coby shares a recipe for Alligator Sauce Piquante, a traditional Louisiana dish he has shared over the years with his Navy veteran brothers. His recipe for Alligator Sauce Piquante contains alligator meat, bell peppers, onions, tomato, andouille sausage and shrimp.\n\nMade possible by viewers like you. Support your local PBS station: https://www.pbs.org/donate\n\nEnjoy full episodes of your favorite PBS shows anytime, anywhere with the free PBS app!\n\n#cajun #louisiana #alligator #navy #veteran \n\nThe Great American Recipe\nAn uplifting cooking competition that celebrates the multiculturalism that makes American food unique and iconic. Hosted by Alejandra Ramos, the series gives talented home cooks from different regions of the country the opportunity to showcase their beloved signature dishes and compete to win the national search for “The Great American Recipe.” Judges Tiffany Derry, Tim Hollingsworth and Francis Lam bring their professional insights and deep culinary knowledge to encourage and support the contestants along the way.</article>","contentLength":1047,"flags":null,"enclosureUrl":"https://www.youtube.com/v/EIIFdt83Ipo?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Untold Story of the Martini-Henry (Part One) with experts Neil Aspinshaw & Jonathan Ferguson","url":"https://www.youtube.com/watch?v=tjq4yj_mzuo","date":1755702914,"author":"Royal Armouries","guid":118,"unread":true,"content":"<article>In this special episode, Jonathan is joined by Neil Aspinshaw, noted author of The Martini-Henry: For Queen and Empire, to explore the fascinating variants of the experimental .402\" calibre Martini-Henry.\n\nWhy did the British Army shrink the calibre from .450\" to .402\"?\nWhat problems were they trying to solve after the Zulu, Afghan, and Sudan campaigns?\nAnd how close did this “improved” Martini come to replacing the service rifle of its age?\n\nThis is Part One of a two-part story, join us again next week for the conclusion!\n\n0:00 Intro \n0:21 Neil &amp; For Queen and Empire\n1:35 What is .402\" Calibre and Why?\n4:58 Issues with .450\" Calibre\n10:53 Martini-Henry 1881 Pattern .402\"\n14:15 Sights inc. New Hanging Sight\n16:52 Hanging Sight (The Right Way Up...)\n21:29 Ad-hoc Button Safety   \n27:12 Martini-Henry 1883 Pattern .402\"\n29:30 Sandy Sudan Sensationalisation\n32:40 Rifling \n34:09 Martini-Henry 1886 Pattern .402\"\n35:10 The Bayonet Scandal of '84\n37:03 The 'Perfected' Enfield Martini\n41:45 Safety \n44:23 Enfield Quick Loader\n49:09 Conclusions\n53:53 End of Part 1\n\nNeil’s book: The Martini-Henry: For Queen and Empire – the definitive guide to this legendary rifle: https://martini-henry-society.myshopify.com/products/the-martini-henry-for-queen-and-empire-by-neil-aspinshaw-600009\n\n#MartiniHenry #BritishArmy #FirearmsHistory #WhatIsThisWeapon\n\nSubscribe to our channel for more videos about arms and armour  \n\nHelp us bring history to life by supporting us here: https://royalarmouries.org/support-us/donations/\n\nSign up to our museum membership scheme here: https://royalarmouries.org/support-us/membership/ \n\n⚔Website: https://royalarmouries.org/home\n⚔Blog: https://royalarmouries.org/stories/\n⚔Facebook: https://www.facebook.com/RoyalArmouriesMuseum/\n⚔Twitter: https://twitter.com/Royal_Armouries\n⚔ Instagram: http://instagram.com/royalarmouriesmuseum\n\nWe are the Royal Armouries, the United Kingdom's national collection of arms and armour. Discover what goes on behind the scenes and watch our collection come to life. See combat demonstrations, experience jousting and meet our experts. \n\nHave a question about arms and armour? Feel free to leave us a comment and we'll do our best to answer it.</article>","contentLength":2227,"flags":null,"enclosureUrl":"https://www.youtube.com/v/tjq4yj_mzuo?version=3","enclosureMime":"","commentsUrl":null},{"title":"🤔 What’s a #Chopin thumb smash? 👍","url":"https://www.youtube.com/shorts/AjYMdIXkLXQ","date":1755702807,"author":"Ben Laude","guid":564,"unread":true,"content":"<article>Chopin Competition jury member Garrick Ohlsson breaks down the second of 16 ways that Chopin revolutionized modern piano playing.\n\nhttps://patreon.com/BenLaude/\nhttps://instagram.com/benlawdy/\nhttps://benlaude.com/</article>","contentLength":214,"flags":null,"enclosureUrl":"https://www.youtube.com/v/AjYMdIXkLXQ?version=3","enclosureMime":"","commentsUrl":null},{"title":"Cannibalism Through the Lens of Cultural Relativism","url":"https://www.youtube.com/shorts/tfVs6CEkS9U","date":1755702097,"author":"Horses","guid":98,"unread":true,"content":"<article>Find the full, uncensored version of this essay and more at: ⁠https://horses.land</article>","contentLength":83,"flags":null,"enclosureUrl":"https://www.youtube.com/v/tfVs6CEkS9U?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Reason The Allies Won WW2","url":"https://www.youtube.com/watch?v=FwWDIfgkaH4","date":1755701265,"author":"Imperial War Museums","guid":415,"unread":true,"content":"<article>This video takes an in depth look at the Second World War, the biggest conflict in human history. Why did the Allies win the war? Or might a better question be - why did the Axis lose it?\n\n00:00 Why did the Axis lose?\n00:36 Axis strategy\n01:33 Allied strategy\n02:27 War begins in Asia\n03:01 War begins in Europe\n3:59 Blizkrieg\n5:28 The big problem\n7:16 Germany invades the USSR\n9:15 Japan attacks Pearl Harbor\n10:59 The turning point\n11:52 The war at sea\n13:27 The air war\n14:59 The land war\n16:38 Endgame\n18:31 Why the Allies won WW2\n\nSee our objects for yourself. Plan your visit to IWM London: \nhttps://www.iwm.org.uk/visits/iwm-london\n\nExplore and licence the film clips used in this video: \nhttps://film.iwmcollections.org.uk/collections/_LaBPgM9g\n\nFollow IWM on social media:\nx.com/I_W_M\ninstagram.com/imperialwarmuseums\nfacebook.com/iwm.london\ntiktok.com/@imperialwarmuseums\n\nCredits:\n\nHitler in Paris image, Bundesarchiv, Bild 183-H28708 / CC BY-SA 3.0 DE https://creativecommons.org/licenses/by-sa/3.0/de/deed.en</article>","contentLength":1021,"flags":null,"enclosureUrl":"https://www.youtube.com/v/FwWDIfgkaH4?version=3","enclosureMime":"","commentsUrl":null},{"title":"Abalone, sharks and survival | DW Documentary","url":"https://www.youtube.com/shorts/TeQVsw_A8O8","date":1755694861,"author":"DW Documentary","guid":12,"unread":true,"content":"<article>Pāua, New Zealand’s black foot abalone, is more than just seafood. To Māori, it’s taonga: a treasure from the god of the sea. And on international markets, it’s sold as a luxury delicacy. Abalone divers can make up to €200,000 a year. But diving for these sea snails isn’t easy – and it’s far from safe. Divers brave cold waters and life-threatening encounters with great white sharks. Would you risk your life for this kind of treasure? \n\nWatch the full documentary “Treasure islands in the Pacific - From the Chatham Islands to Enewetak (2/2)” on the DW Documentary YouTube channel.   \n\n#documentary #dwdocumentary #dwdocs #pacificocean #sharks #abalone \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: ‬\n⮞ DW Documentary (English): https://www.youtube.com/dwdocumentary \n⮞ DW Documental (Spanish): https://www.youtube.com/dwdocumental \n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/dwdocarabia\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/dwdochindi\n⮞ DW Doku (German): https://www.youtube.com/dwdoku\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G</article>","contentLength":1763,"flags":null,"enclosureUrl":"https://www.youtube.com/v/TeQVsw_A8O8?version=3","enclosureMime":"","commentsUrl":null},{"title":"How Unforgiving Tools Help Your Programming Discipline with Michael Feathers","url":"https://www.youtube.com/shorts/3Z1uq0Vj5Ys","date":1755691212,"author":"GOTO Conferences","guid":149,"unread":true,"content":"<article>Check out the full version on our YouTube channel now! #GOTOcon #SoftwareEngineering #Legacy #LegacyCode #Effectiveness #Testing #TDD #CodeQuality #CLangguage #Pascal #DDD #QA #ComputerScience #MichaelFeathers #ChristianClausen #Programming #ViralProgrammingShorts #Viral #ViralShorts #TodayInTech #GOTO\n\nFull version available here:\nhttps://youtu.be/P_6eDL1aqtA\n\nMichael Feathers - Author of “Working Effectively with Legacy Code” &amp;  Chief Architect at Globant\n\nRECOMMENDED BOOK\nMichael Feathers • Working Effectively with Legacy Code • https://amzn.to/3ZFQoMU\nChristian Clausen • Five Lines of Code • https://amzn.to/3s2zjyg\nKent Beck • Test Driven Development • https://amzn.to/36kchvd\n\nCHANNEL MEMBERSHIP BONUS\nJoin this channel to get early access to videos &amp; other perks:\nhttps://www.youtube.com/channel/UCs_tLP3AiwYKwdUHpltJPuA/join\n\nLooking for a unique learning experience?\nAttend the next GOTO conference near you! Get your ticket at https://gotopia.tech\nSign up for updates and specials at https://gotopia.tech/newsletter\n\nSUBSCRIBE TO OUR CHANNEL - new videos posted almost daily.\nhttps://www.youtube.com/user/GotoConferences/?sub_confirmation=1</article>","contentLength":1173,"flags":null,"enclosureUrl":"https://www.youtube.com/v/3Z1uq0Vj5Ys?version=3","enclosureMime":"","commentsUrl":null},{"title":"Why Texas Democrat Rep. Nicole Collier was confined in the Capitol overnight #shorts","url":"https://www.youtube.com/shorts/D5DAR_fDm7s","date":1755642460,"author":"Vox","guid":47,"unread":true,"content":"<article>Texas state Rep. Nicole Collier, a Democratic legislator, refused to sign a permission slip to allow around-the-clock escort from the Department of Public Safety. This was the latest event in a series of escalations between Texas Republicans and Democrats. Earlier in August, over 50 Democrats left Texas to stop the redrawing of congressional maps that would benefit the GOP. #texas #democrats #republicans #congress\n\nSubscribe to our channel and turn on notifications (🔔) so you don't miss any videos: http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com.\n\nWatch our full video catalog: http://goo.gl/IZONyE\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom\nCheck out our articles: https://www.vox.com/\nListen to our podcasts: https://www.vox.com/podcasts</article>","contentLength":888,"flags":null,"enclosureUrl":"https://www.youtube.com/v/D5DAR_fDm7s?version=3","enclosureMime":"","commentsUrl":null},{"title":"Ark Royal: The Engineering Genius Behind WW2's Greatest Aircraft Carrier","url":"https://www.youtube.com/watch?v=Mxz1NjfVki4","date":1755637221,"author":"Timeline - World History Documentaries","guid":353,"unread":true,"content":"<article>Dive into the incredible history of HMS Ark Royal, the groundbreaking British aircraft carrier that redefined naval warfare in WW2. From her innovative design and construction challenges to her legendary battles against U-boats, the Luftwaffe, and the mighty Bismarck, discover why Ark Royal became the ship Hitler feared most. This documentary reveals the untold stories of courage and innovation that shaped the future of naval power.\n\nDo you love uncovering the past, exploring historic sites, and venturing to distant lands? Join History Hit today and stream hundreds of exclusive documentaries, with new releases every week. Plus, enjoy ad-free access to our podcast network for even more history every week.\n\nHead over to https://bit.ly/45CPh5u to embark on your journey through history!\n\nThis channel is part of the Little Dot Studios Network. Any queries, please contact owned-enquiries@littledotstudios.com</article>","contentLength":915,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Mxz1NjfVki4?version=3","enclosureMime":"","commentsUrl":null},{"title":"Who likes pineapple on pizza?","url":"https://www.youtube.com/shorts/Cn-8wT5bMCQ","date":1755626225,"author":"StarTalk","guid":369,"unread":true,"content":"<article>Check out our second channel, @StarTalkPlus\n\nGet the NEW StarTalk book, 'To Infinity and Beyond: A Journey of Cosmic Discovery' on Amazon: https://amzn.to/3PL0NFn\n\nSupport us on Patreon: https://www.patreon.com/startalkradio\n\nFOLLOW or SUBSCRIBE to StarTalk:\nTwitter: http://twitter.com/startalkradio\nFacebook: https://www.facebook.com/StarTalk\nInstagram: https://www.instagram.com/startalk\n\nAbout StarTalk: \nScience meets pop culture on StarTalk! Astrophysicist &amp; Hayden Planetarium director Neil deGrasse Tyson, his comic co-hosts, guest celebrities &amp; scientists discuss astronomy, physics, and everything else about life in the universe. Keep Looking Up!\n\n#StarTalk #NeildeGrasseTyson</article>","contentLength":687,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Cn-8wT5bMCQ?version=3","enclosureMime":"","commentsUrl":null},{"title":"Answering Questions About Our Flat Universe, If the Milky Stopped Rotating & More","url":"https://www.youtube.com/watch?v=qmfR2aXHLtg","date":1755626149,"author":"StarTalk","guid":368,"unread":true,"content":"<article>If you crunched the asteroid belt into one object, would it make a planet? Neil deGrasse Tyson and cohost Chuck Nice answer fan questions about the shape of the universe, the origin of matter, the Casimir Force, pizza toppings, and more!\n\nWhat are gluons and gravitons made of? Can a carbon atom orbit a human? Why do aliens always use Earth time in movies? We speculate whether aliens should use Earth time and whether cryopods make sense in relativistic travel.  Could binary star systems support stable planetary orbits?\n\nWe explore binary star systems, pizza topping debates, and the shape of the universe. Does the universe curve so that you would loop back to your origin? Neil breaks down time at the speed of light, the crushing gravity of neutron stars, and whether ships could harvest hydrogen from cavitation. Where does matter come from in the Many-Worlds interpretation? Is the entire universe expanding or just the observable part?\n\nWhat happens if the Milky Way stops spinning? What is the Casimir Force, and why does empty space press metal plates together? If you crunched the asteroid belt into one object, would it even be a planet? We tackle whether time and space could have existed independently before the Big Bang, and close with advice for physics students navigating uncertain science funding.\n\nThanks to our Patrons Keith Edwards James Murphy, River Harlan, Dashing Design Diva, Zach Ross, Federico Varano, Mark Ballard, Andres Franco-Osorio, Pascal, Emmanuel Cooper, Silvester Dimitrov, Ryan Eldridge, Ricky Isbell, David Hall, Angela Johnson, Demetrius Goosbey II, Morris Griffing, Cole Carter, Adam Huber, J B, Don Bailey, Tom Reed, Aaron Palmer, Odin Drengr, Demba Mdoye, Clay Mattson, Jason aka asmrpeople, Sage, Angel Garcia, Richard Swenson, Rich Elkerton, Kirby Sorensen, Mike Kakeeh, Kodi, John Kremer, Dwayne Boychuk, Jordan Burnam, Brittany Johnson, Aidan M, jared higbee, Theo Chambers, Levi Furber, Kelly, Hubert Dąbrowski, Julio Cataño, StellarScout, Margot Lane, Joudi Saadeh, David Foy, Jacob Sopko, Dell Rabinowitz, and Dominic Strong for supporting us this week.\n\nTimestamps: \n00:00 - Introduction: Grab Bag\n01:26 - Energy in Gluons and Gravitons\n04:08 - Can a Carbon Atom Orbit a Human? \n06:03 - Alien Time\n11:30 - The Likelihood of 2001: A Space Odyssey\n13:34 - Pizza Toppings Debate\n15:09 - The Shape of the Universe\n17:30 - Cryopods &amp; The Speed of Light\n20:26 - A Spoonful of Neutron Star\n22:09 - Collecting Hydrogen and Oxygen from Cavitation\n26:55 - Where Does Matter Come from in Parallel Universes? \n28:43 - Whole Universe vs. Observable Universe\n30:57 - If the Milky Way Stopped Rotating\n34:20 - The Casamir Force\n38:42 - The Entire Asteroid Belt Clumped Together\n41:13 - Could Space and Time Have Been Separate?\n43:59 - The State of Science Funding\n\nCheck out our second channel, @StarTalkPlus\n\nGet the NEW StarTalk book, 'To Infinity and Beyond: A Journey of Cosmic Discovery' on Amazon: https://amzn.to/3PL0NFn\n\nSupport us on Patreon: https://www.patreon.com/startalkradio\n\nFOLLOW or SUBSCRIBE to StarTalk:\nTwitter: http://twitter.com/startalkradio\nFacebook: https://www.facebook.com/StarTalk\nInstagram: https://www.instagram.com/startalk\n\nAbout StarTalk: \nScience meets pop culture on StarTalk! Astrophysicist &amp; Hayden Planetarium director Neil deGrasse Tyson, his comic co-hosts, guest celebrities &amp; scientists discuss astronomy, physics, and everything else about life in the universe. Keep Looking Up!\n\n#StarTalk #NeildeGrasseTyson</article>","contentLength":3494,"flags":null,"enclosureUrl":"https://www.youtube.com/v/qmfR2aXHLtg?version=3","enclosureMime":"","commentsUrl":null},{"title":"Portugal fights severe wildfires | DW Documentary","url":"https://www.youtube.com/watch?v=8u23r_y_J-A","date":1755619671,"author":"DW Documentary","guid":11,"unread":true,"content":"<article>Innovative prevention policies are being implemented in Portugal to combat devastating forest fires. After the deadly wildfires that raged in 2017, the country developed measures that now serve as a model for other European nations.\n\nAndré Mota is one of 31,000 volunteer firefighters in Portugal. He was called out on October 15, 2017, when a devastating wildfire reached the town of Santa Comba Dão, where he lives. The experience left a lasting impression on him. Today, he is responsible for civil protection in his home region of Viseu and coordinates prevention measures.\nGrowing up, Verónica Catarino witnessed wildfires firsthand. Today, she heads up a special training program at the national firefighting school, where she teaches students how meteorological and geographical factors influence wildfires.\nMiguel Jerónimo works for the NGO GEOTA, supporting reforestation projects across Portugal. Part of his job involves clearing areas of eucalyptus trees - especially in the southern region of Algarve - and planting native species such as cork oaks, strawberry bushes and chestnut trees, because mixed forests are more resilient against fire.\n\n#documentary  #dwdocumentary #dwdocs #portugal #wildfire \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: ‬\n⮞ DW Documentary (English): https://www.youtube.com/dwdocumentary \n⮞ DW Documental (Spanish): https://www.youtube.com/dwdocumental \n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/dwdocarabia\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/dwdochindi\n⮞ DW Doku (German): https://www.youtube.com/dwdoku\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G</article>","contentLength":2305,"flags":null,"enclosureUrl":"https://www.youtube.com/v/8u23r_y_J-A?version=3","enclosureMime":"","commentsUrl":null},{"title":"Mood lighting, mating, and murder: The scintillating lives of fireflies - Emily A. Geest","url":"https://www.youtube.com/watch?v=XsFP8fpuQR4","date":1755615646,"author":"TED-Ed","guid":133,"unread":true,"content":"<article>Dig into the science of how and why fireflies glow, and how their bioluminescent signals differ between males and females.\n\n--\n\nThe first firefly is thought to have lived over 100 million years ago, illuminating the night with a glowing green light. And today, there are around 2,000 firefly species, found all over the world, from forests and grasslands to marshes and deserts. So, why do these insects glow? Emily A. Geest digs into the bioluminescent signals of fireflies.\n\nLesson by Emily A. Geest, directed by Lou Morton.\n\nSupport Our Non-Profit Mission\n----------------------------------------------\nSupport us on Patreon: http://bit.ly/TEDEdPatreon\nCheck out our merch: http://bit.ly/TEDEDShop\n----------------------------------------------\n\nConnect With Us\n----------------------------------------------\nSign up for our newsletter: http://bit.ly/TEDEdNewsletter\nFollow us on Facebook: http://bit.ly/TEDEdFacebook\nFind us on Twitter: http://bit.ly/TEDEdTwitter\nPeep us on Instagram: http://bit.ly/TEDEdInstagram\n----------------------------------------------\n\nKeep Learning\n----------------------------------------------\nView full lesson: https://ed.ted.com/lessons/what-makes-fireflies-light-up-at-night-emily-a-geest\nDig deeper with additional resources: https://ed.ted.com/lessons/what-makes-fireflies-light-up-at-night-emily-a-geest/digdeeper\n\nAnimator's website: https://louisjmorton.com/Films-Index\n----------------------------------------------\n\nThank you so much to our patrons for your support! Without you this video would not be possible! Sandra Tersluisen, Zhexi Shan, Bárbara Nazaré, Andrea Feliz, Victor E Karhel, Sydney Evans, Latora, Noel Situ, emily lam, Sid, Niccolò Frassetto, Mana, I'm here because of Knowledge Fight Facebook group., Linda Freedman, Edgardo Cuellar, Jaspar Carmichael-Jack, Michael Burton, VIVIANA A GARCIA BESNE, The Vernon's, Olha Bahatiuk, Jesús Bíquez Talayero, Chels Raknrl, Sai Pranavi Jonnalagadda, Stuart Rice, Jing Chen, Vector-Dopamine math, Jasper Song, Giorgio Bugnatelli, Chardon, Eddy Trochez, OnlineBookClub.org, Eric Shear, Leith Salem, Omar Hicham, Adrian Rotaru, Brad Sullivan, Karen Ho, Niklas Frimberger, Hunter Manhart, Nathan Nguyen, Igor Stavchanskiy, James R DeVries, Grace Huo, Diana Huang, Chau Hong Diem, Orlellys Torre, Corheu, Thomas Mee, Maryann H McCrory, and Blas Borde.</article>","contentLength":2352,"flags":null,"enclosureUrl":"https://www.youtube.com/v/XsFP8fpuQR4?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Drug To Master Reality","url":"https://www.youtube.com/watch?v=u4LUix-BU0s","date":1755612001,"author":"Kurzgesagt – In a Nutshell","guid":124,"unread":true,"content":"<article>Go to https://brilliant.org/nutshell/ to dive deeper into these topics and more for free + get 20% off the premium subscription! \nThis video was sponsored by Brilliant. Thanks a lot for the support!\n\n🚨 IT’S HERE! The LIMITED EDITION Alien Alert Pin just dropped on the kurzgesagt shop: https://shop.kgs.link/AcceptMission\nKeep it close. Watch the light. If it turns red, whatever you do, do NOT ignore it. Humanity is counting on you.\n\nSources &amp; further reading:\nhttps://sites.google.com/view/sources-amphetamines/\n\nFrom study sessions to dance floors, amphetamines can feel like a shortcut to superhuman focus and energy. Why do they work so well? What happens to your body once you take them? And what toll does it take on your health?\n\n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman:        https://kgs.link/youtubeDE\nSpanish:        https://kgs.link/youtubeES\nFrench:          https://kgs.link/youtubeFR\nPortuguese:  https://kgs.link/youtubePT\nArabic:           https://kgs.link/youtubeAR\nHindi:             https://kgs.link/youtubeHI\nJapanese:     https://kgs.link/youtubeJA\nKorean:          https://kgs.link/youtubeKO\n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Products designed with ❤️ https://shop.kgs.link\nJoin the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS &amp; SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nInstagram:     https://kgs.link/instagram\nTikTok:           https://kgs.link/tiktok\nReddit:            https://kgs.link/reddit\nDiscord:          https://kgs.link/discord\nTwitter:           https://kgs.link/twitter\nBluesky:          https://kgs.link/bluesky\nFacebook:      https://kgs.link/facebook\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of kurzgesagt soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          https://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook\n\nThe soundtrack of this video:\nSoundCloud: https://bit.ly/4lAMQpY\nBandcamp: https://bit.ly/4fIIwnd\n\nIf you want to help us caption this video, please send subtitles to subtitle@kurzgesagt.org\nYou can find info on what subtitle files work on YouTube here:\nhttps://support.google.com/youtube/answer/2734698?hl=en-GB&amp;ref_topic=7296214\nThank you!\n\n\n🐦🐧🐤 PATREON BIRD ARMY 🐤🐧🐦\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nMany thanks to our wonderful Patreons (from http://kgs.link/patreon) who support us every month and made this video possible:\nfrazer hughes, Joshua, Harri, Rene Wende, Panda, PenguinDutchman710, Leo McGill, Sean Sands, TGMChrist, Chris, Keaton Ramjit, 최정훈, cheng cheng, Berglind Rúnarsdóttir, Iulius Cheesar, Slyreus, Mohamad Nossier, Prakarn Nisarat, Thoa Nong, Bruno Bröcker, Gaël Beck, Lexi Baugher, Freddie, Emmanuel Russell, Sebastian Colantoni</article>","contentLength":3422,"flags":null,"enclosureUrl":"https://www.youtube.com/v/u4LUix-BU0s?version=3","enclosureMime":"","commentsUrl":null},{"title":"Building Bridges: From Developer to Developer Advocate • David Edoh-Bedi & James Beswick","url":"https://www.youtube.com/watch?v=1T3w7UxeNMo","date":1755606116,"author":"GOTO Conferences","guid":148,"unread":true,"content":"<article>This interview was recorded for GOTO Unscripted.\nhttps://gotopia.tech\n\nRead the full transcription of this interview here\n (https://gotopia.tech/articles/368) \nDavid Edoh-Bedi - Developer Relations at Stripe\nJames Beswick - Head of Developer Relations at Stripe\n\nRESOURCES\nDavid\nhttps://x.com/edohbedi_d\nhttps://www.linkedin.com/in/edohbedi\nhttps://edoh-bedi.com\n\nJames\nhttps://bsky.app/profile/jbesw.bsky.social\nhttps://twitter.com/jbesw\nhttps://linkedin.com/in/jamesbeswick\n\nLinks\nhttps://stripe.dev\n\nDESCRIPTION\nJames Beswick (Head of Developer Relations at Stripe) talks with David Edoh-Bedi (Developer Advocate) about his professional journey from growing up in Togo to working at Microsoft and eventually Stripe.\n\nThe conversation explores David's transition from software engineering to developer advocacy, highlighting the importance of empathy, communication skills, and technical knowledge in the role.\nThey discuss the challenges of working with large legacy systems, the complexities of payment processing, and how the software development landscape has evolved from library-focused development to API-centric approaches.\n\nThe interview provides valuable insights for developers considering a career path in developer relations and those integrating complex systems like payment processing into their applications.\n\nRECOMMENDED BOOKS\nSimon Brown • Software Architecture for Developers Vol. 2\n (https://leanpub.com/visualising-software-architecture) David Farley • Modern Software Engineering\n (https://amzn.to/3GI468M) Kim, Humble, Debois, Willis &amp; Forsgren • The DevOps Handbook\n (https://amzn.to/47oAf3l) Simon Wardley • Wardley Maps\n (https://amzn.to/45U8Upr) Simon Wardley • Wardley Mapping, The Knowledge\n (https://amzn.to/3XQEeDu) David Anderson, Marck McCann &amp; Michael O'Reilly • The Value Flywheel Effect\n (https://amzn.to/3VcHxC) Mike Amundsen • Restful Web API Patterns &amp; Practices Cookbook\n (https://amzn.to/3C74fpH) \nCHANNEL MEMBERSHIP BONUS\nJoin this channel to get early access to videos &amp; other perks:\nhttps://www.youtube.com/channel/UCs_tLP3AiwYKwdUHpltJPuA/join\n\nLooking for a unique learning experience?\nAttend the next GOTO conference near you! Get your ticket at https://gotopia.tech\nSign up for updates and specials at https://gotopia.tech/newsletter\n\nSUBSCRIBE TO OUR CHANNEL - new videos posted almost daily.\nhttps://www.youtube.com/user/GotoConferences/?sub_confirmation=1\n\n\nBluesky (https://bsky.app/profile/gotocon.com) \nTwitter (https://twitter.com/GOTOcon) \nInstagram (https://www.instagram.com/goto_con) \nLinkedIn (https://www.linkedin.com/company/goto-) \nFacebook (https://www.facebook.com/GOTOConferences) \n\nCHANNEL MEMBERSHIP BONUS\nJoin this channel to get early access to videos &amp; other perks:\nhttps://www.youtube.com/channel/UCs_tLP3AiwYKwdUHpltJPuA/join\n\nLooking for a unique learning experience?\nAttend the next GOTO conference near you! Get your ticket: gotopia.tech (https://gotopia.tech) \n\nSUBSCRIBE TO OUR YOUTUBE CHANNEL (https://www.youtube.com/user/GotoConferences/?sub_confirmation=1)  - new videos posted daily!</article>","contentLength":3082,"flags":null,"enclosureUrl":"https://www.youtube.com/v/1T3w7UxeNMo?version=3","enclosureMime":"","commentsUrl":null},{"title":"Why Germany Was TERRIFIED Of The Mosquito","url":"https://www.youtube.com/shorts/sXrnaf5TwM8","date":1755601287,"author":"Imperial War Museums","guid":414,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"https://www.youtube.com/v/sXrnaf5TwM8?version=3","enclosureMime":"","commentsUrl":null},{"title":"Can you swim in shade balls?","url":"https://www.youtube.com/shorts/zQ2ZJuUJeyo","date":1755592520,"author":"Veritasium","guid":54,"unread":true,"content":"<article>I bought 10,000 shade balls and tried to swim in them. \n\nThey appear to act like a non-Newtonian fluid: rigid under high shear stress, but they flow like a liquid under low shear.</article>","contentLength":179,"flags":null,"enclosureUrl":"https://www.youtube.com/v/zQ2ZJuUJeyo?version=3","enclosureMime":"","commentsUrl":null},{"title":"Battle Erupts Over Brooklyn’s Industry City | Full Documentary | POV | PBS","url":"https://www.youtube.com/watch?v=vbJqZBE7Lwg","date":1755567044,"author":"PBS","guid":110,"unread":true,"content":"<article>Residents of Sunset Park, Brooklyn face rising rents, a legacy of environmental racism and the loss of the industrial jobs that once sustained their community. When a global developer purchases a massive industrial complex on the waterfront and lays plans for an “innovation district,” a battle erupts over the future of the neighborhood and of New York City itself. \n\nEmergent City | POV\n\nDiscover more about this documentary: https://www.pbs.org/pov/films/emergentcity/\n\nThis program is made possible by viewers like you. Support your local PBS station: https://www.pbs.org/donate\n\nSubscribe to the PBS channel for more clips:  https://www.youtube.com/PBS/\n\nEnjoy full episodes of your favorite PBS shows anytime, anywhere with the free PBS app: https://to.pbs.org/2QbtzhR\n\nFOLLOW PBS:\nFacebook: https://www.facebook.com/pbs/\nX: https://twitter.com/PBS\nInstagram: https://www.instagram.com/PBS\nShop: https://shop.pbs.org/\n\nFOLLOW POV\nFacebook: https://facebook.com/povdocs\nX: https://twitter.com/povdocs\nInstagram: https://instagram.com/povdocs\n\n#documentary #nyc #brooklyn #housing \n\nPOV (@povborders) \nPOV (a cinema term for “point of view”) is television’s longest-running showcase for independent nonfiction films. POV premieres 14-16 of the best, boldest and most innovative programs every year on PBS. Since 1988, POV has presented over 500 films to public television audiences across the country. POV films are known for their intimacy, their unforgettable storytelling and their timeliness, putting a human face on contemporary social issues.\n\nThis film was co-produced with ITVS.</article>","contentLength":1600,"flags":null,"enclosureUrl":"https://www.youtube.com/v/vbJqZBE7Lwg?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Lost Art Of The Sword: The Story Of A Legendary Weapon","url":"https://www.youtube.com/watch?v=cPDoSa3rNkg","date":1755550847,"author":"Timeline - World History Documentaries","guid":352,"unread":true,"content":"<article>The Medieval and Renaissance blade, a profound and beautiful object handcrafted by master artisans of old. An object of great complexity, yet one with a singular use in mind- it is designed to kill. The truth of the sword has been shrouded in antiquity, and the Renaissance martial arts that brought it to being are long forgotten. The ancient practitioners lent us all they knew through their manuscripts. As gunslingers of the Renaissance they were western heroes with swords, and they lived and died by them. Yet today their history remains cloaked under a shadow of legend.\n\nDo you love uncovering the past, exploring historic sites, and venturing to distant lands? Join History Hit today and stream hundreds of exclusive documentaries, with new releases every week. Plus, enjoy ad-free access to our podcast network for even more history every week.\n\nHead over to https://bit.ly/45CPh5u to embark on your journey through history!\n\nThis channel is part of the Little Dot Studios Network. Any queries, please contact owned-enquiries@littledotstudios.com</article>","contentLength":1056,"flags":null,"enclosureUrl":"https://www.youtube.com/v/cPDoSa3rNkg?version=3","enclosureMime":"","commentsUrl":null},{"title":"WW2's Deadliest Weapons: Allies vs Axis","url":"https://www.youtube.com/watch?v=itgAO64EcWU","date":1755543642,"author":"History Hit","guid":622,"unread":true,"content":"<article>Firearms Expert Jonathan Ferguson teams up with historian Luke Tomes to shoot some of the most iconic weapons of the Second World War belonging to the German Wehrmacht, US, British and Soviet Armies. \n\nDiscover the past on History Hit with ad-free exclusive podcasts and documentaries released weekly presented by world renowned historians Dan Snow, Suzannah Lipscomb, Lucy Worsely, Mary Beard and more. Watch, listen and read history wherever you are, whenever you want it. Available on all devices: Apple TV, Amazon Prime Video, Android TV, Samsung Smart TV, Roku, Xbox, Chromecast, and iOs &amp; Android.\n\nIf you'd like to watch more great history content like this head on over to History Hit using the following link https://eu1.hubs.ly/H0gW80Z0 to sign up to our History SVOD service.\n\n#ww2history #ww2weapons #jonathanferguson \n\n00:00:00 GERMAN ARMY WEAPONS\n00:01:58 Luger P08\n00:12:36 Karabiner 98k\n00:24:15 StG 44\n00:34:33 MP 40\n00:47:52 US ARMY WEAPONS\n00:50:11 Colt M1911\n01:00:58 M1903 Springfield Sniper Rifle\n01:07:25 M1 Garand\n01:15:57 M1 Thompson\n01:32:29 SOVIET ARMY WEAPONS\n01:34:52 Tokarev TT-33 Pistol\n01:45:50 Mosin-Nagant Bolt-Action Rifle\n01:59:44 PPSh-41 \n02:12:10 Degtyaryov 'DP' MG\n02:24:14 BRITISH ARMY WEAPONS\n02:26:27 Webley Revolver Mk VI\n02:36:05 Lee-Enfield No. 4 Mk I Bolt-Action Rifle\n02:46:03 Sten Gun Mk II\n02:56:45 Bren LMG</article>","contentLength":1356,"flags":null,"enclosureUrl":"https://www.youtube.com/v/itgAO64EcWU?version=3","enclosureMime":"","commentsUrl":null},{"title":"#GarrickOhlsson: How #Chopin changed the piano forever 🎹💥","url":"https://www.youtube.com/shorts/8iaHzry12_M","date":1755542022,"author":"Ben Laude","guid":563,"unread":true,"content":"<article>Chopin Competition jury member Garrick Ohlsson breaks down the first of 16 ways that Chopin revolutionized modern piano playing.\n\nhttps://patreon.com/BenLaude/\nhttps://instagram.com/benlawdy/\nhttps://benlaude.com/</article>","contentLength":213,"flags":null,"enclosureUrl":"https://www.youtube.com/v/8iaHzry12_M?version=3","enclosureMime":"","commentsUrl":null},{"title":"This Dinosaur Courtship Could Break Bones | Walking with Dinosaurs (1999) | BBC Earth Science","url":"https://www.youtube.com/watch?v=LRP1Ef0WDkw","date":1755529238,"author":"BBC Earth Science","guid":594,"unread":true,"content":"<article>This female Diplodocus is finally large and strong enough to mate. As the season begins, colossal male dinosaurs battle for her attention. And the winner earns the chance to pass on his genes...\n\nBest of Earth Science: http://bit.ly/EarthLabOriginals \nBest of BBC Earth: http://bit.ly/TheBestOfBBCEarthVideos \n\nThis clip is taken from Walking with Dinosaurs (1999).\n\nThis is a channel from BBC Studios who help fund new BBC programmes. Service information and feedback: http://bbcworldwide.com/vod-feedback--contact-details.aspx</article>","contentLength":528,"flags":null,"enclosureUrl":"https://www.youtube.com/v/LRP1Ef0WDkw?version=3","enclosureMime":"","commentsUrl":null},{"title":"So, what exactly is the “New Right?” | The Gray Area","url":"https://www.youtube.com/watch?v=OUaKLRO33-I","date":1755518444,"author":"Vox","guid":46,"unread":true,"content":"<article>A loose movement of radical intellectuals is driving American politics.  They’re called the “New Right,” and they share a basic hostility to American liberal democracy, a real desire to fundamentally overhaul it, and real influence in the White House. But why do they think that? How much influence do they really have? And what would a response to their rising prominence look like?\n\nToday’s guest is Laura Field, a political theorist who’s spent a lot of time in the conservative intellectual world cataloging the wild world of far-right thinking for her book Furious Minds: The Making of the MAGA New Right.\n\nShe speaks with guest host Zack Beauchamp, author of Vox newsletter On The Right, about why ordinary Americans should really, definitely, and absolutely care what a handful of thinkers are putting out on obscure Substacks and YouTube channels.\n\nSubscribe to our channel! http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com.\n\nWatch our full video catalog: http://goo.gl/IZONyE\nFollow Vox on Facebook: http://goo.gl/U2g06o\nOr Twitter: http://goo.gl/XFrZ5H</article>","contentLength":1203,"flags":null,"enclosureUrl":"https://www.youtube.com/v/OUaKLRO33-I?version=3","enclosureMime":"","commentsUrl":null}],"tags":["yt"]}