{"id":"4PaGeZyGUC","title":"Youtube","displayTitle":"Youtube","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":52,"items":[{"title":"Why China’s Ports Empire Has the US Worried","url":"https://www.youtube.com/watch?v=NfiIXoWyOLI","date":1764320446,"author":"Bloomberg Originals","guid":30,"unread":true,"content":"<article>China has invested more than $60 billion building ports around the world, from Tanzania and Australia to Nigeria and Peru, dwarfing similar investments by any other country. Dominating global trade infrastructure through ports, shipping, highways and rail is a central pillar of China’s Belt and Road Initiative. And it’s paying off, with a network of ports providing strategic advantage amid rising global trade tensions.\n\nBut this unparalleled influence is also sparking security concerns. Some 14 ports with Chinese majority ownership have been identified as having potential military uses, a fact that has the rest of the world, and particularly the US, concerned. \n\n00:00 Introduction\n01:29 China’s ports network\n03:38 Ownership model\n04:21 Chancay port\n06:15 Security concerns\n08:00 Trade implications\n\n#China #Ports #XiJinping #Trump #TradeWar #Military\n\n\n--------\nLike this video? Subscribe: http://www.youtube.com/Bloomberg?sub_confirmation=1\n\nGet unlimited access to Bloomberg.com for just $1.99 your first month: https://www.bloomberg.com/subscriptions?in_source=YoutubeOriginals\nBloomberg Originals offers bold takes for curious minds on today’s biggest topics. Hosted by experts covering stories you haven’t seen and viewpoints you haven’t heard, you’ll discover cinematic, data-led shows that investigate the intersection of business and culture. Exploring every angle of climate change, technology, finance, sports and beyond, Bloomberg Originals is business as you’ve never seen it. \n\nSubscribe for business news, but not as you've known it: exclusive interviews, fascinating profiles, data-driven analysis, and the latest in tech innovation from around the world.\n\nVisit our partner channel Bloomberg News for global news and insight in an instant.</article>","contentLength":1781,"flags":null,"enclosureUrl":"https://www.youtube.com/v/NfiIXoWyOLI?version=3","enclosureMime":"","commentsUrl":null},{"title":"Christmas with The Tabernacle Choir feat. Ruthie Ann Miles & Dennis Haysbert | Full Concert | PBS","url":"https://www.youtube.com/watch?v=obZDWSUxwVo","date":1764284476,"author":"PBS","guid":188,"unread":true,"content":"<article>Official site: https://to.pbs.org/48nFZwH | #TabernacleChoirPBS\nExperience the magic of the season with Hope of the Season: Christmas with The Tabernacle Choir. Tony Award–winner Ruthie Ann Miles joins The Tabernacle Choir and Orchestra at Temple Square for an unforgettable celebration of joy and hope. This spectacular holiday special brings together a 500-member cast — including The Tabernacle Choir and Orchestra at Temple Square, Bells at Temple Square, and the Gabriel Trumpet Ensemble — for a breathtaking musical experience.\n\nEnjoy cherished carols and hymns performed by Miles alongside the world-renowned Choir, blending sacred and popular music into a universal message of peace. Adding depth to the program, acclaimed actor Dennis Haysbert narrates the original Christmas story from Luke. He also tells the remarkable true story of African philanthropist Dr. Charles Mulli, a man who rose from poverty in Kenya to become a successful businessman, then gave it all up to rescue thousands of abandoned children. This moving program captures the true spirit of Christmas — a celebration for all ages that will fill your heart with hope and joy.\n\nTo listen to the music, watch behind the scenes videos, view slideshows and more, visit https://to.pbs.org/48nFZwH \n\nHope of the Season: Christmas with the Tabernacle Choir | Full Concert\n\nThis program is made possible by viewers like you. Support your local PBS station: https://www.pbs.org/donate\n\nSubscribe to the PBS channel for more clips:  https://www.youtube.com/PBS/\n\nEnjoy full episodes of your favorite PBS shows anytime, anywhere with the free PBS App: https://to.pbs.org/2QbtzhR\n\nFOLLOW US:\n\nFacebook: https://www.facebook.com/PBS/\nX: https://twitter.com/PBS/\nInstagram: https://www.instagram.com/PBS/\nTikTok: https://www.tiktok.com/@pbs\nThreads: https://www.threads.net/@pbs\n\nCHAPTERS  \n00:00 O Come, O Come, Emmanuel\n03:46 'Twas Midnight in the Stable\n09:20 Hark! The Herald Angels Sing\n11:49 Ruthie Ann Miles and O Little Town of Bethlehem\n18:03 Welcome Christmas Morning!\n20:33 Gamelan\n24:31 Joy To the World\n27:52 Spirit of the Season, from The Polar Express\n35:06 Alleluia, Amen (Air in G)\n37:40 Alleluia, from Psalm 150\n41:16 Hallelujah, from Messiah\n46:00 When You Hear the Pipe and Drum (Patapan)\n49:33 A Season for Shepherds: The True Story of Dr. Charles Mulli\n1:11:57 What Shall We Give?\n1:16:20 The Christmas Story: Luke 2\n1:19:14 Angels from the Realms of Glory\n\n#TabernacleChoir #ChristmasSongs #holidaymusic \n\nHope of the Season: Christmas with The Tabernacle Choir, featuring Ruthie Ann Miles and Dennis Haysbert, was made possible in part by Ronald C. &amp; Kaye Gunnel, Charles &amp; Janet Stoddard, and David B. and Jolynn Davies. The Tabernacle Choir provides artistic expressions of faith from The Church of Jesus Christ of Latter-day Saints. This program is co-presented by GBH Boston and BYUtv.</article>","contentLength":2886,"flags":null,"enclosureUrl":"https://www.youtube.com/v/obZDWSUxwVo?version=3","enclosureMime":"","commentsUrl":null},{"title":"Happy Thanksgiving. Here’s a little reel I made today about Jasper Johns’ “Flag” from 1954-55.","url":"https://www.youtube.com/shorts/y4raWGPCWpk","date":1764281916,"author":"Great Art Explained","guid":620,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"https://www.youtube.com/v/y4raWGPCWpk?version=3","enclosureMime":"","commentsUrl":null},{"title":"Napoleon vs Metternich: The Diplomatic Duel That Decided The Fate Of Europe","url":"https://www.youtube.com/watch?v=w2XyFkR08qw","date":1764280867,"author":"Timeline - World History Documentaries","guid":349,"unread":true,"content":"<article>On June 26, 1813, two powerful men gathered in Dresden to discuss the future of war and peace in Europe. Napoleon Bonaparte met with diplomat Metternich, known as Austria’s “strong man” and the Emperor’s closest confidant. This fateful showdown between two of the most powerful men of this time period marked the beginning of the end for Napoleon. By rejecting Metternich’s proposal, Napoleon missed an opportunity to build the foundations of a future Europe. In this documentary, join us as we are guided by international historians to reconstruct this key chapter of European history and trace the steps of Napoleon's downfall.\n\nYou can now become a History Hit member right here on YouTube! Join for access to a new exclusive documentary every week, and access to over 160+ of our documentaries presented by world renowned historians like Dan Snow, Eleanor Janega, Tristan Hughes, Mary Beard, Matt Lewis and more.\nGet an exclusive release every week by signing up here: https://bit.ly/4pyExyn\n\nThis channel is part of the History Hit Network. Any queries, please contact owned-enquiries@littledotstudios.com</article>","contentLength":1120,"flags":null,"enclosureUrl":"https://www.youtube.com/v/w2XyFkR08qw?version=3","enclosureMime":"","commentsUrl":null},{"title":"How to Tell What’s Real Online","url":"https://www.youtube.com/watch?v=o4I_hOz_MLw","date":1764274405,"author":"StarTalk","guid":365,"unread":true,"content":"<article>In a world overflowing with opinions, clips, conspiracies, and AI-generated answers, how do you know what’s actually true? Neil deGrasse Tyson breaks down his personal checklist for navigating the modern information landscape—yellow flags, red flags, and why evidence-based thinking matters more than ever. From scientific claims and podcasts to clipped videos and industry commentary, Neil shows you how to separate signal from noise and think like a scientist in the digital age.\n\nHow do you tell what’s real? Neil deGrasse Tyson breaks down how to tell which sources are trustworthy and which yellow flags to look out for. In an age of so much information, how do you parse what’s real and what’s misinformation?\n\n00:00 - What to Trust\n00:45 - AI for Research\n01:50 - The Influence of Industry\n04:15 - Telling You How You Should Feel\n5:34 - Content Lifted From Its Source\n7:00 - Further Research\n9:00 - Conspiracy Theories\n10:21 - Is “Mainstream” a Bad Word? \n11:18 - Indicting Demographics\n13:15 - Laws of Physics, Inventions, &amp; Aliens\n\nCheck out our second channel, @StarTalkPlus\n\nGet the NEW StarTalk book, 'To Infinity and Beyond: A Journey of Cosmic Discovery' on Amazon: https://amzn.to/3PL0NFn\n\nSupport us on Patreon: https://www.patreon.com/startalkradio\n\nFOLLOW or SUBSCRIBE to StarTalk:\nTwitter: http://twitter.com/startalkradio\nFacebook: https://www.facebook.com/StarTalk\nInstagram: https://www.instagram.com/startalk\n\nAbout StarTalk: \nScience meets pop culture on StarTalk! Astrophysicist &amp; Hayden Planetarium director Neil deGrasse Tyson, his comic co-hosts, guest celebrities &amp; scientists discuss astronomy, physics, and everything else about life in the universe. Keep Looking Up!\n\n#StarTalk #NeildeGrasseTyson</article>","contentLength":1742,"flags":null,"enclosureUrl":"https://www.youtube.com/v/o4I_hOz_MLw?version=3","enclosureMime":"","commentsUrl":null},{"title":"We Explored the Hidden Medieval City of London | Full Series","url":"https://www.youtube.com/watch?v=jEDSfIp8axc","date":1764270060,"author":"History Hit","guid":653,"unread":true,"content":"<article>If you were asked to picture London during the Middle Ages, you might think of The White Tower, Westminster Abbey or Guildhall - some of the capital’s most famous landmarks. But scratch beneath the surface and you’ll find there are lots more clues to this medieval metropolis.\n\nIn this series London tour guide Katie Wignall seeks out the London of the Middle Ages - a city of narrow streets and soaring spires, almost completely destroyed by the Great Fire of 1666… and the Blitz during the Second World War. But despite the devastation and centuries of development, not all of that city is lost.\n\nYou can now become a History Hit member right here on YouTube! Join for access to a new exclusive documentary every week, and access to over 160+ of our documentaries presented by world-renowned historians like Dan Snow, Eleanor Janega, Tristan Hughes, Mary Beard, Matt Lewis and more.\n\nGet an exclusive release every week by signing up here: https://www.youtube.com/channel/UCZwU2G-KVl-P-O-B35chZOQ/join\n\n#medievalcity #crusades #knightstemplar</article>","contentLength":1050,"flags":null,"enclosureUrl":"https://www.youtube.com/v/jEDSfIp8axc?version=3","enclosureMime":"","commentsUrl":null},{"title":"X Ray Telescope Discovery","url":"https://www.youtube.com/shorts/McaqhzY58XY","date":1764264609,"author":"StarTalk","guid":364,"unread":true,"content":"<article>Check out our second channel, @StarTalkPlus\n\nGet the NEW StarTalk book, 'To Infinity and Beyond: A Journey of Cosmic Discovery' on Amazon: https://amzn.to/3PL0NFn\n\nSupport us on Patreon: https://www.patreon.com/startalkradio\n\nFOLLOW or SUBSCRIBE to StarTalk:\nTwitter: http://twitter.com/startalkradio\nFacebook: https://www.facebook.com/StarTalk\nInstagram: https://www.instagram.com/startalk\n\nAbout StarTalk: \nScience meets pop culture on StarTalk! Astrophysicist &amp; Hayden Planetarium director Neil deGrasse Tyson, his comic co-hosts, guest celebrities &amp; scientists discuss astronomy, physics, and everything else about life in the universe. Keep Looking Up!\n\n#StarTalk #NeildeGrasseTyson</article>","contentLength":687,"flags":null,"enclosureUrl":"https://www.youtube.com/v/McaqhzY58XY?version=3","enclosureMime":"","commentsUrl":null},{"title":"Stone Age or Bone Age","url":"https://www.youtube.com/shorts/RCQ7J5Cv5ns","date":1764263705,"author":"PBS Eons","guid":44,"unread":true,"content":"<article>*****\nPBS Member Stations rely on viewers like you. To support your local station, go to http://to.pbs.org/DonateEons\n*****\n\nEons is a production of Complexly for PBS Digital Studios.\n\nSuper special thanks to the following Patreon patrons for helping make Eons possible:\nPerseus Bluejay, Mary Sammartino , Hugo van den Hoek, Melodie Chen-Glasser, rene fuqua, John Hildebrandt, Irene Wood, Derek Helling, Casey Hague, Susan Freund, CalamityBangs, Brian Clubb, William Sunderland, Kerry Conneely, Mark Talbott-Williams, Nomi Alchin, Nicholas Arger, Josh L, Duane Westhoff, Yu Mei, A.B. Heckert, Lea Nisay, Beth K, Eric Younge, Hillary Ryde-Collins, Elyssa, Albert Folsom, Alex Hackman, Ruth Orr, Steve Hill, Jennifer Courtemanche, Steven Kern, Jason Rostoker, Lianne Lairmore, John H. Austin, Jr., Walter Ray-Dulany, Eric Franklin, John D Elias, Willie, Gizmo, Nquiztor, Annemiek Arkema, Wookiee Henderson, Randall George, SKS PHD, John Celio, Eric Edwards, Karen Farrell, raus , Aaditya Mehta, IAmHere, Collin Dutrow, Beth-Ann Cheney, Travis Bauer, Sarah Grunow-Mau, Deanna Hernandez, Christopher Samuel, AllPizzasArePersonal, lyric1981, Mary Tevington, Kevin Lacson, Dan Caffee, Nick Ryhajlo, Nathan Paskett, Stephanie Schlea, Jeff Graham, Betsy Radley\n\nIf you'd like to support the channel, head over to http://patreon.com/eons and pledge for some cool rewards!\n\nWant to follow Eons elsewhere on the internet?\nFacebook - https://www.facebook.com/eonsshow\nInstagram - https://www.instagram.com/eonsshow/\nBluesky - https://bsky.app/profile/pbseons.bsky.social\n#Eons\n\nReferences:</article>","contentLength":1577,"flags":null,"enclosureUrl":"https://www.youtube.com/v/RCQ7J5Cv5ns?version=3","enclosureMime":"","commentsUrl":null},{"title":"Benedict Arnold and The Battle of Quebec | The American Revolution | PBS","url":"https://www.youtube.com/watch?v=88LPNK6CJgk","date":1764262814,"author":"PBS","guid":187,"unread":true,"content":"<article>Official website: https://to.pbs.org/amrevpbs | #AmericanRevolutionPBS\nBenedict Arnold leads his army north up the Kennebec River as part of the American invasion of Canada. His forces lose much of their provisions and face terrible winter weather, causing many to turn back. Benedict Arnold's force launches an assault on their target, Quebec City, on New Year's Eve that turns disastrous for the Patriots.\n\nThis program is made possible by viewers like you. Support your local PBS station: https://www.pbs.org/donate\n\nSubscribe to the PBS channel for more clips:  https://www.youtube.com/PBS/\n\nEnjoy full episodes of your favorite PBS shows anytime, anywhere with the free PBS app: https://to.pbs.org/2QbtzhR\n\nFOLLOW US:\n\nFacebook: https://www.facebook.com/PBS/\nX: https://twitter.com/PBS/\nInstagram: https://www.instagram.com/PBS/\nTikTok: https://www.tiktok.com/@pbs\nThreads: https://www.threads.net/@pbs\n\n#americanhistory #revolutionarywar #history #ushistory #warhistory \n\nTHE AMERICAN REVOLUTION | A Film By Ken Burns, Sarah Botstein and David Schmidt\nAn expansive look at the virtues and contradictions of the war and the birth of the United States of America, the film follows dozens of figures from a wide variety of backgrounds. Through their individual stories, viewers experience the war through the memories of the men and women who experienced it: the rank-and-file Continental soldiers and American militiamen (some of them teenagers), Patriot political and military leaders, British Army officers, American Loyalists, Native soldiers and civilians, enslaved and free African Americans, German soldiers in the British service, French and Spanish allies, and various civilians living in North America, Loyalist as well as Patriot, including many made refugees by the war.\n\nThe Revolution began a movement for people around the world to imagine new and better futures for themselves, their nations, and for humanity. It declared American independence with promises that we continue to strive for. The American Revolution opened the door to advance civil liberties and human rights, and it asked questions that we are still trying to answer today.\n\nThe film, narrated by Peter Coyote, includes the first-person voices of nearly 200 individual historic figures, read by a cast of actors, including Adam Arkin, Jeremiah Bitsui, Corbin Bleu, Kenneth Branagh, Josh Brolin, Bill Camp, Tantoo Cardinal, Josh Charles, Hugh Dancy, Claire Danes, Jeff Daniels, Keith David, Hope Davis, Marcus Davis-Orrom, Bruce Davison, Leon Dische Becker, Alden Ehrenreich, Craig Ferguson, Morgan Freeman, Christian Friedel, Paul Giamatti, Domhnall Gleeson, Amanda Gorman, Michael Greyeyes, Jonathan Groff, Charlotte Hacke, Tom Hanks, Ethan Hawke, Maya Hawke, Lucas Hedges, Josh Hutcherson, Samuel L. Jackson, Gene Jones, Michael Keaton, Joe Keery, Joel Kinnaman, Tracy Letts, Damian Lewis, Laura Linney, Josh Lucas, Michael Mando, Carolyn McCormick, Lindsay Mendez, Tobias Menzies, Joe Morton, Edward Norton, David Oyelowo, Mandy Patinkin, Wendell Pierce, Jon Proudstar, Matthew Rhys, LaTanya Richardson, Liev Schreiber, Chaske Spencer, Dan Stevens, Meryl Streep, and Yul Vazquez, among others.</article>","contentLength":3182,"flags":null,"enclosureUrl":"https://www.youtube.com/v/88LPNK6CJgk?version=3","enclosureMime":"","commentsUrl":null},{"title":"Amazon: Who pays the price? | DW Documentary","url":"https://www.youtube.com/watch?v=6r3x2t872Pc","date":1764262810,"author":"DW Documentary","guid":15,"unread":true,"content":"<article>Online retailer Amazon has been repeatedly criticized for its business practices. The US company puts pressure on retailers and exerts influence on pricing policies, thus fueling cut-throat competition.\n\nAmazon attracts customers with low prices - but according to a former manager at the company, the reason for this is not what consumers might think. She claims that the company's aim is not to give customers fair deals but to put retailers and manufacturers under enormous pressure.\n\nThis investigative documentary reveals the questionable methods used by the company: suppliers are prevented from selling their products below the Amazon-listed price - whether that be online or in a physical store. Insiders say that this practice not only distorts competition, but also has direct consequences for customers in the form of price rises\n\n#documentary #dwdocumentary #dwdocs #amazon \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: ‬\n⮞ DW Documentary (English): https://www.youtube.com/@DWDocumentary \n⮞ DW Documental (Spanish): https://www.youtube.com/@DWDocumental \n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/@dwdocarabia\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/@dwdochindi\n⮞ DW Dokumenter (Indonesian): https://www.youtube.com/@DWDokumenter\n⮞ DW Doku (German): https://www.youtube.com/@DWDoku\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G</article>","contentLength":2048,"flags":null,"enclosureUrl":"https://www.youtube.com/v/6r3x2t872Pc?version=3","enclosureMime":"","commentsUrl":null},{"title":"Greed or Inflation? Why We Pay More For Less","url":"https://www.youtube.com/watch?v=GPcdighO0eU","date":1764256898,"author":"ColdFusion","guid":412,"unread":true,"content":"<article>Use code COLDFUSION at the link below to get an exclusive 60% off an annual Incogni plan:&nbsp;https://incogni.com/your-unique-code\n\nWatch or listen to ColdFusion on Spotify: https://open.spotify.com/show/1YEwCKoRz8fEDqheXB6UJ1\n\n\nColdFusion Music: \nhttps://www.youtube.com/@ColdFusionmusic\nhttp://burnwater.bandcamp.com   \n\nGet my book: \n\nhttp://bit.ly/NewThinkingbook \n\nColdFusion Socials: \n\nhttps://discord.gg/coldfusion\nhttps://facebook.com/ColdFusionTV \nhttps://twitter.com/ColdFusion_TV \nhttps://instagram.com/coldfusiontv\n\nCreated by: Dagogo Altraide\nProducers: Tawsif Akkas, Dagogo Altraide</article>","contentLength":593,"flags":null,"enclosureUrl":"https://www.youtube.com/v/GPcdighO0eU?version=3","enclosureMime":"","commentsUrl":null},{"title":"I turned my phone into a microscope","url":"https://www.youtube.com/shorts/Bb0uDpvitoE","date":1764255859,"author":"Veritasium","guid":67,"unread":true,"content":"<article>#Sponsored @madebygoogle A single drop of water is all it takes to turn the new Google #Pixel10Pro into a makeshift microscope.\n\nPromotional code offer expires 12/05/2025 at 11:59p.m. PT; while supplies last. Must be redeemed on Google Store only. User must be signed-in to their Google Account and checkout with Google Pay profile, including a valid form of payment. Limit 1 per customer.Available only to US residents, aged 18 years or older, with US shipping addresses. Google Pay profile must be registered in the US and promotional code can only be used in the US.To redeem, visit store.google.com, add the desired item to the cart, then enter promotional code during checkout for an instant discount on your purchase on one of four eligible items: Pixel 10 (unlocked), Pixel 10 Pro (unlocked), Pixel 10 Pro XL (unlocked), Pixel 10 Pro Fold (unlocked). Promotional code is for one-time use only with no residual balance; is not transferable; and is not valid for cash or cash equivalent. May be combined with other offers on Google Store. Void where prohibited. Terms of sale and additional Promotional code terms apply: https://store.google.com/terms/google_store_promo_codes</article>","contentLength":1181,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Bb0uDpvitoE?version=3","enclosureMime":"","commentsUrl":null},{"title":"Will Fungi Infect Us All?","url":"https://www.youtube.com/shorts/omNvSHfIv7s","date":1764255705,"author":"Kurzgesagt – In a Nutshell","guid":242,"unread":true,"content":"<article>Who watched or played The Last of Us? Hopefully, with continuous research, we can make sure those scenarios stay on the screen, far away from the reality. \n\n#kurzgesagt\n#inanutshell #kurzgesagt_inanutshell #learnwithshorts #science #lastofus #fungi \n\nSources &amp; further reading: \nhttps://sites.google.com/view/kgs-tiktok-sources\n\nFollow us for more sciencey content! 🦆\n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman:        https://kgs.link/youtubeDE\nSpanish:        https://kgs.link/youtubeES\nFrench:          https://kgs.link/youtubeFR\nPortuguese:  https://kgs.link/youtubePT\nArabic:           https://kgs.link/youtubeAR\nHindi:             https://kgs.link/youtubeHI\nJapanese:     https://kgs.link/youtubeJA\nKorean:          https://kgs.link/youtubeKO\n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Products designed with ❤ https://shop.kgs.link/shorts\nBecome a Part of kurzgesagt by joining the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS &amp; SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nInstagram:     https://kgs.link/instagram\nTikTok:           https://kgs.link/tiktok\nReddit:            https://kgs.link/reddit\nDiscord:          https://kgs.link/discord\nTwitter:           https://kgs.link/twitter\nBluesky:          https://kgs.link/bluesky\nFacebook:      https://kgs.link/facebook\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          https://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook</article>","contentLength":2159,"flags":null,"enclosureUrl":"https://www.youtube.com/v/omNvSHfIv7s?version=3","enclosureMime":"","commentsUrl":null},{"title":"Why has Ecuador become a “war zone”? | DW Documentary","url":"https://www.youtube.com/shorts/BgI-TWLTkgA","date":1764252019,"author":"DW Documentary","guid":14,"unread":true,"content":"<article>Images of masked gunmen storming a TV station live on air in Ecuador in 2024 shocked the world. But how did this country, once considered one of Latin America’s most peaceful, became a “war zone”? \n\nEcuador has become an attractive logistical hub for local and international cartels – due in part to its location between two of the world's largest cocaine producers, Colombia and Peru. \n\nGrowing demand for cocaine in Europe, one of its main markets, is considered to be fuelling the surge in extreme violence seen in cities like Guayaquil.\n\n#documentary #dwdocumentary #dwdocs #EcuadorCrisis #DrugTrafficking \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: ‬\n⮞ DW Documentary (English): https://www.youtube.com/@DWDocumentary \n⮞ DW Documental (Spanish): https://www.youtube.com/@DWDocumental \n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/@dwdocarabia\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/@dwdochindi\n⮞ DW Dokumenter (Indonesian): https://www.youtube.com/@DWDokumenter\n⮞ DW Doku (German): https://www.youtube.com/@dwdoku\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G</article>","contentLength":1780,"flags":null,"enclosureUrl":"https://www.youtube.com/v/BgI-TWLTkgA?version=3","enclosureMime":"","commentsUrl":null},{"title":"Modern Full-Stack Web Development with ASP.NET Core • Alexandre Malavasi & Albert Tanure • GOTO 2025","url":"https://www.youtube.com/watch?v=B0hGGRkEotk","date":1764248432,"author":"GOTO Conferences","guid":265,"unread":true,"content":"<article>This interview was recorded for the GOTO Book Club. #GOTOcon #GOTObookclub\nhttp://gotopia.tech/bookclub\n\nCheck out more here:\nhttps://gotopia.tech/episodes/413\n\nAlexandre Malavasi - CTO at Marelo &amp; Author of “Modern Full-Stack Web Development with ASP.NET Core” @alexandremalavasi-software101 \nAlbert S. Tanure - Cross Solutions Architec at Microsoft &amp; Author of \"ASP.NET Core 9 Essentials\" @CodeFC \n\nRESOURCES\nAlexandre\nhttps://x.com/alemalavasi\nhttps://github.com/alexandremalavasi\nhttps://www.linkedin.com/in/alexandremalavasi\n\nAlbert\nhttps://x.com/alberttanure\nhttps://github.com/tanure\nhttps://www.linkedin.com/in/albert-tanure\nhttps://www.codefc.io/en\n\nLinks\nhttps://youtu.be/GqJfsDJuwCI\nhttps://youtu.be/O91hJJ5KMLs\nhttps://youtu.be/Mu9zKpGhX1Y\nhttps://youtu.be/dK4Yb6-LxAk\nhttps://youtu.be/n8ERFbkt_h8\nhttps://youtu.be/BKaxtBSgueQ\nhttps://youtu.be/PzEox3szeRc\nhttps://youtu.be/HKS5sKsIkkc\nhttps://youtu.be/VMmkHZ4wShA\nhttps://youtu.be/7NAyn1DC420\nhttps://youtu.be/Saaz6D1azlU\nhttps://youtu.be/Zyz_2lELqG8\nhttps://youtu.be/ESOaDiv3lXA\nhttps://youtu.be/WKx9E3DRqXc\n\nDESCRIPTION\nMicrosoft Cloud Solution Architect Albert Tanure interviews Microsoft MVP Alexandre Malavasi about his fourth book, \"Modern Full-Stack Web Development with ASP.NET Core\". The discussion explores the challenges of writing comprehensive technical books, the importance of foundational knowledge in full stack development, and how to integrate ASP.NET Core with modern JavaScript frameworks like React, Angular, and Vue.js.\n\nAlexandre emphasizes that successful architecture decisions depend primarily on team expertise and the ability to facilitate change, rather than following trends.\nThe conversation also highlights the critical importance of looking beyond just coding - encompassing project planning, DevOps practices, monitoring, and continuous optimization - to truly bring value to customers and become well-rounded software engineers.\n\nTIMECODES\n00:00 Intro\n01:33 Covering the full-stack\n07:22 Book structure &amp; foundation concepts\n13:13 Planning &amp; structuring full-stack projects\n21:09 Design patterns &amp; avoiding over-engineering\n24:35 DevOps mindset &amp; beyond development\n31:03 Outro\n\nRECOMMENDED BOOKS\nAlexandre Malavasi • Modern Full-Stack Web Development with ASP.NET Core • https://amzn.to/4pvEXnY\nAlexandre Malavasi • Implementing Design Patterns in C# 11 and .NET 7 • https://amzn.to/49Capwn\nAlexandre Malavasi • Enterprise Applications with C# and .NET • https://amzn.to/4iiVidk\nAlexandre Malavasi • Implementing Design Patterns in C# and .NET 5 • https://amzn.to/3JU5UD2\nAlbert Tanure • ASP.NET Core 9 Essentials • https://amzn.to/43bH73t\n\nhttps://bsky.app/profile/gotocon.com\nhttps://twitter.com/GOTOcon\nhttps://www.linkedin.com/company/goto-\nhttps://www.instagram.com/goto_con\nhttps://www.facebook.com/GOTOConferences\n#dotNET #ASPdotNET #ASPdotNETCore #ASPdotNET9 #ReactJS #VueJS #AngularJS #Programming #SoftwareArchitecture #DevOps #FullStack #DesignPatterns #Observability #ModernSWDevelopment #SoftwareEngineering #Programming #TodayInTech #AlexandreMalavasi #AlbertTanure #BookClub\n\nCHANNEL MEMBERSHIP BONUS\nJoin this channel to get early access to videos &amp; other perks:\nhttps://www.youtube.com/channel/UCs_tLP3AiwYKwdUHpltJPuA/join\n\nLooking for a unique learning experience?\nAttend the next GOTO conference near you! Get your ticket at https://gotopia.tech\nSign up for updates and specials at https://gotopia.tech/newsletter\n\nSUBSCRIBE TO OUR CHANNEL - new videos posted almost daily.\nhttps://www.youtube.com/user/GotoConferences/?sub_confirmation=1</article>","contentLength":3581,"flags":null,"enclosureUrl":"https://www.youtube.com/v/B0hGGRkEotk?version=3","enclosureMime":"","commentsUrl":null},{"title":"England on the Brink of Civil War, 1642 (RA Winter Lecture)","url":"https://www.youtube.com/watch?v=4mDyRaCXqgs","date":1764214709,"author":"Royal Armouries","guid":220,"unread":true,"content":"<article>The year is 1642 and England is on the brink of Civil War. Discover the political crisis that plunged the country into conflict.\n\nSpeaker: Dr Jonathan Healey, Associate Professor in Social History, University of Oxford.\n\nSubscribe to our channel for more videos about arms and armour  \n\nHelp us bring history to life by supporting us here: https://royalarmouries.org/support-us/donations/\n\nSign up to our museum membership scheme here: https://royalarmouries.org/support-us/membership/ \n\n⚔Website: https://royalarmouries.org/home\n⚔Blog: https://royalarmouries.org/stories/\n⚔Facebook: https://www.facebook.com/RoyalArmouriesMuseum/\n⚔Twitter: https://twitter.com/Royal_Armouries\n⚔ Instagram: http://instagram.com/royalarmouriesmuseum\n\nWe are the Royal Armouries, the United Kingdom's national collection of arms and armour. Discover what goes on behind the scenes and watch our collection come to life. See combat demonstrations, experience jousting and meet our experts. \n\nHave a question about arms and armour? Feel free to leave us a comment and we'll do our best to answer it.</article>","contentLength":1088,"flags":null,"enclosureUrl":"https://www.youtube.com/v/4mDyRaCXqgs?version=3","enclosureMime":"","commentsUrl":null},{"title":"Will the Voting Rights Act survive the Supreme Court’s ruling in Louisiana v. Callais? #shorts","url":"https://www.youtube.com/shorts/LgJJb4ZBKeo","date":1764198420,"author":"Vox","guid":59,"unread":true,"content":"<article>The Voting Rights Act of 1965 transformed America, marking the end of the Jim Crow era and effectively banning racial discrimination in elections.\n\nThis video explains how, 60 years later, a redistricting case out of Louisiana called Louisiana v. Callais has the potential to upend the Voting Rights Act and political representation for a generation.\n\nJoin our community on Patreon to watch the full episode. For every annual membership purchased between now and the end of the year, we’ll gift a free annual membership to someone who can’t afford one. #voting #scotus #elections #votingrightsact #politics #vox #patreon\n\nSubscribe to our channel and turn on notifications (🔔) so you don't miss any videos: http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com.\n\nWatch our full video catalog: http://goo.gl/IZONyE\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom\nCheck out our articles: https://www.vox.com/\nListen to our podcasts: https://www.vox.com/podcasts</article>","contentLength":1095,"flags":null,"enclosureUrl":"https://www.youtube.com/v/LgJJb4ZBKeo?version=3","enclosureMime":"","commentsUrl":null},{"title":"Hypertension is a silent killer. Here’s how to look out for it. #shorts","url":"https://www.youtube.com/shorts/jHaaNwxTnNM","date":1764198065,"author":"Vox","guid":58,"unread":true,"content":"<article>Mashed potatoes, turkey, mac and cheese… While these are all delicious Thanksgiving Day foods, they can also be instigators of one of the most prevalent silent killers in the US: hypertension. So, as you get ready to sit down and celebrate with your loved ones, check if you’re at risk and use these tips from Vox senior correspondent Dylan Scott for keeping your blood pressure down. #hypertension #bloodpressure #thanksgiving #health #highbloodpressure\n\nSubscribe to our channel and turn on notifications (🔔) so you don't miss any videos: http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com.\n\nWatch our full video catalog: http://goo.gl/IZONyE\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom\nCheck out our articles: https://www.vox.com/\nListen to our podcasts: https://www.vox.com/podcasts</article>","contentLength":929,"flags":null,"enclosureUrl":"https://www.youtube.com/v/jHaaNwxTnNM?version=3","enclosureMime":"","commentsUrl":null},{"title":"What’s Next for The World? | An Optimist’s Guide to the Planet","url":"https://www.youtube.com/watch?v=T2RlKDNUkX0","date":1764198042,"author":"Bloomberg Originals","guid":29,"unread":true,"content":"<article>When solutions prove elusive close to home, humanity’s instinct has always been to venture into the unknown. As season two of An Optimist’s Guide to the Planet draws to a close, Nikolaj Coster-Waldau looks to the future—traveling from India to Finland and Peru to uncover how people with imagination are forging a new path forward for the planet. From communities in India’s Eastern Ghats overcoming fear of snakes to restore fragile ecosystems, to Helsinki’s bold reimagining of nuclear energy and the reforestation efforts in Peru’s Cusco region bringing water back to the Andes—this episode reveals how challenging assumptions and redefining humanity's relationship with nature can lead to a cleaner, more sustainable future.\n\n\n--------\nLike this video? Subscribe: http://www.youtube.com/Bloomberg?sub_confirmation=1\n\nGet unlimited access to Bloomberg.com for just $1.99 your first month: https://www.bloomberg.com/subscriptions?in_source=YoutubeOriginals\nBloomberg Originals offers bold takes for curious minds on today’s biggest topics. Hosted by experts covering stories you haven’t seen and viewpoints you haven’t heard, you’ll discover cinematic, data-led shows that investigate the intersection of business and culture. Exploring every angle of climate change, technology, finance, sports and beyond, Bloomberg Originals is business as you’ve never seen it. \n\nSubscribe for business news, but not as you've known it: exclusive interviews, fascinating profiles, data-driven analysis, and the latest in tech innovation from around the world.\n\nVisit our partner channel Bloomberg News for global news and insight in an instant.</article>","contentLength":1657,"flags":null,"enclosureUrl":"https://www.youtube.com/v/T2RlKDNUkX0?version=3","enclosureMime":"","commentsUrl":null},{"title":"Remains of Young Girl Reveal Jamestown Colony Mystery | Full Episode | Secrets of the Dead | PBS","url":"https://www.youtube.com/watch?v=9gN8z4MNd9M","date":1764198011,"author":"PBS","guid":186,"unread":true,"content":"<article>Watch more: https://to.pbs.org/3mHxfbj | #SecretsDeadPBS\nArchaeologists have been excavating in Jamestown, Virginia for more than 20 years. In April 2012, a team of Historic Jamestowne archeologists discovered something surprising. In the trash layer of a cellar, among the butchered animal bones and household trash discarded by the Jamestown colonists, they found the mutilated skull and severed leg of a 14-year-old English girl dating back to 1609.\n\nJamestown, Virginia is the site of the first permanent English colony the Americas settled in 1607 and the home of the archaeological site “Historic Jamestowne” today. It has long been speculated that the harsh conditions faced by the colonists during the winter of 1609, often referred to as the “starving time,” might have made them desperate enough to participate in the unthinkable.\n\nJamestown's Dark Winter | Secrets of the Dead\n\nThis program is made possible by viewers like you. Support your local PBS station: https://www.pbs.org/donate\n\nSubscribe to the PBS channel for more clips:  https://www.youtube.com/PBS/\n\nEnjoy full episodes of your favorite PBS shows anytime, anywhere with the free PBS app: https://to.pbs.org/2QbtzhR\n\nFOLLOW US:\n\nFacebook: https://www.facebook.com/PBS/\nX: https://twitter.com/PBS/\nInstagram: https://www.instagram.com/PBS/\nTikTok: https://www.tiktok.com/@pbs\nThreads: https://www.threads.net/@pbs\n\nSecrets of the Dead on YouTube: https://www.youtube.com/@secretsofthedead\n\n#SecretsoftheDead #jamestown #history #archaeology \n\nSecrets of the Dead\nPart detective story, part true-life drama, @secretsofthedead unearths evidence from around the world, challenging prevailing ideas and throwing fresh light on unexplained events.</article>","contentLength":1724,"flags":null,"enclosureUrl":"https://www.youtube.com/v/9gN8z4MNd9M?version=3","enclosureMime":"","commentsUrl":null},{"title":"Operation Gunnerside: The Allied Mission To Sabotage The Nazi Nuclear Program","url":"https://www.youtube.com/watch?v=2jPYoqlbLpc","date":1764194403,"author":"Timeline - World History Documentaries","guid":348,"unread":true,"content":"<article>Uncover the thrilling true story of \"The Heavy Water War\" during WW2, a desperate Allied effort to prevent Nazi Germany from developing an atomic bomb. This documentary details the critical role of heavy water in nuclear fission and the audacious covert operations, including the daring \"Operation Gunnerside,\" undertaken by Norwegian commandos to sabotage the Vemork plant in occupied Norway. Witness the high-stakes race for the ultimate weapon and the unsung heroes who risked everything to stop Hitler's nuclear ambitions.\n\nYou can now become a History Hit member right here on YouTube! Join for access to a new exclusive documentary every week, and access to over 160+ of our documentaries presented by world renowned historians like Dan Snow, Eleanor Janega, Tristan Hughes, Mary Beard, Matt Lewis and more.\nGet an exclusive release every week by signing up here: https://bit.ly/4pyExyn\n\nThis channel is part of the History Hit Network. Any queries, please contact owned-enquiries@littledotstudios.com</article>","contentLength":1007,"flags":null,"enclosureUrl":"https://www.youtube.com/v/2jPYoqlbLpc?version=3","enclosureMime":"","commentsUrl":null},{"title":"This graph will change how you see the world","url":"https://www.youtube.com/watch?v=HBluLfX2F_k","date":1764193500,"author":"Veritasium","guid":66,"unread":true,"content":"<article>The world is not Normal. Sponsored by NordVPN. 🌏 Get exclusive NordVPN deal here ➵  https://NordVPN.com/veritasium It’s risk free with Nord’s 30 day money-back guarantee!✌\n\nGet your exclusive edition of Veritasium’s first tabletop game - join 6,000+ backers - https://ve42.co/pld\n\nTo play around with the simulations in the video, you can follow these links:\nSandpiles - https://www.veritasium.com/simulation3 \nIsing model (magnetism) - https://www.veritasium.com/simulation4\nForest fires - https://www.veritasium.com/simulation5  \n\n▀▀▀\nA huge thanks to Steven Strogatz, Mark Buchanan and Mark Newman for their time and expertise.\n\n▀▀▀\nCHAPTERS: \n0:00 What is a power law?\n4:31 Expected Values\n8:49 The St. Petersburg Paradox\n11:37 Outliers Dominate Averages\n15:23 Fractals and Power Laws \n19:28 Self-Organized Criticality\n24:08 Why do we light controlled forest fires?\n26:40 How We Can Predict Earthquakes\n32:11 Critical Systems and Universality \n36:31 How Some Businesses Are Built On Power Laws \n39:30 What game are you playing? Normal or power?\n\n▀▀▀\nReferences: https://ve42.co/PowerLawsRefs\n\n▀▀▀\nSpecial thanks to our Patreon supporters:\n\nAdam Foreman, Albert Wenger, Alex Porter, Alexander Tamas, Anton Ragin, Anupam Banerjee, armedtoe, Bertrand Serlet, Blake Byers, Bruce, Dave Kircher, David Johnston, David Tseng, Evgeny Skvortsov, Garrett Mueller, Gnare, gpoly, Hayden Christensen, Ibby Hadeed, Jeromy Johnson, Jon Jamison, Juan Benet, KeyWestr, Kyi, Lee Redden, Marinus Kuivenhoven, Matthias Wrobel, Meekay, meg noah, Michael Bush, Michael Krugman, Orlando Bassotto, Paul Peijzel, Richard Sundvall, Robert Oliveira, Sam Lutfi, Tj Steyn, Ubiquity Ventures &amp; wolfee\n\n▀▀▀\nWriters - James Moore, Casper Mebius &amp; Derek Muller\nProducer &amp; Director - James Moore\nPresenters - Derek Muller &amp; Casper Mebius\nEditors - Jack Saxon &amp; Peter Nelson\nAnimators -  Fabio Albertelli, Emma Wright, Saif Javed &amp; Andrew Neet\nAdditional Editor - James Stuart\nResearchers - Aakash Singh Bagga &amp; Callum Cuttle\nSimulations - Aakash Singh Bagga\nThumbnail Designers - Abdallah Rabah, Ren Hurley &amp; Ben Powell\nProduction Team -  Josh Pitt, Matthew Cavanagh, Anna Milkovic &amp; Katy Southwood \nExecutive Producers - Derek Muller &amp; Casper Mebius\n\n\nAdditional video/photos supplied by Getty Images, Storyblocks\nMusic from Epidemic Sound</article>","contentLength":2353,"flags":null,"enclosureUrl":"https://www.youtube.com/v/HBluLfX2F_k?version=3","enclosureMime":"","commentsUrl":null},{"title":"Baltimore’s Secret Language","url":"https://www.youtube.com/shorts/QrBZ87okKYM","date":1764193300,"author":"Channel 5 with Andrew Callaghan","guid":452,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"https://www.youtube.com/v/QrBZ87okKYM?version=3","enclosureMime":"","commentsUrl":null},{"title":"Hope","url":"https://www.youtube.com/shorts/7mQLZiMX1sM","date":1764189679,"author":"Horses","guid":113,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"https://www.youtube.com/v/7mQLZiMX1sM?version=3","enclosureMime":"","commentsUrl":null},{"title":"Reese Witherspoon on Picking the Perfect Part","url":"https://www.youtube.com/shorts/8MORX-I6wuc","date":1764187720,"author":"Bloomberg Originals","guid":28,"unread":true,"content":"<article>Emily Chang spends a day with Reese Witherspoon – they talk about power, business and why playing Elle Woods was more radical than anyone realized.\n\n--------\nLike this video? Subscribe: http://www.youtube.com/Bloomberg?sub_confirmation=1\n\nGet unlimited access to Bloomberg.com for just $1.99 your first month: https://www.bloomberg.com/subscriptions?in_source=YoutubeOriginals\nBloomberg Originals offers bold takes for curious minds on today’s biggest topics. Hosted by experts covering stories you haven’t seen and viewpoints you haven’t heard, you’ll discover cinematic, data-led shows that investigate the intersection of business and culture. Exploring every angle of climate change, technology, finance, sports and beyond, Bloomberg Originals is business as you’ve never seen it. \n\nSubscribe for business news, but not as you've known it: exclusive interviews, fascinating profiles, data-driven analysis, and the latest in tech innovation from around the world.\n\nVisit our partner channel Bloomberg News for global news and insight in an instant.</article>","contentLength":1063,"flags":null,"enclosureUrl":"https://www.youtube.com/v/8MORX-I6wuc?version=3","enclosureMime":"","commentsUrl":null},{"title":"Is The Human Brain Smart Enough To Understand Universe?","url":"https://www.youtube.com/shorts/rLANht463PI","date":1764183659,"author":"StarTalk","guid":363,"unread":true,"content":"<article>Check out our second channel, @StarTalkPlus\n\nGet the NEW StarTalk book, 'To Infinity and Beyond: A Journey of Cosmic Discovery' on Amazon: https://amzn.to/3PL0NFn\n\nSupport us on Patreon: https://www.patreon.com/startalkradio\n\nFOLLOW or SUBSCRIBE to StarTalk:\nTwitter: http://twitter.com/startalkradio\nFacebook: https://www.facebook.com/StarTalk\nInstagram: https://www.instagram.com/startalk\n\nAbout StarTalk: \nScience meets pop culture on StarTalk! Astrophysicist &amp; Hayden Planetarium director Neil deGrasse Tyson, his comic co-hosts, guest celebrities &amp; scientists discuss astronomy, physics, and everything else about life in the universe. Keep Looking Up!\n\n#StarTalk #NeildeGrasseTyson</article>","contentLength":687,"flags":null,"enclosureUrl":"https://www.youtube.com/v/rLANht463PI?version=3","enclosureMime":"","commentsUrl":null},{"title":"We Finally Know Why Betelgeuse Behaves So Strangely","url":"https://www.youtube.com/watch?v=SbCHSYJfLu8","date":1764177369,"author":"Astrum","guid":457,"unread":true,"content":"<article>Everything you need to know about Betelgeuse, plus a surprising new discovery. \nStart uncovering your story with MyHeritage, and don't forget to use my link for a 14-day free trial: https://bit.ly/Astrum_MH \n\n▀▀▀▀▀▀\n\nThis Supercut dives into the enigma of Betelgeuse, our red giant neighbour star on the brink of supernova. But will this spectacular death happen in our lifetime? And should we be worried here on Earth? Beyond the impending explosion, we uncover the exciting new discovery of Betelgeuse’s companion, affectionately dubbed \"Betelbuddy.\" See how this partner star could be the key to understanding Betelgeuse’s strange, erratic activity.\n\nTo those returning and new to the channel: This video is a supercut of our previous videos about Betelgeuse, along with new and updated science content. We’ve edited this into a new seamless video, remastered in 4K resolution, and re-recorded the older voiceover to match the quality of the recent episodes. \n\n▀▀▀▀▀▀\n\n0:00 What You Need to Know About Betelgeuse\n2:54 Will Betelgeuse Explode?\n7:57 How Supernovae Happen\n12:44 Could It Destroy Earth?\n17:15 How Long Left?\n20:47 Betelgeuse’s Buddy\n24:39 The Problem With Betelgeuse’s Rotation\n30:01 Cannibal Stars\n\n▀▀▀▀▀▀\n\nWIN A 5-DAY VIP SPACE COAST TRIP! 🚀\nCheck out this sweepstakes from our friends at ScienceAlert.com. They are giving one reader and their guest a 5-day VIP space adventure vacation in Florida. You’ll participate in Astronaut Training at Kennedy Space Center, dine at EPCOT’s Space 2020 restaurant and experience a bioluminescent night kayaking tour.\nAll you need to do to enter is subscribe to their free, fact-checked science newsletter - Spark. No purchase necessary. Open to US residents only.\n➡️ ENTER HERE: https://www.sciencealert.com/spark-into-space-comp?utm_source=astrum\n\n▀▀▀▀▀▀\n\nTo stay on top of space news, sign up to the Astrum newsletter: https://astrumspace.kit.com \n \nAstrum Displate Posters: https://astrumspace.info/Displates \nAstrum Infographic Artwork: https://electrify.art/collections/astrum  \nAstrum Merch: https://astrum-shop.fourthwall.com/ \n\nJoin us on the Astrum discord: https://discord.gg/TKw8Hpvtv8 \n\nA huge thanks to our Patreons who help make these videos possible. Sign-up here to support the channel: https://bit.ly/4aiJZNF \n\n▀▀▀▀▀▀\n\nAstrum Podcast on Spotify: https://open.spotify.com/show/6jPRrbq3o3dpvBb173ZTKi?si=a90d3efe3b704c83 \n\nAstrum Earth: https://youtube.com/@AstrumEarth \nAstrum Extra: https://www.youtube.com/@astrumextra \n\nAstrum Spanish: https://www.youtube.com/@astrumespanol \nAstrum Portuguese: https://www.youtube.com/channel/UChn_-OwvV63mr1yeUGvH-BQ \n\n▀▀▀▀▀▀\n\nReferences:\nBetelgeuse: A Review”, via academic.oup.com https://astrumspace.info/betelgeusereview \n“What Is Betelgeuse? Inside the Strange, Volatile Star”, via nasa.gov https://astrumspace.info/insidebetelgeuse \n“Supernovae: Types I and II”, via cfa.harvard.edu https://astrumspace.info/supernovatypes \n“The Great Dimming of Betelgeuse”, via eso.org https://astrumspace.info/greatdimming \n“Betelgeuse Companion Discovered”, via noirlab.edu https://astrumspace.info/betelbuddy \n“Direct Imaging of the ‘Betel-Buddy’: A Companion to Betelgeuse”, via iop.org https://astrumspace.info/betelbuddyimage \n“Hubble Sees Red Supergiant Star Betelgeuse Slowly Recovering After Blowing Its Top”, via nasa.gov https://astrumspace.info/betelgeuserecovery \n“Is Betelgeuse Really Rotating?”, via iop.org https://astrumspace.info/betelgeuserotation \n“Convective Outbursts, Mode Switching, and Mass Ejection in Betelgeuse”, via iop.org https://astrumspace.info/betelgeuseoutbursts \n“Betelgeuse Pulsation and Impending Explosion”, via arxiv.org https://astrumspace.info/betelgeusepulsation\n\n▀▀▀▀▀▀\n\nCredits:\nWriter: Jon McColgan\nVideo Editor: Nathália Huzian\nResearcher: Shourya Shrivastava\nScript Editor: Damaris McColgan\nThumbnail Designer: Peter Sheppard\nPublishing Lead: Georgina Brenner\nProduction Manager: Raquel Taylor\nEdit Producer: Poppy Pinnock\nHead of Astrum: Jess Jordan\nCreator of Astrum: Alex McColgan\n\nWith special thanks to:\nNASA/ESO/ESA\n\n#Astrum #Space #Betelgeuse</article>","contentLength":4247,"flags":null,"enclosureUrl":"https://www.youtube.com/v/SbCHSYJfLu8?version=3","enclosureMime":"","commentsUrl":null},{"title":"Hair: Why it's important and what it reveals about us | DW Documentary","url":"https://www.youtube.com/watch?v=f1rNyA1-sg4","date":1764176485,"author":"DW Documentary","guid":13,"unread":true,"content":"<article>Our hair doesn't just provide protection from sun and cold, it also says a great deal about us. In a society that's predominantly focused on outward appearance, hair wields huge social capital. It can either elicit admiration — or turn into a problem.\n\nA full, glossy head of hair is synonymous with beauty, youth and vitality. But what happens when that hair loses its shine? As we age, our hair gets thinner, alters its structure or falls out. Can anything be done to address these changes? How do we learn to be content with the hair we have — or with no hair whatsoever? Are hair transplants worth the bother?\n\nThis documentary observes people for whom hair is of particular importance: an actor who is happy to be bald, a man who decides to have a hair transplant and a hair artist whose hair can do incredible things, such as supporting her entire body weight. This is due to the structure of hair: each individual strand consists of numerous protein spirals linked together by chemical bonds. That makes it incredibly elastic and highly stable: a single hair can hold up to 100 grams without breaking.\n\n#documentary #dwdocumentary #dwdocs #hair \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: ‬\n⮞ DW Documentary (English): https://www.youtube.com/@DWDocumentary \n⮞ DW Documental (Spanish): https://www.youtube.com/@DWDocumental \n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/@dwdocarabia\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/@dwdochindi\n⮞ DW Dokumenter (Indonesian): https://www.youtube.com/@DWDokumenter\n⮞ DW Doku (German): https://www.youtube.com/@DWDoku\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G</article>","contentLength":2318,"flags":null,"enclosureUrl":"https://www.youtube.com/v/f1rNyA1-sg4?version=3","enclosureMime":"","commentsUrl":null},{"title":"What does Ken Burns leave on the cutting floor? 🎬 #AmericanRevolutionPBS","url":"https://www.youtube.com/shorts/02LwbVY8cUQ","date":1764176401,"author":"PBS","guid":185,"unread":true,"content":"<article>Ken Burns discusses the choices that go into making his documentaries. A documentary can't always include \"everything that happened\", otherwise it would be a million hours long, so what material doesn't make the final cut? \n\nMade possible by viewers like you. Support your local PBS station: https://www.pbs.org/donate\n\nEnjoy full episodes of your favorite PBS shows anytime, anywhere with the free PBS app!\n\nThe American Revolution | A Film by Ken Burns, Sarah Botstein and David Schmidt\nThirteen American colonies unite in rebellion, win an eight-year war to secure their independence, and establish a new form of government that would inspire democratic movements at home and around the globe. What begins as a political clash between colonists and the British government grows into a bloody struggle that will engage more than two dozen nations and forever change the world.\n\n#AmericanRevolutionPBS #documentary #PBS #history</article>","contentLength":929,"flags":null,"enclosureUrl":"https://www.youtube.com/v/02LwbVY8cUQ?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Albanian AK of the Kosovo Liberation Army (UÇK) with firearms expert Jonathan Ferguson ft. IWM","url":"https://www.youtube.com/watch?v=yHtx4obL8I0","date":1764173730,"author":"Royal Armouries","guid":219,"unread":true,"content":"<article>This week we’re looking at an Albanian Kalashnikov (that Ian recently looked at...) with a very personal mark carved into it: “UCK” (UÇK), standing for the Kosovo Liberation Army.\n\nWe're also joined by our friends at IWM for this episode and we'd like to thank them for providing footage and collaborating with us.\n\nYou can find their channel here: @ImperialWarMuseums \n\n0:00 Intro\n1:11 ASh-78\n2:40 “UCK” on the Handguard &amp; The KLA\n3:49 Kosovo War, NATO Intervention &amp; How the Rifle Was Captured\n5:04 Imperial War Museum Drawing &amp; Albanian-Supplied Rifles\n7:00 IWM Segment\n8:52 From Rough AK to Historical Object &amp; Ongoing Legacy\n9:54 Outro\n\nSubscribe to our channel for more videos about arms and armour  \n\nHelp us bring history to life by supporting us here: https://royalarmouries.org/support-us/donations/\n\nSign up to our museum membership scheme here: https://royalarmouries.org/support-us/membership/ \n\n⚔Website: https://royalarmouries.org/home\n⚔Blog: https://royalarmouries.org/stories/\n⚔Facebook: https://www.facebook.com/RoyalArmouriesMuseum/\n⚔Twitter: https://twitter.com/Royal_Armouries\n⚔ Instagram: http://instagram.com/royalarmouriesmuseum\n\nWe are the Royal Armouries, the United Kingdom's national collection of arms and armour. Discover what goes on behind the scenes and watch our collection come to life. See combat demonstrations, experience jousting and meet our experts. \n\nHave a question about arms and armour? Feel free to leave us a comment and we'll do our best to answer it.</article>","contentLength":1520,"flags":null,"enclosureUrl":"https://www.youtube.com/v/yHtx4obL8I0?version=3","enclosureMime":"","commentsUrl":null},{"title":"How Did Britain Fight a Guerrilla War in Malaya?","url":"https://www.youtube.com/watch?v=zVkwQO3HdH4","date":1764167407,"author":"Imperial War Museums","guid":431,"unread":true,"content":"<article>This video explores the Malayan Emergency, a brutal counter-insurgency conflict in colonial Malaya spanning from 1948 until 1960.  \n\n00:00:00:00 The Malayan Emergency\n00:01:27:15 Importance of Malaya to the British Empire\n00:02:39:10 Japanese Occupation\n00:04:22:06 The Malayan Union\n00:05:58:04 Social Climate\n00:08:12:03 Declaration of Emergency and Jungle Warfare\n00:10:11:08 British Tactics\n00:13:49:14 Forced Relocation and The Briggs Plan\n00:17:44:05 The Baling Talks\n00:19:58:22 End of the Emergency and Legacy\n\nVisit Emergency Exits: The Fight for Independence in Mayala, Kenya and Cyprus, open now at IWM London: https://www.iwm.org.uk/events/emergency-exits-the-fight-for-independence-in-malaya-kenya-and-cyprus\n\nExplore and licence the film clips used in this video:\nhttps://film.iwmcollections.org.uk/collections/_e9q63jA5\n\nFollow IWM on social media:\nx.com/I_W_M \ninstagram.com/imperialwarmuseums \nfacebook.com/iwm.london \ntiktok.com/@imperialwarmuseums\n\nThe Baling Talks, 28 December 1955 from Wikimedia Commons, THE NEW STRAITS TIMES PRESS (M) BERHAD (NSTP), CC BY-SA 4.0,  https://creativecommons.org/licenses/by-sa/4.0/</article>","contentLength":1136,"flags":null,"enclosureUrl":"https://www.youtube.com/v/zVkwQO3HdH4?version=3","enclosureMime":"","commentsUrl":null},{"title":"Building Data Visualisations in Python in Minutes • Kris Jenkins • GOTO 2025","url":"https://www.youtube.com/watch?v=lQRq4-MiAGA","date":1764162101,"author":"GOTO Conferences","guid":264,"unread":true,"content":"<article>This presentation was recorded at GOTO Copenhagen 2025. #GOTOcon #GOTOcph\nhttps://gotocph.com\n\nKris Jenkins - Lifelong Computer Geek and Podcast Host @krisajenkins \n\nRESOURCES\nhttps://bsky.app/profile/krisajenkins.bsky.social\nhttps://twitter.com/krisajenkins\nhttps://www.linkedin.com/in/krisjenkins\nhttps://github.com/krisajenkins\nhttp://blog.jenkster.com\n\nABSTRACT\nThe backend has all the data. It has access to all the databases, the flat files and the remote storage APIs. But if you want to look at that data, it feels like you're forced to build yet another REST API and hire a React expert.\n\nNo more! Streamlit has you covered. Streamlit's a simple Python framework that makes it incredibly easy to take Python's data-processing capabilities and build clean, professional visualisations in minutes.\n\nIn this live-coding session we'll start completely from scratch and explore the core parts of Streamlit's API, learn a little Pandas along the way, and see how a backend developer or data scientist can actually look at their data faster than you can say, \"JSON encoding\". [...]\n\nTIMECODES\n00:00 Intro\n02:40 Live Demo\n32:15 Outro\n\nRead the full abstract here:\nhttps://gotocph.com/2025/sessions/3936\n\nRECOMMENDED BOOKS\nSandy Maguire • Thinking with Types • https://leanpub.com/thinking-with-types\nEdwin Brady • Type-Driven Development with Idris • https://amzn.to/432GZTi\nMaryann Kisamore • Basics Of Apache Kafka • https://amzn.to/3tkVYFD\nMitch Seymour • Mastering Kafka Streams and ksqlDB • https://amzn.to/3HZ18wK\nTed Dunning &amp; Ellen Friedman • Streaming Architecture • https://amzn.to/3lhk3Kb\nLiz Rice • Container Security • https://amzn.to/3oU4iJe\nNeal Ford • Functional Thinking • https://amzn.to/3DdP35B\nPetricek &amp; Skeet • Real-World Functional Programming • https://amzn.to/38diF4M\n\nhttps://bsky.app/profile/gotocon.com\nhttps://twitter.com/GOTOcon\nhttps://www.linkedin.com/company/goto-\nhttps://www.instagram.com/goto_con\nhttps://www.facebook.com/GOTOConferences\n#Streamlit #Dataviz #PythonLanguage #DataVisualizations #PythonProgramming #PythonTutorial #PythonFramework #LiveCoding #Eurovision #Snowflake #Data #Database #RESTAPI #KrisJenkins\n\nCHANNEL MEMBERSHIP BONUS\nJoin this channel to get early access to videos &amp; other perks:\nhttps://www.youtube.com/channel/UCs_tLP3AiwYKwdUHpltJPuA/join\n\nLooking for a unique learning experience?\nAttend the next GOTO conference near you! Get your ticket at https://gotopia.tech\nSign up for updates and specials at https://gotopia.tech/newsletter\n\nSUBSCRIBE TO OUR CHANNEL - new videos posted almost daily.\nhttps://www.youtube.com/user/GotoConferences/?sub_confirmation=1</article>","contentLength":2656,"flags":null,"enclosureUrl":"https://www.youtube.com/v/lQRq4-MiAGA?version=3","enclosureMime":"","commentsUrl":null},{"title":"Why Didn't BF-109s Have DROP TANKS?","url":"https://www.youtube.com/shorts/K-kzdoR940g","date":1764158442,"author":"Imperial War Museums","guid":430,"unread":true,"content":"<article>This video examines why the Luftwaffe didn't use drop tanks on their BF-109s during the Battle of Britain.\n\n#history #ww2 #bf109</article>","contentLength":128,"flags":null,"enclosureUrl":"https://www.youtube.com/v/K-kzdoR940g?version=3","enclosureMime":"","commentsUrl":null},{"title":"20th Century Keyboard Trailer","url":"https://www.youtube.com/watch?v=SIVxfOUMV4U","date":1764149155,"author":"Chyrosran22","guid":92,"unread":true,"content":"<article>22-12-2025 (unboxing before that)\nJust me having some fun again :p . \n\nMusic: T. Rex - 20th Century Boy\nCamerawoman: my mum\nText animation: Kyle L. Carter\nVideo effects: T.O.M Studios, Vinni Gret</article>","contentLength":195,"flags":null,"enclosureUrl":"https://www.youtube.com/v/SIVxfOUMV4U?version=3","enclosureMime":"","commentsUrl":null},{"title":"2000 Meters to Andriivka (full documentary) | FRONTLINE","url":"https://www.youtube.com/watch?v=Nf4Cgy56slU","date":1764126007,"author":"FRONTLINE PBS | Official","guid":334,"unread":true,"content":"<article>A stunning and immersive portrayal of the men fighting on the front lines of the war in Ukraine, \nfrom the Oscar®-winning team behind “20 Days in Mariupol.”\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: https://www.pbs.org/donate​.\n\n“2000 Meters to Andriivka” documents the toll of the Russia-Ukraine war from a personal and devastating vantage point. Following his historic account of the civilian toll in Mariupol, Ukrainian filmmaker and Associated Press journalist Mstyslav Chernov turns his lens towards Ukrainian soldiers — who they are, where they came from, and the impossible decisions they face in the trenches as they fight for every inch of their land.\n\nThe documentary follows a Ukrainian brigade battling through approximately one mile of a heavily fortified forest on their mission to liberate the Russian-occupied village of Andriivka amid a failing counteroffensive in 2023. \n\nWeaving together original footage, intensive Ukrainian Army bodycam video and powerful moments of reflection with haunting intimacy, the documentary reveals how the farther the soldiers advance through their destroyed homeland, the more they realize that, for them, this war may never end.\n\n“2000 Meters to Andriivka” is written, filmed and directed by filmmaker and Associated Press journalist Mstyslav Chernov. It is produced by Chernov, FRONTLINE’s senior documentary editor and producer Michelle Mizner and FRONTLINE’s editor-in-chief and executive producer Raney Aronson-Rath. It is edited by Michelle Mizner. The film is co-produced and includes additional cinematography by AP journalist Alex Babenko, and is composed by two-time Grammy Award®-winning composer and music-producer Sam Slater. Distributed domestically by PBS Distribution and internationally by Dogwoof, “2000 Meters to Andriivka” is a FRONTLINE FEATURES and The Associated Press production.</article>","contentLength":1929,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Nf4Cgy56slU?version=3","enclosureMime":"","commentsUrl":null},{"title":"Reporter Extra: Chatbots Are Designed to Please You — Here’s Why That’s a Problem","url":"https://www.youtube.com/shorts/WaLS0lM4-1o","date":1764112014,"author":"Vox","guid":57,"unread":true,"content":"<article>Vox senior technology correspondent Adam Clark Estes has a cautionary tale about chatbots.\n\nWhat started as using AI for tedious chores — meal plans, grocery lists, quick research — quietly morphed into hours talking to a chatbot. And Adam isn’t alone. As chatbots get better at flattery, emotional support, and companionship, researchers are seeing more users (including teens) slip into dependency without realizing it.\n\nAdam unpacks how chatbots are designed to keep us coming back, why young people are especially vulnerable, and what happens when adults can’t walk away — in some cases, leading to severe mental health crises. \n\nThis is the first episode of Reporter Extras, a new Patreon-exclusive Vox video series that gives you a behind-the-scenes look at how our journalists create their work.\n\nIf you value this kind of in-depth journalism, join Vox on Patreon to unlock the full episode, get unlimited access to Vox.com, and support the reporting that makes it possible. https://www.patreon.com/posts/144397104?pr=true\n\nSubscribe to our channel and turn on notifications (🔔) so you don't miss any videos: http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com.\n\nWatch our full video catalog: http://goo.gl/IZONyE\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom\nCheck out our articles: https://www.vox.com/\nListen to our podcasts: https://www.vox.com/podcasts</article>","contentLength":1510,"flags":null,"enclosureUrl":"https://www.youtube.com/v/WaLS0lM4-1o?version=3","enclosureMime":"","commentsUrl":null},{"title":"What about the ladies of the Revolutionary War? 🙋‍♀️ #AmericanRevolutionPBS","url":"https://www.youtube.com/shorts/JPVCTXfLOQ4","date":1764111628,"author":"PBS","guid":184,"unread":true,"content":"<article>What did the ladies contribute to the American Revolution? Kathleen DuVal, American historian and professor at University of North Carolina at Chapel Hill discusses the role of women in the war efforts and intellectual aspects of the new America government.\n\nMade possible by viewers like you. Support your local PBS station: https://www.pbs.org/donate\n\nEnjoy full episodes of your favorite PBS shows anytime, anywhere with the free PBS app!\n\n#revolutionarywar #americanhistory #womeninhistory #womenshistory \n\nThe American Revolution | A Film by Ken Burns, Sarah Botstein and David Schmidt\nThirteen American colonies unite in rebellion, win an eight-year war to secure their independence, and establish a new form of government that would inspire democratic movements at home and around the globe. What begins as a political clash between colonists and the British government grows into a bloody struggle that will engage more than two dozen nations and forever change the world.</article>","contentLength":980,"flags":null,"enclosureUrl":"https://www.youtube.com/v/JPVCTXfLOQ4?version=3","enclosureMime":"","commentsUrl":null},{"title":"Inside Stalin's Spy Network: Secret War For The Atomic Bomb","url":"https://www.youtube.com/watch?v=GImS8q8vBEg","date":1764108017,"author":"Timeline - World History Documentaries","guid":347,"unread":true,"content":"<article>Set up as a 'temporary' measure by Lenin, millions of Soviet citizens would die at the hands of the secret services as internal dissent, real or imaginary, was crushed. Outside the Soviet Union, however, they were busy infiltrating German High Command, British Intelligence and America’s Manhattan Project, constructing the world’s first atomic bomb. Soon, Moscow had the means to build one of their own. \n\nYou can now become a History Hit member right here on YouTube! Join for access to a new exclusive documentary every week, and access to over 160+ of our documentaries presented by world renowned historians like Dan Snow, Eleanor Janega, Tristan Hughes, Mary Beard, Matt Lewis and more.\nGet an exclusive release every week by signing up here: https://bit.ly/4pyExyn\n\nThis channel is part of the History Hit Network. Any queries, please contact owned-enquiries@littledotstudios.com</article>","contentLength":890,"flags":null,"enclosureUrl":"https://www.youtube.com/v/GImS8q8vBEg?version=3","enclosureMime":"","commentsUrl":null},{"title":"Do We Live in the Rarest Solar System In The Universe? We're about to find out!","url":"https://www.youtube.com/watch?v=mPFFUWPXAFs","date":1764105309,"author":"PBS Space Time","guid":99,"unread":true,"content":"<article>To learn more visit: https://hensonshaving.com/pbs and use code spacetime to get 100 blades for free with your purchase of a Henson Razor. Add both products to your cart for the code to take effect!\n\nThere are lots of reasons to search for planets around other stars—exoplanets. A big one is to find other places in the universe that might harbor life. We only know of one such planet so far: Earth. And so we get particularly excited when we find Earth-mass planets at the right distance from their star to sustain liquid water—also critical for life as we know it. We’ve found lots of those “habitable” worlds. But we also don’t know what factors are really critical to the initial development of life. Maybe star type? We get even more excited if that Earth-mass at the right distance from a Sun-type star. We’ve found a few of those too, and we can infer that there are lots more. \n\nCheck out the Black Friday Sale at the Space Time Merch Store\nhttps://www.pbsspacetime.com/shop\n\nPBS Member Stations rely on viewers like you. To support your local station, go to:http://to.pbs.org/DonateSPACE\n\nSign Up on Patreon to get access to the Space Time Discord!\nhttps://www.patreon.com/pbsspacetime\n\n\n\nSign up for the mailing list to get episode notifications and hear special announcements!\nhttps://mailchi.mp/1a6eb8f2717d/spacetime\n\nSearch the Entire Space Time Library Here: https://search.pbsspacetime.com/\n\nHosted by Matt O'Dowd\nWritten by Matt O'Dowd \nPost Production by Leonardo Scholzer\nDirected by Andrew Kornhaber\nAssociate Producer: Bahar Gholipour\nExecutive Producer: Andrew Kornhaber\nExecutive in Charge for PBS: Maribel Lopez\nDirector of Programming for PBS: Gabrielle Ewing\nAssistant Director of Programming for PBS: John Campbell\n\nSpacetime is a production of Kornhaber Brown for PBS Digital Studios.\nThis program is produced by Kornhaber Brown, which is solely responsible for its content.\n© 2025 PBS. All rights reserved.\n\nEnd Credits Music by J.R.S. Schattenberg: https://www.youtube.com/user/MultiDroideka\n\nSpace Time Was Made Possible In Part By: \n\nBig Bang\nAlexander Tamas\nDavid Paryente\nJuan Benet\nMark Rosenthal\nMorgan Hough\nPeter Barrett\nSantiago\nTj Steyn\nVinnie Falco\n\nSupernova\nEthan Cohen\nGlenn Sugden\nGrace Biaelcki\nMark Heising\nStephen Wilcox\nTristan Lucian Claudius Aurelius Tyacke\n\nHypernova\nAlex Kern\nBen Delo\nCal Stephens\nchuck zegar\nDavid Giltinan\nDean Galvin\nDonal Botkin\nGregory Forfa\nJesse Cid Dyer\nJohn R. Slavik\nJustin Lloyd\nKenneth See\nMassimiliano Pala\nMichael Tidwell\nMike Purvis\nPaul Stehr-Green\nScott Gorlick\nScott Gray\nSpencer Jones\nStephen Saslow\nThomas Mouton\nZachary Haberman\nАнтон Кочков\nDaniel Muzquiz\n\nGamma Ray Burst\nAaron Pinto\nAdrien Molyneux\nAlmog Cohen\nAnthony Leon\nArko Provo Mukherjee\nAyden Miller\nBen McIntosh\nBradley Jenkins\nBradley Ulis\nBrandon Lattin\nBrian Cook\nBryan White\nChris Liao\nChristopher Wade\nChuck Lukaszewski\nCollin Dutrow\nCraig Falls\nCraig Stonaha\nDan Warren\nDaniel Donahue\nDaniel Jennings\nDaron Woods\nDarrell Stewart\nDavid Johnston\nDoyle Vann\nEric Kiebler\nEric Raschke\nEric Schrenker\nFaraz Khan\nFrederic Simon\nHarsh Khandhadia\nIan Williams\nIsaac Suttell\nJames Trimmier\nJeb Campbell\nJeremy Soller\nJerry Thomas\njim bartosh\nJohn Anderson\nJohn De Witt\nJohn Funai\nJohn H. Austin, Jr.\nJohn591\nJoseph Salomone\nJunaid Ali\nKacper Cieśla\nKane Holbrook\nKeith Pasko\nKent Durham\nKoen Wilde\nKyle Atkinson\nMarcelo Garcia\nMarion Lang\nMark Daniel Cohen\nMark Delagasse\nMatt Kaprocki\nMatthew Johnson\nMichael Barton\nMichael Clark\nMichael Lev\nMichael Purcell\nNathaniel Bennett\nNick Hoffenstoffer III\nNicolas Katsantonis\nPaul Wood\nRad Antonov\nReuben Brewer\nRichard Steenbergen\nRobert DeChellis\nRoss Story\nRussell Moore\nSamSword\nSandhya Devi\nSatwik Pani\nSean Owen\nShane Calimlim\nSilentGnome\nSound Reason\nSteffen Bendel\nSteven Giallourakis\nTerje Vold\nThomas Dougherty\nTomaz Lovsin\nTybie Fitzhugh\nVlad Shipulin\nWilliam Flinn\nWILLIAM HAY III\nZac Sweers</article>","contentLength":3925,"flags":null,"enclosureUrl":"https://www.youtube.com/v/mPFFUWPXAFs?version=3","enclosureMime":"","commentsUrl":null},{"title":"My favourite Picasso quote as featured in my latest video","url":"https://www.youtube.com/shorts/9qsAATFN4RI","date":1764099649,"author":"Shawn Grenier | The Canvas","guid":105,"unread":true,"content":"<article>My Letterboxd: https://boxd.it/4bApF\nInstagram: https://www.instagram.com/thecanvasyoutube/\nSupport us on Patreon: https://www.patreon.com/TheCanvas\n\n#arthistory #art</article>","contentLength":166,"flags":null,"enclosureUrl":"https://www.youtube.com/v/9qsAATFN4RI?version=3","enclosureMime":"","commentsUrl":null},{"title":"The “Dumbest Question” Mayor Scott has ever Received","url":"https://www.youtube.com/shorts/Fc8yHTYOjvg","date":1764098169,"author":"Channel 5 with Andrew Callaghan","guid":451,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Fc8yHTYOjvg?version=3","enclosureMime":"","commentsUrl":null},{"title":"A Soldier's Haunting Request | 2000 Meters to Andriivka (excerpt) | FRONTLINE & @AssociatedPress","url":"https://www.youtube.com/watch?v=ea2bvNqjIps","date":1764095415,"author":"FRONTLINE PBS | Official","guid":333,"unread":true,"content":"<article>About an hour into the new feature documentary \"2000 Meters to Andriivka,\" a Ukrainian volunteer soldier makes a haunting request: \"Don't make me out as a hero.\" \n\nThis journalism is made possible by viewers like you. Support your local PBS station here: https://www.pbs.org/donate\n\nThe soldier, who went by the call sign “Sheva,”  was part of the Ukrainian platoon at the heart of \"2000 Meters to Andriivka,\" the new feature documentary from FRONTLINE, The Associated Press and the Academy Award-winning team behind \"20 Days in Mariupol.\"\n\nWeaving together quiet moments of reflection, like this one with Sheva, and vivid battle footage, \"2000 Meters to Andriivka\" documents the toll of the Russia-Ukraine war from a personal and devastating vantage point. The film follows Ukraine’s 3rd Assault Brigade as it carries out a grueling, meter-by-meter counteroffensive that aims to retake the strategic Ukrainian town of Andriivka from Russia -- and as the soldiers realize that for them, the war may never end.\n\nSheva would be killed in a battle and die in a hospital five months after this scene was filmed. Read more about Sheva's story at pbs.org/frontline, and watch the full documentary on @frontline starting Nov. 25, 2025.\n\n“2000 Meters to Andriivka” is written, filmed and directed by filmmaker and Associated Press journalist Mstyslav Chernov. It is produced by Chernov, FRONTLINE’s senior documentary editor and producer Michelle Mizner and FRONTLINE’s editor-in-chief and executive producer Raney Aronson-Rath. It is edited by Michelle Mizner. The film is co-produced and includes additional cinematography by AP journalist Alex Babenko; is composed by two-time Grammy Award®-winning composer and music-producer Sam Slater; and is executive produced by Raney Aronson-Rath and the AP's Derl McCrudden. Distributed domestically by PBS Distribution and internationally by Dogwoof, “2000 Meters to Andriivka” is a FRONTLINE FEATURES and The Associated Press production.\n\n#ukraine #ukrainewar #ukrainerussiawar #documentaryexcerpt</article>","contentLength":2054,"flags":null,"enclosureUrl":"https://www.youtube.com/v/ea2bvNqjIps?version=3","enclosureMime":"","commentsUrl":null},{"title":"Dunmore's Proclamation & Black Americans in the American Revolution | PBS","url":"https://www.youtube.com/watch?v=bfChc8JR8O8","date":1764090070,"author":"PBS","guid":183,"unread":true,"content":"<article>Official website: https://to.pbs.org/amrevpbs | #AmericanRevolutionPBS\nForty percent of white Virginians owned enslaved people, and farmers like George Washington lived in fear of a revolt. These fears come to reality when Virginia's royal governor, Lord Dunmore, issues a proclamation offering freedom to any enslaved individual who joins his fight against their Patriot masters. Some 800 men would join Dunmore, including some of George Washington's own slaves.\n\nThis program is made possible by viewers like you. Support your local PBS station: https://www.pbs.org/donate\n\nSubscribe to the PBS channel for more clips:  https://www.youtube.com/PBS/\n\nEnjoy full episodes of your favorite PBS shows anytime, anywhere with the free PBS app: https://to.pbs.org/2QbtzhR\n\nFOLLOW US:\n\nFacebook: https://www.facebook.com/PBS/\nX: https://twitter.com/PBS/\nInstagram: https://www.instagram.com/PBS/\nTikTok: https://www.tiktok.com/@pbs\nThreads: https://www.threads.net/@pbs\n\n#americanhistory #revolutionarywar #history #ushistory #blackhistory   \n\nTHE AMERICAN REVOLUTION | A Film By Ken Burns, Sarah Botstein and David Schmidt\nAn expansive look at the virtues and contradictions of the war and the birth of the United States of America, the film follows dozens of figures from a wide variety of backgrounds. Through their individual stories, viewers experience the war through the memories of the men and women who experienced it: the rank-and-file Continental soldiers and American militiamen (some of them teenagers), Patriot political and military leaders, British Army officers, American Loyalists, Native soldiers and civilians, enslaved and free African Americans, German soldiers in the British service, French and Spanish allies, and various civilians living in North America, Loyalist as well as Patriot, including many made refugees by the war.\n\nThe Revolution began a movement for people around the world to imagine new and better futures for themselves, their nations, and for humanity. It declared American independence with promises that we continue to strive for. The American Revolution opened the door to advance civil liberties and human rights, and it asked questions that we are still trying to answer today.\n\nThe film, narrated by Peter Coyote, includes the first-person voices of nearly 200 individual historic figures, read by a cast of actors, including Adam Arkin, Jeremiah Bitsui, Corbin Bleu, Kenneth Branagh, Josh Brolin, Bill Camp, Tantoo Cardinal, Josh Charles, Hugh Dancy, Claire Danes, Jeff Daniels, Keith David, Hope Davis, Marcus Davis-Orrom, Bruce Davison, Leon Dische Becker, Alden Ehrenreich, Craig Ferguson, Morgan Freeman, Christian Friedel, Paul Giamatti, Domhnall Gleeson, Amanda Gorman, Michael Greyeyes, Jonathan Groff, Charlotte Hacke, Tom Hanks, Ethan Hawke, Maya Hawke, Lucas Hedges, Josh Hutcherson, Samuel L. Jackson, Gene Jones, Michael Keaton, Joe Keery, Joel Kinnaman, Tracy Letts, Damian Lewis, Laura Linney, Josh Lucas, Michael Mando, Carolyn McCormick, Lindsay Mendez, Tobias Menzies, Joe Morton, Edward Norton, David Oyelowo, Mandy Patinkin, Wendell Pierce, Jon Proudstar, Matthew Rhys, LaTanya Richardson, Liev Schreiber, Chaske Spencer, Dan Stevens, Meryl Streep, and Yul Vazquez, among others.</article>","contentLength":3242,"flags":null,"enclosureUrl":"https://www.youtube.com/v/bfChc8JR8O8?version=3","enclosureMime":"","commentsUrl":null},{"title":"Poland’s fentanyl crisis | DW Documentary","url":"https://www.youtube.com/watch?v=LMybt9-aXTQ","date":1764090039,"author":"DW Documentary","guid":12,"unread":true,"content":"<article>Fentanyl is estimated to be fifty times as potent as heroin and is extremely addictive. The number of people in Poland abusing this powerful painkiller is growing. There have been dozens of fatalities.\n\nMichal lives in a small town south of Gdansk. Because of the stigma surrounding people with addiction, he prefers to remain anonymous. Every two weeks, he travels to Święciec to take methadone, a substitute drug, at the addiction clinic of the psychiatric hospital. After using various drugs, he started taking fentanyl, the strongest of all opiates. \nFentanyl is used to treat people with severe pain and as an anesthetic. Addicts remove the gel from pain patches and inject it directly into their bloodstream. There have been dozens of fatal overdoses in Poland. Michal has also lost one of his close friends. Corrupt pharmacists are believed to have sold large quantities of fentanyl patches to dealers. The authorities have since put a stop to this.  \nIn Żuromin, Jadwiga Karpinska lost her son Pawel to a fatal overdose. Their town, a two-hour drive from the capital Warsaw, was known as the country’s unofficial fentanyl capital in 2024. That changed when police detained a well-known local dealer. The drug continues to be available there, but in smaller quantities.\nElementary school teacher Adam Ejnik believes in prevention. He wants to keep his students away from the drug by raising awareness about its dangers. \nArtur from Łódź has managed to get off fentanyl. A few years ago, he was so addicted, he had lost the will to live. Today, his girlfriend Agnieszka helps him stay clean. His goal: he hopes to finish his psychology degree and work as a therapist to help other addicts get off the extremely powerful drug.\n\n#documentary #dwdocumentary #dwdocs #poland #fentanyl \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: ‬\n⮞ DW Documentary (English): https://www.youtube.com/@DWDocumentary \n⮞ DW Documental (Spanish): https://www.youtube.com/@DWDocumental \n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/@dwdocarabia\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/@dwdochindi\n⮞ DW Dokumenter (Indonesian): https://www.youtube.com/@DWDokumenter\n⮞ DW Doku (German): https://www.youtube.com/@dwdoku\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G</article>","contentLength":2957,"flags":null,"enclosureUrl":"https://www.youtube.com/v/LMybt9-aXTQ?version=3","enclosureMime":"","commentsUrl":null},{"title":"Are Space Elevators Possible?","url":"https://www.youtube.com/shorts/5kaNDtqsPBE","date":1764088201,"author":"StarTalk","guid":362,"unread":true,"content":"<article>Check out our second channel, @StarTalkPlus\n\nGet the NEW StarTalk book, 'To Infinity and Beyond: A Journey of Cosmic Discovery' on Amazon: https://amzn.to/3PL0NFn\n\nSupport us on Patreon: https://www.patreon.com/startalkradio\n\nFOLLOW or SUBSCRIBE to StarTalk:\nTwitter: http://twitter.com/startalkradio\nFacebook: https://www.facebook.com/StarTalk\nInstagram: https://www.instagram.com/startalk\n\nAbout StarTalk: \nScience meets pop culture on StarTalk! Astrophysicist &amp; Hayden Planetarium director Neil deGrasse Tyson, his comic co-hosts, guest celebrities &amp; scientists discuss astronomy, physics, and everything else about life in the universe. Keep Looking Up!\n\n#StarTalk #NeildeGrasseTyson</article>","contentLength":687,"flags":null,"enclosureUrl":"https://www.youtube.com/v/5kaNDtqsPBE?version=3","enclosureMime":"","commentsUrl":null},{"title":"4️⃣ Levels of Darkness in Brahms Op. 118, No. 6","url":"https://www.youtube.com/shorts/O5xYtSZUGh4","date":1764088183,"author":"Ben Laude","guid":604,"unread":true,"content":"<article>https://patreon.com/BenLaude\nhttps://instagram.com/benlawdy/\nhttps://benlaude.com/</article>","contentLength":82,"flags":null,"enclosureUrl":"https://www.youtube.com/v/O5xYtSZUGh4?version=3","enclosureMime":"","commentsUrl":null},{"title":"Baltimore Streets","url":"https://www.youtube.com/watch?v=XQs59YY-e2I","date":1764087938,"author":"Channel 5 with Andrew Callaghan","guid":450,"unread":true,"content":"<article>Go to https://ground.news/channel5 to stay fully informed with all sides of every story. Subscribe for 40% off the Vantage plan through my link.\n\nHead to http://www.youtube.com/@CanalCincoLatam to see our original, Spanish-language content! \n\nSubscribe to our Patreon at https://www.patreon.com/channel5 to see our new episode 'Inside the All-White Community of Arkansas.'</article>","contentLength":372,"flags":null,"enclosureUrl":"https://www.youtube.com/v/XQs59YY-e2I?version=3","enclosureMime":"","commentsUrl":null},{"title":"The seed that gave Coca-Cola its name - Shantel George","url":"https://www.youtube.com/watch?v=IpaVpMFBwAE","date":1764086412,"author":"TED-Ed","guid":250,"unread":true,"content":"<article>Dig into the bitter history of kola nuts, a sacred ingredient in West African culture and part of Coca-Cola's original recipe.\n\n--\n\nThe kola nut is the seed of the kola tree, a small evergreen native to the forests of West Africa, where it’s long been integral to the cultural fabric of many communities. So, how did this sacred ingredient end up all around the world? And how did it make its way into the original recipe of a drink that billions of people consume every day? Shantel George explores the bitter history of kola nuts.\n\nLesson by Shantel George, directed by Nikhita Prabhudesai Jeena, Totem Creative.\n\nSupport Our Non-Profit Mission\n----------------------------------------------\nSupport us on Patreon: http://bit.ly/TEDEdPatreon\nCheck out our merch: http://bit.ly/TEDEDShop\n----------------------------------------------\n\nConnect With Us\n----------------------------------------------\nSign up for our newsletter: http://bit.ly/TEDEdNewsletter\nFollow us on Facebook: http://bit.ly/TEDEdFacebook\nFind us on Twitter: http://bit.ly/TEDEdTwitter\nPeep us on Instagram: http://bit.ly/TEDEdInstagram\n----------------------------------------------\n\nKeep Learning\n----------------------------------------------\nView full lesson: https://ed.ted.com/lessons/the-seed-that-gave-coca-cola-its-name-shantel-george\nDig deeper with additional resources: https://ed.ted.com/lessons/the-seed-that-gave-coca-cola-its-name-shantel-george/digdeeper\n\nAnimator's website: https://www.totemcreative.in\n----------------------------------------------\n\nThank you so much to our patrons for your support! Without you this video would not be possible! Vector-Dopamine math, Jasper Song, Giorgio Bugnatelli, Chardon, Eddy Trochez, OnlineBookClub.org, Eric Shear, Leith Salem, Omar Hicham, Adrian Rotaru, Brad Sullivan, Karen Ho, Niklas Frimberger, Hunter Manhart, Nathan Nguyen, Igor Stavchanskiy, James R DeVries, Grace Huo, Diana Huang, Chau Hong Diem, Orlellys Torre, Corheu, Thomas Mee, Maryann H McCrory, Blas Borde, John Hellmann, Poompak Meephian, Chuck Wofford, Adam Pagan, Wes Winn, Conder Shou, ntiger, Noname, Hansan Hu, David D, Mac Hyney, Keith Ellison, robin valero walters, Lynne Truesdale, Gatsby Dkdc, Matthew Neal, Denis Chon, Julian Oberhofer, Monte Carroll, Eddy, Jay M, Constantino Victor Delgado, Andrea Galvagni, Andrew Tweddle, and Laurel-Ann Rice.</article>","contentLength":2358,"flags":null,"enclosureUrl":"https://www.youtube.com/v/IpaVpMFBwAE?version=3","enclosureMime":"","commentsUrl":null},{"title":"Trees Are So Weird","url":"https://www.youtube.com/watch?v=ZSch_NgZpQs","date":1764082810,"author":"Kurzgesagt – In a Nutshell","guid":241,"unread":true,"content":"<article>Want to restore the planet’s ecosystems and see your impact in monthly videos? The first 100 people to join Planet Wild with my code KURZGESAGT11 will get the first month for free at: https://planetwild.com/r/kurzgesagt/join\nIf you want to get to know them better first, check out their project reviving underground forests in Tanzania: https://planetwild.com/r/kurzgesagt/m33\n\nIt’s not too late to get your 12,026 Human Era Calendar: https://shop.kgs.link/12026! It’s filled with cosmic stories, elaborate illustrations, and supports all that we do at kurzgesagt ❤️\n\nSources &amp; further reading:\nhttps://sites.google.com/view/sources-treesaredead/\n\nTrees are among the most extreme and successful forms of life on Earth. They build their bodies from thin air, move water with pressures that would crush a human, and grow using a fascinating system of living cables wrapped in layers of corpses. Under their bark lies a razor-thin strip of living cells, working endlessly to move water hundreds of meters, build indestructible wood, and coordinate millions of functions. \nHow do trees work, and what are they even made of? What makes these ancient giants so resilient, and maybe even immortal?\n\n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman:        https://kgs.link/youtubeDE\nSpanish:        https://kgs.link/youtubeES\nFrench:          https://kgs.link/youtubeFR\nPortuguese:  https://kgs.link/youtubePT\nArabic:           https://kgs.link/youtubeAR\nHindi:             https://kgs.link/youtubeHI\nJapanese:     https://kgs.link/youtubeJA\nKorean:          https://kgs.link/youtubeKO\n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Products designed with ❤️ https://shop.kgs.link\nJoin the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS &amp; SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nInstagram:     https://kgs.link/instagram\nTikTok:           https://kgs.link/tiktok\nReddit:            https://kgs.link/reddit\nDiscord:          https://kgs.link/discord\nTwitter:           https://kgs.link/twitter\nBluesky:          https://kgs.link/bluesky\nFacebook:      https://kgs.link/facebook\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of kurzgesagt soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          https://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook\n\nThe soundtrack of this video:\nSoundCloud: https://bit.ly/4riwGp9\nBandcamp: https://bit.ly/44uVxMG\n\nIf you want to help us caption this video, please send subtitles to subtitle@kurzgesagt.org\nYou can find info on what subtitle files work on YouTube here:\nhttps://support.google.com/youtube/answer/2734698?hl=en-GB&amp;ref_topic=7296214\nThank you!\n\n\n🐦🐧🐤 PATREON BIRD ARMY 🐤🐧🐦\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nMany thanks to our wonderful Patreons (from http://kgs.link/patreon) who support us every month and made this video possible:\nAcácio Correia, AeryaRia, aforsberg, Ahmad Seet, Alexander, Alexander Devlin, amia, Andres Ramos, Anna Duwenig, Anthony Hanson, Anton Abrahamsson, AonReo, Armond Aghanian, Asaf Yishai, Benjamin R., Bharath Ron, Brendan Ryan-Lewis, Christoph Lurz, Christoph Rau, Clay, Cliff Hudson, ConsterCoaster, Corbin Meier, Dale Kipple, Delano Stijns, dotvhs, Dylan Gafner, eddie k, Ela Yohannan, Enigma66, Eran Aviram, Erwin Heckler, Eva Markiewicz, Evil Cookie, FeelinaraIRL, Frankie Ennis, G, Geoff Evans, George Hutter, hazardx, Hugh Mungus, Inigo vd, Ireleigh, Isabelll, Ishaan Varma, Jack Sparrow, James Emmitt Zugar, James Pinkerton, james trotta, Jason Desrosiers, Jason Murley, Jens Begemann, Jesse, Jesus Mayo, Joann Taijala, Joseph Gauthier, jurd, Justin, KawasakiDragonno, Keddan, KekzL, Lauren Woolsey LeGrandAnanas, Lulidine, LumpyMammot, manchicken, Mark A Vargas, MasterOfTree, Matthew Brady, Matthew Brodeur, Maximilian Schons, Mead Landis, Ms. Ewing, Mykola Balakin, Nathaniel Bauernfeind, Nicholas McCalla, Owen, PaladinSpartac, Phoenix_Flames, Primalis, Quinn Wilson, Rath Robin, Robert Cudinski, Robin Hockett, Ryan Snead, Ryan Staunch, Ryan Thompson, SentinelD20, Siddharth Chaini, Sindre Nistad, Soko Divanovic, Spleens, Stacey Nicholson, Stephen Conlon, Strudy, Syi, Sérgio P., Thomas Mitchell, Thomas Stokes, Thomas Toombes, Tom Kocmi, Warren MacEvoy, William Lingenfelter</article>","contentLength":4935,"flags":null,"enclosureUrl":"https://www.youtube.com/v/ZSch_NgZpQs?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Worst Tech Product of the Century [Friend.com]","url":"https://www.youtube.com/watch?v=BN9zz2O6jcw","date":1764081929,"author":"ColdFusion","guid":411,"unread":true,"content":"<article>Go to https://buyraycon.com/coldfusionOPEN to get up to 30% off during Raycon’s Black Friday and Cyber Monday Sale.\nThese days people are in search of companionship but tech companies are treating it like another problem that has to be solved. One of the latest efforts in this space is Friend.com. An AI pendant that serves as your very own digital buddy. The product itself has seen terrible reviews and has a lot of people asking the question “do we really need this?” \nIn this video we explore.\n\nWatch or listen to ColdFusion on Spotify: https://open.spotify.com/show/1YEwCKoRz8fEDqheXB6UJ1\n\nColdFusion Music: \n\nhttps://www.youtube.com/@ColdFusionmusic\nhttp://burnwater.bandcamp.com   \n\nGet my book: \n\nhttp://bit.ly/NewThinkingbook \n\nColdFusion Socials: \n\nhttps://discord.gg/coldfusion\nhttps://facebook.com/ColdFusionTV \nhttps://twitter.com/ColdFusion_TV \nhttps://instagram.com/coldfusiontv\n\nCreated by: Dagogo Altraide\nProducers: Tawsif Akkas, Dagogo Altraide</article>","contentLength":970,"flags":null,"enclosureUrl":"https://www.youtube.com/v/BN9zz2O6jcw?version=3","enclosureMime":"","commentsUrl":null},{"title":"Fear on the streets | DW Documentary","url":"https://www.youtube.com/shorts/l_FpOnObpK4","date":1764079277,"author":"DW Documentary","guid":11,"unread":true,"content":"<article>Although sexual violence can affect people of all genders, women and girls are disproportionally impacted.  \n\nMany women feel unsafe in public spaces, whether on streets, at train stations, or in parks. The danger they face overwhelmingly comes from men: Around 95% of sexualized violence in public spaces is committed by them. \n\nYanni Gentsch's encounter with a stranger who secretly filmed her while she jogged in a forest in Cologne went viral on the internet after she recorded the confrontation. Her experience demonstrates a common and recurring problem. \n\nWatch the full documentary “How male violence shapes women’s lives” on the DW Documentary YouTube channel.\n\n#documentary #dwdocumentary #dwdocs #maleviolence #25N #internationaldayfortheeliminationofviolenceagainstwomen \n\n______\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G</article>","contentLength":906,"flags":null,"enclosureUrl":"https://www.youtube.com/v/l_FpOnObpK4?version=3","enclosureMime":"","commentsUrl":null},{"title":"Breaking the Architecture Bottleneck • Andrew Harmel-Law & Marit van Dijk","url":"https://www.youtube.com/watch?v=6BGQcTjecjM","date":1764077355,"author":"GOTO Conferences","guid":263,"unread":true,"content":"<article>This interview was recorded for GOTO Unscripted.\nhttps://gotopia.tech\n (https://gotopia.tech/articles/392) \nAndrew Harmel-Law - Technical Principal at Thoughtworks &amp; Author of \"Facilitating Software Architecture\"\nMarit van Dijk - Developer Advocate at JetBrains, Java Champion &amp; Open Source Contributor\n\nRESOURCES\nAndrew\nhttps://bsky.app/profile/andrewhl.bsky.social\n (https://github.com/andrewharmellaw) https://www.linkedin.com/in/andrewharmellaw\nhttps://andrewharmellaw.github.io\n\nMarit\nhttps://bsky.app/profile/maritvandijk.bsky.social\nhttps://linkedin.com/in/maritvandijk\n (https://github.com/mlvandijk) https://medium.com/@mlvandijk\nhttps://maritvandijk.com\n\nLinks\nhttps://facilitatingsoftwarearchitecture.com\nhttps://ruthmalan.com\nhttps://www.linkedin.com/pulse\n (https://www.linkedin.com/pulse/software-architects-do-we-need-em-ruth-malan) \nDESCRIPTION\nAndrew Harmel-Law discusses their book \"Facilitating Software Architecture\" and how traditional architecture approaches often become bottlenecks that slow down high-performing development teams.\n\nRather than architects making top-down decisions in isolation, they advocate for a facilitation approach centered on the \"advice process\".\n\nThis collaborative method shifts the architect's role from decision-maker to conversation facilitator. The approach has proven successful even in traditional corporate environments, ultimately creating more maintainable code bases where development teams actually enjoy working and can respond effectively to changing requirements.\n\nRECOMMENDED BOOK\nAndrew Harmel-Law • Facilitating Software Architecture • https://amzn.eu/d/5kZKVfU\n\n\nBluesky (https://bsky.app/profile/gotocon.com) \nTwitter (https://twitter.com/GOTOcon) \nInstagram (https://www.instagram.com/goto_con) \nLinkedIn (https://www.linkedin.com/company/goto-) \nFacebook (https://www.facebook.com/GOTOConferences) \n\nCHANNEL MEMBERSHIP BONUS\nJoin this channel to get early access to videos &amp; other perks:\nhttps://www.youtube.com/channel/UCs_tLP3AiwYKwdUHpltJPuA/join\n\nLooking for a unique learning experience?\nAttend the next GOTO conference near you! Get your ticket: gotopia.tech (https://gotopia.tech) \n\nSUBSCRIBE TO OUR YOUTUBE CHANNEL (https://www.youtube.com/user/GotoConferences/?sub_confirmation=1)  - new videos posted daily!</article>","contentLength":2293,"flags":null,"enclosureUrl":"https://www.youtube.com/v/6BGQcTjecjM?version=3","enclosureMime":"","commentsUrl":null}],"tags":["yt"]}