{"id":"4W3i2hyrJTVfcLq85rWgduVQ3y3BMzrSD4pVUCMqPpFhmXWpqxQ","title":"Hacker News: Front Page","displayTitle":"HN Front","url":"https://hnrss.org/frontpage?points=75","feedLink":"https://news.ycombinator.com/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":16,"items":[{"title":"The Impact of Generative AI on Critical Thinking [pdf]","url":"https://www.microsoft.com/en-us/research/uploads/prod/2025/01/lee_2025_ai_critical_thinking_survey.pdf","date":1739621161,"author":"nosianu","guid":154,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43057907"},{"title":"Jane Street's Figgie card game","url":"https://www.figgie.com/","date":1739613560,"author":"eamag","guid":153,"unread":true,"content":"<p><a href=\"https://www.janestreet.com/\">Jane Street</a>'s fast-paced\n              Figgie game simulates exciting elements of markets and trading. At\n              Jane Street, Figgie is a game we teach and also one we really\n              enjoy playing.\n            </p><p><a href=\"https://www.figgie.com/faqs.html\">Read our FAQs</a>\n              for more. If you have a question that isn’t answered there, we’d\n              like to hear\n              <a href=\"mailto:figgie@janestreet.com\">what’s missing</a> and what\n              would be helpful to know, and we’ll do our best to update FAQs\n              along the way.\n            </p>","contentLength":507,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43057344"},{"title":"Bookshop.org launches Kindle alternative, sends e-book sales to local bookstores","url":"https://www.usatoday.com/story/entertainment/books/2025/01/28/bookshop-org-ereader-ebook-app/77928209007/","date":1739603151,"author":"dotcoma","guid":152,"unread":true,"content":"<p>Bibliophiles don’t need to commit to one style of reading – with myriad titles available digitally or as audiobooks, diversifying reading habits has never been easier.</p><p>However, as platforms vary, the seller often doesn’t. Amazon accounts for <a href=\"https://www.ibisworld.com/united-states/industry/online-book-sales/5100/\" data-t-l=\":b|z|k|${u}\">more than 80% of all online book sales</a>, according to market research firm IBISWorld. Not to mention it owns Kindle, a wildly popular format for e-reading.</p><p><a href=\"https://bookshop.org/\" data-t-l=\":b|z|k|${u}\">Bookshop.org</a> is ready to change that. Today, the online platform that connects readers to local bookstores launched an e-reading platform of its own. For the first time, local <a href=\"https://www.usatoday.com/booklist/independent-bookstores\" target=\"_blank\" rel=\"noreferrer noopener\" data-t-l=\":b|e|k|${u}\">independent bookstores</a> can sell e-books to customers, says CEO and founder Andy Hunter.&nbsp;</p><h2>Bookshop.org launches e-book platform to support local bookstores</h2><p>Hunter is in the business of solving logistical problems for readers. In 2020, he launched <a href=\"https://bookshop.org/\" target=\"_blank\" rel=\"noreferrer noopener\" data-t-l=\":b|z|k|${u}\">Bookshop.org</a> to support local businesses losing sales to Amazon Books. Years later, as an e-reader himself, he realized how hard it was to continue his “socially-conscious consumerism” mindset of buying locally when it came to digital titles.</p><p>“Right now, no matter how much you love your local bookstore, if you want to read an e-book, you have to go to Amazon or another alternate platform and you can’t support your local bookstore,” Hunter tells USA TODAY. “E-books are an important revenue stream for publishers and authors and they could be for independent bookstores.”</p><p>The result is an app (<a href=\"https://bookshop.org/info/ebooks\" target=\"_blank\" rel=\"noreferrer noopener\" data-t-l=\":b|z|k|${u}\">available for iOS and Android,</a> and accessible from a web browser) with nearly a million titles from major publishing houses. Readers can annotate, add notes, look up words and sync across all their devices. There's a search function if consumers know the book they want to read, and if they don't, there's an explore page with suggestions by genre.</p><p>Most importantly for Hunter, booksellers will take home the profits, which he says has prevented local businesses from thriving in e-book sales until now.&nbsp;</p><p>“There’s no real way to make it profitable, but we don’t care about it being profitable,” Hunter says, citing the socially conscious company’s B corporation status. “Our mission is to help independent bookstores survive and thrive in the digital age.”</p><p>With discounts, quick shipping and Kindle synching, Amazon Books has long been an appealing option to many readers. But now, Hunter says there’s “no reason on Earth to give a billionaire your $9.99 for your e-book,” as publishers set a fixed price for e-books and there’s no shipping to compete with.&nbsp;</p><p>Bookshop.org’s new initiative follows a growing movement across social media – not just exclusively in bookish communities – to <a href=\"https://www.theatlantic.com/culture/archive/2024/10/washington-post-bezos-amazon-prime-cancel/680421/\" data-t-l=\":b|z|k|${u}\">forgo Amazon and other big-box sellers</a> in favor of shopping locally.&nbsp;</p><p>“In an age of billionaires and giant e-commerce companies and our loss of control of our lives to Silicon Valley <a href=\"https://www.usatoday.com/story/news/politics/2025/01/15/oligarchy-meaning-biden-farewell-address/77731224007/\" data-t-l=\":b|e|k|${u}\">oligarchs</a>, that they know we’re going to fight back against that and we’re going to stay local,” Hunter says. “It doesn’t have to be this way. We can invest in, we can support our local community even when we’re reading digital books.”</p><h2>E-reader features to include social sharing</h2><p>Bookshop.org's platform also includes a “quote-sharing” feature for social media, Hunter says. He wants books to catch up to the way other media is shared – it’s easy to share your Spotify or Apple Music listening to your Instagram story, and you can even post about your workouts with some apps. But if you want to share a quote from a book, readers have to take a photo of the physical book or a screenshot.&nbsp;</p><p>“They should be able to share that to social media and somebody else should be able to click in, buy the book using Apple Pay and start reading it right away,” Hunter says. “That’ll fuel all kinds of discussions about books on TikTok and places like that, and all of that will benefit the independent bookstores because it will be them selling the books that people are talking about.”</p><h2>Looking for your next great read? USA TODAY has you covered.</h2><p><em>Clare Mulroy is USA TODAY’s Books Reporter, where she covers buzzy releases, chats with authors and dives into the culture of reading. Find her</em><a href=\"https://www.instagram.com/claremmulroy/\" data-t-l=\":b|z|k|${u}\"></a><a href=\"https://www.usatoday.com/staff/7713150001/clare-mulroy/\" data-t-l=\":b|e|k|${u}\"></a><em> or tell her what you’re reading at cmulroy@usatoday.com.</em></p>","contentLength":4199,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43056526"},{"title":"The 20 year old PSP can now connect to WPA2 WiFi Networks","url":"https://wololo.net/2025/02/14/the-20-year-old-psp-can-now-connect-to-wpa2-wifi-networks/","date":1739590316,"author":"zdw","guid":151,"unread":true,"content":"<div><img data-recalc-dims=\"1\" fetchpriority=\"high\" decoding=\"async\" aria-describedby=\"caption-attachment-49719\" src=\"https://i0.wp.com/wololo.net/wagic/wp-content/uploads/2025/02/psp_wpa2_support.jpg?resize=848%2C477&amp;ssl=1\" alt=\"\" width=\"848\" height=\"477\" srcset=\"https://i0.wp.com/wololo.net/wagic/wp-content/uploads/2025/02/psp_wpa2_support.jpg?w=848&amp;ssl=1 848w, https://i0.wp.com/wololo.net/wagic/wp-content/uploads/2025/02/psp_wpa2_support.jpg?resize=300%2C169&amp;ssl=1 300w, https://i0.wp.com/wololo.net/wagic/wp-content/uploads/2025/02/psp_wpa2_support.jpg?resize=768%2C432&amp;ssl=1 768w\" sizes=\"(max-width: 848px) 100vw, 848px\"><p>Screenshot source: Zekiu_ on youtube</p></div><p><a href=\"https://wololo.net/tag/acid_snake\">Acid_Snake</a> and the <a href=\"https://wololo.net/tag/ark-4/\">ARK</a> Development team have released a significant update to the ARK custom Firmware for the Sony PSP. Custom Firmware now allows the Playstation Portable to connect to WPA2 encrypted Wifi networks. This is thanks to the recently released  plugin, created by developer  and published on the PSP Homebrew discord.</p><h2>Playstation Portable gets WPA2 Wifi access</h2><p>The PSP has been out of official support from Sony for years, but lots of enthusiasts keep maintaining this great handheld through homebrew and custom Firmware updates. As technology evolves around us, older devices such as the PlayStation Portable can lose some of their features.</p><p>For example, as WPA2 has become the defacto encryption standard for home wifi networks (WPA3’s adoption rate remains low), older devices such as the PSP, that do not support these new* encryption standards become technically unable to access the internet.</p><p>Wifi access was a very strong feature of the PSP when it was released, and, although it’s probably less important nowadays, losing that feature because newer networks aren’t compatible is a bummer.</p><p>WPA2 support has been a request by many enthusiasts for years on PSP discussion channels, and it seems that the wpa2psp plugin by developer Moment now brings this to life. According to Acid_Snake, the developer was kind enough to provide the source code of the plugin, which allowed the ARK team to embed it into the ARK Custom Firmware for PSP.</p><div><img data-recalc-dims=\"1\" decoding=\"async\" aria-describedby=\"caption-attachment-49720\" src=\"https://i0.wp.com/wololo.net/wagic/wp-content/uploads/2025/02/moment_wpa2psp_release.png?resize=1024%2C321&amp;ssl=1\" alt=\"\" width=\"1024\" height=\"321\" srcset=\"https://i0.wp.com/wololo.net/wagic/wp-content/uploads/2025/02/moment_wpa2psp_release.png?resize=1024%2C321&amp;ssl=1 1024w, https://i0.wp.com/wololo.net/wagic/wp-content/uploads/2025/02/moment_wpa2psp_release.png?resize=300%2C94&amp;ssl=1 300w, https://i0.wp.com/wololo.net/wagic/wp-content/uploads/2025/02/moment_wpa2psp_release.png?resize=768%2C241&amp;ssl=1 768w, https://i0.wp.com/wololo.net/wagic/wp-content/uploads/2025/02/moment_wpa2psp_release.png?w=1124&amp;ssl=1 1124w\" sizes=\"(max-width: 1000px) 100vw, 1000px\"></div><p><a href=\"https://www.reddit.com/r/psphacks/comments/1iimnft/wpa2_now_works_on_psp_thanks_to_a_new_plugin/\">This reddit thread</a> by Nebula_NL covers a lot of details on how to install and use the plugin. But the bottom line is: install the latest release of the ARK CFW on your PSP, and take it from there. (Note that you can also manually install the plugin if you’re using another CFW than ARK)</p><p>This is of course the first iteration of this plugin, and it comes with limitations, specifically:</p><ul><li>2.4 GHz Only\n<ul><li>WPA2 support works with 2.4 GHz WiFi.</li><li>If your router uses a single SSID for both 2.4 GHz and 5 GHz, you may need to separate them and connect your PSP to the 2.4 GHz network.</li></ul></li><li>WPA2 AES Only\n<ul><li>Requires WPA2 with AES (AES-CCMP) encryption.</li><li>TKIP is not supported and will not work.</li></ul></li><li>WEP/WPA Compatibility\n<ul><li>While WPA2 is active, WEP and WPA encryption will not work.</li><li>To use WEP or WPA again, disable WPA2, and they will function normally.</li></ul></li><li>WPA2/WPA3 Mixed Mode\n<ul><li>If your router is set to WPA2/WPA3 mixed mode, your PSP may struggle to obtain an IP address.</li><li>Try manually setting the IP address instead of using DHCP in [AUTO] mode.</li></ul></li></ul><h2>Download and install ARK-4 + enable WPA2 Support for the PSP</h2><p><em>* WPA2 was certified in 2004… It’s “new” from the PSP’s perspective which launched the same year and didn’t “need” to support it at the time. WPA3 launched in 2018 but its adoption is taking time</em></p>","contentLength":2772,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43055671"},{"title":"Q2DOS – Quake 2 backported to MS-DOS","url":"https://dk.toastednet.org/Q2DOS/","date":1739583125,"author":"jsheard","guid":150,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43054963"},{"title":"Did Semgrep Just Get a Lot More Interesting?","url":"https://fly.io/blog/semgrep-but-for-real-now/","date":1739580031,"author":"ghuntley","guid":149,"unread":true,"content":"<p><a href=\"https://ghuntley.com/stdlib/\" title=\"\">This bit by Geoffrey Huntley</a> is super interesting to me and, despite calling out that LLM-driven development agents like Cursor have something like a 40% success rate at actually building anything that passes acceptance criteria, makes me think that more of the future of our field belongs to people who figure out how to use this weird bags of model weights than any of us are comfortable with. </p><p>I’ve been dinking around with Cursor for a week now (if you haven’t, I think it’s something close to malpractice not to at least take it — or something like it — for a spin) and am just now from this post learning that Cursor has this <a href=\"https://docs.cursor.com/context/rules-for-ai\" title=\"\">rules feature</a>. </p><p>The important thing for me is not how Cursor rules work, but rather how Huntley uses them. He turns them back on themselves, writing rules to tell Cursor how to organize the rules, and then teach Cursor how to write (under human supervision) its own rules.</p><p>Cursor kept trying to get Huntley to use Bazel as a build system. So he had cursor write a rule for itself: “no bazel”. And there was no more Bazel. If I’d known I could do this, I probably wouldn’t have bounced from the Elixir project I had Cursor doing, where trying to get it to write simple unit tests got it all tangled up trying to make <a href=\"https://hexdocs.pm/mox/Mox.html\" title=\"\">Mox</a> work. </p><p>But I’m burying the lead. </p><p>Security people have been for several years now somewhat in love with a tool called <a href=\"https://github.com/semgrep/semgrep\" title=\"\">Semgrep</a>. Semgrep is a semantics-aware code search tool; using symbolic variable placeholders and otherwise ordinary code, you can write rules to match pretty much arbitary expressions and control flow. </p><p>If you’re an appsec person, where you obviously go with this is: you build a library of Semgrep searches for well-known vulnerability patterns (or, if you’re like us at Fly.io, you work out how to get Semgrep to catch the Rust concurrency footgun of RWLocks inside if-lets).</p><p>The reality for most teams though is “ain’t nobody got time for that”. </p><p>But I just checked and, unsurprisingly, 4o <a href=\"https://chatgpt.com/share/67aa94a7-ea3c-8012-845c-6c9491b33fe4\" title=\"\">seems to do reasonably well</a> at generating Semgrep rules? Like: I have no idea if this rule is actually any good. But it looks like a Semgrep rule?</p><p>What interests me is this: it seems obvious that we’re going to do more and more “closed-loop” LLM agent code generation stuff. By “closed loop”, I mean that the thingy that generates code is going to get to run the code and watch what happens when it’s interacted with. You’re just a small bit of glue code and a lot of system prompting away from building something like that right now: <a href=\"https://x.com/chris_mccord/status/1882839014845374683\" title=\"\">Chris McCord is building</a> a thingy that generates whole Elixir/Phoenix apps and runs them as Fly Machines. When you deploy these kinds of things, the LLM gets to see the errors when the code is run, and it can just go fix them. It also gets to see errors and exceptions in the logs when you hit a page on the app, and it can just go fix them.</p><p>With a bit more system prompting, you can get an LLM to try to generalize out from exceptions it fixes and generate unit test coverage for them. </p><p>With a little bit more system prompting, you can probably get an LLM to (1) generate a Semgrep rule for the generalized bug it caught, (2) test the Semgrep rule with a positive/negative control, (3) save the rule, (4) test the whole codebase with Semgrep for that rule, and (5) fix anything it finds that way. </p><p>That is a lot more interesting to me than tediously (and probably badly) trying to predict everything that will go wrong in my codebase a priori and Semgrepping for them. Which is to say: Semgrep — which I have always liked — is maybe a lot more interesting now? And tools like it?</p>","contentLength":3614,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43054673"},{"title":"A decade later, a decade lost (2024)","url":"https://meyerweb.com/eric/thoughts/2024/06/07/a-decade-later-a-decade-lost/","date":1739574636,"author":"ZeWaka","guid":148,"unread":true,"content":"<p>I woke up this morning about an hour ahead of my alarm, the sky already light, birds calling.&nbsp; After a few minutes, a brief patter of rain swept across the roof and moved on.</p><p>I just lay there, not really thinking.&nbsp; Feeling.&nbsp; Remembering.</p><p>Almost sixteen years to the minute before I awoke, my second daughter was born.&nbsp; Almost ten years to the same minute before, she’d turned six years old, already semi-unconscious, and died not quite twelve hours later.</p><p>So she won’t be taking her first solo car drive today.&nbsp; She won’t be celebrating with dinner at her favorite restaurant in the whole world.&nbsp; She won’t kiss her niece good night or affectionately rag on her siblings.</p><p>Or maybe she wouldn’t have done any of those things anyway, after a decade of growth and changes and paths taken.&nbsp; What would she really be like, at sixteen?</p><p>We will never know.&nbsp; We can’t even guess.&nbsp; All of that, everything she might have been, is lost.</p><p>This afternoon, we’ll visit Rebecca’s grave, and then go to hear her name read in remembrance at one of her very happiest places, <a href=\"https://en.wikipedia.org/wiki/Anshe_Chesed_Fairmount_Temple\">Anshe Chesed Fairmount Temple</a>, for the last time.&nbsp; At the end of the month, the temple will close as part of a merger.&nbsp; Another loss.</p><p>A decade ago, I said that I felt the weight of all the years she would never have, and that they might crush me.&nbsp; Over time, I have come to realize all the things she never saw or did adds to that weight.&nbsp; Even though it seems like it should be the same weight.&nbsp; Somehow, it isn’t.</p><p>I was talking about all of this with a therapist a few days ago, about the time and the losses and their accumulated weight.&nbsp; I said, “I don’t know how to be okay when I failed my child in the most fundamental way possible.”</p><p>“You didn’t fail her,” they said gently.</p><p>“I know that,” I replied. “But I don’t feel it.”</p><p>A decade, it turns out, does not change that.&nbsp; I’m not sure now that any stretch of time ever could.</p>","contentLength":1935,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43054069"},{"title":"If you ever stacked cups in gym class, blame my dad","url":"https://defector.com/if-you-ever-stacked-cups-in-gym-class-blame-my-dad","date":1739573102,"author":"nonoobs","guid":147,"unread":true,"content":"<p>The boxes came from Tokyo: first by tanker, then overland via container truck from a Pacific port, across the Continental Divide, and finally backed into a driveway at the end of a cul-de-sac in a south Denver suburban enclave. This was a neighborhood with Razor scooters dumped in trimmed front lawns. Where family walks with leashed dogs happened down the middle of intentionally curved streets named after long demolished natural landmarks like \"Timbercrest\" and \"Forest Trails.\" Where the HOA (because of course there was an HOA) banned the installation of driveway basketball hoops.</p><p>Receiving industrial freight deliveries, freshly cleared through international customs, probably wasn't explicitly prohibited in the homeowner's handbook. But then, why would it need to be? Nobody would think to bring that kind of commercial chaos into the burgeoning middle-class peace of Castle Pines North in 1998.</p><p>If neighbors peeking behind curtains at the idling 18-wheeler thought to call in a complaint, the husband and wife receiving the delivery didn't notice. They were too busy unloading boxes—more than 800 of them.&nbsp;</p><p>Balancing four at a time on a handcart, it took 200 trips through the open garage door and down the unfinished basement steps. The boxes, holding smaller rectangular packages inscribed with Japanese lettering, were piled to the ceiling. There was enough room left for a skinny aisle leading back up the stairs, and two plastic tables ladened with tape and flat-rate USPS packaging.&nbsp;</p><p>5,800 miles away, a man in middle management at the global toy conglomerate Hasbro must have been very pleased. The delivery represented a small yet unexpected boon.&nbsp;</p><p>Those boxes were dead inventory, wasting space in a nondescript warehouse. They should have been headed for a landfill and a tax write-off. Instead, a Mr. Toshio Takiguchi brokered the export at a ¥1,300 per-unit cost. Not a tidy profit, but no longer a loss on the annual P&amp;L. The remains of a failed business decision disappeared across the ocean. It was a certain Mr. Fox's problem now.</p><p>That problem cost $43,000, a sum that represented the entire life savings of Mr. Fox and his wife, who at that point had been surviving on public-school salaries. Friends and family never really said it out loud, but they were certainly thinking it: <em>This was insane. What about the three kids and that mortgage?&nbsp;</em></p><p>The couple, though, never had a doubt.&nbsp;</p><p>\"He always used to tell me, 'If I had 10,000 of these, I could sell them in a year,'\" Mrs. Fox&nbsp;recalled, 27 years later.</p><p>That's the unabashed confidence you'd expect from any good entrepreneur, especially with the benefit of hindsight. But ask yourself this: Would you, watching this couple unload box after box into their bank-financed home, have bet on this man and his family's future if you knew exactly what he needed to sell?</p><p>Tucked inside those boxes, in nested columns of 12, were 120,000 plastic cups. They were turned upside down, each with a hole drilled through the middle of the base, rendering them useless in terms of a cup's normal, and really only, task.</p><p>The couple's future hinged on accomplishing what the world's second largest toy company could not: convincing thousands of kids that stacking these plastic cups in pre-determined patterns was … . More critically, the couple needed to convince the parents of those kids to actually buy these cups, despite not even being able to drink from them.&nbsp;</p><p>Mr. Takiguchi could breathe a sigh of relief. Mr. and Mrs. Fox had to get to work.</p><div><div><blockquote><p><strong><em>The first thing you need to know about Bob Fox is that he used to be a clown</em></strong> ... <em><strong>The second thing you need to know about my dad is that he was a really, really good clown.&nbsp;</strong></em></p></blockquote></div></div><p>Every few months, in different corners of the internet, someone asks a version of the same question: <em>Why did we all stack plastic cups in elementary school PE class?</em></p><p>You might have even asked it yourself, perhaps after a few beers when a friend turned some Solo Cups upside down, activating one of your mid-aughts memories of sitting cross-legged on a linoleum gym floor, surrounded by the clatter of your classmates piling cups into pyramids.</p><p><a href=\"https://www.speedstacks.com/\" target=\"_blank\" rel=\"noreferrer noopener\">Sport Stacking</a>, as it's officially known (cup stacking and speed stacking as it is colloquially known), exists in the same cloud of millennial nostalgia where you'll find vague recollections of SlamBall and JoJo. It has appeared on pretty much every morning and late show, been a trend piece in both the <a href=\"https://www.nytimes.com/2016/04/01/sports/sport-stacking-speed-cups.html\" target=\"_blank\" rel=\"noreferrer noopener\"></a> and <a href=\"https://www.wsj.com/articles/SB124044351073445491\" target=\"_blank\" rel=\"noreferrer noopener\"></a>, and was once labeled by Glenn Beck as \"<a href=\"https://www.foxnews.com/story/glenn-beck-why-health-care-reform-is-like-cup-stacking\" target=\"_blank\" rel=\"noreferrer noopener\">what’s really wrong with America</a>.\"</p><p>It has been a minor plot line in , Matt LeBlanc's , and ; it's been the major plot line in a 2022 Thai-language film released on Netflix titled <a href=\"https://www.imdb.com/title/tt18357588/\" target=\"_blank\" rel=\"noreferrer noopener\"></a> (100 percent on Rotten Tomatoes). The infamous \"Oh my gosh!\" scream in Skrillex's \"Scary Monsters and Nice Sprites\" was sampled from a <a href=\"https://www.youtube.com/watch?v=j54yGxuk0yo&amp;t=1s\" target=\"_blank\" rel=\"noreferrer noopener\">viral sport stacking video</a> from 2008.</p><p>At its peak, between 2002 and 2011, roughly 5,000 American schools included it as part of their annual curriculum, according to Mr. and Mrs. Fox. That means somewhere between five and eight percent of U.S. adults between the ages of 22 and 35 share the same core memory—and in the ensuing years have asked themselves, their friends, or social media the same question: <em>Why did credentialed educational professionals make us do this ludicrous activity in gym class?</em></p><p>I am, perhaps, the person best suited on the planet to answer this question.&nbsp;Because the answer … is my dad.</p><p>The first thing you need to know about Bob Fox is that he used to be a clown. Not in the figurative, funnyman personality sense. In the literal red-nose, black-eyeliner, juggling-tennis-balls-at-children’s-birthday-parties sense.</p><p>The second thing you need to know about my dad is that he was a <em>really, really good clown</em>.&nbsp;</p><p>He'd scoff at the mental image you probably have of him right now: oversized shoes, cartoonish honks, and bumbling choreography. My dad's act was entirely silent, required immense skill, and was predicated on audience participation. He was equally good at riding a unicycle and convincing the most curmudgeonly dad in the room to leave their back corner and join him onstage to try—and always fail—at blowing up a balloon animal. Kids went bananas. Adults always laughed.&nbsp;</p><p>The San Francisco 49ers hired him to be the walk-around entertainment for their post–Super Bowl ring ceremony in 1995. We used to shut the shades so neighbors didn't think he robbed a bank as he counted the cash he earned during Denver's largest busking festival.</p><p>This was a man who took the unserious very, very seriously.&nbsp;</p><p>As a high school theater teacher, he'd spend 60–80 hours a week building out increasingly elaborate sets for the annual musical. He built a life-sized plant puppet that could actually eat cast members for , and cut a full-sized muscle car in half so it would fit on stage during ; another car was hoisted onto the school's roof to promote the show. Before her bevy of Oscar nominations, Amy Adams was one of his choreographers and students.</p><p>He quit because his wife, Jill, needed him home more to help raise their three children. So he became an elementary school classroom and PE teacher instead, where he would end up teaching hundreds of kids how to ride unicycles and produce an annual show on the blacktop basketball court called KidZircus.</p><p>The first thing you need to know about Jill Fox is that before working as a communications administrator at a school district, she used to be a journalist at a small newspaper, where she was assigned to write a profile about a local clown on \"sabbatical\" from his full-time job.&nbsp;</p><p>The second thing you need to know about Jill Fox is that despite the word \"sabbatical\" doing a generous amount of euphemistic work in her final published piece, she married that unemployed clown.</p><p>This was a woman who was very, very good at seeing—and supporting—the potential in the crazy.</p><div><div><blockquote><p><strong><em>They had to figure out how to tap into the supply chain of global toy conglomerates. Fortunately, they had a guy: Uncle Johnny.</em></strong></p></blockquote></div></div><p>It took them 10 months to sell the 10,000 sets of 12 cups.&nbsp;</p><p>Kids in south Denver, it turns out, went absolutely nuts over this new phenomenon called \"cup stacking.\" That's mostly because my dad figured out the one thing Hasbro did not: The level of interest in the activity hinged almost exclusively on the enthusiasm and skill level of a real-life teacher. Without that, it was just inanimate plastic ephemera sitting on a shelf.</p><p>The basic rules take about 15 minutes to learn. Like a track meet, the sport is built on completing different \"distances\" as fast as you can. The shortest, and simplest, is called the 3-3-3. Envision each one of those 3's as a nested column of cups. You start on one side and \"upstack\" the first 3 into a pyramid, then move to the middle, and then the last 3. Then you return to where you started, and \"downstack\" them back into columns in the same order. The 3-6-3 has the same principle, but with a pyramid of six cups in the middle. The \"Cycle,\" is the sport's primetime event, starting with the 3-6-3, morphing into a 6-6, and ending with a 1-10-1.</p><p>If you skimmed over that clunky paragraph, you've proved my dad's foundational epiphany: You really need to see it to buy in. In fact, scrap reading this for a few seconds (that's all it will take) and watch this video instead.</p><p>Place a set of these cups in the corner of a room or on a toy shelf with paper instructions, and you might earn five minutes of an 8-year-old's frenzied attention. Put that same 8-year-old on the gym floor in front of a professionally trained clown with a passion for juggling, and they will be utterly hooked.</p><p>A brief digression on nomenclature: The sport was known as \"cup stacking\" until 2005, when my parents had the savvy to officially change the name to \"sport stacking.\" Why? 1) Because it sounds way cooler, and if enough people call it a sport then it must damn well be one. 2) The phrase \"cup stacking\" out of context evokes toddlers playing with blocks, a vibe they wanted to avoid. Confusingly, you might have also seen it referenced as \"speed stacking,\" after the company they eventually founded, Speed Stacks. They strategically eschewed this label to avoid the fate of Roller Blades, Frisbee, and Kleenex, all formerly good standing trademarks, until you lot ruined everything. </p><p>Except for this early-stage reference, I'll be calling it sport stacking hereafter so as to avoid a grumpy phone call from my dad (he'll probably still call about my use of \"damn,\" though). If you have a problem with that, consider the last time you went berserk over a nine-darter or screamed at the Swedish curling team during the Olympics. As my dad likes to say, there used to be a man trying to convince the world that tossing balls made from dried cow skin into retrofitted peach baskets was fun—and you all bought in.</p><p>It is important to note that my dad did not actually invent sport stacking. Credit goes to a group of bored kids at a Boys and Girls Club in Oceanside, Calif., in the early 1980s. They'd been given a stack of paper cups, and told to figure out a game that didn't involve messy liquid. Under the guidance of a program director named Wayne Godinet, both the rules and equipment evolved. He is responsible for the sport's first major innovation: He drilled a hole through the base of hard plastic cups to reduce air friction and prevent sticking. The California group's high-water mark came on Nov. 2, 1990, when they appeared on <em>The Tonight Show with Johnny Carson</em>. Among the millions watching that night, from his bed in a south Denver suburb: a clown and future PE teacher who thought it looked a bit like upside-down juggling.</p><p>Hasbro must have been watching, too. Perhaps chasing the Hoola Hoop and Pogs high of the '80s, the company scooped up a license to sell \"Kup Stax,\" popping sets in a rectangular plastic sleeve on toy store shelves around the world. Instead of becoming a fad, the product moved to the clearance rack. Someone in middle management was probably scolded. Manufacturing ceased.&nbsp;</p><p>In 1995, my dad attended a physical education development workshop to give new teachers a dozen ideas on how to keep kids occupied, exercised, and docile. The classics were all there: four-wheeled square scooters designed to give 80 percent of users elbow burn, dodgeballs primed to pop kids like me in the face, that large circus tent you toss above your head until it temporarily inflates so you can sit under it for a few seconds. So were the cups.&nbsp;</p><p>He brought them home and taught his kids. I was 4, my brother 6, our sister 9. We not only fell in love with them, we got good—. We weren't outliers. Among an elementary school of 500 students, 250 signed up for an afterschool program to keep stacking. My mom drove to every Toys \"R\" Us and Walmart within a 50-mile radius. She bought every set of Kup Stax she could find. They were always discounted, tucked in a back corner.</p><p>The local supply ran dry as my parents hosted workshops. Demand started to skyrocket from other PE teachers. My parents needed to go upstream. They had to figure out how to tap into the supply chain of global toy conglomerates. Fortunately, they had a guy: .</p><p>Now 64 with a Colonel Sanders goatee and passion for intricate leather carving, my dad's brother has been at certain points in his life: a professor at the Ringling Bros. and Barnum &amp; Bailey Clown College; a street mime in San Diego; a director of&nbsp;a Las Vegas magic show, performed entirely on ice; and a consultant for Japan's oldest and largest circus. If you need to find a man in middle management at Hasbro's Tokyo corporate office, you call Uncle Johnny.</p><p>The deal was struck. The shipment arrived. And the cups, rather magically, disappeared from our basement.</p><p>By 1998, Bob Fox was a dealer with no product and an increasingly addicted customer base. There was only one logical next step: Transition from distribution to fabrication.</p><p>He did make a final good-faith effort to partner with the sport's originator, Wayne Godinet, offering to purchase $20,000 worth of product. It was almost a third of the profit earned from reselling the Japanese shipment. Godinet sent back two sample sets with a bill for the cost of goods and shipping.</p><p>In a similar vein, Nike was founded in 1964 only after a running shoe company called Onitsuka lost interest in partnering with a recent Oregon track grad named Phil Knight. While his shoe empire was born between the grooves of a waffle iron, Bob and Jill's cup empire was sketched on the back of a Fresh Fish Co. paper placemat.</p><p>Speed Stacks LLC was incorporated in December 1998. My parents quit their full-time public school jobs in June 2000.&nbsp;</p><p>This was to be an official test of a core tenet of the American Dream: With enough passion and even more prodigious work ethic, you can turn a ludicrous idea into a successful business. To get started, they just needed four things.</p><p>First: a mold to mass produce the cups. It required $20,000 and overcoming the absolute befuddlement of executives at a Denver plastics manufacturer who did not understand the  to include three small holes at the base. As each cup came off the line, our family would inspect the shape; minor defects in its roundness caused sticking. Nearly every cup in the first run had to be tossed out for deformities.</p><p>Second: a nylon and mesh cup-carrying bag. Those were sewn in the back basement of a Vietnamese immigrant–owned textile company. We bagged each set of 12 by hand, my parents staying up until 2:00 in the morning to fulfill orders after working full school days. Bob wasn't satisfied unless the logo of every cup perfectly faced forward.</p><p>Third: to hit the road. Speed Stack's first tagline was \"See it! Believe it! Teach it!\" My parents meant it: They knew that success was linearly related to the number of PE teachers who witnessed the sport in person. Our family of five put almost 100,000 miles on our 1997 maroon Suburban in a little over four years.</p><p>Fourth: kids who could stack the cups. . For some reason, all three of the Fox progeny developed both the interest and intrinsic skill to do just that.</p><div><div><blockquote><p><strong><em>At a booth in hotel conference halls and city convention centers, we'd stack for hours, drawing crowds spread three and four rows deep, often to the annoyance of the dodgeball or shuttlecock purveyors next door.&nbsp;</em></strong></p></blockquote></div></div><p>Legendary ring announcer Michael Buffer’s voice was always our music cue. <em>\"Ladies and gentlemen, welcome to the main event!\"</em></p><p>It would blast over portable speakers on either side of a gym floor. Emmy, my older sister, would lead us out from a hidden corner, followed by my brother, Brennan, then me: a 7-year-old with Coke-bottle glasses, immensely satisfied by the fact that hundreds of eyes were watching my every move.</p><p>We stopped when we reached separate tables spread evenly across our makeshift stage, usually under the basketball hoop. We stood still to let the tempo build.&nbsp;</p><p><em>\"Let’s get ready to rumble!\"</em></p><p>The synths would drop, and we would commence stacking plastic cups. Faster and with more skill than the students and teachers in Amarillo or Ft. Lauderdale or Butzbach, Germany, or Copenhagen, Denmark, could ever think possible.&nbsp;</p><p>Our family performed hundreds of school assemblies in almost every corner of the country (and some overseas). The 30-minute spectacle was choreographed specifically to blow the minds of kids between the ages of 7 and 14 as quickly as possible. This wasn't a talk from your fire chief about safety, or puppets teaching you the value of sharing. We humiliated principals and popular teachers by making them race us. There was a fabricated jacket with holes cut in the back that we fitted onto a volunteer, then stuck our arms through the sleeves to make it appear like they were magically adept (performed to the  soundtrack). The finale was a choreographed stacking routine, set to \"Dueling Banjos\" from .</p><p>But a school-by-school roadshow wasn't a scalable business model. So we went to the nexus of physical education sweatsuitdom: state and national teacher conventions. At a booth in hotel conference halls and city convention centers, we'd stack for hours, drawing crowds spread three and four rows deep, often to the annoyance of the dodgeball or shuttlecock purveyors next door.&nbsp;</p><p>It's most likely that you learned how to sport stack because your teacher, with a lanyard badge bouncing over her multi-colored windbreaker on her way to get a free muffin from the guys who sell tug-o-war ropes, stopped in her tracks in the back corner of Exhibit Hall B at an exurban Renaissance hotel. She would watch as our hands manipulated dishware so fast it blurred.</p><p>If my dad was adept at putting on a good show, my mom was equally adept at corralling the press. Her journalism and PR–honed chops put sport stacking in front of millions, from the D-block of local newscasts to 30 Rock Plaza during the .&nbsp;</p><p>That's how I found myself chatting with a shirtless Simon Cowell in the makeup room before we both appeared on Ellen DeGeneres's show, taught Tiki Barber the basics of the 3-3-3, and tried to convince a baffled Michael Caine in the green room of <em>LIVE with Regis and Kelly</em> that yes, indeed, kids really do stack plastic cups for fun.</p><p>All press, to my parents, was good. My dad was absolutely thrilled when Glenn Beck spent four minutes of his daily Fox News monologue staring directly into the camera, railing against the dangers of stacking cups.</p><p>\"We can't fix our country by keeping our children weak,\" Beck sputtered, roughly two minutes in. \"They need to have spines. They need to get hit in the face a few times with a ball, you know what I mean? They have to learn how to live with and thrive on past failures.\"</p><p>Brands soon took advantage of sport stacking's essential power: No matter the context, it attracts near-instant attention. In 2005, I appeared in a <a href=\"https://www.youtube.com/clip/UgkxwybLaGciSxQJgS1FKh-3PeJwa9xtXtN8\" target=\"_blank\" rel=\"noreferrer noopener\">nationwide Comcast commercial</a> for high speed internet. FritoLay shut down part of Times Square to feature our stacking talents as it launched Stax, a competitor to Pringles. A beverage company in England flew a dozen of us to London to help launch an abomination of a drink called <a href=\"https://www.youtube.com/watch?v=eelE8tHEScM\" target=\"_blank\" rel=\"noreferrer noopener\">Freekee Soda</a>. Main ingredient? Carbonated milk. (Did I pretend to enjoy drinking that carbonated milk so as to not piss off any of the execs helping to pay for my college education? Obviously. But it is a cursed flavor.)</p><p>Perhaps the only media my parents turned down was an appearance on the infamous reality show . The producers, naturally, presumed the scions of a ludicrous gym activity would have some weird baggage to mine for the masses.&nbsp;</p><p>Unfortunately, despite the cups, we were pretty normal.</p><div><div><blockquote><p><strong><em>To stack as fast as you possibly can in a World Championship is to strike a balance between fluidity and chaos.</em></strong></p></blockquote></div></div><p>It was the Germans who made everything more serious.</p><p>They arrived at the 2004 World Sport Stacking Championships in matching flag-inspired sweatsuits. Multiple coaches would analyze everything from hand-tag efficiency during the four-person relay event to the mental routines of stackers before their individual competition.</p><p>Sport stacking, I believe, grew into a minor phenomenon for three reasons: 1) It's visually arresting, 2) it's easy to learn, and 3) competing against the clock is incredibly addicting.</p><p>Media buzz and schoolteachers kindled the first two. But my dad's magnum opus—the reason the sport didn't wither in the way of skip ball and snake boards—was that he (with the help of the 20 employees at the burgeoning HQ) built the infrastructure and equipment to spur global competition.&nbsp;</p><p>The sport's growth coincided with two of my dad's innovations: the StackMat, a patented self-timing device that allowed kids to practice on their own for hours, aiming to trim hundredths of a second off their best times; and the World Sport Stacking Association, a governing body to codify the rules and serve as the keeper of world, national, and local records.</p><p>In 1997, 250 kids were hand-timed with stop watches at the first Colorado State Championship.&nbsp;By 2007, ESPN aired an <a href=\"https://www.youtube.com/watch?v=xm8EKnl4ZDQ\" target=\"_blank\" rel=\"noreferrer noopener\">hourlong David Lloyd–hosted special</a> of the World Championships, featuring more than 1,000 competitors from seven countries (re-aired in 2020 during their pandemic \"The Ocho\" promotion).&nbsp;</p><p>Like everything in his life, my dad choreographed a spectacle. He ordered a three-story banner to hang behind garbage can–sized cups that served as center stage. The competition floor was arranged with dozens of tables, all marked with laser-lined tape to demarcate relay boundaries.</p><p>During the final \"Stack of Champions,\" the top competitors (and relay teams) from each event competed under the scrutiny of spotlights, three officials, an instant replay camera, and hundreds of spectators. In individual events, you're allotted two warmups and three tries. Relays are conducted head-to-head in teams of four.</p><p>For a few years, I was among those finalists.&nbsp;</p><p>To stack as fast as you possibly can in a World Championship is to strike a balance between fluidity and chaos. Push too hard and the cups tumble. Pull back and you'll lose by thousandths of a second.</p><div><div><figure><figcaption>A relay race in the Stack of Champions, in which I (the third stacker on the left team) stumble at the start, allowing my brother (the last stacker on the right team) to beat us by two-hundredths of a second.</figcaption></figure></div></div><p>For those moments, you exist at the outer physical boundary of human biology. When performing at your peak, the cups feel less like they're being stacked and more like they're being sprayed.&nbsp;</p><p>In 2001, the world record for sport stacking's marquee event, the Cycle, was 7.43 seconds. It was held by my sister. At the time, most people assumed a sub-seven-second time was physically impossible. The pattern requires more than 40 separate moves. At those speeds, hands make micro-adjustments faster than the brain can register. Her time stood for nearly four years.</p><p>In 2025, the world record for the cycle is 4.739 seconds.&nbsp;</p><p>Please understand: I know this whole endeavor is silly, that it's worthy of your slight mockery and general patina of confusion. But also understand that my dad created a culture in which German coaches passed strategic tips to Australian competitors. Where Japanese teenagers became pen pals with suburban Texans. Where nerves collapsed faster than the cups. Where kids and adults shrieked with joy over millisecond improvements. Where tension and drama and friendship mingled with the clattering cacophony of sliding and tapping plastic (there really is no sound like the one at these competitions).&nbsp;</p><p>Sport stacking had broad exposure in both mainstream and weird places. But it had a deep impact in a much smaller community. It changed lives.</p><div><div><blockquote><p><strong><em>You've probably heard Rachael’s voice. Her effusive reaction on a stacking YouTube video meant for her small group of friends is behind the iconic \"YES, OH MY GOSH!\" scream, sampled in one of EDM's most mainstream hits, \"Scary Monsters and Nice Sprites,\" by Skrillex.</em></strong></p></blockquote></div></div><p>Milo Ferguson discovered sport stacking in first-grade PE class.&nbsp;</p><p>\"My teacher was the final boss of butch lesbians. That's the only way I know how to describe her,\" Ferguson, now a 23-year-old co-founder of an independent animation studio, said. Their teacher loved competition and was beloved by her students, exactly the archetype to stop at a conference booth and believe in a quirky new cup-centric educational trend.</p><p>Rachael Nedrow, now a 29-year-old product manager at Amazon, first saw the sport while scrolling YouTube when she was 11. She pulled paper cups from the kitchen drawer to try and mimic the movement.</p><p>Both became obsessed, quickly. Though for different reasons.</p><p>\"I was never the fastest kid. I was always kind of chubby. I was much more the creative person than an athletic one,\" Ferguson said. \"Sport stacking was about hand-eye coordination more than strength. It was intricate. Delicate.\" For the first time, they were excited to attend PE class.</p><p>Nedrow, an accomplished tennis player, was intrigued by the self-improvement and rigid strictures of the clock. She bought an official set of Speed Stacks and started logging her progress on her own YouTube channel.</p><p>\"My first competition was at a local church,\" Nedrow said. \"I did terribly, but I still won.\"</p><p>Despite differing motivations, Ferguson and Nedrow's paths to competitive sport stacking mirror each other. Friends weren't interested, so they went looking for a community online and at competitions.&nbsp;</p><p>For the thousand kids that congregated on the arena floor at each World Championships, like Ferguson and Nedrow, the sentiment was common. They had found  people. They fit in, sometimes for the first time in their life.&nbsp;</p><p>There were future college athletes and kids with autism. There were rugby fans from New Zealand (riffing off their national team, they called themselves the \"All Stacks\") and South Koreans who had never been to the United States.&nbsp;</p><p>Roll your eyes, but my dad loved to say that the sport only helped build \"positive pyramids.\" Spend a few hours watching kids pat each other on the back after a fumbled cup, or earn a hug for achieving a new personal best, and you'd buy into the platitude too.</p><p>Compared to other top-level stackers, Nedrow and Ferguson's experiences only differ in one way.&nbsp;</p><p>You've probably heard Rachael's voice. Her effusive reaction on a stacking YouTube video meant for her small group of friends is behind the iconic \"YES, OH MY GOSH!\" scream, sampled in one of EDM's most mainstream hits, \"<a href=\"https://www.youtube.com/watch?v=WSeNSzJ2-Jw\" target=\"_blank\" rel=\"noreferrer noopener\">Scary Monsters and Nice Sprites</a>,\" by Skrillex. Between Spotify and YouTube, it has more than 500 million streams.</p><p>And you probably know Ferguson's dad, Craig, the comedian and host of <em>The Late Late Show with Craig Ferguson</em> from 2005 to 2014.</p><p>Nedrow's collision with virality gave her backstage passes to several Skrillex concerts and the greatest fodder for \"Two Truths and a Lie\" of all time. But sport stacking also gave her something else she wasn’t expecting: a wide group of online friends.</p><p>\"I don't think I would have taken stacking so far if it wasn't for the online community,\" Nedrow said. \"When you are doing anything kind of competitive, it seems like it's much better when you are doing it with people. I really loved the aspect of kids commenting on my videos, saying they started stacking because of me. What greater pleasure can you get than inspiring other people to do what you love the most?\"</p><p>Sport stacking gave Ferguson inclusion and validation. But perhaps more important than what it gave them is what it gave their parents. While Craig and his ex-wife Sascha had been separated for a few years by the time their kid started competing, both fully committed to supporting this weird, wholesome obsession. Sascha helped Milo learn how to breathe and center themselves before starting to stack. And she supplied an ever-growing collection of stacking equipment, stored in a dedicated room in their Southern California home.</p><p>To see what sport stacking gave Craig, you need to watch his show <a href=\"https://www.youtube.com/watch?v=9Wjk0PkpWco\" target=\"_blank\" rel=\"noreferrer noopener\">from April 20, 2009</a>. He spends four minutes—more than half of the entire monologue—bragging about Milo. Beneath the scripted jokes and of-the-era references (Octomom is mentioned twice), you see a guy just genuinely proud of his kid. He's like any neighbor, going off a bit too effusively about the weekend's peewee football game or math test.&nbsp;</p><p>Except this was done for millions. And it was about ... cups.&nbsp;</p><div><div><blockquote><p><strong><em>\"I wanted to give kids, no matter their athletic ability, the opportunity for success. It gave them something new and different. And it created a community. It brought kids around the world together.\"</em></strong></p></blockquote></div></div><p>Sport stacking gave different things to a lot of people.</p><p>For a few, it genuinely improved their life. College funds were paid through YouTube viewership revenue and small brand endorsements. Children with autism and special needs learned, practiced, competed, and socialized with others for the first time.&nbsp;</p><p>For me and my siblings, it gave us a stable home, trips to a dozen countries, and some excellent college essay material. My sister, Emmy, went on to play basketball for four years at the University of Minnesota, was drafted into the WNBA by the Minnesota Lynx, and then played professionally overseas with Sheryl Swoopes. My brother Brennan played D-III college football and turned into a mechanical engineer at a global cosmetics company. I turned into a fairly unathletic writer.</p><p>For my parents, it gave them an early retirement. A sometimes-operational 1957 VW Bug and an obsession with growing ever-larger pumpkins occupied my dad, while training to run another marathon at age 70 became a focus for my mom. They left their active roles at Speed Stacks in 2015, leaving control to some of its earliest employees. Programs are still active in thousands of schools around the world.</p><p>\"I was motivated to spread sport stacking for the same reason I taught my students how to juggle or unicycle,\" my dad recalled, nearly 10 years into retirement. \"I wanted to give kids, no matter their athletic ability, the opportunity for success. It gave them something new and different. And it created a community. It brought kids around the world together. And believe it or not, that all happened because of a couple million plastic cups.\"</p><p>For some of you reading this, sport stacking gave you an identical memory.&nbsp;A cross-legged seat on a linoleum gym floor. The hush from the principal. The music crescendoing into ' most iconic synth riff. The sound of cups, stacking at lightning speed. You knew, in that moment, that you weren't in for another monotonous few hours at school. Your day was about to rock.&nbsp;</p><p>For that, you can thank my dad.</p>","contentLength":31508,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43053908"},{"title":"Complex dynamics require complex solutions","url":"https://mathstodon.xyz/@tao/113873092369347147","date":1739570733,"author":"ckemere","guid":145,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43053625"},{"title":"The Iconic 3DBenchy Enters the Public Domain","url":"https://www.nti-group.com/home/information/news/3dbenchy/","date":1739569169,"author":"kotaKat","guid":143,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43053350"},{"title":"Sunsetting Create React App","url":"https://react.dev/blog/2025/02/14/sunsetting-create-react-app","date":1739560595,"author":"acemarke","guid":142,"unread":true,"content":"<div><p>Today, we’re deprecating <a href=\"https://create-react-app.dev/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Create React App</a> for new apps, and encouraging existing apps to migrate to a <a href=\"https://react.dev/learn/creating-a-react-app\">framework</a>. We’re also providing docs for when a framework isn’t a good fit for your project, or you prefer to start by <a href=\"https://react.dev/learn/building-a-react-framework\">building a framework</a>.</p></div><p>When we released Create React App in 2016, there was no clear way to build a new React app.</p><p>To create a React app, you had to install a bunch of tools and wire them up together yourself to support basic features like JSX, linting, and hot reloading. This was very tricky to do correctly, so the <a href=\"https://github.com/react-boilerplate/react-boilerplate\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">community</a><a href=\"https://github.com/kriasoft/react-starter-kit\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">created</a><a href=\"https://github.com/petehunt/react-boilerplate\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">boilerplates</a> for <a href=\"https://github.com/gaearon/react-hot-boilerplate\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">common</a><a href=\"https://github.com/erikras/react-redux-universal-hot-example\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">setups</a>. However, boilerplates were difficult to update and fragmentation made it difficult for React to release new features.</p><p>Create React App solved these problems by combining several tools into a single recommended configuration. This allowed apps a simple way to upgrade to new tooling features, and allowed the React team to deploy non-trivial tooling changes (Fast Refresh support, React Hooks lint rules) to the broadest possible audience.</p><p>This model became so popular that there’s an entire category of tools working this way today.</p><h2>Deprecating Create React App </h2><p>Although Create React App makes it easy to get started, <a href=\"https://react.dev/blog/2025/02/14/sunsetting-create-react-app#limitations-of-create-react-app\">there are several limitations</a> that make it difficult to build high performant production apps. In principle, we could solve these problems by essentially evolving it into a <a href=\"https://react.dev/blog/2025/02/14/sunsetting-create-react-app#why-we-recommend-frameworks\">framework</a>.</p><p>However, since Create React App currently has no active maintainers, and there are many existing frameworks that solve these problems already, we’ve decided to deprecate Create React App.</p><p>Starting today, if you install a new app, you will see a deprecation warning:</p><div translate=\"no\" dir=\"ltr\"><div><div><div>create-react-app is deprecated.\n\nYou can find a list of up-to-date React frameworks on react.dev\nFor more info see: react.dev/link/cra\n\nThis error message will only be shown once per install.</div></div></div></div><p>We recommend <a href=\"https://react.dev/learn/creating-a-react-app\">creating new React apps</a> with a framework. All the frameworks we recommend support client-only SPAs, and can be deployed to a CDN or static hosting service without a server.</p><p>For existing apps, these guides will help you migrate to a client-only SPA:</p><p>Create React App will continue working in maintenance mode, and we’ve published a new version of Create React App to work with React 19.</p><p>If your app has unusual constraints, or you prefer to solve these problems by building your own framework, or you just want to learn how react works from scratch, you can roll your own custom setup with React using Vite or Parcel.</p><div><div><div><p>We provide several Vite-based recommendations.</p><p>React Router v7 is a Vite based framework which allows you to use Vite’s fast development server and build tooling with a framework that provides routing and data fetching. Just like the other frameworks we recommend, you can build a SPA with React Router v7.</p><p>Just like Svelte has Sveltekit, Vue has Nuxt, and Solid has SolidStart, React recommends using a framework that integrates with build tools like Vite for new projects.</p></div></div></div><h2>Limitations of Create React App </h2><p>Create React App and build tools like it make it easy to get started building a React app. After running <code dir=\"ltr\">npx create-react-app my-app</code>, you get a fully configured React app with a development server, linting, and a production build.</p><p>For example, if you’re building an internal admin tool, you can start with a landing page:</p><div dir=\"ltr\"><div><div><div><pre><code><div>Welcome to the Admin Tool!</div></code></pre></div></div></div></div><p>This allows you to immediately start coding in React with features like JSX, default linting rules, and a bundler to run in both development and production. However, this setup is missing the tools you need to build a real production app.</p><p>Most production apps need solutions to problems like routing, data fetching, and code splitting.</p><p>Create React App does not include a specific routing solution. If you’re just getting started, one option is to use  to switch between routes. But doing this means that you can’t share links to your app - every link would go to the same page - and structuring your app becomes difficult over time:</p><div dir=\"ltr\"><div><div><div><pre><code><div> = </div><div> ===  &amp;&amp; </div><div> ===  &amp;&amp; </div></code></pre></div></div></div></div><p>This is why most apps that use Create React App solve add routing with a routing library like <a href=\"https://reactrouter.com/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">React Router</a> or <a href=\"https://tanstack.com/router/latest\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Tanstack Router</a>. With a routing library, you can add additional routes to the app, which provides opinions on the structure of your app, and allows you to start sharing links to routes. For example, with React Router you can define routes:</p><div dir=\"ltr\"><div><div><div><pre><code><div> = </div><div>=</div></code></pre></div></div></div></div><p>With this change, you can share a link to  and the app will navigate to the dashboard page . Once you have a routing library, you can add additional features like nested routes, route guards, and route transitions, which are difficult to implement without a routing library.</p><p>There’s a tradeoff being made here: the routing library adds complexity to the app, but it also adds features that are difficult to implement without it.</p><p>Another common problem in Create React App is data fetching. Create React App does not include a specific data fetching solution. If you’re just getting started, a common option is to use  in an effect to load data.</p><p>But doing this means that the data is fetched after the component renders, which can cause network waterfalls. Network waterfalls are caused by fetching data when your app renders instead of in parallel while the code is downloading:</p><div dir=\"ltr\"><div><div><div><pre><code><div> = </div><div>      ..</div><div>      .</div><div>.=..</div></code></pre></div></div></div></div><p>Fetching in an effect means the user has to wait longer to see the content, even though the data could have been fetched earlier. To solve this, you can use a data fetching library like <a href=\"https://react-query.tanstack.com/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">React Query</a>, <a href=\"https://swr.vercel.app/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">SWR</a>, <a href=\"https://www.apollographql.com/docs/react\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Apollo</a>, or <a href=\"https://relay.dev/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Relay</a> which provide options to prefetch data so the request is started before the component renders.</p><p>These libraries work best when integrated with your routing “loader” pattern to specify data dependencies at the route level, which allows the router to optimize your data fetches:</p><div dir=\"ltr\"><div><div><div><pre><code><div> = </div><div> = .</div><div>.=..</div></code></pre></div></div></div></div><p>On initial load, the router can fetch the data immediately before the route is rendered. As the user navigates around the app, the router is able to fetch both the data and the route at the same time, parallelizing the fetches. This reduces the time it takes to see the content on the screen, and can improve the user experience.</p><p>However, this requires correctly configuring the loaders in your app and trades off complexity for performance.</p><p>Another common problem in Create React App is <a href=\"https://www.patterns.dev/vanilla/bundle-splitting\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">code splitting</a>. Create React App does not include a specific code splitting solution. If you’re just getting started, you might not consider code splitting at all.</p><p>This means your app is shipped as a single bundle:</p><p>But for ideal performance, you should “split” your code into separate bundles so the user only needs to download what they need. This decreases the time the user needs to wait to load your app, by only downloading the code they need to see the page they are on.</p><div dir=\"ltr\"><div><div><div><pre><code></code></pre></div></div></div></div><p>One way to do code-splitting is with . However, this means that the code is not fetched until the component renders, which can cause network waterfalls. A more optimal solution is to use a router feature that fetches the code in parallel while the code is downloading. For example, React Router provides a  option to specify that a route should be code split and optimize when it is loaded:</p><div dir=\"ltr\"><div><div><div><pre><code><div> = </div></code></pre></div></div></div></div><p>Optimized code-splitting is tricky to get right, and it’s easy to make mistakes that can cause the user to download more code than they need. It works best when integrated with your router and data loading solutions to maximize caching, parallelize fetches, and support <a href=\"https://www.patterns.dev/vanilla/import-on-interaction\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">“import on interaction”</a> patterns.</p><p>These are just a few examples of the limitations of Create React App.</p><p>Once you’ve integrated routing, data-fetching, and code splitting, you now also need to consider pending states, navigation interruptions, error messages to the user, and revalidation of the data. There are entire categories of problems that users need to solve like:</p><div><ul></ul><ul></ul><ul></ul></div><p>Solving each of these problems individually in Create React App can be difficult as each problem is interconnected with the others and can require deep expertise in problem areas users may not be familiar with. In order to solve these problems, users end up building their own bespoke solutions on top of Create React App, which was the problem Create React App originally tried to solve.</p><h2>Why we Recommend Frameworks </h2><p>Although you could solve all these pieces yourself in a build tool like Create React App, Vite, or Parcel, it is hard to do well. Just like when Create React App itself integrated several build tools together, you need a tool to integrate all of these features together to provide the best experience to users.</p><p>This category of tools that integrates build tools, rendering, routing, data fetching, and code splitting are known as “frameworks” — or if you prefer to call React itself a framework, you might call them “metaframeworks”.</p><p>Frameworks impose some opinions about structuring your app in order to provide a much better user experience, in the same way build tools impose some opinions to make tooling easier. This is why we started recommending frameworks like <a href=\"https://nextjs.org/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Next.js</a>, <a href=\"https://reactrouter.com/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">React Router</a>, and <a href=\"https://expo.dev/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Expo</a> for new projects.</p><p>Frameworks provide the same getting started experience as Create React App, but also provide solutions to problems users need to solve anyway in real production apps.</p><div><div><div><h4>Server Rendering is not just for SEO </h4><p>A common misunderstanding is that server rendering is only for <a href=\"https://developer.mozilla.org/en-US/docs/Glossary/SEO\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">SEO</a>.</p><p>While server rendering can improve SEO, it also improves performance by reducing the amount of JavaScript the user needs to download and parse before they can see the content on the screen.</p><p>This is why the Chrome team <a href=\"https://web.dev/articles/rendering-on-the-web\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">has encouraged</a> developers to consider static or server-side render over a full client-side approach to achieve the best possible performance.</p></div></div></div>","contentLength":9624,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43051961"},{"title":"The largest sofa you can move around a corner","url":"https://www.quantamagazine.org/the-largest-sofa-you-can-move-around-a-corner-20250214/","date":1739546645,"author":"abe94","guid":141,"unread":true,"content":"<p>In 1992, Joseph Gerver of Rutgers University proposed a particularly clever curved shape with an area of approximately 2.2195. Mathematicians suspected that it answered Moser’s question. But they couldn’t prove it.</p><p>Now a young postdoctoral researcher has. In a 119-page paper, <a href=\"https://jcpaik.github.io/\">Jineon Baek</a> of Yonsei University in Seoul <a href=\"https://arxiv.org/abs/2411.19826\">showed that Gerver’s sofa</a> is the largest shape that can successfully pass through the hallway.</p><p>The paper isn’t just noteworthy for resolving a 60-year-old problem. It has also garnered attention because mathematicians had expected any eventual proof of the conjecture to require a computer. Baek’s proof did not. Mathematicians now hope that the techniques he used might help them make progress on other kinds of optimization problems.</p><p>Perhaps even more intriguing, Gerver’s sofa, unlike more familiar shapes, is defined in such a way that its area can’t be expressed in terms of known quantities (such as π or square roots). But for the moving sofa problem — a very simple question — it’s the optimal solution. The result illustrates that even the most straightforward optimization problems can have counterintuitively complicated answers.</p><p>The first major progress on the moving sofa problem came in 1968, just two years after Moser posed it. John Hammersley connected two quarter circles with a rectangle, then cut a semicircle out of it to form a shape that resembled an old telephone. Its area was π/2 + 2/π, or approximately 2.2074.</p><p>Hammersley also showed that any solution to the problem could have an area of at most $latex&nbsp; 2\\sqrt{2}$, or about 2.8284.</p><p>A couple of years later, Gerver, then a graduate student at the University of California, Berkeley, learned about the question. “Another grad student told me this problem and challenged me to find the answer,” he said. “He never said anything about it being unsolved. So I thought about it for a few days. Finally, I came back to him and said ‘OK, I give up. What’s the solution?’ And he refused to tell me! He said, ‘Just keep thinking about it. You’ll get it.’”</p><p>Gerver thought about it sporadically over the next 20 years. But it wasn’t until 1990, when he mentioned it to the renowned mathematician <a href=\"https://www.quantamagazine.org/john-conway-solved-mathematical-problems-with-his-bare-hands-20200420/\">John Conway</a>, that he found out it had never been solved. The realization motivated him to spend more time with the problem, and he soon came up with a potential solution.</p><p>Gerver’s sofa looked a lot like Hammersley’s telephone, but it was far more complicated to describe, consisting of 18 different pieces. (As it turned out, Ben Logan, an engineer at Bell Labs, independently uncovered the same shape but never published his work.) Some of the pieces were simple line segments and arcs. Others were more exotic, and tougher to describe.</p><p>Still, Gerver suspected that this complicated shape was optimal: It possessed many features that mathematicians expected the optimal sofa to have, and he was able to prove that making small perturbations to its contours wouldn’t yield a suitable shape with a bigger area.</p>","contentLength":3034,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43049251"},{"title":"Show HN: Transform your codebase into a single Markdown doc for feeding into AI","url":"https://tesserato.web.app/posts/2025-02-12-CodeWeaver-launch/index.html","date":1739539403,"author":"tesserato","guid":135,"unread":true,"content":"<p>CodeWeaver is a command-line tool designed to weave your codebase into a single, easy-to-navigate Markdown document. It recursively scans a directory, generating a structured representation of your project's file hierarchy and embedding the content of each file within code blocks. This tool simplifies codebase sharing, documentation, and integration with AI/ML code analysis tools by providing a consolidated and readable Markdown output.\nThe output for the current repository can be found <a href=\"https://github.com/tesserato/CodeWeaver/blob/main/codebase.md\">here</a>.</p><ul><li><strong>Comprehensive Codebase Documentation:</strong> Generates a Markdown file that meticulously outlines your project's directory and file structure in a clear, tree-like format.</li><li> Embeds the complete content of each file directly within the Markdown document, enclosed in syntax-highlighted code blocks based on file extensions.</li><li>  Utilize regular expressions to define ignore patterns, allowing you to exclude specific files and directories from the generated documentation (e.g., , build artifacts, specific file types).</li><li> Choose to save lists of included and excluded file paths to separate files for detailed tracking and debugging of your ignore rules.</li><li><strong>Simple Command-Line Interface:</strong>  Offers an intuitive command-line interface with straightforward options for customization.</li></ul><p>If you have Go installed, run <code>go install github.com/tesserato/CodeWeaver@latest</code>to install the latest version of CodeWeaver or <code>go install github.com/tesserato/CodeWeaver@vX.Y.Z</code> to install a specific version.</p><p>Alternatively, download the appropriate pre built executable from the <a href=\"https://github.com/tesserato/CodeWeaver/releases\">releases page</a>.</p><p>If necessary, make the  executable by using the  command:</p><table><thead><tr></tr></thead><tbody><tr><td>The root directory to scan and document.</td></tr><tr><td>The name of the output Markdown file.</td></tr><tr><td><code>-ignore \"&lt;regex patterns&gt;\"</code></td><td>Comma-separated list of regular expression patterns for paths to exclude.</td></tr><tr><td><code>-included-paths-file &lt;filename&gt;</code></td><td>File to save the list of paths that were included in the documentation.</td></tr><tr><td><code>-excluded-paths-file &lt;filename&gt;</code></td><td>File to save the list of paths that were excluded from the documentation.</td></tr><tr><td>Display this help message and exit.</td></tr></tbody></table><h2><strong>Generate documentation for the current directory:</strong></h2><p>This will create a file named  in the current directory, documenting the structure and content of the current directory and its subdirectories (excluding paths matching the default ignore pattern ).</p><h2><strong>Specify a different input directory and output file:</strong></h2><pre><code>./codeweaver -dir=my_project -output=project_docs.md\n</code></pre><p>This command will process the  directory and save the documentation to .</p><h2><strong>Ignore specific file types and directories:</strong></h2><pre><code>./codeweaver -ignore=\"\\.log,temp,build\" -output=detailed_docs.md\n</code></pre><p>This example will generate , excluding any files or directories with names containing , , or . Regular expression patterns are comma-separated.</p><h2><strong>Save lists of included and excluded paths:</strong></h2><pre><code>./codeweaver -ignore=\"node_modules\" -included-paths-file=included.txt -excluded-paths-file=excluded.txt -output=code_overview.md\n</code></pre><p>This command will create  while also saving the list of included paths to  and the list of excluded paths (due to the  ignore pattern) to .</p><p>Contributions are welcome! If you encounter any issues, have suggestions for new features, or want to improve CodeWeaver, please feel free to open an issue or submit a pull request on the project's GitHub repository.</p><p>CodeWeaver is released under the <a href=\"https://tesserato.web.app/posts/2025-02-12-CodeWeaver-launch/LICENSE\">MIT License</a>. See the  file for complete license details.</p>","contentLength":3311,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43048027"},{"title":"TeX and Typst: Layout Models (2024)","url":"https://laurmaedje.github.io/posts/layout-models/","date":1739421249,"author":"fngjdflmdflg","guid":140,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43032697"},{"title":"Nping – ping, but with a graph or table view","url":"https://github.com/hanshuaikang/Nping","date":1739356982,"author":"markhan-nping","guid":139,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43023991"},{"title":"TL;DW: Too Long; Didn't Watch Distill YouTube Videos to the Relevant Information","url":"https://tldw.tube/","date":1739326517,"author":"pkaeding","guid":138,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43021044"}],"tags":["dev","hn"]}