{"id":"6C2W1azD1rBsV4qJANNfruBrvGgdqLWrPGWtk6Mp1WgfCNcfvBZHFQw","title":"The System Design Newsletter","displayTitle":"Dev - System Design Newsletter","url":"https://newsletter.systemdesign.one/feed","feedLink":"https://newsletter.systemdesign.one/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":3,"items":[{"title":"Get Better With System Design in 2025 🔥","url":"https://newsletter.systemdesign.one/p/system-design-in-2025","date":1736771403,"author":"Neo Kim","guid":43,"unread":true,"content":"<p>August 2023 - Ko Samui, Thailand.</p><p>I went there on a family vacation and was lucky to stay at an extremely beautiful place.</p><p>But I couldn’t write long-form system design articles on my website as the internet and power at my place weren’t reliable.</p><p>So I decided to start this newsletter with short-form content and published the first article without a real plan.</p><p>Now I need your feedback, so I can help you better.</p><p>This survey is only valid for 3 days, so I’d appreciate your participation. You’ll get some rewards at the end of it.</p><p>Let me understand what to focus on in 2025:</p><p><em>It’s only 3 questions, and you’ll get a coupon for 1 month of free access to the Eraser design tool.</em></p><p>Let me understand how this newsletter helped you last year:</p><p><em>It’ll only take 3 minutes, and you’ll get the powerful template to approach Leetcode interviews for free.</em></p><p>This newsletter has grown to 118,000 subscribers and I want to make it more valuable for you.</p>","contentLength":942,"flags":null,"enclosureUrl":"https://substack-post-media.s3.amazonaws.com/public/images/27ac2360-e3c5-487a-b4fa-b402388fa136_1280x720.gif","enclosureMime":"","commentsUrl":null},{"title":"How Do AirTags Work ","url":"https://newsletter.systemdesign.one/p/how-do-airtags-work","date":1736342258,"author":"Neo Kim","guid":42,"unread":true,"content":"<p>Get the powerful template to approach system design for FREE on newsletter sign-up:</p><p><em>This post outlines how AirTag works. You will find references at the bottom of this page if you want to go deeper.</em></p><p><em>Note: This post is based on my research and may differ from real-world implementation.</em></p><p>Once upon a time, there was a sports journalist named Maria.</p><p>She had to travel often by flight for work.</p><p>But one day she lost her luggage during a flight, and couldn’t track it. </p><p>So she was sad and upset.</p><p>She hears about a tracking device, called <a href=\"https://www.apple.com/airtag/\">Apple AirTag,</a> from a coworker.</p><p>And bought it immediately, she was dazzled by its simplicity in tracking luggage.</p><p>I wrote a summary of this post (save it for later):</p><p>And I’d love to connect if you’re also on Bluesky:</p><p>An AirTag contains a low-power CPU and a tiny amount of memory.</p><p>A tracking device must send its accurate location data at regular intervals.</p><p>Yet finding location data using GPS, WiFI, or cellular networks consumes power. Besides it’s expensive to maintain a tracking device with GPS functionality.</p><p>So smart engineers at Apple used simple ideas to solve this hard problem.</p><p>An AirTag doesn’t use GPS, WiFi, or a cellular network for communication; instead, it uses Bluetooth Low Energy ().</p><p>Imagine BLE as a low-power wireless technology for communication.</p><p>The key pair is shared between AirTag and the user account. The AirTag sends location data after <a href=\"https://cloud.google.com/learn/what-is-encryption?hl=en\">encrypting</a> it using the public key. While the user account decrypts the received location data using the private key.</p><p>Think of the  as an email address; anyone can send messages to it. While the  is similar to the password of an inbox; only the user with the password can read emails.</p><p>And authenticity of an email can be verified by checking the sender’s email address: .</p><h3>2. Broadcasting AirTag’s Location</h3><p>They send the AirTag’s location, which is near its owner’s iPhone, using Bluetooth, or Ultra Wideband for precision and efficiency.</p><p>Think of  as a wireless technology for high-speed, and short-range communication.</p><p>Yet Bluetooth and Ultra Wideband communication won’t work if the owner’s iPhone is far from the AirTag. So they rely on someone else's iPhone which is nearby.</p><ul><li><p>The AirTag <em>broadcasts its public key every 2 seconds over BLE</em>.</p></li><li><p>Someone else’s iPhone, which is nearby, receives the broadcast signal. </p></li><li><p>The iPhone encrypts its location data and timestamp using the received public key.</p></li><li><p>The iPhone uploads the encrypted data to the Apple server over HTTP.</p></li></ul><p>Put simply, AirTag doesn’t send location data; instead, only the public key. The iPhone then includes its location data and encrypts it.</p><h3>3. Finding AirTag’s Location</h3><p>The owner can find AirTag’s location using their iPhone app.</p><ul><li><p>The owner authenticates on the Apple server.</p></li><li><p>The owner requests location data for a specific public key.</p></li><li><p>The owner <em>decrypts the received location data using their private key</em>.</p></li></ul><p>The iPhone then displays AirTag’s recent location on a map.</p><p>An iPhone is necessary to relay location data, so an AirTag won’t work if there aren’t any iPhones nearby.</p><p>Put simply, the precision and effectiveness of an AirTag depends on the number of iPhones in its proximity.</p><p>While there are around 1.46 billion iPhone users in the world.</p><p>👋 PS - Do you want to level up at work?</p><ul><li><p>I’m launching system design deep dives in February 2025.</p></li><li><p>But it’ll be available only to paid subscribers of this newsletter.</p></li></ul><p>My mission is to help you go from 0 to 1 in system design by spending less than an hour each month. Yet paid subscription fees will be higher than current pledge fees. So pledge now to get access to it at a very low price.</p><p><em>“This newsletter is an amazing resource for learning system design.” </em>Alex</p><p>Subscribe to get simplified case studies delivered straight to your inbox:</p><p><strong>Want to advertise in this newsletter? </strong>📰</p><p>If your company wants to reach a 100K+ tech audience, you may want to <a href=\"https://newsletter.systemdesign.one/p/sponsorship\">advertise with me</a>.</p><p>Thank you for supporting this newsletter.</p><p>You are now 117,001+ readers strong, very close to 118k. Let’s try to get 118k readers by 17 January. Consider sharing this post with your friends and get rewards.</p>","contentLength":4083,"flags":null,"enclosureUrl":"https://substack-post-media.s3.amazonaws.com/public/images/43c2ccc9-1f05-472d-ad8b-933c4c32d38e_1280x720.gif","enclosureMime":"","commentsUrl":null},{"title":"How Shopify Handled 30TB per Minute With a Modular Monolith Architecture 🔥","url":"https://newsletter.systemdesign.one/p/modular-monolith","date":1734873324,"author":"Neo Kim","guid":41,"unread":true,"content":"<p>Get the powerful template to approach system design for FREE on newsletter sign-up:</p><p><em>This post outlines modular monolith architecture. You will find references at the bottom of this page if you want to go deeper.</em></p><p><em>Note: This post is based on my research and may differ from real-world implementation.</em></p><p>Once upon a time, 3 people decided to sell snowboarding equipment online.</p><p>And set up an e-commerce platform.</p><p>Yet their business model failed.</p><p>So they pivoted to create a software-as-a-service model with the e-commerce platform and called it Shopify.</p><p>Their growth rate was explosive.</p><p>But they wanted to keep it simple and reduce costs.</p><p>So they built Shopify using a classic monolith architecture in Ruby on Rails.</p><p>As time passed, they added features to scale the business.</p><p>Yet it increased the codebase complexity.</p><p>And became difficult to understand &amp; maintain the code.</p><p>So they  moving to a microservices architecture.</p><p>Although it’ll temporarily solve their issues, it might create newer problems.</p><p>Each microservice needs a separate deployment pipeline.</p><p>So it’ll increase the effort and costs.</p><p>Also security vulnerabilities must be updated in each microservice.</p><p>So it’ll increase the system complexity.</p><p>I wrote a summary of this post (save it for later):</p><p>And I’d love to connect if you’re on Bluesky:</p><p>They wanted the benefits of monolith and microservices architecture.</p><p>But ditch the problems coming with it.</p><p>So they set up a modular monolith.</p><p>They designed each module around a specific business domain.</p><p>Think of as grouping functionalities from a business area within a module. Put simply, related functionalities get stored in a specific module.</p><p>Also they created a  for each module and hid the internal logic &amp; data behind it. It let them:</p><ul><li><p>Understand the behavior of a module easily.</p></li><li><p>Modify a module without breaking others.</p></li></ul><p>Imagine  as a measure of dependency between 2 modules.</p><p>A module will always depend on something.</p><p>Yet dependencies must be minimized.</p><p>So they merged modules with many dependencies on each other. (It happens when domain boundaries aren’t set properly.)</p><p>They designed modules to communicate with each other via public API - function calls. And threw errors if anything got accessed outside the public API.</p><p>Each module can be deployed as a separate <a href=\"https://en.wikipedia.org/wiki/Process_(computing)\">process</a> for fault isolation.</p><p>So they deploy every module within the same process.</p><p>They organized code so each module contains a business domain. Put simply, each directory represents a specific business domain. For example, the code for orders and payments modules will be in separate directories.</p><p>Also they set up separate database schemas for each module. And avoided transactions across them to avoid coupling &amp; achieve data isolation.</p><p>A modular monolith is a better way to organize code than a classic monolith. Here are its benefits:</p><ul><li><p>It’s easier to modify code as the area of code change is limited. (Compared to <a href=\"https://www.baeldung.com/cs/layered-architecture\">layered architecture</a> in a classic monolith.)</p></li><li><p>Developer productivity is high because the codebase is easier to understand.</p></li></ul><ul><li><p>There’s no network overhead because functional calls are enough. (Compared to microservices.)</p></li><li><p>It’s easier to deploy because there’s only a single app.</p></li><li><p>The infrastructure costs are low because there’s only a single codebase.</p></li></ul><p>Besides a modular monolith makes the transition to microservices easier.</p><p>Each architecture has its tradeoffs:</p><ul><li><p>It’s difficult to scale only a specific module in a modular monolith, so resources might get wasted.</p></li></ul><p>Also failure impact is high because every module runs in the same process.</p><p>Each architectural pattern solves a specific problem.</p><p>Yet there’s no silver bullet.</p><p>So the correct solution depends on your needs and scale.</p><p>While Shopify remains one of the largest e-commerce platforms in the world.</p><p>And handled 30TB traffic per minute during black friday.</p><p>👋 PS - Are you unhappy at your current job?</p><p>And preparing for system design interviews to get your dream job can be stressful.</p><p>Don't worry, I'm working on content to help you pass the system design interview. I'll make it easier - you spend only a few minutes each week to go from 0 to 1. Yet paid subscription fees will be higher than current pledge fees.</p><p>So pledge now to get access at a lower price.</p><p><em>“This newsletter is an amazing resource for learning system design.” </em>Alex</p><p>Subscribe to get simplified case studies delivered straight to your inbox:</p><p><strong>Want to advertise in this newsletter? </strong>📰</p><p>Thank you for supporting this newsletter. Consider sharing this post with your friends and get rewards. Y’all are the best.</p>","contentLength":4490,"flags":null,"enclosureUrl":"https://substack-post-media.s3.amazonaws.com/public/images/4fd94889-8498-4940-b782-1155906ec752_1280x720.gif","enclosureMime":"","commentsUrl":null}]}