{"id":"6C2W1azD1rBrcTRY3HU8boSx83NbkHKLjCRzRoNgHM1f9rDLzUhN2yx","title":"MLOps.community","displayTitle":"Podcast - MLOps","url":"https://anchor.fm/s/174cb1b8/podcast/rss","feedLink":"https://mlops.community/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":5,"items":[{"title":"Collective Memory for AI on Decentralized Knowledge Graph // Tomaž Levak // #285","url":"https://podcasters.spotify.com/pod/show/mlops/episodes/Collective-Memory-for-AI-on-Decentralized-Knowledge-Graph--Toma-Levak--285-e2tr84a","date":1737735174,"author":"Demetrios Brinkmann","guid":293,"unread":true,"content":"<p>Tomaž Levak&nbsp;is the Co-founder and CEO of&nbsp;<a href=\"https://iq.wiki/wiki/trace-labs\" target=\"_blank\" rel=\"ugc noopener noreferrer\">Trace Labs</a>&nbsp;–&nbsp;<a href=\"https://iq.wiki/wiki/origintrail\" target=\"_blank\" rel=\"ugc noopener noreferrer\">OriginTrail</a>&nbsp;core developers.&nbsp;OriginTrail&nbsp;is a&nbsp;<a href=\"https://iq.wiki/wiki/web3\" target=\"_blank\" rel=\"ugc noopener noreferrer\">web3</a>&nbsp;infrastructure project combining a decentralized knowledge graph (DKG) and&nbsp;<a href=\"https://iq.wiki/wiki/blockchain\" target=\"_blank\" rel=\"ugc noopener noreferrer\">blockchain</a>&nbsp;technologies to create a neutral, inclusive ecosystem.\n\nCollective Memory for AI on Decentralized Knowledge Graph // MLOps Podcast #285 with Tomaz Levak, Founder of Trace Labs, Core Developers of OriginTrail.\n\n// Abstract\nThe talk focuses on how OriginTrail Decentralized Knowledge Graph serves as a collective memory for AI and enables neuro-symbolic AI. We cover the basics of OriginTrail’s symbolic AI fundamentals (i.e. knowledge graphs) and go over details how decentralization improves data integrity, provenance, and user control. We’ll cover the DKG role in AI agentic frameworks and how it helps with verifying and accessing diverse data sources, while maintaining compatibility with existing standards. \n\nWe’ll explore practical use cases from the enterprise sector as well as latest integrations into frameworks like ElizaOS. We conclude by outlining the future potential of decentralized AI, AI becoming the interface to “eat” SaaS and the general convergence of AI, Internet and Crypto.\n\n// Bio\nTomaz Levak, founder of OriginTrail, is active at the intersection of Cryptocurrency, the Internet, and Artificial Intelligence (AI). At the core of OriginTrail is a pursuit of Verifiable Internet for AI, an inclusive framework addressing critical challenges of the world in an AI era. To achieve the goal of Verifiable Internet for AI, OriginTrail's trusted knowledge foundation ensures the provenance and verifiability of information while incentivizing the creation of high-quality knowledge. These advancements are pivotal to unlock the full potential of AI as they minimize the technology’s shortfalls such as hallucinations, bias, issues of data ownership, and model collapse.\n\nTomaz's contributions to OriginTrail span over a decade and across multiple fields. He is involved in strategic technical innovations for OriginTrail Decentralized Knowledge Graph (DKG) and NeuroWeb blockchain and was among the authors of all three foundational White Paper documents that defined how OriginTrail technology addresses global challenges. Tomaz contributed to the design of OriginTrail token economies and is driving adoption with global brands such as British Standards Institution, Swiss Federal Railways and World Federation of Haemophilia, among others.\n\nCommitted to the ongoing expansion of the OriginTrail ecosystem, Tomaz is a regular speaker at key industry events. In his appearances, he highlights the significant value that the OriginTrail DKG brings to diverse sectors, including supply chains, life sciences, healthcare, and scientific research. In a rapidly evolving digital landscape, Tomaz and the OriginTrail ecosystem as a whole are playing an important role in ensuring a more inclusive, transparent and decentralized AI.\n\n// MLOps Swag/Merch\n<a href=\"https://shop.mlops.community/\" target=\"_blank\" rel=\"ugc noopener noreferrer\">https://shop.mlops.community/</a>\n\n// Related Links\nWebsite: <a href=\"https://origintrail.io\" target=\"_blank\" rel=\"noopener noreferer\">https://origintrail.io</a></p>","contentLength":3065,"flags":null,"enclosureUrl":"https://anchor.fm/s/174cb1b8/podcast/play/97410634/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2025-0-22%2F393522714-44100-2-c347ea83225bc.mp3","enclosureMime":"","commentsUrl":null},{"title":"Efficient Deployment of Models at the Edge // Krishna Sridhar // #284","url":"https://podcasters.spotify.com/pod/show/mlops/episodes/Efficient-Deployment-of-Models-at-the-Edge--Krishna-Sridhar--284-e2tkifl","date":1737138979,"author":"Demetrios Brinkmann","guid":292,"unread":true,"content":"<p><a href=\"https://www.linkedin.com/in/srikris/\" target=\"_blank\" rel=\"ugc noopener noreferrer\">Krishna Sridhar</a> is an experienced engineering leader passionate about building wonderful products powered by machine learning.\n\nEfficient Deployment of Models at the Edge // MLOps Podcast #284 with Krishna Sridhar, Vice President of Qualcomm.</p><p>Big shout out to <a href=\"https://www.qualcomm.com/\" target=\"_blank\" rel=\"ugc noopener noreferrer\">Qualcomm</a> for sponsoring this episode!\n\n// Abstract\nQualcomm® AI Hub helps to optimize, validate, and deploy machine learning models on-device for vision, audio, and speech use cases.\n\nWith Qualcomm® AI Hub, you can:\n\nConvert trained models from frameworks like PyTorch and ONNX for optimized on-device performance on Qualcomm® devices.\nProfile models on-device to obtain detailed metrics including runtime, load time, and compute unit utilization.\nVerify numerical correctness by performing on-device inference.\nEasily deploy models using Qualcomm® AI Engine Direct, TensorFlow Lite, or ONNX Runtime.\n\nThe Qualcomm® AI Hub Models repository contains a collection of example models that use Qualcomm® AI Hub to optimize, validate, and deploy models on Qualcomm® devices.\n\nQualcomm® AI Hub automatically handles model translation from source framework to device runtime, applying hardware-aware optimizations, and performs physical performance/numerical validation. The system automatically provisions devices in the cloud for on-device profiling and inference. The following image shows the steps taken to analyze a model using Qualcomm® AI Hub.\n\n// Bio\nKrishna Sridhar leads engineering for Qualcomm™ AI Hub, a system used by more than 10,000 AI developers spanning 1,000 companies to run more than 100,000 models on Qualcomm platforms. \n\nPrior to joining Qualcomm, he was Co-founder and CEO of Tetra AI which made its easy to efficiently deploy ML models on mobile/edge hardware. \n\nPrior to Tetra AI, Krishna helped design Apple's CoreML which was a software system mission critical to running several experiences at Apple including Camera, Photos, Siri, FaceTime, Watch, and many more across all major Apple device operating systems and all hardware and IP blocks. \n\nHe has a Ph.D. in computer science from the University of Wisconsin-Madison, and a bachelor’s degree in computer science from Birla Institute of Technology and Science, Pilani, India.\n\n// MLOps Swag/Merch\n<a href=\"https://shop.mlops.community/\" target=\"_blank\" rel=\"ugc noopener noreferrer\">https://shop.mlops.community/</a>\n\n// Related Links\nWebsite: <a href=\"https://www.linkedin.com/in/srikris/\" target=\"_blank\" rel=\"ugc noopener noreferrer\">https://www.linkedin.com/in/srikris/</a>\n \n--------------- ✌️Connect With Us ✌️ -------------\nJoin our slack community: <a href=\"https://go.mlops.community/slack\" target=\"_blank\" rel=\"ugc noopener noreferrer\">https://go.mlops.community/slack</a>\nFollow us on Twitter: <a href=\"https://podcasters.spotify.com/pod/show/mlops/episodes/@mlopscommunity\" target=\"_blank\" rel=\"ugc noopener noreferrer\">@mlopscommunity</a>\nSign up for the next meetup: <a href=\"https://go.mlops.community/register\" target=\"_blank\" rel=\"ugc noopener noreferrer\">https://go.mlops.community/register</a>\nCatch all episodes, blogs, newsletters, and more: <a href=\"https://mlops.community/\" target=\"_blank\" rel=\"ugc noopener noreferrer\">https://mlops.community/</a>\n\nConnect with Demetrios on LinkedIn: <a href=\"https://www.linkedin.com/in/dpbrinkm/\" target=\"_blank\" rel=\"ugc noopener noreferrer\">https://www.linkedin.com/in/dpbrinkm/</a>\nConnect with Krishna on LinkedIn: <a href=\"https://www.linkedin.com/in/srikris/\" target=\"_blank\" rel=\"ugc noopener noreferrer\">https://www.linkedin.com/in/srikris/</a></p>","contentLength":2783,"flags":null,"enclosureUrl":"https://anchor.fm/s/174cb1b8/podcast/play/97191861/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2025-0-17%2F393252053-44100-2-f52a7de7a6939.mp3","enclosureMime":"","commentsUrl":null},{"title":"Real World AI Agent Stories // Zach Wallace // #283","url":"https://podcasters.spotify.com/pod/show/mlops/episodes/Real-World-AI-Agent-Stories--Zach-Wallace--283-e2tg374","date":1736966196,"author":"Demetrios Brinkmann","guid":291,"unread":true,"content":"<p>\nMachine Learning, AI Agents, and Autonomy // MLOps Podcast #283 with Zach Wallace, Staff Software Engineer at Nearpod Inc.\n\n// Abstract\nDemetrios chats with Zach Wallace, engineering manager at Nearpod, about integrating AI agents in e-commerce and edtech. They discuss using agents for personalized user targeting, adapting AI models with real-time data, and ensuring efficiency through clear task definitions. Zach shares how Nearpod streamlined data integration with tools like Redshift and DBT, enabling real-time updates. The conversation covers challenges like maintaining AI in production, handling high-quality data, and meeting regulatory standards. Zach also highlights the cost-efficiency framework for deploying and decommissioning agents and the transformative potential of LLMs in education.\n\n// Bio\nSoftware Engineer with 10 years of experience. Started my career as an Application Engineer, but I have transformed into a Platform Engineer. As a Platform Engineer, I have handled the problems described below\n - Localization across 6-7 different languages\n - Building a custom local environment tool for our engineers\n - Building a Data Platform\n - Building standards and interfaces for Agentic AI within ed-tech.\n\n// MLOps Swag/Merch\nhttps://shop.mlops.community/\n\n// Related Links\nhttps://medium.com/renaissance-learning-r-d/data-platform-transform-a-data-monolith-9d5290a552ef\n \n--------------- ✌️Connect With Us ✌️ -------------\nJoin our slack community: https://go.mlops.community/slack\nFollow us on Twitter: @mlopscommunity\nSign up for the next meetup: https://go.mlops.community/register\nCatch all episodes, blogs, newsletters, and more: https://mlops.community/\n\nConnect with Demetrios on LinkedIn: https://www.linkedin.com/in/dpbrinkm/\nConnect with Zach on LinkedIn: https://www.linkedin.com/in/zachary-wallace/\n\n</p>","contentLength":1846,"flags":null,"enclosureUrl":"https://anchor.fm/s/174cb1b8/podcast/play/97045156/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2025-0-15%2F393138720-44100-2-f50482692b347.mp3","enclosureMime":"","commentsUrl":null},{"title":"Machine Learning, AI Agents, and Autonomy // Egor Kraev // #282","url":"https://podcasters.spotify.com/pod/show/mlops/episodes/Machine-Learning--AI-Agents--and-Autonomy--Egor-Kraev--282-e2t6ct4","date":1736341207,"author":"Demetrios Brinkmann","guid":290,"unread":true,"content":"<p>Since three years, <a href=\"https://www.linkedin.com/in/egorkraev/\" target=\"_blank\" rel=\"ugc noopener noreferrer\"></a> is bringing the power of AI to bear at <a href=\"https://wise.com/\" target=\"_blank\" rel=\"ugc noopener noreferrer\"></a>, across domains as varied as trading algorithms for Treasury, fraud detection, experiment analysis and causal inference, and recently the numerous applications unlocked by large language models. Open-source projects initiated and guided by Egor include wise-pizza, causaltune, and neural-lifetimes, with more on the way.\n</p>","contentLength":381,"flags":null,"enclosureUrl":"https://anchor.fm/s/174cb1b8/podcast/play/96727396/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2025-0-7%2F392674585-44100-2-6ae032f481f05.mp3","enclosureMime":"","commentsUrl":null},{"title":"Re-Platforming Your Tech Stack // Michelle Marie Conway & Andrew Baker // #281","url":"https://podcasters.spotify.com/pod/show/mlops/episodes/Re-Platforming-Your-Tech-Stack--Michelle-Marie-Conway--Andrew-Baker--281-e2t1aq9","date":1735927992,"author":"Demetrios Brinkmann","guid":289,"unread":true,"content":"<p>Re-Platforming Your Tech Stack // MLOps Podcast #281 with Michelle Marie Conway, Lead Data Scientist at Lloyds Banking Group and Andrew Baker, Data Science Delivery Lead at Lloyds Banking Group.\n\n// Abstract\nLloyds Banking Group is on a mission to embrace the power of cloud and unlock the opportunities that it provides. Andrew, Michelle, and their MLOps team have been on a journey over the last 12 months to take their portfolio of circa 10 Machine Learning models in production and migrate them from an on-prem solution to a cloud-based environment. During the podcast, Michelle and Andrew share their reflections as well as some dos (and don’ts!) of managing the migration of an established portfolio.\n\n// Bio\nMichelle Marie Conway\nMichelle is a Lead Data Scientist in the high-performance data science team at Lloyds Banking Group. With deep expertise in managing production-level Python code and machine learning models, she has worked alongside fellow senior manager Andrew to drive the bank's transition to the Google Cloud Platform. Together, they have played a pivotal role in modernising the ML portfolio in collaboration with a remarkable ML Ops team.\n\nOriginally from Ireland and now based in London, Michelle blends her technical expertise with a love for the arts. \n\nAndrew Baker\nAndrew graduated from the University of Birmingham with a first-class honours degree in Mathematics and Music with a Year in Computer Science and joined Lloyds Banking Group on their Retail graduate scheme in 2015.\n\nSince 2021 Andrew has worked in the world of data, firstly in shaping the Retail data strategy and most recently as a Data Science Delivery Lead, growing and managing a team of Data Scientists and Machine Learning Engineers. He has built a high-performing team responsible for building and maintaining ML models in production for the Consumer Lending division of the bank.\n\nAndrew is motivated by the role that data science and ML can play in transforming the business and its processes, and is focused on balancing the power of ML with the need for simplicity and explainability that enables business users to engage with the opportunities that exist in this space and the demands of a highly regulated environment.\n\n// MLOps Swag/Merch\nhttps://shop.mlops.community/\n\n// Related Links\nWebsite: https://www.michelleconway.co.uk/\nhttps://www.linkedin.com/pulse/artificial-intelligence-just-when-data-science-answer-andrew-baker-hfdge/\nhttps://www.linkedin.com/pulse/artificial-intelligence-conundrum-generative-ai-andrew-baker-qla7e/ \n \n--------------- ✌️Connect With Us ✌️ -------------\nJoin our slack community: https://go.mlops.community/slack\nFollow us on Twitter: @mlopscommunity\nSign up for the next meetup: https://go.mlops.community/register\nCatch all episodes, blogs, newsletters, and more: https://mlops.community/\n\nConnect with Demetrios on LinkedIn: https://www.linkedin.com/in/dpbrinkm/\nConnect with Michelle on LinkedIn: https://www.linkedin.com/in/michelle--conway/\nConnect with Andrew on LinkedIn: https://www.linkedin.com/in/andrew-baker-90952289\n\n</p>","contentLength":3086,"flags":null,"enclosureUrl":"https://anchor.fm/s/174cb1b8/podcast/play/96561417/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2025-0-3%2F392469992-44100-2-bcad12a952aae.mp3","enclosureMime":"","commentsUrl":null}],"tags":["podcast"]}