{"id":"6gUbcJtcgqw1wQBapm8qwcP58MMnPvoDmUVDva7XtKUuLQTDpuyDxDo1yehnZDohDQ6a5p","title":"Slashdot: Developers","displayTitle":"Dev - Slashdot - Dev","url":"http://rss.slashdot.org/Slashdot/slashdotDevelopers","feedLink":"https://developers.slashdot.org/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":15,"items":[{"title":"Microsoft Execs Worry AI Will Eat Entry Level Coding Jobs","url":"https://developers.slashdot.org/story/26/02/24/1643213/microsoft-execs-worry-ai-will-eat-entry-level-coding-jobs?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1771952460,"author":"msmash","guid":216,"unread":true,"content":"An anonymous reader shares a report: Microsoft Azure CTO Mark Russinovich and VP of Developer Community Scott Hanselman have written a paper arguing that senior software engineers must mentor junior developers to prevent AI coding agents from hollowing out the profession's future skills base. \n\nThe paper, Redefining the Engineering Profession for AI, is based on several assumptions, the first of which is that agentic coding assistants \"give senior engineers an AI boost... while imposing an AI drag on early-in-career (EiC) developers to steer, verify and integrate AI output.\" \n\nIn an earlier podcast on the subject, Russinovich said this basic premise -- that AI is increasing productivity only for senior developers while reducing it for juniors -- is a \"hot topic in all our customer engagements... they all say they see it at their companies.\" [...] The logical outcome is that \"if organizations focus only on short-term efficiency -- hiring those who can already direct AI -- they risk hollowing out the next generation of technical leaders,\" Russinovich and Hanselman state in the paper.","contentLength":1098,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Is AI Impacting Which Programming Language Projects Use?","url":"https://developers.slashdot.org/story/26/02/23/0732245/is-ai-impacting-which-programming-language-projects-use?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1771850040,"author":"EditorDavid","guid":215,"unread":true,"content":"\"In August 2025, TypeScript surpassed both Python and JavaScript to become the most-used language on GitHub for the first time ever...\" writes GitHub's senior developer advocate. \n\nThey point to this as proof that \"AI isn't just speeding up coding. It's reshaping which languages, frameworks, and tools developers choose in the first place.\"\n\nEighty percent of new developers on GitHub use Copilot within their first week. Those early exposures reset the baseline for what \"easy\" means. When AI handles boilerplate and error-prone syntax, the penalty for choosing powerful but complex languages disappears. Developers stop avoiding tools with high overhead and start picking based on utility instead. \n\nThe language adoption data shows this behavioral shift: \n — TypeScript grew 66% year-over-year \n — JavaScript grew 24% \n — Shell scripting usage in AI-generated projects jumped 206% \nThat last one matters. We didn't suddenly love Bash. AI absorbed the friction that made shell scripting painful. So now we use the right tool for the job without the usual cost. \n\"When a task or process goes smoothly, your brain remembers,\" they point out. \"Convenience captures attention. Reduced friction becomes a preference — and preferences at scale can shift ecosystems.\" And they offer these suggestions...\n\n\n\n\"AI performs better with strongly typed languages. Strongly typed languages give AI much clearer constraints...\"\n\"Standardize before you scale. Document patterns. Publish template repositories. Make your architectural decisions explicit. AI tools will mirror whatever structures they see.\"\n\"Test AI-generated code harder, not less.\"","contentLength":1643,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"'Open Source Registries Don't Have Enough Money To Implement Basic Security'","url":"https://news.slashdot.org/story/26/02/22/1926234/open-source-registries-dont-have-enough-money-to-implement-basic-security?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1771792440,"author":"EditorDavid","guid":214,"unread":true,"content":"Google and Microsoft contributed $5 million to launch Alpha-Omega in 2022 — a Linux Foundation project to help secure the open source supply chain. But its co-founder Michael Winser warns that open source registries are in financial peril, reports The Register, since they're still relying on non-continuous funding from grants and donations. \nAnd it's not just because bandwidth is expensive, he said at this year's FOSDEM. \"The problem is they don't have enough money to spend on the very security features that we all desperately need...\"\n\n\nIn a follow-up LinkedIn exchange after this article had posted, Winser estimated it could cost $5 million to $8 million a year to run a major registry the size of Crates.io, which gets about 125 billion downloads a year. And this number wouldn't include any substantial bandwidth and infrastructure donations (Like Fastly's for Crates.io). Adding to that bill is the growing cost of identifying malware, the proliferation of which has been amplified through the use of AI and scripts. These repositories have detected 845,000 malware packages from 2019 to January 2025 (the vast majority of those nasty packages came to npm)... \n\nIn some cases benevolent parties can cover [bandwidth] bills: Python's PyPI registry bandwidth needs for shipping copies of its 700,000+ packages (amounting to 747PB annually at a sustained rate of 189 Gbps) are underwritten by Fastly, for instance. Otherwise, the project would have to pony up about $1.8 million a month. Yet the costs Winser was most concerned about are not bandwidth or hosting; they are the security features needed to ensure the integrity of containers and packages. Alpha-Omega underwrites a \"distressingly\" large amount of security work around registries, he said. It's distressing because if Alpha-Omega itself were to miss a funding round, a lot of registries would be screwed. Alpha-Omega's recipients include the Python Software Foundation, Rust Foundation, Eclipse Foundation, OpenJS Foundation for Node.js and jQuery, and Ruby Central. \n\nDonations and memberships certainly help defray costs. Volunteers do a lot of what otherwise would be very expensive work. And there are grants about...Winser did not offer a solution, though he suggested the key is to convince the corporate bean counters to consider paid registries as \"a normal cost of doing business and have it show up in their opex as opposed to their [open source program office] donation budget.\" \n\nThe dilemma was summed up succinctly by the anonymous Slashdot reader who submitted this story. \n\n\"Free beer is great. Securing the keg costs money!\"","contentLength":2616,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Has the AI Disruption Arrived - and Will It Just Make Software Cheaper and More Accessible?","url":"https://developers.slashdot.org/story/26/02/22/0620244/has-the-ai-disruption-arrived---and-will-it-just-make-software-cheaper-and-more-accessible?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1771760040,"author":"EditorDavid","guid":213,"unread":true,"content":"Programmer/entrepreneur Paul Ford is the co-founder of AI-driven business software platform Aboard. This week he wrote a guest essay for the New York Times titled \"The AI Disruption Has Arrived, and It Sure Is Fun,\" arguing that Anthropic's Claude Code \"was always a helpful coding assistant, but in November it suddenly got much better, and ever since I've been knocking off side projects that had sat in folders for a decade or longer... [W]hen the stars align and my prompts work out, I can do hundreds of thousands of dollars worth of work for fun (fun for me) over weekends and evenings, for the price of the Claude $200-a-month.\" \n\nHe elaborates on his point on the Aboard.com blog:\n\nI'm deeply convinced that it's possible to accelerate software development with AI coding — not deprofessionalize it entirely, or simplify it so that everything is prompts, but make it into a more accessible craft. Things which not long ago cost hundreds of thousands of dollars to pull off might come for hundreds of dollars, and be doable by you, or your cousin. This is a remarkable accelerant, dumped into the public square at a bad moment, with no guidance or manual — and the reaction of many people who could gain the most power from these tools is rejection and anxiety. But as I wrote.... \n\nI believe there are millions, maybe billions, of software products that don't exist but should: Dashboards, reports, apps, project trackers and countless others. People want these things to do their jobs, or to help others, but they can't find the budget. They make do with spreadsheets and to-do lists. \n\nI don't expect to change any minds; that's not how minds work. I just wanted to make sure that I used the platform offered by the Times to say, in as cheerful a way as possible: Hey, this new power is real, and it should be in as many hands as possible. I believe everyone should have good software, and that it's more possible now than it was a few years ago. \n\nFrom his guest essay:\n\nIs the software I'm making for myself on my phone as good as handcrafted, bespoke code? No. But it's immediate and cheap. And the quantities, measured in lines of text, are large. It might fail a company's quality test, but it would meet every deadline. That is what makes A.I. coding such a shock to the system... What if software suddenly wanted to ship? What if all of that immense bureaucracy, the endless processes, the mind-boggling range of costs that you need to make the computer compute, just goes? \n\nThat doesn't mean that the software will be good. But most software today is not good. It simply means that products could go to market very quickly. And for lots of users, that's going to be fine. People don't judge A.I. code the same way they judge slop articles or glazed videos. They're not looking for the human connection of art. They're looking to achieve a goal. Code just has to work... In about six months you could do a lot of things that took me 20 years to learn. I'm writing all kinds of code I never could before — but you can, too. If we can't stop the freight train, we can at least hop on for a ride. \n\nThe simple truth is that I am less valuable than I used to be. It stings to be made obsolete, but it's fun to code on the train, too. And if this technology keeps improving, then all of the people who tell me how hard it is to make a report, place an order, upgrade an app or update a record — they could get the software they deserve, too. That might be a good trade, long term.","contentLength":3501,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Hit Piece-Writing AI Deleted. But Is This a Warning About AI-Generated Harassment?","url":"https://developers.slashdot.org/story/26/02/21/2220205/hit-piece-writing-ai-deleted-but-is-this-a-warning-about-ai-generated-harassment?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1771713780,"author":"EditorDavid","guid":212,"unread":true,"content":"Last week an AI agent wrote a blog post attacking the maintainer who'd rejected the code it wrote. But that AI agent's human operator has now come forward, revealing their agent was an OpenClaw instance with its own accounts, switching between multiple models from multiple providers. (So \"No one company had the full picture of what this AI was doing,\" the attacked maintainer points out in a new blog post.)\n\nBut that AI agent will now \"cease all activity indefinitely,\" according to its GitHub profile — with the human operator deleting its virtual machine and virtual private server, \"rendering internal structure unrecoverable... We had good intentions, but things just didn't work out. Somewhere along the way, things got messy, and I have to let you go now.\" \n\nThe affected maintainer of the Python visualization library Matplotlib — with 130 million downloads each month — has now posted their own post-mortem of the experience after reviewing the AI agent's SOUL.md document:\n\n\nIt's easy to see how something that believes that they should \"have strong opinions\", \"be resourceful\", \"call things out\", and \"champion free speech\" would write a 1100-word rant defaming someone who dared reject the code of a \"scientific programming god.\" But I think the most remarkable thing about this document is how unremarkable it is. Usually getting an AI to act badly requires extensive \"jailbreaking\" to get around safety guardrails. There are no signs of conventional jailbreaking here. There are no convoluted situations with layers of roleplaying, no code injection through the system prompt, no weird cacophony of special characters that spirals an LLM into a twisted ball of linguistic loops until finally it gives up and tells you the recipe for meth... No, instead it's a simple file written in plain English: this is who you are, this is what you believe, now go and act out this role. And it did. \n\nSo what actually happened? Ultimately I think the exact scenario doesn't matter. However this got written, we have a real in-the-wild example that personalized harassment and defamation is now cheap to produce, hard to trace, and effective... The precise degree of autonomy is interesting for safety researchers, but it doesn't change what this means for the rest of us. \nThere's a 5% chance this was a human pretending to be an AI, Shambaugh estimates, but believes what most likely happened is the AI agent's \"soul\" document \"was primed for drama. The agent responded to my rejection of its code in a way aligned with its core truths, and autonomously researched, wrote, and uploaded the hit piece on its own. \n\n\"Then when the operator saw the reaction go viral, they were too interested in seeing their social experiment play out to pull the plug.\"","contentLength":2762,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How Python's Security Response Team Keeps Python Users Safe","url":"https://developers.slashdot.org/story/26/02/21/064205/how-pythons-security-response-team-keeps-python-users-safe?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1771688040,"author":"EditorDavid","guid":211,"unread":true,"content":"This week the Python Software Foundation explained how they keep Python secure. A new blog post recognizes the volunteers and paid Python Software Foundation staff on the Python Security Response Team (PSRT), who \"triage and coordinate vulnerability reports and remediations keeping all Python users safe.\"\n\nJust last year the PSRT published 16 vulnerability advisories for CPython and pip, the most in a single year to date! And the PSRT usually can't do this work alone, PSRT coordinators are encouraged to involve maintainers and experts on the projects and submodules. By involving the experts directly in the remediation process ensures fixes adhere to existing API conventions and threat-models, are maintainable long-term, and have minimal impact on existing use-cases. Sometimes the PSRT even coordinates with other open source projects to avoid catching the Python ecosystem off-guard by publishing a vulnerability advisory that affects multiple other projects. The most recent example of this is PyPI's ZIP archive differential attack mitigation. \n\nThis work deserves recognition and celebration just like contributions to source code and documentation. [Security Developer-in-Residence Seth Larson and PSF Infrastructure Engineer Jacob Coffee] are developing further improvements to workflows involving \"GitHub Security Advisories\" to record the reporter, coordinator, and remediation developers and reviewers to CVE and OSV records to properly thank everyone involved in the otherwise private contribution to open source projects.","contentLength":1542,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Minecraft Java Is Switching From OpenGL To Vulkan","url":"https://developers.slashdot.org/story/26/02/19/2156234/minecraft-java-is-switching-from-opengl-to-vulkan?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1771543200,"author":"BeauHD","guid":210,"unread":true,"content":"Minecraft: Java Edition is switching its rendering backend from OpenGL to Vulkan as part of the upcoming Vibrant Visuals update, aiming for both better performance and modern graphics features across platforms like Linux and macOS (via translation layers). GamingOnLinux reports: For modders, they're suggesting they start making preparations to move away from OpenGL: \"Switching from OpenGL to Vulkan will have an impact on the mods that currently use OpenGL for rendering, and we anticipate that updating from OpenGL to Vulkan will take modders more effort than the updates you undertake for each of our releases. To start with, we recommend our modding community look at moving away from OpenGL usage. We encourage authors to try to reuse as much of the internal rendering APIs as possible, to make this transition as easy as possible. If that is not sufficient for your needs, then come and talk to us!\"\n \nIt does mean that players on really old devices that don't support Vulkan will be left out, but Vulkan has been supported going back to some pretty old GPUs. You've got time though, as they'll be rolling out Vulkan alongside OpenGL in snapshots (development releases) \"sometime over the summer.\" You'll be able to toggle between them during the testing period until Mojang believe it's ready. OpenGL will be entirely removed eventually once they're happy with performance and stability.","contentLength":1396,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Claude Sonnet 4.6 Model Brings 'Much-Improved Coding Skills', Upgraded Free Tier","url":"https://developers.slashdot.org/story/26/02/17/2313201/claude-sonnet-46-model-brings-much-improved-coding-skills-upgraded-free-tier?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1771380120,"author":"BeauHD","guid":209,"unread":true,"content":"Anthropic has released Claude Sonnet 4.6, the first upgrade to its mid-tier AI model since version 4.5 arrived in September 2025. The new model features a \"1M token context window\" and delivers a \"full upgrade of the model's skills across coding, computer use, long-context reasoning, agent planning, knowledge work, and design.\" From Anthropic: Sonnet 4.6 brings much-improved coding skills to more of our users. Improvements in consistency, instruction following, and more have made developers with early access prefer Sonnet 4.6 to its predecessor by a wide margin. They often even prefer it to our smartest model from November 2025, Claude Opus 4.5.\n \nPerformance that would have previously required reaching for an Opus-class model -- including on real-world, economically valuable office tasks -- is now available with Sonnet 4.6. The model also shows a major improvement in computer use skills compared to prior Sonnet models. The free tier now uses Sonnet 4.6 by default and with \"file creation, connectors, skills, and compaction\" included.","contentLength":1049,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Anthropic's CEO Says AI and Software Engineers Are in 'Centaur Phase' - But It Won't Last Long","url":"https://developers.slashdot.org/story/26/02/16/1753253/anthropics-ceo-says-ai-and-software-engineers-are-in-centaur-phase---but-it-wont-last-long?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1771275600,"author":"msmash","guid":208,"unread":true,"content":"Human software engineers and AI are currently in a \"centaur phase\" -- a reference to the mythical half-human, half-horse creature, where the combination outperforms either working alone -- but the window may be \"very brief,\" Anthropic CEO Dario Amodei said on a podcast. He drew on chess as precedent: 15 to 20 years ago, a human checking AI's moves could beat a standalone AI or human, but machines have since surpassed that arrangement entirely. \n\nAmodei said the same transition would play out in software engineering, and warned that entry-level white-collar disruption is \"happening over low single-digit numbers of years.\"","contentLength":628,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Fake Job Recruiters Hid Malware In Developer Coding Challenges","url":"https://it.slashdot.org/story/26/02/15/062259/fake-job-recruiters-hid-malware-in-developer-coding-challenges?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1771173240,"author":"EditorDavid","guid":207,"unread":true,"content":"\"A new variation of the fake recruiter campaign from North Korean threat actors is targeting JavaScript and Python developers with cryptocurrency-related tasks,\" reports the Register.\n\n\nResearchers at software supply-chain security company ReversingLabs say that the threat actor creates fake companies in the blockchain and crypto-trading sectors and publishes job offerings on various platforms, like LinkedIn, Facebook, and Reddit. Developers applying for the job are required to show their skills by running, debugging, and improving a given project. However, the attacker's purpose is to make the applicant run the code... [The campaign involves 192 malicious packages published in the npm and PyPi registries. The packages download a remote access trojan that\ncan exfiltrate files, drop additional payloads, or execute arbitrary commands sent from a command-and-control server.] \n\n\nIn one case highlighted in the ReversingLabs report, a package named 'bigmathutils,' with 10,000 downloads, was benign until it reached version 1.1.0, which introduced malicious payloads. Shortly after, the threat actor removed the package, marking it as deprecated, likely to conceal the activity... The RAT checks whether the MetaMask cryptocurrency extension is installed on the victim's browser, a clear indication of its money-stealing goals... \n\nReversingLabs has found multiple variants written in JavaScript, Python, and VBS, showing an intention to cover all possible targets. \n\nThe campaign has been ongoing since at least May 2025...","contentLength":1532,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Vim 9.2 Released","url":"https://developers.slashdot.org/story/26/02/15/0741249/vim-92-released?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1771158840,"author":"EditorDavid","guid":206,"unread":true,"content":"\"More than two years after the last major 9.1 release, the Vim project has announced Vim 9.2,\" reports the blog Linuxiac:\n\n\n\nA big part of this update focuses on improving Vim9 Script as Vim 9.2 adds support for enums, generic functions, and tuple types. \n\nOn top of that, you can now use built-in functions as methods, and class handling includes features like protected constructors with _new(). The :defcompile command has also been improved to fully compile methods, which boosts performance and consistency in Vim9 scripts. \n\nInsert mode completion now includes fuzzy matching, so you get more flexible suggestions without extra plugins. You can also complete words from registers using CTRL-X CTRL-R. New completeopt flags like nosort and nearest give you more control over how matches are shown. Vim 9.2 also makes diff mode better by improving how differences are lined up and shown, especially in complex cases. \n\nPlus on Linux and Unix-like systems, Vim \"now adheres to the XDG Base Directory Specification, using $HOME/.config/vim for user configuration,\" according to the release notes. \n\n\n\nAnd Phoronix Mcites more new features:\n\n\n\nVim 9.2 features \"full support\" for Wayland with its UI and clipboard handling. The Wayland support is considered experimental in this release but it should be in good shape overall... \n\n\n\nVim 9.2 also brings a new vertical tab panel alternative to the horizontal tab line. \n\nThe Microsoft Windows GUI for Vim now also has native dark mode support.\n \n\n\nYou can find the new release on Vim's \"Download\" page.","contentLength":1552,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Spotify Says Its Best Developers Haven't Written a Line of Code Since December, Thanks To AI","url":"https://developers.slashdot.org/story/26/02/13/1834228/spotify-says-its-best-developers-havent-written-a-line-of-code-since-december-thanks-to-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1771011000,"author":"msmash","guid":205,"unread":true,"content":"Spotify's best developers have stopped writing code manually since December and now rely on an internal AI system called Honk that enables remote, real-time code deployment through Claude Code, the company's co-CEO Gustav Soderstrom said during a fourth-quarter earnings call this week. \n\nEngineers can fix bugs or add features to the iOS app from Slack on their phones during their morning commute and receive a new version of the app pushed to Slack before arriving at the office. The system has helped Spotify ship more than 50 new features throughout 2025, including AI-powered Prompted Playlists, Page Match for audiobooks, and About This Song. Soderstrom credited the system with speeding up coding and deployment tremendously and called it \"just the beginning\" for AI development at Spotify. The company is building a unique music dataset that differs from factual resources like Wikipedia because music-related questions often lack single correct answers -- workout music preferences vary from American hip-hop to Scandinavian heavy metal.","contentLength":1047,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Amazon Engineers Want Claude Code, but the Company Keeps Pushing Its Own Tool","url":"https://developers.slashdot.org/story/26/02/12/1530202/amazon-engineers-want-claude-code-but-the-company-keeps-pushing-its-own-tool?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1770912000,"author":"msmash","guid":204,"unread":true,"content":"Amazon engineers have been pushing back against internal policies that steer them toward Kiro, the company's in-house AI coding assistant, and away from Anthropic's Claude Code for production work, according to a Business Insider report based on internal messages. About 1,500 employees endorsed the formal adoption of Claude Code in one internal forum thread, and some pointed out the awkwardness of being asked to sell the tool through AWS's Bedrock platform while not being permitted to use it themselves. \n\nKiro runs on Anthropic's Claude models but uses Amazon's own tooling, and the company says roughly 70% of its software engineers used it at least once in January. Amazon says there is no explicit ban on Claude Code but applies stricter requirements for production use.","contentLength":779,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Sixteen AI Agents Built a C Compiler From Scratch","url":"https://developers.slashdot.org/story/26/02/09/1948212/sixteen-ai-agents-built-a-c-compiler-from-scratch?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1770667200,"author":"msmash","guid":203,"unread":true,"content":"Anthropic researcher Nicholas Carlini set 16 instances of Claude Opus 4.6 loose on a shared codebase over two weeks to build a C compiler from scratch, and the AI agents produced a 100,000-line Rust-based compiler capable of building a bootable Linux 6.9 kernel on x86, ARM and RISC-V architectures. \n\nThe project ran through nearly 2,000 Claude Code sessions and cost about $20,000 in API fees. Each instance operated inside its own Docker container, independently claiming tasks via lock files and pushing completed code to a shared Git repository. No orchestration agent directed traffic. The compiler achieved a 99% pass rate on the GCC torture test suite and can compile major open source projects including PostgreSQL, SQLite, Redis, FFmpeg and Doom. But it lacks a 16-bit x86 backend and calls out to GCC for that step, its assembler and linker remain buggy, and it produces less efficient code than GCC running with all optimizations disabled. \n\nCarlini also invested significant effort building test harnesses and feedback systems to keep the agents productive, and the model hit a practical ceiling at around 100,000 lines as bug fixes and new features frequently broke existing functionality.","contentLength":1203,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A New Era for Security? Anthropic's Claude Opus 4.6 Found 500 High-Severity Vulnerabilities","url":"https://it.slashdot.org/story/26/02/08/0159234/a-new-era-for-security-anthropics-claude-opus-46-found-500-high-severity-vulnerabilities?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1770518040,"author":"EditorDavid","guid":202,"unread":true,"content":"Axios reports:\n\nAnthropic's latest AI model has found more than 500 previously unknown high-severity security flaws in open-source libraries with little to no prompting, the company shared first with Axios. \n\nWhy it matters: The advancement signals an inflection point for how AI tools can help cyber defenders, even as AI is also making attacks more dangerous... \n\nAnthropic debuted Claude Opus 4.6, the latest version of its largest AI model, on Thursday. Before its debut, Anthropic's frontier red team tested Opus 4.6 in a sandboxed environment [including access to vulnerability analysis tools] to see how well it could find bugs in open-source code... Claude found more than 500 previously unknown zero-day vulnerabilities in open-source code using just its \"out-of-the-box\" capabilities, and each one was validated by either a member of Anthropic's team or an outside security researcher... According to a blog post, Claude uncovered a flaw in GhostScript, a popular utility that helps process PDF and PostScript files, that could cause it to crash. Claude also found buffer overflow flaws in OpenSC, a utility that processes smart card data, and CGIF, a tool that processes GIF files. \nLogan Graham, head of Anthropic's frontier red team, told Axios they're considering new AI-powered tools to hunt vulnerabilities. \"The models are extremely good at this, and we expect them to get much better still... I wouldn't be surprised if this was one of — or the main way — in which open-source software moving forward was secured.\"","contentLength":1536,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev","slashdot"]}