{"id":"6gUbcJtcgqw1wQBapm8qwcP58MMnPvoDmUVDva7XtKUuLQTDpuyDxDo1yehnZDohDQ6a5p","title":"Slashdot: Developers","displayTitle":"Dev - Slashdot - Dev","url":"http://rss.slashdot.org/Slashdot/slashdotDevelopers","feedLink":"https://developers.slashdot.org/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":15,"items":[{"title":"C++ on Steroids: Bjarne Stroustrup Presents Guideline-Enforcing 'Profiles' For Resource and Type Safety","url":"https://developers.slashdot.org/story/25/02/09/0636247/c-on-steroids-bjarne-stroustrup-presents-guideline-enforcing-profiles-for-resource-and-type-safety?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1739102640,"author":"EditorDavid","guid":255,"unread":true,"content":"\"It is now 45+ years since C++ was first conceived,\" writes 74-year-old C++ creator Bjarne Stroustrup in an article this week for Communications of the ACM. But he complains that many developers \"use C++ as if it was still the previous millennium,\" in an article titled 21st Century C++ that promises \"the key concepts on which performant, type safe, and flexible C++ software can be built: resource management, life-time management, error-handling, modularity, and generic programming... \n\n\"At the end, I present ways to ensure that code is contemporary, rather than relying on outdated, unsafe, and hard-to-maintain techniques: guidelines and profiles.\"\n\nTo help developers focus on effective use of contemporary C++ and avoid outdated \"dark corners\" of the language, sets of guidelines have been developed. Here I focus on the C++ Core guidelines that I consider the most ambitious... My principal aim is a type-safe and resource-safe use of ISO standard C++. That is: \n\n- Every object is exclusively used according to its definition\n- No resource is leaked \nThis encompasses what people refer to as memory safety and much more. It is not a new goal for C++. Obviously, it cannot be achieved for every use of C++, but by now we have years of experience showing that it can be done for modern code, though so far enforcement has been incomplete... When thinking about C++, it is important to remember that C++ is not just a language but part of an ecosystem consisting of implementations, libraries, tools, teaching, and more. \nWG21 (and others) are working on \"profiles\" to enforce guidelines (though they're \"not yet available, except for experimental and partial versions\"). But Stroustrup writes that the C++ Core Guidelines \"use a strategy known as subset-of-superset.\"\n\n First: extend the language with a few library abstractions: use parts of the standard library and add a tiny library to make use of the guidelines convenient and efficient (the Guidelines Support Library, GSL).\n Next: subset: ban the use of low-level, inefficient, and error-prone features. \nWhat we get is \"C++ on steroids\": Something simple, safe, flexible, and fast; rather than an impoverished subset or something relying on massive run-time checking. Nor do we create a language with novel and/or incompatible features. The result is 100% ISO standard C++. Messy, dangerous, low-level features can still be enabled and used when needed. \nStroustrup writes that the C++ Core Guidelines focus on rules \"we hope that everyone eventually could benefit from.\"\n\nNo uninitialized variables\nNo range or nullptr violations\nNo resource leaks\nNo dangling pointers\nNo type violations\nNo invalidation\n\n\nBjarne Stroustrup answered questions from Slashdot readers in 2014...\n","contentLength":2744,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Google's 7-Year Slog To Improve Chrome Extensions Still Hasn't Satisfied Developers","url":"https://developers.slashdot.org/story/25/02/07/2246202/googles-7-year-slog-to-improve-chrome-extensions-still-hasnt-satisfied-developers?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1738977900,"author":"BeauHD","guid":289,"unread":true,"content":"The Register's Thomas Claburn reports: Google's overhaul of Chrome's extension architecture continues to pose problems for developers of ad blockers, content filters, and privacy tools. [...] While Google's desire to improve the security, privacy, and performance of the Chrome extension platform is reasonable, its approach -- which focuses on code and permissions more than human oversight -- remains a work-in-progress that has left extension developers frustrated.\n \nAlexei Miagkov, senior staff technology at the Electronic Frontier Foundation, who oversees the organization's Privacy Badger extension, told The Register, \"Making extensions under MV3 is much harder than making extensions under MV2. That's just a fact. They made things harder to build and more confusing.\" Miagkov said with Privacy Badger the problem has been the slowness with which Google addresses gaps in the MV3 platform. \"It feels like MV3 is here and the web extensions team at Google is in no rush to fix the frayed ends, to fix what's missing or what's broken still.\" According to Google's documentation, \"There are currently no open issues considered a critical platform gap,\" and various issues have been addressed through the addition of new API capabilities.\n \nMiagkov described an unresolved problem that means Privacy Badger is unable to strip Google tracking redirects on Google sites. \"We can't do it the correct way because when Google engineers design the [chrome.declarativeNetRequest API], they fail to think of this scenario,\" he said. \"We can do a redirect to get rid of the tracking, but it ends up being a broken redirect for a lot of URLs. Basically, if the URL has any kind of query string parameters -- the question mark and anything beyond that -- we will break the link.\" Miagkov said a Chrome developer relations engineer had helped identify a workaround, but it's not great. Miagkov thinks these problems are of Google's own making -- the company changed the rules and has been slow to write the new ones. \"It was completely predictable because they moved the ability to fix things from extensions to themselves,\" he said. \"And now they need to fix things and they're not doing it.\"","contentLength":2187,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Oracle Starts Laying Mines In JavaScript Trademark Battle","url":"https://developers.slashdot.org/story/25/02/05/2345236/oracle-starts-laying-mines-in-javascript-trademark-battle?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1738805400,"author":"BeauHD","guid":288,"unread":true,"content":"The Register's Thomas Claburn reports: Oracle this week asked the US Patent and Trademark Office (USPTO) to partially dismiss a challenge to its JavaScript trademark. The move has been criticized as an attempt to either stall or water down legal action against the database goliath over the programming language's name. Deno Land, the outfit behind the Deno JavaScript runtime, filed a petition with the USPTO back in November in an effort to make the trademarked term available to the JavaScript community. This legal effort is led by Node.js creator and Deno Land CEO Ryan Dahl, summarized on the JavaScript.tm website, and supported by more than 16,000 members of the JavaScript community. It aims to remove the fear of an Oracle lawsuit for using the term \"JavaScript\" in a conference title or business venture.\n \n\"Programmers working with JavaScript have formed innumerable community organizations,\" the website explains. \"These organizations, like the standards bodies, have been forced to painstakingly avoid naming the programming language they are built around -- for example, JSConf. Sadly, without risking a legal trademark challenge against Oracle, there can be no 'JavaScript Conference' nor a 'JavaScript Specification.' The world's most popular programming language cannot even have a conference in its name.\" [...] In the initial trademark complaint, Deno Land makes three arguments to invalidate Oracle's ownership of \"JavaScript.\" The biz claims that JavaScript has become a generic term; that Oracle committed fraud in 2019 when it applied to renew its trademark; and that Oracle has abandoned its trademark because it does not offer JavaScript products or services.\n \nOracle's motion on Monday focuses on the dismissal of the fraud claim, while arguing that it expects to prevail on the other two claims, citing corporate use of the trademarked term \"in connection with a variety of offerings, including its JavaScript Extension Toolkit as well as developer's guides and educational resources, and also that relevant consumers do not perceive JavaScript as a generic term.\" The fraud claim follows from Deno Land's assertion that the material Oracle submitted in support of its trademark renewal application has nothing to do with any Oracle product. \"Oracle, through its attorney, submitted specimens showing screen captures of the Node.js website, a project created by Ryan Dahl, Petitioner's Chief Executive Officer,\" the trademark cancellation petition says. \"Node.js is not affiliated with Oracle, and the use of screen captures of the 'nodejs.org' website as a specimen did not show any use of the mark by Oracle or on behalf of Oracle.\"\n \nOracle contends that in fact it submitted two specimens to the USPTO -- a screenshot from the Node.js website and another from its own Oracle JavaScript Extension Toolkit. And this, among other reasons, invalidates the fraud claim, Big Red's attorneys contend. \"Where, as here, Registrant 'provided the USPTO with [two specimens]' at least one of which shows use of the mark in commerce, Petitioner cannot plausibly allege that the inclusion of a second, purportedly defective specimen, was material,\" Oracle's motion argues, adding that no evidence of fraudulent intent has been presented. Beyond asking the court to toss the fraud claim, Oracle has requested an additional thirty days to respond to the other two claims.","contentLength":3388,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"NetChoice Sues To Block Maryland's Kids Code, Saying It Violates the First Amendment","url":"https://yro.slashdot.org/story/25/02/03/2028246/netchoice-sues-to-block-marylands-kids-code-saying-it-violates-the-first-amendment?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1738616400,"author":"BeauHD","guid":287,"unread":true,"content":"NetChoice has filed (PDF) its 10th lawsuit challenging state internet regulations, this time opposing Maryland's Age-Appropriate Design Code Act. The Verge's Lauren Feiner reports: NetChoice has become one of the fiercest -- and most successful -- opponents of age verification, moderation, and design code laws, all of which would put new obligations on tech platforms and change how users experience the internet. [...] NetChoice's latest suit opposes the Maryland Age-Appropriate Design Code Act, a rule that echoes a California law of a similar name. In the California litigation, NetChoice notched a partial win in the Ninth Circuit Court of Appeals, which upheld the district court's decision to block a part of the law requiring platforms to file reports about their services' impact on kids. (It sent another part of the law back to the lower court for further review.)\n \nA similar provision in Maryland's law is at the center of NetChoice's complaint. The group says that Maryland's reporting requirement lets regulators subjectively determine the \"best interests of children,\" inviting \"discriminatory enforcement.\" The reporting requirement on tech companies essentially mandates them \"to disparage their services and opine on far-ranging and ill-defined harms that could purportedly arise from their services' 'design' and use of information,\" NetChoice alleges. NetChoice points out that both California and Maryland have passed separate online privacy laws, which NetChoice Litigation Center director Chris Marchese says shows that \"lawmakers know how to write laws to protect online privacy when what they want to do is protect online privacy.\"\n \nSupporters of the Maryland law say legislators learned from California's challenges and \"optimized\" their law to avoid questions about speech, according to Tech Policy Press. In a blog analyzing Maryland's approach, Future of Privacy Forum points out that the state made some significant changes from California's version -- such as avoiding an \"express obligationâ to determine users' ages and defining the \"best interests of children.\" The NetChoice challenge will test how well those changes can hold up to First Amendment scrutiny. NetChoice has consistently maintained that even well-intentioned attempts to protect kids online are likely to backfire. Though the Maryland law does not explicitly require the use of specific age verification tools, Marchese says it essentially leaves tech platforms with a no-win decision: collect more data on users to determine their ages and create varied user experiences or cater to the lowest common denominator and self-censor lawful content that might be considered inappropriate for its youngest users. And similar to its arguments in other cases, Marchese worries that collecting more data to identify users as minors could create a \"honey pot\" of kids' information, creating a different problem in attempting to solve another.","contentLength":2938,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Should We Sing the Praises of Agile, or Bury It?","url":"https://it.slashdot.org/story/25/02/02/1948240/should-we-sing-the-praises-of-agile-or-bury-it?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1738528440,"author":"EditorDavid","guid":286,"unread":true,"content":"\"Stakeholders must be included\" throughout an agile project \"to ensure the evolving deliverables meet their expectations,\" according to an article this week in Communications of the ACM. \n\nBut long-time Slashdot reader theodp complains it's a \"gushing how-to-make-Agile-even-better opinion piece.\"\n\nLike other pieces by Agile advocates, it's long on accolades for Agile, but short on hard evidence justifying why exactly Agile project management \"has emerged as a critical component for firms looking to improve project delivery speed and flexibility\" and the use of Agile approaches is being expanded across other departments beyond software development. Indeed, among the three examples of success offered in the piece to \"highlight the effectiveness of agile methods in navigating complex stakeholder dynamics and achieving project success\" is Atlassian's use of agile practices to market and develop its products, many of which are coincidentally designed to support Agile practices and teams (including Jira). How meta. \n\nCiting \"recent studies,\" the piece concludes its call for stakeholder engagement by noting that \"59% of organizations measure Agile success by customer or user satisfaction.\" But that is one of those metrics that can create perverse incentives. Empirical studies of user satisfaction and engagement have been published since the 1970's, and sadly one of the cruel lessons learned from them is that the easiest path to having satisfied users is to avoid working on difficult problems. Keep that in mind when you ponder why difficult user stories seem to languish forever in the Kanban and Scrum Board \"Ice Box\" column, while the \"Complete\" column is filled with low-hanging fruit. Sometimes success does come easy! So, are you in the Agile-is-Heaven or Agile-is-Hell camp?","contentLength":1798,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Slashdot Asks: Do You Remember Your High School's 'Computer Room'?","url":"https://developers.slashdot.org/story/25/02/02/0233216/slashdot-asks-do-you-remember-your-high-schools-computer-room?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1738463760,"author":"EditorDavid","guid":285,"unread":true,"content":"Bill Gates' blog has been updated with short videos about his upcoming book, including one about how his school ended up with an ASR-33 teletype that could connect their Seattle classroom to a computer in California. \"The teachers faded away pretty quickly,\" Gates adds, \"But about six of us stayed hardcore. One was Paul Allen...\" — the future co-founder of Microsoft. And the experience clearly meant a lot to Gates. \"Microsoft just never would've happened without Paul — and this teletype room.\" \n\nIn a longer post thanking his \"brilliant\" teachers, Gates calls his teletype experience \"an encounter that would shape my entire future\" and \"opened up a whole new world for me.\" Gates also thanks World War II Navy pilot and Boeing engineer Bill Dougall, who \"was instrumental in bringing computer access to our school, something he and other faculty members pushed for after taking a summer computer class... The fascinating thing about Mr. Dougall was that he didn't actually know much about programming; he exhausted his knowledge within a week. But he had the vision to know it was important and the trust to let us students figure it out.\" \n\nGates shared a similar memory about the computer-room's 20-something overseer Fred Wright, who \"intuitively understood that the best way to get students to learn was to let us explore on our own terms. There was no sign-up sheet, no locked door, no formal instruction.\"\n\nInstead, Mr. Wright let us figure things out ourselves and trusted that, without his guidance, we'd have to get creative... Some of the other teachers argued for tighter regulations, worried about what we might be doing in there unsupervised. But even though Mr. Wright occasionally popped in to break up a squabble or listen as someone explained their latest program, for the most part he defended our autonomy... \nMr. Wright gave us something invaluable: the space to discover our own potential.\n \n\nAny Slashdot readers have a similarly impactful experience? Share your own thoughts and memories in the comments. \n\nDo you remember your high school's computer room?","contentLength":2089,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Oracle Faces Java Customer Revolt After 'Predatory' Pricing Changes","url":"https://developers.slashdot.org/story/25/01/30/1617210/oracle-faces-java-customer-revolt-after-predatory-pricing-changes?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1738255260,"author":"msmash","guid":284,"unread":true,"content":"Nearly 90% of Oracle Java customers are looking to abandon the software maker's products following controversial licensing changes made in 2023, according to research firm Dimensional Research. \n\nThe exodus reflects growing frustration with Oracle's shift to per-employee pricing for its Java platform, which critics called \"predatory\" and could increase costs up to five times for the same software, Gartner found. The dissatisfaction runs deepest in Europe, where 92% of French and 95% of German users want to switch to alternative providers like Bellsoft Liberica, IBM Semeru, or Azul Platform Core.","contentLength":602,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"UK Council Sells Assets To Fund Ballooning $50 Million Oracle Project","url":"https://news.slashdot.org/story/25/01/28/004213/uk-council-sells-assets-to-fund-ballooning-50-million-oracle-project?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1738023600,"author":"BeauHD","guid":283,"unread":true,"content":"West Sussex County Council is using up to $31 million from the sale of capital assets to fund an Oracle-based transformation project, originally budgeted at $3.2 million but now expected to cost nearly $50 million due to delays and cost overruns. The project, intended to replace a 20-year-old SAP system with a SaaS-based HR and finance system, has faced multiple setbacks, renegotiated contracts, and a new systems integrator, with completion now pushed to December 2025. The Register reports: West Sussex County Council is taking advantage of the so-called \"flexible use of capital receipts scheme\" introduced in 2016 by the UK government to allow councils to use money from the sale of assets such as land, offices, and housing to fund projects that result in ongoing revenue savings. An example of the asset disposals that might contribute to the project -- set to see the council move off a 20-year-old SAP system -- comes from the sale of a former fire station in Horley, advertised for $3.1 million.\n \nMeanwhile, the delays to the project, which began in November 2019, forced the council to renegotiate its terms with Oracle, at a cost of $3 million. The council had expected the new SaaS-based HR and finance system to go live in 2021, and signed a five-year license agreement until June 2025. The plans to go live were put back to 2023, and in the spring of 2024 delayed again until December 2025. According to council documents published this week [PDF], it has \"approved the variation of the contract with Oracle Corporation UK Limited\" to cover the period from June 2025 to June 2028 and an option to extend again to the period June 2028 to 2030. \"The total value of the proposed variation is $2.96 million if the full term of the extension periods are taken,\" the council said.","contentLength":1792,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Microsoft Takes on MongoDB with PostgreSQL-Based Document Database","url":"https://developers.slashdot.org/story/25/01/27/2023232/microsoft-takes-on-mongodb-with-postgresql-based-document-database?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1738009320,"author":"msmash","guid":282,"unread":true,"content":"Microsoft has launched an open-source document database platform built on PostgreSQL, partnering with FerretDB as a front-end interface. The solution includes two PostgreSQL extensions: pg_documentdb_core for BSON optimization and pg_documentdb_api for data operations. \n\nFerretDB CEO Peter Farkas said the integration with Microsoft's DocumentDB extension has improved performance twentyfold for certain workloads in FerretDB 2.0. The platform carries no commercial licensing fees or usage restrictions under its MIT license, according to Microsoft.","contentLength":550,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"New Michigan Law Requires High Schools to Offer CS Classes","url":"https://news.slashdot.org/story/25/01/26/1547204/new-michigan-law-requires-high-schools-to-offer-cs-classes?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737912840,"author":"EditorDavid","guid":281,"unread":true,"content":"The state of Michigan will now require each public high school in the state to offer at least one computer science course to its students. \"This bill aligns Michigan with a majority of the country,\" according to the state's announcement, which says the bill \"advances technological literacy\" and ensures their students \"are well-equipped with the critical thinking skills necessary for success in the workforce.\" \nSlashdot reader theodp writes:\n\n\n\nFrom the Michigan House Fiscal Agency Analysis: \"Supporters of the bill say that increasing access to computer science courses for students in schools should be a priority of the state in order to ensure that students can compete for the types of jobs that have good pay and will be needed in the coming decades.\" \nThat analysis goes on to report that testifying in favor of the bill were tech-giant backed nonprofit Code.org (Microsoft is a $30 million Code.org donor), Amazon and AWS (Amazon is a $30+ million Code.org donor), the tech-supported Computer Science Teachers Association (CSTA), and the lobbying organization TechNet, whose members include Amazon, Apple, Google, Meta, and OpenAI). \nIt's not clear how many high schools in Michigan are already teaching CS courses, but this still raises a popular question for discussion. Should high schools be required to teach at least one CS course?","contentLength":1349,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Oracle and US Investors (Including Microsoft) Discuss Taking Control of TikTok in the US","url":"https://tech.slashdot.org/story/25/01/26/0037255/oracle-and-us-investors-including-microsoft-discuss-taking-control-of-tiktok-in-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737858840,"author":"EditorDavid","guid":280,"unread":true,"content":"A plan to keep TikTok available in the U.S. \"involves tapping software company Oracle and a group of outside investors,\" reports NPR, \"to effectively take control of the app's global operations, according to two people with direct knowledge of the talks...\" \n\n\"[P]otential investors who are engaged in the talks include Microsoft.\"\n\nUnder the deal now being negotiated by the White House, TikTok's China-based owner ByteDance would retain a minority stake in the company, but the app's algorithm, data collection and software updates will be overseen by Oracle, which already provides the foundation of TikTok's web infrastructure... \"The goal is for Oracle to effectively monitor and provide oversight with what is going on with TikTok,\" said the person directly involved in the talks, who was not authorized to speak publicly about the deliberations. \"ByteDance wouldn't completely go away, but it would minimize Chinese ownership....\" Officials from Oracle and the White House held a meeting on Friday about a potential deal, and another meeting has been scheduled for next week, according to the source involved in the discussions, who said Oracle is interested in a TikTok stake \"in the tens of billions,\" but the rest of the deal is in flux... \n\n\nUnder a law passed by Congress and upheld by the Supreme Court, TikTok must execute what is known as \"qualified divestiture\" from ByteDance in order to stay in business in the U.S... A congressional staffer involved in talks about TikTok's future, who was not authorized to speak publicly, said binding legal agreements from the White House ensuring ByteDance cannot covertly manipulate the app will prove critical in winning lawmakers' approval. \"A key part is showing there is no operational relationship with ByteDance, that they do not have control,\" the Congressional staffer said. \"There needs to be no backdoors where China can potentially gain access....\" \n\n\nChinese regulators, who have for years opposed the selling of TikTok, recently signaled that they would not stand in the way of a TikTok ownership change, saying acquisitions \"should be independently decided by the enterprises and based on market principles.\" The statement, at first, does not seem to say much, but negotiators in the White House believe it indicates that Beijing is not planning to block a deal that gives American investors a majority-stake position in the company.\n \n\n\"Meanwhile, Apple and Google still have not returned TikTok to app stores...\"","contentLength":2485,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Epic Games To Cover Developer iOS Fees","url":"https://games.slashdot.org/story/25/01/23/2350253/epic-games-to-cover-developer-ios-fees?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737680400,"author":"BeauHD","guid":279,"unread":true,"content":"Epic Games is expanding its mobile app store to include nearly 20 third-party games on Android and EU iOS, launching a free games program, and temporarily covering Apple's Core Technology Fee for participating developers to counter platform restrictions. \"Our aim here isn't just to launch a bunch of different stores in different places, but to build a single, cross-platform store in which, within the era of multi-platform games, if you buy a game or digital items in one place, you have the ability to own them everywhere,\" Epic CEO Tim Sweeney told reporters during a press briefing. The Verge reports: Under the program, Epic will offer new free games in the store each month before eventually switching to a weekly schedule. However, the games aren't actually in the store yet -- Epic said on Thursday that it \"ran into a few bugs that we're working through now\" and \"we'll provide an update once the games are live and ready to play!\"\n \nTo sweeten the deal for developers that participate in the free games program on iOS, Epic will help defray the cost of using third-party marketplaces. For one year, it will pay these developers' Core Technology Fee (CTF): a 50 euro cent fee levied on every install of an iOS app that uses third-party stores after it exceeds 1 million annual downloads. (Apple gives developers with less than 10 million euros in global revenue a three-year on-ramp.) [...] Epic writes in its blog post that covering the fee \"is not financially viable for every third party app store or for Epic long term, but we'll do it while the European Commission investigates Apple's non-compliance with the law.\"","contentLength":1631,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"IMDb Founder Steps Down As CEO After 35 Years","url":"https://developers.slashdot.org/story/25/01/21/2232241/imdb-founder-steps-down-as-ceo-after-35-years?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737507600,"author":"BeauHD","guid":278,"unread":true,"content":"IMDb founder Col Needham is stepping down as CEO after 35 years, transitioning to executive chair. He will be succeeded by Nikki Santoro, who has served as the chief operating officer since 2021. TechCrunch reports: Santoro's appointment is significant, as she is the first woman to become the CEO and only the second person to hold the position. Needham founded IMDb in 1990 at the age of 23, steering the company into a powerhouse within the entertainment industry. After 35 years, he'll transition to a new role as executive chair.\n \nAccording to Needham, Santoro's ascension is well deserved. [...] Santoro has been with the company since 2016, leading the company in expanding its database and improving its IMDbPro membership. She previously held leadership positions at Amazon, Microsoft, and The Weather Channel. \"Nikki's strategic vision, deep understanding of our customers and products, and commitment to innovation have already delivered impressive business results during her tenure as COO,\" said Needham in a statement. \"Her track record of driving growth and enhancing our products and services makes her the ideal person to guide IMDb into a new era.\"","contentLength":1167,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Node.js 'Type Stripping' for TypeScript Now Enabled by Default","url":"https://developers.slashdot.org/story/25/01/19/0335202/nodejs-type-stripping-for-typescript-now-enabled-by-default?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737304440,"author":"EditorDavid","guid":277,"unread":true,"content":"The JavaScript runtime Node.js can execute TypeScript (Microsoft's JavaScript-derived language with static typing). \nBut now it can do it even better, explains Marco Ippolito of the Node.js steering committee:\n\nIn August 2024 Node.js introduced a new experimental feature, Type Stripping, aimed at addressing a longstanding challenge in the Node.js ecosystem: running TypeScript with no configuration. Enabled by default in Node.js v23.6.0, this feature is on its way to becoming stable. \n\n\nTypeScript has reached incredible levels of popularity and has been the most requested feature in all the latest Node.js surveys. Unlike other alternatives such as CoffeeScript or Flow, which never gained similar traction, TypeScript has become a cornerstone of modern development. While it has been supported in Node.js for some time through loaders, they relied heavily on configuration and user libraries. This reliance led to inconsistencies between different loaders, making them difficult to use interchangeably. The developer experience suffered due to these inconsistencies and the extra setup required... The goal is to make development faster and simpler, eliminating the overhead of configuration while maintaining the flexibility that developers expect... \n\nTypeScript is not just a language, it also relies on a toolchain to implement its features. The primary tool for this purpose is tsc, the TypeScript compiler CLI... Type checking is tightly coupled to the implementation of tsc, as there is no formal specification for how the language's type system should behave. This lack of a specification means that the behavior of tsc is effectively the definition of TypeScript's type system. tsc does not follow semantic versioning, so even minor updates can introduce changes to type checking that may break existing code. Transpilation, on the other hand, is a more stable process. It involves converting TypeScript code into JavaScript by removing types, transforming certain syntax constructs, and optionally \"downleveling\" the JavaScript to allow modern syntax to execute on older JavaScript engines. Unlike type checking, transpilation is less likely to change in breaking ways across versions of tsc. The likelihood of breaking changes is further reduced when we only consider the minimum transpilation needed to make the TypeScript code executable — and exclude downleveling of new JavaScript features not yet available in the JavaScript engine but available in TypeScript... \n\nNode.js, before enabling it by default, introduced --experimental-strip-types. This mode allows running TypeScript files by simply stripping inline types without performing type checking or any other code transformation. This minimal technique is known as Type Stripping. By excluding type checking and traditional transpilation, the more unstable aspects of TypeScript, Node.js reduces the risk of instability and mostly sidesteps the need to track minor TypeScript updates. Moreover, this solution does not require any configuration in order to execute code... Node.js eliminates the need for source maps by replacing the removed syntax with blank spaces, ensuring that the original locations of the code and structure remain intact. It is transparent — the code that runs is the code the author wrote, minus the types... \n\n\"As this experimental feature evolves, the Node.js team will continue collaborating with the TypeScript team and the community to refine its behavior and reduce friction. You can check the roadmap for practical next steps...\"","contentLength":3543,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Google Reports Halving Code Migration Time With AI Help","url":"https://developers.slashdot.org/story/25/01/17/2156235/google-reports-halving-code-migration-time-with-ai-help?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737158520,"author":"BeauHD","guid":276,"unread":true,"content":"Google computer scientists have been using LLMs to streamline internal code migrations, achieving significant time savings of up to 89% in some cases. The findings appear in a pre-print paper titled \"How is Google using AI for internal code migrations?\" The Register reports: Their focus is on bespoke AI tools developed for specific product areas, such as Ads, Search, Workspace and YouTube, instead of generic AI tools that provide broadly applicable services like code completion, code review, and question answering. Google's code migrations involved: changing 32-bit IDs in the 500-plus-million-line codebase for Google Ads to 64-bit IDs; converting its old JUnit3 testing library to JUnit4; and replacing the Joda time library with Java's standard java.time package. The int32 to int64 migration, the Googlers explain, was not trivial as the IDs were often generically defined (int32_t in C++ or Integer in Java) and were not easily searchable. They existed in tens of thousands of code locations across thousands of files. Changes had to be tracked across multiple teams and changes to class interfaces had to be considered across multiple files. \"The full effort, if done manually, was expected to require hundreds of software engineering years and complex crossteam coordination,\" the authors explain.\n \nFor their LLM-based workflow, Google's software engineers implemented the following process. An engineer from Ads would identify an ID in need of migration using a combination of code search, Kythe, and custom scripts. Then an LLM-based migration toolkit, triggered by someone knowledgeable in the art, was run to generate verified changes containing code that passed unit tests. Those changes would be manually checked by the same engineer and potentially corrected. Thereafter, the code changes would be sent to multiple reviewers who are responsible for the portion of the codebase affected by the changes. The result was that 80 percent of the code modifications in the change lists (CLs) were purely the product of AI; the remainder were either human-authored or human-edited AI suggestions.\n \n\"We discovered that in most cases, the human needed to revert at least some changes the model made that were either incorrect or not necessary,\" the authors observe. \"Given the complexity and sensitive nature of the modified code, effort has to be spent in carefully rolling out each change to users.\" Based on this, Google undertook further work on LLM-driven verification to reduce the need for detailed review. Even with the need to double-check the LLM's work, the authors estimate that the time required to complete the migration was reduced by 50 percent. With LLM assistance, it took just three months to migrate 5,359 files and modify 149,000 lines of code to complete the JUnit3-JUnit4 transition. Approximately 87 percent of the code generated by AI ended up being committed with no changes. As for the Joda-Java time framework switch, the authors estimate a time saving of 89 percent compared to the projected manual change time, though no specifics were provided to support that assertion.","contentLength":3113,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev","slashdot"]}