{"id":"7DceLgR4szFyHjpUotrBgPp9fEDdwmRmyXGW53xLQnbPAifjKVFPj1dyKJ6sHa1bC6AC9QFBhYUJLmJ6GyX57","title":"top scoring links : linux","displayTitle":"Reddit - Linux","url":"https://www.reddit.com/r/linux/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/linux/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Several Linux DRM Drivers Orphaned Due To Developer Health","url":"https://www.phoronix.com/news/Several-Linux-DRM-Orphaned","date":1737775080,"author":"/u/GL4389","guid":576,"unread":true,"content":"<p>Michael Larabel is the principal author of Phoronix.com and founded the site in 2004 with a focus on enriching the Linux hardware experience. Michael has written more than 20,000 articles covering the state of Linux hardware support, Linux performance, graphics drivers, and other topics. Michael is also the lead developer of the Phoronix Test Suite, Phoromatic, and OpenBenchmarking.org automated benchmarking software. He can be followed via <a href=\"https://twitter.com/MichaelLarabel\">Twitter</a>, <a href=\"https://www.linkedin.com/in/michaellarabel/\">LinkedIn</a>, or contacted via <a href=\"https://www.michaellarabel.com/\">MichaelLarabel.com</a>.</p>","contentLength":500,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1i9dt3e/several_linux_drm_drivers_orphaned_due_to/"},{"title":"MediaTek improvements in Linux 6.13","url":"https://www.collabora.com/news-and-blog/news-and-events/mediatek-improvements-in-linux-613.html","date":1737749806,"author":"/u/mfilion","guid":575,"unread":true,"content":"<p>Made available earlier this week, Linux 6.13 brought numerous contributions from our engineering team. Collabora's deep involvement with the MediaTek community also continued to shine, with multiple improvements for MediaTek SoCs landing with this release.</p><p>AngeloGioacchino Del Regno introduced support to communicate with the Dynamic Voltage and Frequency Scaling Resource Collector (DVFSRC) hardware in MediaTek SoCs. As a result, the previously upstreamed DVFSRC Regulator and External Memory Interface (EMI) Interconnect drivers can now be enabled. This allows the System Companion Processor (SCP) Core Voltage and the EMI Bus Bandwidth to be scaled, improving the power efficiency of MediaTek-powered machines.</p><p>Moreover, during a round of testing, Angelo also found that the MMC/SD Controller of MediaTek SoCs doesn't always embed Command Queue Hardware (CQHCI) on all SoCs or even on all instances of the said controller on the same SoCs. For example, on MT8186, MT8192, MT8195 (and others), the eMMC instance of this controller does support CQE by hardware but the (Micro)SD one does not: this brings numerous performance hits, sometimes also shown as micro-stuttering in UX, because of a necessary spinlock at every read, or write, operation.</p><p>In order to overcome this, he implemented support in the MediaTek MMC/SD Controller driver (mtk-sd) for a software-based alternative for controller instances that don't support CQHCI, called Host Software Queue (HSQ): by doing so, MediaTek's driver acquires spinlocks less frequently, reducing expensive context switching, since it joins the sending of multiple commands into one single operation.</p><p>His tests with this patch, which he ran on a MT8195 Tomato Chromebook with a SanDisk Extreme Pro (A2 rated) MicroSD card, show decreased average access times (with a reduction of up to 150 milliseconds during intensive read/write cycles). This is an improvement of +50.5% IOPS and bandwidth during random 4k reads/writes, +24.28% during random 4k reads, and +3.14% in sequential reads. This has greatly reduced UX micro-stuttering, making them mostly unnoticeable during read/write-intensive workloads, such as opening the Chromium or Firefox browsers on GNOME.</p><p>Another notable contribution from Angelo includes the introduction of the support for OF Graphs in the MediaTek Display Controller (mediatek-drm) driver. The display IP cores in MediaTek SoCs allow a good amount of flexibility, supporting being interconnected with various different IP cores (for example, the Read DMA IP can be connected to either the Color Management, DisplayPort, DSI, Merge, or another IP) to form a full Display Data Path (DDP) that ends with an actual display. As the Display Data Path for a machine (Chromebook/Laptop, Smartphone, SBCs, etc) depends on the physically available display output(s), this cannot be hardcoded as a SoC-global parameter and is machine-specific.</p><p>His change removes the need to hardcode display paths into the driver for each machine, allowing them to be specified in the Device Tree of the target machine with an OF Graph. This avoids unnecessary growth of the mediatek-drm driver and reflects the configuration flexibility of the MediaTek Display Controller into devicetree files.</p><p>More contributions from Angelo include various other cleanups and improvements. He modernized the MediaTek RTC driver to use the RTC-subsystem provided APIs, reducing both binary and code size. He also added support for restricting Link Speed (Gen) and Link Width (Lanes) in the MediaTek PCI-Express Gen3 Controller driver.</p><p>Stay tuned for more MediaTek updates, as well as a complete recap of our contributions to Linux 6.13.</p>","contentLength":3661,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1i94uul/mediatek_improvements_in_linux_613/"},{"title":"Would you ever pay/donate to a Photoshop competitor that is Linux-first?","url":"https://www.reddit.com/r/linux/comments/1i92s5c/would_you_ever_paydonate_to_a_photoshop/","date":1737744521,"author":"/u/True-Direction5217","guid":579,"unread":true,"content":"<p>I've seen many posts throughout the years that share my sentiment on not having Photoshop on Linux, and that the alternatives aren't in one way or another filling that need. I've realized that even if Photoshop came to Linux today, I don't think I'd use it, because of Adobe. I left Windows because software these days are plagued by enshitifcation, invading your privacy, poor performance and security. Top it off with Adobe's recent nonsense around training on your data and exorbitant cancellation fees, was the final nail in the coffin for me.</p><p>So I decided to work on my own PS-like editor that have been such a joy to write so far, but still very far off from a releasable state. I would love to work on full-time and thinking about raising some form of funding instead of working at another morally-bankrupt company.</p><p>I know some will ask why not help out on other existing projects like Gimp. The reason is quite simply these projects are built on years of legacy code with a vision &amp; programming language that isn't completely compatible with mine. None of my MRs would ever get accepted because what I have in mind for my editor would simply not be possible without major rewrites. It would be much easier to start from scratch.</p><p>From what I can gather, Adobe does not see it as worth investing in adding support for Linux, whether that is just due to the size of the user base or maybe they feel people in the Linux community are less inclined to pay for software in general. </p><p>So my question to the community: Would anyone be interested in buying or donating to such a thing or am I completely delusional here?</p>","contentLength":1614,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Learned from mistakes","url":"https://www.reddit.com/r/linux/comments/1i92kkw/learned_from_mistakes/","date":1737743999,"author":"/u/Lillian_La_Elara_","guid":578,"unread":true,"content":"<p>So yesterday was deffenetly a day... i had a good working KDE Setup but of course the kind of person i am i had to fiddle around, i see all these beautifull Hyprland setups, thought i try to install it, make it look pretty, that didn't work out. Watching YouTube guides rarely work out, there are some that work but that's usually not the case. This time when i tried to instatll Hyprland, i wiped my KDE and started a new Archinstall, which installed a chunk of the stuff, as i followed the instructions the person opend the terminal and guided into the config to edit stuff, that's when everything became problematic as i was unable to interact with the config...i couldn't delete or write into it i was so utterly confused, so i re installed KDE tried to pretty it up, i eventually fucked up and rigged my own system, probably with the Sudo Chown command i lost all root acess with the following error that UID 1000 has acess and it should be 0, i spent an hour trouble shooting, i was able to acess root function from the bios, starting Arch in single mode but it refused to change the Writing,Reading conditions... after an hour i decided to okay reinstall KDE... for the 3rd time that day...i eventually finnished at 1AM. As you can see i didn't do any major fuckery with my system this time, i kept it simple, i still had to use Sudo Chown to give my user account read and write acess to my mounted drives but this time the system integrity is good, nothing is bricked so far. I still have to eventually make a backup file with all the programs,dependencys downloaded. Will i try this again? Im not sure...im kinda scared to...i probably messed it up with Chown command or something along that line...i tried to install eww, i tried to install an image burner both failed...maybe keeping it simple as is...ain't that bad...it works, heck after this install my RAM usage somehow gotten a lot better too. If it were my secoundary PC i would keep fiddle around but this is my one and only main PC and i need it to be stable and functional.</p>","contentLength":2043,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Richard Stallman to Visit India's Birla Institute of Technology and Science, Hyderabad","url":"https://www.reddit.com/r/linux/comments/1i8v1ka/richard_stallman_to_visit_indias_birla_institute/","date":1737724287,"author":"/u/fury999io","guid":577,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Richard Stallman in BITS Pilani, India","url":"https://www.reddit.com/r/linux/comments/1i8uxl6/richard_stallman_in_bits_pilani_india/","date":1737723941,"author":"/u/SpyCracker21","guid":580,"unread":true,"content":"<div><p>Richard Stallman has come to my college today to give a talk and said chatGPT is Bullshit and is an example of Artificial Stupidness 😂</p></div>   submitted by   <a href=\"https://www.reddit.com/user/SpyCracker21\"> /u/SpyCracker21 </a>","contentLength":172,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}]}