{"id":"7DceLgR4szFyHjpUotrBgPp9fEDdwmRmyXGW53xLQnbPAifjKVFPj1dyKJ6sHa1bC6AC9QFBhYUJLmJ6GyX57","title":"top scoring links : linux","displayTitle":"Reddit - Linux","url":"https://www.reddit.com/r/linux/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/linux/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"tiling window manager for the masses!","url":"https://www.reddit.com/r/linux/comments/1k3vegn/tiling_window_manager_for_the_masses/","date":1745179999,"author":"/u/Savings_Walk_1022","guid":480,"unread":true,"content":"<p>hey guys i made a window manager called sxwm!</p><p>its a really, really, really easily configurable tiling windowmanager like dwm or i3wm.</p><p>its also really fast and uses 0.2m of memory!</p><p>i hope this can let people experience tiling wm's without any fear.</p><p>i turned 16 meaning i can have an internship and for a job you need a portfolio. I have nothing so when i found this 2 year old scrap project i thought this was perfect!</p><p>i also dont like how time consuming patching dwm is and how the quality of the patches vary a  so this project includes all the necessary features of a window manager and makes configuring it easy even though its from a C header.</p><p>i hope you likemy project and if you make any good improvements please make sure to make a pull request so i can incorporate it to the main branch</p>","contentLength":788,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"No Arch hasnt gotten that much better, its Ubuntu that has gotten progressively worse.","url":"https://www.reddit.com/r/linux/comments/1k3sh49/no_arch_hasnt_gotten_that_much_better_its_ubuntu/","date":1745171999,"author":"/u/babuloseo","guid":482,"unread":true,"content":"<p>See snap breaking server functionality, desktop functionality and more, I stopped using Ubuntu in a server capacity when snaps started breaking packages and was the preffered or default way of installing key packages that I need on my servers. Whereas in Arch things are working pretty damn well, that I am using it in a server capacity and it hasnt dissapointed me yet, it has dissapointed me in late 2010s when I was using custom AURs or patches to support some things, but it feels like Arch has come very very far nowadays whereas Ubuntu seems to have gotten worse slowly.</p>","contentLength":576,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ubuntu 6.06 (2006)","url":"https://www.reddit.com/r/linux/comments/1k3rsih/ubuntu_606_2006/","date":1745170193,"author":"/u/HeitorMD2","guid":483,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux battery life on laptops","url":"https://www.reddit.com/r/linux/comments/1k3kncj/linux_battery_life_on_laptops/","date":1745149173,"author":"/u/Tiny-Satisfaction-40","guid":478,"unread":true,"content":"<p>I'm thinking about switching to Mint on my laptop, but found out in most cases the battery life was worse on Linux than on Windows, though the posts I tound were from 2-3 years ago.</p><p>Has battery life on Linux improved?</p>","contentLength":216,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"[UPDATE] Successfully fixed the problems of QCA9377 802.11ac Wireless Network Adapter!","url":"https://www.reddit.com/r/linux/comments/1k387ef/update_successfully_fixed_the_problems_of_qca9377/","date":1745102161,"author":"/u/lonelyroom-eklaghor","guid":481,"unread":true,"content":"<p>This is a guide. If you have a Qualcomm Atheros QCA9377 802.11ac Wireless Network Adapter and you're facing issues in Linux, this is for you only.</p><p>I have switched from KDE Neon to Fedora Workstation, and honestly, it works mostly fine (except the Night Light). However, I faced the same Wi-Fi problem initially. As I was trying out everything, I noted down the quirks of all the techniques out there on the Internet.</p><p>The issue here is that there are two kinds of problems with this particular WLAN adapter: the disconnection problem and the network speed problem. In my case, I'll be mainly dealing with the disconnection problem, but in case anyone knows about the network problem (especially how to implement Roaming Aggressiveness in Linux), then I'll cover it in a separate post. Experts are encouraged to chime in :)</p><p>A simple note that some of these methods might work in one distro, but not for the other ones. However, I'll only be stating the ones which worked for me in Fedora 41 &amp; 42.</p><ul><li>In your terminal, open this file<code>/etc/NetworkManager/conf.d/wifi-powersave.conf</code> using whatever editor you prefer. (Neovim or Nano or Emacs or whatever)</li></ul><p>Write this down or change it appropriately:</p><pre><code>[connection] wifi.powersave=2 </code></pre><p>Restart your computer after that.</p><p>For me, it absolutely didn't work. <strong>The wlp1s0 network interface was disappearing as a whole.</strong></p><p>This one might not actually work because linux-firmware has already merged the last commit, so this might not be the fix.</p><p>At first, check if this is the file tree:</p><pre><code>/lib/firmware/ath10k/QCA9377 ├── firmware-6.bin.xz └── hw1.0 ├── board-2.bin ├── board-2.bin.xz ├── board.bin ├── board.bin.xz ├── CNSS.TF.1.0 ├── firmware-5.bin.xz ├── firmware-6.bin.xz ├── firmware-sdio-5.bin.xz ├── notice_ath10k_firmware-5.txt.xz ├── notice_ath10k_firmware-6.txt.xz -&gt; ../../QCA6174/hw3.0/notice_ath10k_firmware-6.txt.xz ├── notice_ath10k_firmware-sdio-5.txt.xz -&gt; notice_ath10k_firmware-5.txt.xz ├── untested ├── WLAN.TF.1.0 └── WLAN.TF.2.1 </code></pre><p>You just need to ensure that there is content within this  directory; it's optional for the files to match.</p><ul><li>Click on the Code icon in blue, then scroll down to \"Download this directory\". Under that section, you can download in any format.</li><li>Download that archive, then extract it.</li><li>Through your terminal, use  to go to the folder where you have extracted it all.</li><li>Go to the directory/folder named . Under that directory, there will only be one item called .</li><li>While being under this  directory in the terminal, as a protective measure, write <code>ls /lib/firmware/ath10k/QCA9377/</code>. Check if there's only  or not.</li><li>Press the up arrow, then replace thatwith  . Then it becomes<code>sudo cp -rv * /lib/firmware/ath10k/QCA9377/</code>.</li><li>Press Enter. Wait for the files to go.</li></ul><p>Just so you know, it didn't work in this case.</p><p><strong><em>3) Copying firmware files (didn't work but this can fix your issue)</em></strong></p><ul><li>As usual, check what <code>ls /lib/firmware/ath10k/QCA9377/hw1.0/</code> leads to. What are the names of the firmware files?</li><li>I think you guys have seen it... the names are like firmware-6, firmware-5. Basically, the one with the highest number is the one being run.</li><li>Suppose N is the highest number. Then, you will use <code>cd /lib/firmware/ath10k/QCA9377/hw1.0/</code> .</li><li>Notice the file you see resembling <code>firmware-N.whatever.extensions</code> . Copy it to the parent directory. In simpler terms: <code>sudo cp -v firmware-N.whatever.extensions ..</code></li></ul><p>Even this one didn't quite work. At first, it could resolve the network interface disappearance issue for some time. I even attended a class through Google Meet. But just after classes ended, I used Suspend/S3 Sleep. After waking, the Wi-Fi wasn't working at all, just like the previous solutions. On a different note, you guys can try this out if you can make a startup script with root access (but this might be tedious): <a href=\"https://github.com/pop-os/pop/issues/1470#issuecomment-2029119116\">https://github.com/pop-os/pop/issues/1470#issuecomment-2029119116</a></p><p><strong><em>4) ath10k-custom.conf (hyphen) and ath10k_core.conf (underscore) (Read it carefully, skip_otp is an important aspect after all)</em></strong></p><p>At first, I tried to create ath10k-custom.conf. That's what helped someone in the previous post. However, my problems were resolved ONLY after wrting ath10k_core.conf.</p><p>Just execute these commands ONCE and you'll be fine. <em>Note that the following commands are case-sensitive.</em></p><ul><li>For ath10k-custom.conf: <code>echo -e \"options ath10k_core skip_otp=y\\noptions ath10k_core rawmode=0\" | sudo tee -a /etc/modprobe.d/ath10k-custom.conf</code></li><li>For ath10k_core.conf: <code>echo \"options ath10k_core skip_otp=y\" | sudo tee -a /etc/modprobe.d/ath10k_core.conf</code></li></ul><p>Restart your PC after executing the first command, and after executing the second command (basically twice).</p><p>I have tried my best to propose all the solutions to this problem I could find, and now I'm tired. It's already 3:58 AM. To the firmware/NetworkManager experts, it'd be a pleasure for me to know how can roaming aggressiveness be increased. To the normal users, in case you find anything problematic, you can ask me in the comments.</p>","contentLength":4992,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Shout out to nautilus-scripts (which, despite the name, work in Caja, Dolphin, Nemo, PCManFM-Q, and Thunar, too)","url":"https://www.reddit.com/r/linux/comments/1k37s2f/shout_out_to_nautilusscripts_which_despite_the/","date":1745100879,"author":"/u/JimmyRecard","guid":479,"unread":true,"content":"<p>This project is probably my single most used tool outside of the core OS software, and after it saved me a bunch of time yet again, I figured I'd rave about it a bit, if you'll indulge me.</p><p>I'm not much of a customisation devotee. I rawdog basically vanilla Gnome with only a few strategic extensions, and that's the way I like it. But the one place where this radical turn towards simplicity has presented challenges are file managers.</p><p>Back years ago in my Windows days, I used to us Directory Opus and loved it, but none of the third party file managers really stuck with me on Linux. But I still missed some of the cool features. Well, this project fills the gap.</p><p>It is a set of scripts that you can invoke from context click to execute all kinds of useful actions. The selection is extensive, and I use the following the most:</p><ul><li>copy filepath to clipboard (the path box doesn't contain name of the specific file, this lets me yoink the path and the file name in one go)</li><li>paste from clipboard as a file (paste text directly into a file, without needing to create the file first)</li><li>list the largest files/directories</li><li>combine multiple PDFs into one (great for merging multiple PDFs into one before feeding it to my document storage solution)</li><li>optimise PDFs/images for web</li><li>strip exif data via ExifTool</li><li>verify checksum files (to verify my linux .isos, naturally)</li><li>convert webps to pngs/jpgs</li><li>paste as hard links (recursively paste whole folder as hard links, equivalent of , my MVP)</li><li>permanently delete via </li><li>git operations, especially pull</li></ul><p>There are a bunch more too. If you find the sheer number overwhelming, you don't have to use them all, the install script lets you pick what you want.</p><p>If you ever felt your file manager needed a bit more oomph, give it a look.</p>","contentLength":1739,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev","reddit"]}