{"id":"7DceLgR4szFyHjpUotrBgPp9fEDdwmRmyXGW53xLQnbPAifjKVFPj1dyKJ6sHa1bC6AC9QFBhYUJLmJ6GyX57","title":"top scoring links : linux","displayTitle":"Reddit - Linux","url":"https://www.reddit.com/r/linux/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/linux/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Karol Herbst steps down as Nouveau maintainer due to “thin blue line comment”","url":"https://www.reddit.com/r/linux/comments/1iq09g6/karol_herbst_steps_down_as_nouveau_maintainer_due/","date":1739622250,"author":"/u/mdedetrich","guid":586,"unread":true,"content":"<p>\"I was pondering with myself for a while if I should just make it official that I'm not really involved in the kernel community anymore, neither as a reviewer, nor as a maintainer.</p><p>Most of the time I simply excused myself with \"if something urgent comes up, I can chime in and help out\". Lyude and Danilo are doing a wonderful job and I've put all my trust into them.</p><p>However, there is one thing I can't stand and it's hurting me the most. I'm convinced, no, my core believe is, that inclusivity and respect, working with others as equals, no power plays involved, is how we should work together within the Free and Open Source community.</p><p>I can understand maintainers needing to learn, being concerned on technical points. Everybody deserves the time to understand and learn. It is my true belief that most people are capable of change eventually. I truly believe this community can change from within, however this doesn't mean it's going to be a smooth process.</p><p>The moment I made up my mind about this was reading the following words written by a maintainer within the kernel community:</p><p>\"we are the thin blue line\"</p><p>This isn't okay. This isn't creating an inclusive environment. This isn't okay with the current political situation especially in the US. A maintainer speaking those words can't be kept. No matter how important or critical or relevant they are. They need to be removed until they learn. Learn what those words mean for a lot of marginalized people. Learn about what horrors it evokes in their minds.</p><p>I can't in good faith remain to be part of a project and its community where those words are tolerated. Those words are not technical, they are a political statement. Even if unintentionally, such words carry power, they carry meanings one needs to be aware of. They do cause an immense amount of harm.</p><p>I wish the best of luck for everybody to continue to try to work from within. You got my full support and I won't hold it against anybody trying to improve the community, it's a thankless job, it's a lot of work. People will continue to burn out.</p><p>I got burned out enough by myself caring about the bits I maintained, but eventually I had to realize my limits. The obligation I felt was eating me from inside. It stopped being fun at some point and I reached a point where I simply couldn't continue the work I was so motivated doing as I've did in the early days.</p><p>Please respect my wishes and put this statement as is into the tree. Leaving anything out destroys its entire meaning.</p>","contentLength":2492,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Richard Stallman in Polytechnic University of Turin, Italy","url":"https://www.reddit.com/r/linux/comments/1ipz4wy/richard_stallman_in_polytechnic_university_of/","date":1739617538,"author":"/u/ShockleyTransistor","guid":590,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux in any distribution is unobtainable for most people because the first two installation steps are basically impossible.","url":"https://www.reddit.com/r/linux/comments/1ipyc1o/linux_in_any_distribution_is_unobtainable_for/","date":1739613947,"author":"/u/trollfinnes","guid":588,"unread":true,"content":"<p>Recently, just before Christmas, I decided to check out Linux again (tried it ~20 years ago) because Windows 11 was about to cause an aneurysm.</p><p>I was expecting to spend the \"weekend\" getting everything to work; find hardware drivers, installing various open source software and generally just 'hack together something that works'.</p><p>To my surprise everything worked flawlessly first time booting up. I had WiFi, sound, usb, webcam, memory card reader, correct screen resolution. I even got battery status and management! It even came with a nice litte 'app center' making installation of a bunch of software as simple as a click!</p><p>And I remember thinking any Windows user could  install Linux and would get comfortable using it in an afternoon.</p><p>I'm pretty 'comfortable' in anything PC and have changed boot orders and created bootable things since the early 90's and considered that part of the installation the easiest part.</p><p>However, most people have never heard about any of them, and that makes the two steps seem 'impossible'.</p><p>I recently convinced a friend of mine, who also couldn't stand Window11, to install Linux instead as it would easily cover all his PC needs. </p><p>And while he is definitely in the upper half of people in terms of 'tech savvyness', both those \"two easy first steps\" made it virtually impossible for him to install it. </p><p>He easily managed downloading the .iso, but turning that iso into a bootable USB-stick turned out to be too difficult. But after guiding him over the phone he was able to create it.</p><p>But he wasn't able to get into bios despite all my attempts explaining what button to push and when</p><p>Next day he came over with his laptop. And just out of reflex I just started smashing the F2 key (or whatever it was) repeatingly and got right into bios where I enabled USB boot and put it at the top at the sequence.</p><p>After that he managed to install Linux just fine without my supervision.</p><p>But it made me realise that the two first steps in installing Linux, that are second nature to me and probably everyone involved with Linux from people just using it to people working on huge distributions, makes them virtually impossible for most people to install it.</p><p>I don't know enough about programming to know of this is possible:</p><p>Instead of an .iso file for download some sort of .exe file can be downloaded that is able to create a bootable USB-stick and change the boot order?</p><p>That would 'open up' Linux to  more people, probably orders of magnitude..</p>","contentLength":2460,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"what was the Linux expirance like in the 90's and 00's?","url":"https://www.reddit.com/r/linux/comments/1ipql9k/what_was_the_linux_expirance_like_in_the_90s_and/","date":1739583310,"author":"/u/mrcrabs6464","guid":587,"unread":true,"content":"<div><p>I started using Linux about 2 years ago really right at the beginning of the proton revolution. And I know that Gaming in specif was the biggest walls for mass adaption of Linux throughout the 2010's and late 2000's but Ive heard things about how most software ran through WINE until Direct x and other API's became more common. but gaming aside what was the expirance and community like at the time?</p></div>   submitted by   <a href=\"https://www.reddit.com/user/mrcrabs6464\"> /u/mrcrabs6464 </a>","contentLength":434,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Dynamic triple/double buffering merge request for GNOME was just merged!","url":"https://gitlab.gnome.org/GNOME/mutter/-/merge_requests/1441","date":1739556559,"author":"/u/joojmachine","guid":591,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1ipguyt/dynamic_tripledouble_buffering_merge_request_for/"},{"title":"Why does Linux open large file bases much faster than windows?","url":"https://www.reddit.com/r/linux/comments/1ipd8a7/why_does_linux_open_large_file_bases_much_faster/","date":1739547296,"author":"/u/AlternativeCarpet494","guid":589,"unread":true,"content":"<p>So I have a 4TB hard drive with around a 100 GB dataset on it. I was going to some useless uni classes today and thought oh I’ll just work on some of my code to process the data set on my windows laptop. Anyways, the file explorer crashed. Why is the windows file system so much worse?</p>","contentLength":287,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev","reddit"]}