{"id":"7DceLgR4szFyHjpUotrBgPp9fEDdwmRmyXGW53xLQnbPAifjKVFPj1dyKJ6sHa1bC6AC9QFBhYUJLmJ6GyX57","title":"top scoring links : linux","displayTitle":"Reddit - Linux","url":"https://www.reddit.com/r/linux/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/linux/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Facebook considers Linux and related topics a \"cybersecurity threat\", according to Distrowatch","url":"https://www.reddit.com/r/linux/comments/1ib3vaf/facebook_considers_linux_and_related_topics_a/","date":1737968106,"author":"/u/Sirius707","guid":573,"unread":true,"content":"<blockquote><p>Starting on January 19, 2025 Facebook's internal policy makers decided that Linux is malware and labelled groups associated with Linux as being \"cybersecurity threats\". Any posts mentioning DistroWatch and multiple groups associated with Linux and Linux discussions have either been shut down or had many of their posts removed.</p><p>We've been hearing all week from readers who say they can no longer post about Linux on Facebook or share links to DistroWatch. Some people have reported their accounts have been locked or limited for posting about Linux.</p><p>The sad irony here is that Facebook runs much of its infrastructure on Linux and often posts job ads looking for Linux developers.</p><p>Unfortunately, there isn't anything we can do about this, apart from advising people to get their Linux-related information from sources other than Facebook. I've tried to appeal the ban and was told the next day that Linux-related material is staying on the cybersecurity filter. My Facebook account was also locked for my efforts.</p></blockquote>","contentLength":1011,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Orbitiny Desktop Environment Released (Originally Announced as LQDE)","url":"https://www.reddit.com/r/linux/comments/1iayzwm/orbitiny_desktop_environment_released_originally/","date":1737949743,"author":"/u/sash-au","guid":570,"unread":true,"content":"<p>Finally, after about a month after the original announcement (LQDE), the  has been released.</p><p>Built from the ground up using  and coded in C++,  is a new, 100% portable, innovative and traditional but modern looking desktop environment for Linux.  because it has features <strong>not seen in any other desktop environment before</strong> while <strong>keeping traditional aspects of computing alive</strong> (desktop icons, menus etc).</p><p>Portable because you can run it on any distro and on any live CD and that's because everything gets saved inside the directory that gets created when the archive is extracted (this can be changed so that the settings go to $HOME/.config/orbitiny).</p><p>One of these innovative features is  but more on that later in this post.</p><p>It comes with its own set of utilities and applications. It has a device manager which can disable / enable devices by right-clicking the device and selecting  and all that <strong>without black-listing the whole kernel module</strong> so it targets the selected device only and nothing more.</p><p>It has its own <strong>fully featured and innovative file manager</strong>, a fully featured <strong>desktop panel with 18 plugins</strong> with <strong>full and natural Drag&amp;Drop</strong> support, a dedicated search utility, one integrated with the file manager while the other is a stand-alone one, a , <strong>hot-plug detection with desktop notifications</strong> and more.</p><p> is  a derivative of or based on any other project. It started with a blank / main window - the one that you'd create in Qt Creator when you start a new project.</p><p>So what is so special and innovative in ? I don't know where to start, here are some of the features that sets it apart from other DEs (I've probably missed some).</p><ul><li> - On the blank area of the desktop, draw a gesture pattern (like in a web browser) but on the desktop to perform an action, like for example, launch a custom command or use one of the built-in supported actions available to choose from. Up to 12 gestures are supported for both left and right mouse buttons, 12 per button + additional configurations for middle clicks. Gestures are drawn on the blank area of the desktop and they work regardless whether icons are turned off or on.</li><li> When a file is  or  to the clipboard, a little icon emblem with a \"cut\" or \"copy\" symbol is attached to the icon to indicate that the file is on the clipboard, either copied or cut. If the file is a directory, and contents of that directory change (like a file is created or deleted), an emblem is attached to let you know that the folder contents have changed.</li><li> - Drag a text file over another text file to add the contents of the dragged file to the target file.</li><li> - If there is ASCII content on the clipboard, right click the files and select \"\" and the content will be appended to the end of the file. Prepending is also available. If the selected file is a folder, the text content will be pasted into that folder and a file gets generated automatically. There is also image pasting. If the clipboard has an image, right click + paste will generate an image file.</li><li> - Select a set of folders on the desktop and click \"Paste\" and the content from theclipboard will be pasted <strong>to all of the selected folders</strong>. Text content will also be pasted automatically by generating a unique file name and a file (works with images too).</li><li><strong>Custom Desktop Directories</strong> - Choose any folder and use it as a desktop directory. It doesn't have to be .</li><li> - Each screen is a separate desktop so on one screen you can have one desktop with its own set of icons (by selecting a desktop directory of your choice) and on another screen, you can have another desktop with its own icon by selecting a different desktop folder. Of course, works with wallpapers too. So it's like two different computers running on two screens</li><li><strong>Beautiful and Non-Blocking Custom Context Menus</strong>. Non-blocking means your traditional shortcuts you have assigned in X11, will continue to work when a context menu is open, the shortcut won't get caught/blocked by it like it is the case with many other applications that use standard context menus. The context menus are custom made, not using the QMenu component.</li><li> - Select several folders, right click and select Open Terminal and a new terminal will open for all of the selected folders.</li><li><strong>Built-in Run Drop-down Box (Combo Box)</strong> in the context menus allows you to run a command against the selectedfiles (highly experimental and new).</li><li><strong>Multi Profile Support on the Panel</strong> - Right click the edge button on the panel and create a new profile or select one of the previously created ones to get a new configuration / sets of applets. You can switch between profiles like you switch different TV channels.</li><li><strong>Full Drag&amp;Support on the Panel</strong> - Drop any File/Folder from the Desktop or a File Manager or Drag and Re-arrange any applet, any icon on the panel. <strong>No special \"Edit Mode\" is required</strong>. Just grab the applet on the panel or a file from the desktop / file manager and drop it straight onto the panel and an icon for it gets created or the dragged one gets re-positioned. So to be clear: Launch Thunar, Nemo, Dolphin or whatever and drop any file / folder from it onto the panel, either on the Quick Launch or anywhere else and a file icon gets created. This, Drag&amp;Drop Support . The panel can be resized, and placed on any corner of the screen by dragging its handle or you can put it on the middle of the screen if you wish, or turn it into a dock with auto-resizing, or a deskbar that takes the width or the height of the screen. It's highly configurable. I use it as a deskbar as I am used to it.</li><li><strong>A Comprehensive Start Menu / Application Launcher</strong> applet and again with full Drag&amp;Drop support. You can re-arrange icons within the menu, from / in the menu, and there is designated area for a sidebar too on the menu which you can also attach / remove icons from and in to it.</li><li> - Perform custom actions on the selected files. Commands can be edited in the configuration file.</li><li> inside the right-click context menu.</li><li> - click any edge on the desktop to launch a dashboard window that shows you running tasks + installed applications. Search/Filter is available. At the moment, the running applications only work with X11.</li><li> - All the files needed to run along with the applications it comes with can be downloaded to a USB flash drive (or a folder) along with the settings so you can just take the whole folder with you and run it on any Linux computer and the settings will remain the same so the settings are also portable.</li><li> support. All the components mentioned here support both WINE and DOSBOX. This means, if you drop a Windows or DOS exe onto the panel and click on it to launch it or double click it from the file manager or the desktop, its path will be handed over to either WINE or DOSBOX to run it.</li><li> - Remember this? Well, if you double click on a MAFF file, it will extract it in the /tmp dir and launch it for you, same as if you are clicking an HTML file.</li><li> - Some of the panel applets such as the launcher applet, quick launch and the drawer menu along with its items allow you to add two commands per launcher. One for left-click and another one for middle-click.</li><li><strong>Multi-content Search Support in File Manager</strong> - The file manager supports searching for content inside files but it also gives you an option to search for an additional word on the same line the match is found.</li><li> - To increase / decrease the icon size, along the standard CTRL + Wheel to zoom in / out, you can also click and hold the right-hand mouse button and use the scroll wheel – up/down.</li><li><strong>Double-Clicking a Blank Desktop Area</strong> Run a preset gesture or an individual command when the blank area of the desktop is clicked. Hold-Down Right-Hand Mouse Button and Double Click - Run a preset gesture or an individual command</li></ul><p>Right now, it serves more like a desktop shell because it doesn't have a session manager and other utilities such as a power manager, screensaver, screen config etc but if I get enough motivation, I intend to develop that too.</p><p>The application can run in  and  mode.</p><p>To run in portable mode, make sure a file named \".portable_mode\" (without the quotes) exists in </p><p> If running in , it will return the path to the folder/dir that contains all the files. if running in e, it will return </p><p> Returns the path to <strong>$BASE_DIR/shared directory</strong>.</p><pre><code> To make sure the package remains portable across live CDs and distros, save/download all yours files to the \"shared\" folder and then when assigning commands to launchers, do something like $SHARED_DIR/my_file </code></pre><p>To run in , make sure a file named \"\" (without the quotes) exists in .</p><ol><li>This desktop can be run on top of any other desktop, even GNOME, Elementary, KDE. When so, it draws its own desktop window, full screen covering the already running one. When run under iconless desktops, you will get icons (works on GNOME).</li><li>Right-click the Desktop and go to \"Environment &amp; Workspace Settings\" and then \"Appearance\" to adjust the content margins of the desktop. This is the left, top, right and bottom positions of where the icons start. It's in the \"Content Margins &amp; Spacing\" section. This should be adjusted according to where the existing panels are positioned such as the GNOME menu bar or any other panels on the sides of the screen.</li><li>Double-clicking the \"Linux System\" icon brings a \"Disks &amp; Partitions\" menu. This behaviour will remain until I implement a proper and fancy \"Computer\" window. I have most (but not all) of the code already.</li><li>Right-clicking \"Linux System\" brings up a menu with a set of system utilities whose paths need to be set in \"Environment &amp; Workspace Settings\"-&gt;\"Applications\". Except for the \"Device Manager\" which I already have working (most of it), the rest of the utilities need implementation but as a work-around, you can enter a path to an external utility.</li><li>Double-clicking the \"Disks &amp; Partitions\" icon brings up a different, perhaps fancier \"Disks &amp; Partitions\" menu so use the one you prefer. Right-clicking the \"Disks &amp; Partitions\" icon will bring the same \"Disk &amp; Partitions\" menu as the one that comes when double-clicking the \"Linux System\" icon.</li><li>I have pre-prepared an existing \"Custom Actions\" menu for you to look at. Take a look at the examples, I think you will get the gist but if you don't, then just email me / ask me. \"Right-click\"-&gt;\"Custom Actions\"-&gt;\"Edit Custom Actions\".</li><li>When holding the \"Alt\" key when double-clicking an icon, either on the desktop or the file manager or any of the panel applets that let you run commands, will force-run the command in a terminal window  there is a catch. This will NOT work if your window manager's accessibility key is set to \"Alt\". On my system, I have this accessibility key set to the Super key so it works fine. I will make this customizabe in the future.</li><li>You will need to right-click the \"Orbitiny\" applications menu on the panel and go to \"Commands\" to set log out, reboot and power off commands. These will need to be matched with the ones used by the exisitng session manager.I have done it like this because I don't have a session manager yet. My next primary goal is to develop a session-manager so that you can select the DE from your display manager and run it. Right now, you can set \"start-orbitiny\" as a start-up application in your existing desktop environment settings and when so, it will start automatically.</li><li>Wayland support, as far as I am aware, the window tasks and the systray are the only parts that don't work but it has not been tested fully. When testing, you should be testing it under the X11 display server rather than a Wayland compositor. Right now, I don't support any of the Wayland copmositors but I intend to add official Wayland support in the future.</li><li>By default, middle-clicking an empty area on the desktop will bring the fancy looking \"Disk &amp; Partitions\" menu. You can change this in \"Environment &amp; Workspace Settings\"-&gt;\"Advanced\"-&gt;\"Gestures\"-&gt;\"Middle Button Click\".</li><li>You can change gestures in \"Environment &amp; Workspace Settings\"-&gt;\"Advanced\"-&gt;\"Gestures\"</li><li>Some of the panel applets such as the launcher applet and the drawer menu along with its items allow you to add two commands per launcher. One for left-click and another one for middle-click.</li></ol><p>The code base is huge, some of it is very old and requires a re-write and some very new and I've most likely missed something and that would cause an error.</p><p>Please don't get upset/disappointed if you encounter an error or something that's annoying, just let me know and I will fix it.</p><p>Finally, if you are happy with what you see, please consider making a monetary donation. That would be very much appreciated and would motivate me to continue working on the project and release updates, add/improve features etc. Originally I built this DE for my personal use but I now decided to release it to the public.</p><p>bce30f77bcdc42bdc9633095e4b97327</p><p>Again, the code base is large and without a doubt something is broken so please report bugs / issues and I will try to fix it. Looking forward to your feedback.</p><p>Something I forgot to add about the panel.</p><ul><li>In some VMs, pressing and holding keyboard keys simultaneously do not behave as expected and as such it is not an issue with this panel.</li><li>Click on a panel handle or the edge button and move the bar to any of the 4 edges of the screen / monitor to dock the panel to that edge position of the screen.</li><li>Click on a panel handle and then while holding CTRL, drag horizontally to resize the bar.</li><li>Click on a panel handle and then while holding SHIFT, drag vertically to move the bar vertically.</li><li>Click on a panel handle and then while holding ALT, drag horizontally to move the bar horizontally.</li><li>Also, the Edge button at the end of the panel can act as a handle <a href=\"http://too.Click\">too.Click</a> on a panel handle and then while holding CTRL, press the Up/Down keys on your keyboard to move the bar vertically by an inch at a time.</li><li>Likewise, press the Left/Right keys on your keyboard to move the bar horizontally by an inch at a time.</li><li>Hover over the panel and use the mouse wheel to scroll the panel Contents (when scrolling is enabled).</li><li>Hover over the panel and then while holding CTRL, use the mouse wheel to resize the bar.</li><li>Double clicking a panel handle will run a command. You can edit the command in Preferences.</li><li>Middle clicking a panel handle will expand/collapse a panel.</li><li>To copy the content of a tooltip, click the tooltip icon on the right.</li><li>To stop this message from popping up, go to Preferences and uncheck \"Show Drag Handles Tooltips\" located in the \"Other\" tab.</li><li>To get to Preferences, right click the panel and select Preferences from the popup menu.</li></ul>","contentLength":14425,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.14 To Switch From SHA1 To SHA512 For Module Signing By Default","url":"https://www.phoronix.com/news/Linux-6.14-Modules","date":1737946679,"author":"/u/unixbhaskar","guid":571,"unread":true,"content":"<p>Michael Larabel is the principal author of Phoronix.com and founded the site in 2004 with a focus on enriching the Linux hardware experience. Michael has written more than 20,000 articles covering the state of Linux hardware support, Linux performance, graphics drivers, and other topics. Michael is also the lead developer of the Phoronix Test Suite, Phoromatic, and OpenBenchmarking.org automated benchmarking software. He can be followed via <a href=\"https://twitter.com/MichaelLarabel\">Twitter</a>, <a href=\"https://www.linkedin.com/in/michaellarabel/\">LinkedIn</a>, or contacted via <a href=\"https://www.michaellarabel.com/\">MichaelLarabel.com</a>.</p>","contentLength":500,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1iaxzp8/linux_614_to_switch_from_sha1_to_sha512_for/"},{"title":"Tips for detecting if our shell is running inside a virtual machine","url":"https://distrowatch.com/weekly.php?issue=20250127#qa","date":1737940161,"author":"/u/daemonpenguin","guid":569,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1iavvtw/tips_for_detecting_if_our_shell_is_running_inside/"},{"title":"Hard numbers in the Wayland vs X11 input latency discussion","url":"https://mort.coffee/home/wayland-input-latency/","date":1737909856,"author":"/u/mort96","guid":572,"unread":true,"content":"<p>Yesterday, I read this blog post:\n<a href=\"https://gist.github.com/generic-internet-user/e8eec46ce159571032115f6fb064523c\">Wayland Cursor Lag: Just give me a break already...</a>,\nwhere a Linux user discusses their frustration with input latency under Wayland.\nThey detailed their own subjective experience of the problem,\nbut failed to produce hard evidence.</p><p>Even though I'm a very happy user of wayland overall,\nI share the blog post's author's subjective impression that there's more\ncursor lag under Wayland than under X11.\nIn my opinion, their experiment was limited by their phone camera's 90 FPS,\nwhich really doesn't feel like it's enough to get conclusive numbers\nwhen we're talking about differences which are probably on the order of\nsingle screen refresh cycles.</p><p>So I thought: hey, I have a phone with a 240 FPS camera mode,\nI bet that's enough to get some conclusive results!</p><p>I simply pointed my phone's camera at the screen and desk using my left hand,\nmade sure to get the mouse cursor, the mouse and my right hand in frame,\nand recorded myself repeatedly flicking the mouse with my finger.\nI recorded myself flicking it 16 times under Wayland,\nlogged out of the GNOME Wayland session and into a GNOME X11 session,\nthen did the same there.</p><p>I then converted the two resulting video files into a series of JPEGs\nusing ffmpeg (<code>ffmpeg -i &lt;input file&gt; %04d.jpg</code>),\nand counted from the first frame where I could see the mouse move\nuntil the first frame where I could clearly see that the cursor had moved.</p><p>I elected to include the start and end frame;\nso if I saw the mouse move in frame 1045,\nthen I saw the cursor move in frame 1047,\nI would count that as 3 frames.</p><p>Here's an example which depicts a latency of 3 frames (requires JavaScript):</p><div><div><blockquote><p>Here's a frame from before the mouse has begun moving.</p></blockquote></div><div><blockquote><p>The mouse still hasn't moved.</p></blockquote></div><div><blockquote><p>Here, the mouse has just about started moving,\nso I consider this \"frame 1\".\nThe cursor hasn't moved yet.</p></blockquote></div><div><blockquote><p>The mouse moves a bit further, but the cursor still hasn't moved.\nThis is \"frame 2\".</p></blockquote></div><div><blockquote><p>This is the frame where the cursor starts moving.\nThis is \"frame 3\", so I would note down this sequence\nas taking 3 frames.</p></blockquote></div></div><ul><li>Distro: Fedora Workstation 41</li><li>GPU: AMD Radeon RX 7900XT</li><li>Monitor: Gigabyte M32U (4k IPS @ 144.99, no DPI scaling)</li><li>Mouse: Logitech G502 Lightspeed</li><li>Camera: iPhone 15 Pro, slo-mo 240 FPS</li></ul><p>The main limitations of this experiment are:</p><ul><li>240 FPS still isn't  much. With my 144Hz screen, I have less than\ntwo camera frames per screen refresh. This introduces some random variance.</li><li>Pixels don't switch instantly, so there are ambiguous frames where the cursor\nis  starting to become visible in its new location.\nI decided to count the cursor as \"having moved\" when there is a clearly visible\ncursor in a new location on the screen, even if the pixels haven't fully lit up.</li><li>For some reason, the video recording from my phone contains some duplicate frames.\nI don't know why this happens. I decided to interpret these duplicate frames\nas a representation of a frame's worth of time passing, so I counted them as normal.</li></ul><p>All these factors introduce some uncertainty in the results.\nHowever, they  affect Wayland and X11 equally, so with enough data,\nit should all even out.</p><p> Another caveat I should clearly point out is that there are\nmany other Wayland compositors out there than GNOME's, and I have not tested them.\nFor that matter, there are other GPU drivers out there than AMD's.\nOther compositors and other GPU drivers may show different results.</p><p>Here's the data I captured:</p><p>Wayland, on average, has roughly 6.5ms more cursor latency than X11 on my system.\nI don't have the statistics expertise necessary to properly analyze\nwhether this difference is statistically significant or not,\nbut to my untrained eye, it looks like there's a clear and consistent difference.</p><p>Interestingly, the difference is very close to 1 full screen refresh.\nI don't know whether or not that's a coincidence.</p><p>Here are the numbers in chart form:</p><p>In my mind, these results are conclusive proof that there  a difference\nin input latency between X11 and Wayland, at least with my hardware,\nand that the difference is large enough that it's plausible for some people to notice.</p><p>Further testing on more varied hardware and refresh rates is necessary\nto get a clear picture of how wide-spread the problem is and how large it is.\nIt's likely that the magnitude of the difference varies based on factors\nsuch as which compositor is used and what the refresh rate of the screen is.</p><p>I probably won't undertake that further testing,\nbecause this is all very time intensive work.\nMy goal was only to see if I could conclusively measure  difference.</p><p> I want to add a note here about what this testing does  show.\nIt does not show that there's higher input latency \nin Wayland compared to X11 in a way which affects, for example, games.\nIt is possible that this added latency is entirely cursor-specific\nand that Wayland and X11 exhibit the exact same input latency\nin graphical applications and games.\nIt is my understanding that the cursor is handled very differently from\nnormal graphical applications.\nFurther testing would be necessary to show whether Wayland has more input latency\n than X11.</p>","contentLength":5083,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1iajb1o/hard_numbers_in_the_wayland_vs_x11_input_latency/"},{"title":"Break up with Adobe, switch to Linux","url":"https://youtu.be/lm51xZHZI6g?si=bl-gjEb2KGa2YKii","date":1737899242,"author":"/u/BulkyMix6581","guid":574,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1iaexty/break_up_with_adobe_switch_to_linux/"}],"tags":["dev"]}