{"id":"7DceLgR4szFyHjpUotrBgPp9fEDdwmRmyXGW53xLQnbPAifjKVFPj1dyKJ6sHa1bC6AC9QFBhYUJLmJ6GyX57","title":"top scoring links : linux","displayTitle":"Reddit - Linux","url":"https://www.reddit.com/r/linux/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/linux/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"GNU Hurd now supports x86_64 through GNU Guix, marking its first official move beyond 32-bit architecture after decades of development.","url":"https://linuxiac.com/gnu-hurd-finally-runs-on-x86-64-with-new-64-bit-port/","date":1772416590,"author":"/u/nix-solves-that-2317","guid":547,"unread":true,"content":"<p>The GNU Project has announced a major milestone: native 64-bit support for GNU Hurd is now available through <a href=\"https://linuxiac.com/gnu-guix-1-5-brings-plasma-6-5-gnome-46-rootless-mode-and-more/\" data-type=\"post\" data-id=\"205931\">GNU Guix</a>.</p><p>If you are not familiar with it, let me shed some light. <a href=\"https://www.gnu.org/software/hurd/\" target=\"_blank\" rel=\"noreferrer noopener\">GNU Hurd</a> is the kernel of the GNU operating system. Unlike the Linux kernel, however, Hurd uses a microkernel design based on GNU Mach. Core services run as separate user-space servers that communicate through message passing. Launched in the early 1990s, Hurd has remained largely experimental.</p><p>For decades, GNU Hurd was limited to 32-bit x86 systems. The absence of x86_64 support restricted its use on modern hardware. But not anymore. With 64-bit builds now available in Guix, Hurd can run natively on current x86_64 systems.</p><p>The new 64-bit support expands Hurd’s memory addressing and aligns it with current hardware standards. According to the Guix announcement, x86_64 Hurd system images are now available for installation or testing through Guix System tools.</p><p>Keep in mind that, despite this progress, GNU Hurd remains experimental. It is not a production-ready alternative to Linux, and hardware support still lags behind mainstream kernels. However, 64-bit builds make it more accessible for developers and researchers interested in its architecture.</p>","contentLength":1234,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1rig0kg/gnu_hurd_now_supports_x86_64_through_gnu_guix/"},{"title":"Linux 7.0-rc2 Released: \"So I'm Not Super-Happy With How Big This Is\"","url":"https://www.phoronix.com/news/Linux-7.0-rc2-Released","date":1772411293,"author":"/u/somerandomxander","guid":543,"unread":true,"content":"\nThe second weekly release candidate of <a href=\"https://www.phoronix.com/search/Linux+7.0\">Linux 7.0</a> is now available for testing.\n<p>Linux 7.0-rc2 is out with an initial batch of fixes following last Sunday's Linux 7.0-rc1 that capped off the busy Linux 7.0 merge window. Among the fixes merged this week were </p><a href=\"https://www.phoronix.com/news/Linux-7.0-rc2-DRM-Fixes\">numerous AMDXDNA Ryzen AI accelerator driver fixes</a> along with scattered kernel graphics driver fixes at large. Linus Torvalds also authored a change himself for <a href=\"https://www.phoronix.com/news/Torvalds-Unseeded-Random\">dropping an old Kconfig option to address tiresome log spam messages</a>. Plus a variety of other bug/regression fixes throughout the codebase.\nLinus Torvalds wrote in today's <a href=\"https://lore.kernel.org/lkml/CAHk-=wh=dScTmB+zr7zDdBB-SeFHuqgoQx5PSX5Yusp7LiqgrQ@mail.gmail.com/T/#u\">7.0-rc2 announcement</a>:\n<blockquote>\"So I'm not super-happy with how big this is, but I'm hoping it's just the random timing noise we see every once in a while where I just happen to get more pull requests one week, only for the next week to then be quieter.\n<p>Because I don't think we've had a bigger rc2 (counting non-merge commits) in quite a while. It might be because of pent-up work with 6.19 having dragged out that extra week. I guess we'll see how the release progresses.\n</p><p>rc2 is also a bit unusual in how the bulk of the changes aren't in drivers. Sure, drivers are still a quarter of the diff, but it's _only_ a quarter. Normally it's at least half. Filesystems (mostly smb client, but we've got xfs and erofs there too) are another 25%.\n</p><p>The rest (half the diff, for people keeping score at home) is a more mixed bunch, with tests (mostly bpf), core kernel, bpf, arch updates and networking code leading the charge.\"</p></blockquote>See our <a href=\"https://www.phoronix.com/review/linux-7-features-changes\">Linux 7.0 feature overview</a> to learn more about the interesting features coming with this kernel release due out as stable by mid-April.","contentLength":1643,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1rie2i8/linux_70rc2_released_so_im_not_superhappy_with/"},{"title":"Intel's Clear Linux website is no longer online","url":"https://www.phoronix.com/news/Clear-Linux-Org-No-More","date":1772385782,"author":"/u/somerandomxander","guid":545,"unread":true,"content":"<p>Michael Larabel is the principal author of Phoronix.com and founded the site in 2004 with a focus on enriching the Linux hardware experience. Michael has written more than 20,000 articles covering the state of Linux hardware support, Linux performance, graphics drivers, and other topics. Michael is also the lead developer of the Phoronix Test Suite, Phoromatic, and OpenBenchmarking.org automated benchmarking software. He can be followed via <a href=\"https://twitter.com/MichaelLarabel\">Twitter</a>, <a href=\"https://www.linkedin.com/in/michaellarabel/\">LinkedIn</a>, or contacted via <a href=\"https://www.michaellarabel.com/\">MichaelLarabel.com</a>.</p>","contentLength":500,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1ri32ey/intels_clear_linux_website_is_no_longer_online/"},{"title":"Resist Age checks now!","url":"https://www.reddit.com/r/linux/comments/1ri1eev/resist_age_checks_now/","date":1772381992,"author":"/u/ForeverHuman1354","guid":548,"unread":true,"content":"<p>Now that California is pushing for operating system-level age verification, I think it's time to consider banning countries or places that implement this. It started in the UK with age ID requirements for websites, and after that, other EU countries began doing the same. Now, US states are following suit, and with California pushing age verification at the operating system level, I think it's going to go global if companies accept it.</p><p>If we don't resist this, the whole world will be negatively impacted.</p><p>What methods should be done to resist this? Sadly, the most effective method I see is banning states and countries from using your operating system, maybe by updating the license of the OS to not allow users from those specific places.</p><p>If this is not resisted hard we are fucked</p><p>this law currently dosent require id but it requires you to put in your age I woude argue that this is the first step they normalize then put id requierments</p>","contentLength":941,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Quickshare/Nearbyshare Implementation for linux based on the official nearby codebase from google","url":"https://www.reddit.com/r/linux/comments/1rhxo6q/quicksharenearbyshare_implementation_for_linux/","date":1772372787,"author":"/u/Striking-Storm-6092","guid":544,"unread":true,"content":"<p>Hi <a href=\"https://www.reddit.com/r/linux\">r/linux</a>. I got tired of waiting for google to support linux so I tried doing it myself. I submitted PRs for linux implementations on their official repo but the maintainers weren't that enthusiastic about a linux implementation.</p><p>RQuickShare the the likes exist but they use a reverse engineered version of the google nearby share protocol and so are WIFI-LAN only. I've built support for many of the official mediums they support.</p><table><thead><tr></tr></thead><tbody></tbody></table><p>If you're tired of finding creative ways to share files to your linux machines, feel free to check it out. Criticism is always appreciated :)</p><blockquote><p><strong>This is not just a quickshare/nearbyshare client. It is an implementation of the nearby connections/ nearby presence and fastpair protocol. So in theory other app developers can link against the library and build cool stuff</strong></p></blockquote><p>NOTE: The library/ client is still in  early beta. I can only guarantee that it works on my hardware for now. But in theory it should be universal since it uses dbus, networkmanager and bluez under the hood for most of the heavylifting.</p><p>NOTE 2: You'll need a companion app over <a href=\"https://github.com/kidfromjupiter/shareby\">here</a> for android to linux sharing. Don't worry, its almost as seamless as quickshare since it integrates into android's native share sheet. This app was mostly AI generated. The reasoning being that it is just a proof of concept. In the grand scheme of things, my main repo is very much a library with an app on the side. Instead of the other way around. </p>","contentLength":1428,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"GNU Hurd On Guix Is Ready With 64-bit Support, SMP Multi-Processor Support \"Soon\"","url":"https://www.phoronix.com/news/GNU-Hurd-64-bit-2026","date":1772372242,"author":"/u/anh0516","guid":546,"unread":true,"content":"\nAfter hearing last month that <a href=\"https://www.phoronix.com/news/GNU-Hurd-In-2026\">GNU Hurd is \"almost there\" with x86_64 support</a>, it was exciting to kickoff today by seeing a developer headline \"\" GNU Hurd 64-bit support is now said to be ready but SMP support for multiple processor cores and the like remain still in development.\n<p>The GNU Guix developer blog announced the headline today of 64-bit support. The GNU Guix distribution with Hurd rather than the Linux kernel is now available in an x86_64 flavor for those wanting to try it out. The post also outlines other progress made to GNU Hurd with the Guix distribution over the past year and a half.\n</p><p>There have been many fixes throughout for GNU Guix/Hurd, including to the installer. 64-bit Hurd is booting successfully and there is now an installer option for Hurd on x86_64.\n</p>While some may be excited over GNU Guix/Hurd, there is still a very limited subset of packages successfully building:\n<blockquote>\"In Guix only about 1.7% (32-bit) and 0.9% (64-bit) of packages are available for the Hurd. These percentages fluctuate a bit but continue to grow (both grew with a couple tenth percent point during the preparation of this blog post), and as always, might grow faster with your help.\n<p>So while Guix GNU/Hurd has an exciting future, please be aware that it lacks many packages and services, including Xorg.\"</p></blockquote>The <a href=\"https://guix.gnu.org/blog/2026/the-64-bit-hurd//\">GNU Guix blog post</a> concludes talking about Symmetric Multi-Processing (SMP) Support that \"<em>so most probably we'll have 64-bit multiprocessing real soon now! It seems however, that we will need new bootstrap binaries for that.</em>\"","contentLength":1535,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1rhxhcf/gnu_hurd_on_guix_is_ready_with_64bit_support_smp/"}],"tags":["dev","reddit"]}