{"id":"7DceLgR4szFyHjpUotrBgPp9fEDdwmRmyXGW53xLQnbPAifjKVFPj1dyKJ6sHa1bC6AC9QFBhYUJLmJ6GyX57","title":"top scoring links : linux","displayTitle":"Reddit - Linux","url":"https://www.reddit.com/r/linux/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/linux/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"SysV init 3.14 released","url":"https://github.com/slicer69/sysvinit/releases/tag/3.14","date":1739117474,"author":"/u/gabriel_3","guid":434,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1ili4vn/sysv_init_314_released/"},{"title":"IO_uring Zero-Copy Receive Support Ready For Linux 6.15 Networking","url":"https://www.phoronix.com/news/IO_uring-Zero-Copy-Receive-Net","date":1739089999,"author":"/u/unixbhaskar","guid":435,"unread":true,"content":"<p>Michael Larabel is the principal author of Phoronix.com and founded the site in 2004 with a focus on enriching the Linux hardware experience. Michael has written more than 20,000 articles covering the state of Linux hardware support, Linux performance, graphics drivers, and other topics. Michael is also the lead developer of the Phoronix Test Suite, Phoromatic, and OpenBenchmarking.org automated benchmarking software. He can be followed via <a href=\"https://twitter.com/MichaelLarabel\">Twitter</a>, <a href=\"https://www.linkedin.com/in/michaellarabel/\">LinkedIn</a>, or contacted via <a href=\"https://www.michaellarabel.com/\">MichaelLarabel.com</a>.</p>","contentLength":500,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1ilacgo/io_uring_zerocopy_receive_support_ready_for_linux/"},{"title":"I think linux is actually easier to use than windows now","url":"https://www.reddit.com/r/linux/comments/1il9tes/i_think_linux_is_actually_easier_to_use_than/","date":1739087709,"author":"/u/petitlita","guid":438,"unread":true,"content":"<p>I had to reinstall windows on the one PC that I was (previously) running windows on, basically just for debugging windows programs and the 2 games that don't play well with linux. One is a ported browser game that still works in browser and the other is kinitopet where windows being required is kinda understandable. Found a disk for windows that came with a laptop and put it in, oops, I don't have TPM 2. Tried downloading windows 10. Mysterious driver issues that it refused to elaborate on, apparently I needed to find these drivers and put them on a USB without it giving me any information on what I was looking for. I got sick of dealing with it at this point since it really gave no information and I just wanted to play witcher, though I know if I had worked out the driver issues I would still need to work through getting a local account, debloating the OS, modifying the registry, etc, just to get it to run in a way any reasonable person would expect a normal computer to behave.</p><p>So I decide to just put endeavour OS on it instead (I have a recent nvidia GPU and I am lazy) and like, yeah it works well basically immediately, but what surprised me was how well it played with... everything. On windows, I spent 2 hours just fixing weird audio bugs with the steelseries wireless headset I have but it just works and connects immediately after I turn it on now. I didn't need to use their bloatware to turn off sidetone. The controller I use would require a bit of fiddling to connect when I turned it on on windows but on linux I just pick it up and it works. I install my games and they all (minux the aforementioned two) just work perfectly immediately. I don't get random video stuttering that I had on windows. WHEN did the linux experience become so seamless?</p><p>Edit: In case anyone is curious, in witcher I am getting 60fps (cap) when previously I was getting like 45 lol</p>","contentLength":1886,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How do I convince someone that Linux is, in fact, a \"normal operating system?\"","url":"https://www.reddit.com/r/linux/comments/1il6p1k/how_do_i_convince_someone_that_linux_is_in_fact_a/","date":1739075511,"author":"/u/FutureSuccess2796","guid":437,"unread":true,"content":"<p>EDIT: Want to clarify that the people who were telling me this were my parents and not a friend or just someone random. Just making note because I was vague about it prior. My bad!</p><p>I'll try to make this as quick as I possibly can: I finally decide to dive into the world of Linux and I LOVE it! Been using that more than Windows now on my laptop and I've also been experimenting with the terminal and installing some different applications to try out too. Now I'm extremely passionate about technology and learning new things, and I'm also someone who can get hyperfixated on a topic. And this time it was about the cool things I was working on using Ubuntu, which included installing and adding different applications' dependencies as well as trying out some other things to make my experience more decentralized. Well, that backfired because I was went off on and told that I need to just go back to \"a normal device and stop playing around with that USB all the time.\"</p><p>I tried to explain that Ubuntu is a normal operating system but was just a little different than Windows or Apple and that I installed it myself on my own USB. But that did nothing. And discussing decentralization made them start presuming that I was \"up to no good and that I would get into trouble with that command stuff,\" which is referencing the terminal and what it looks like when I install packages. Like, really, people? I get that not everybody's versed in computers, but you're literally assuming that something I'm passionate about must be troublesome because you're not familiar with it. </p><p>Any way to explain that I'm just being tech-savvy and using a regular operating system that just happens to look a little different? </p>","contentLength":1704,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Most Linux users dont allow the browser to collect data about their system. So, we won?","url":"https://www.reddit.com/r/linux/comments/1iktbzl/most_linux_users_dont_allow_the_browser_to/","date":1739037697,"author":"/u/ParamedicDirect5832","guid":439,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Can anyone ELI5 the general rust in linux kernel drama?","url":"https://www.reddit.com/r/linux/comments/1ikt1fq/can_anyone_eli5_the_general_rust_in_linux_kernel/","date":1739036983,"author":"/u/Nothos927","guid":436,"unread":true,"content":"<p>I only vaguely follow kernel dev but I've seen there's been another instance of drama over incorporating rust into the kernel that only seems to make complete sense if you already know what's going on.</p><p>As far as I can tell, roughly what's happened so far is:</p><ul><li>Linus (and other maintainers?) have traditionally been iffy on adding new languages like C++ to the kernel</li><li>However with rust becoming more popular and younger coders who learnt rust first it was decided to allow some small bits of rust in the mainline kernel codebase</li><li>A certain subset of maintainers were/are extremely opposed to rust code</li><li>There isn't actually much rust code there yet, what is there is mostly just the plumbing needed to get the rust code able to call existing functions safely. We are seeing more out of tree rust drivers being written that rely on these interfaces.</li></ul><p>So really I'm wondering how off the mark that assessment is and why some maintainers still have so much opposition? Is it ideological? Technical? It also seems like this entire thing is touching on broader issues with the kernel development process itself and stuff like tooling?</p>","contentLength":1118,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev","reddit"]}