{"id":"82kPqomaPXmNomrHzpZWfbkQxiiNUBTAYKxHR5qZBEpf","title":"Hacker News: Show HN","displayTitle":"HN Show","url":"https://hnrss.org/show?points=60","feedLink":"https://news.ycombinator.com/shownew","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":15,"items":[{"title":"Show HN: Making AR experiences is still painful – had to make my own editor","url":"https://ordinary.space/","date":1737963163,"author":"boriskourt","guid":182,"unread":true,"content":"<div><h3>With Ordinary Objects, ideating, designing and testing  experiences is faster and more fun than ever before. Discover novel use-cases, create variants and fine tune prototypes until they excite and are intuitive to use.</h3></div>","contentLength":219,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42838355"},{"title":"Show HN: DeepSeek My User Agent","url":"https://www.jasonthorsness.com/20","date":1737929019,"author":"jasonthorsness","guid":181,"unread":true,"content":"<p><a href=\"https://github.com/deepseek-ai/DeepSeek-R1\">DeepSeek R1</a> is a new model and service that exposes\nchain-of-thought to the user. You can use it live for free at\n<a href=\"https://chat.deepseek.com/\">chat.deepseek.com</a>, or via an API at\n<a href=\"https://platform.deepseek.com/\">platform.deepseek.com</a> that is currently significantly less\nexpensive than OpenAI o1. OR, simply click  to see what the model thinks about your user\nagent, browser capabilities, and IP location headers. If you dare.</p>","contentLength":364,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42834648"},{"title":"Show HN: Orange intelligence, an open source alternative to Apple Intelligence","url":"https://github.com/sharingan-no-kakashi/orange-intelligence","date":1737889379,"author":"MexicanYoda","guid":180,"unread":true,"content":"<p>Hi HN! I’m excited to share Orange Intelligence, an open-source alternative to Apple Intelligence for macOS.</p><p>Orange Intelligence allows you to interact with any text on your macOS system in a more powerful and customizable way. It brings a floating text processor that integrates seamlessly with your workflow. Whether you’re a developer, writer, or productivity enthusiast, this tool can boost your efficiency.\nKey Features:</p><pre><code>    Floating Text Processor: Trigger a floating window by double-tapping the Option key to process selected text.\n    Run Any Python Function: From basic text manipulations to running large language models (LLM) like OpenAI or local LLaMA, you can execute any Python function on the fly.\n    Full Customization: Want to add your own functions or logic? Just write them in Python, and they’ll appear in the floating window.\n</code></pre>\nHow does it work?<pre><code>    Capture: Uses AppleScript to simulate a global Cmd+C and capture selected text from any active macOS app.\n    Process: A floating window pops up, letting you choose what to do with the text (run a function, format it, or apply an LLM).\n    Replace: After processing, the app returns focus to the original application and pastes the processed text back with a global Cmd+V.\n</code></pre>\nWhy open source?<p>I built this to overcome the limitations of Apple’s proprietary tools, and I wanted to make it fully customizable and extendable. Orange Intelligence is built with Python and PyQt6, so it’s easy to adapt, extend, and contribute to.</p><p>It’s not just a text processor—it’s a platform for building custom workflows, whether you want to automate simple tasks or integrate with complex AI systems.</p><p>I’m looking forward to your thoughts, ideas, and contributions. Thanks!</p>","contentLength":1736,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42829309"},{"title":"Show HN: I built a DIY plane spotting system at home","url":"https://pilane.obviy.us/","date":1737810877,"author":"obviyus","guid":178,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42821457"},{"title":"Show HN: Lightpanda, an open-source headless browser in Zig","url":"https://github.com/lightpanda-io/browser","date":1737756932,"author":"fbouvier","guid":177,"unread":true,"content":"<p>We’re Francis and Pierre, and we're excited to share Lightpanda (<a href=\"https://lightpanda.io\" rel=\"nofollow\">https://lightpanda.io</a>), an open-source headless browser we’ve been building for the past 2 years from scratch in Zig (not dependent on Chromium or Firefox). It’s a faster and lighter alternative for headless operations without any graphical rendering.</p><p>Why start over? We’ve worked a lot with Chrome headless at our previous company, scraping millions of web pages per day. While it’s powerful, it’s also heavy on CPU and memory usage. For scraping at scale, building AI agents, or automating websites, the overheads are high. So we asked ourselves: what if we built a browser that only did what’s absolutely necessary for headless automation?</p><p>Our browser is made of the following main components:</p><p>- an HTML parser and DOM tree (based on Netsurf libs)</p><p>- a Javascript runtime (v8)</p><p>- partial web APIs support (currently DOM and XHR/Fetch)</p><p>- and a CDP (Chrome Debug Protocol) server to allow plug &amp; play connection with existing scripts (Puppeteer, Playwright, etc).</p><p>The main idea is to avoid any graphical rendering and just work with data manipulation, which in our experience covers a wide range of headless use cases (excluding some, like screenshot generation).</p><p>In our current test case Lightpanda is roughly 10x faster than Chrome headless while using 10x less memory.</p><p>It's a work in progress, there are hundreds of Web APIs, and for now we just support some of them. It's a beta version, so expect most websites to fail or crash. The plan is to increase coverage over time.</p><p>We chose Zig for its seamless integration with C libs and its  feature that allow us to generate bi-directional Native to JS APIs (see our zig-js-runtime lib <a href=\"https://github.com/lightpanda-io/zig-js-runtime\">https://github.com/lightpanda-io/zig-js-runtime</a>). And of course for its performance :)</p><p>As a company, our business model is based on a Managed Cloud, browser as a service. Currently, this is primarily powered by Chrome, but as we integrate more web APIs it will gradually transition to Lightpanda.</p><p>We would love to hear your thoughts and feedback. Where should we focus our efforts next to support your use cases?</p>","contentLength":2114,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42817439"},{"title":"Show HN: Onit – Source-available ChatGPT Desktop with local mode, Claude, Gemini","url":"https://github.com/synth-inc/onit","date":1737756916,"author":"telenardo","guid":176,"unread":true,"content":"<p>Hey Hackernews- it’s Tim Lenardo and I’m launching v1 of Onit today!</p><p>Onit is ChatGPT Desktop, but with local mode and support for other model providers (Anthropic, GoogleAI, etc). It's also like Cursor Chat, but everywhere on your computer - not just in your IDE!</p><p>Onit is open-source! You can download a pre-built version from our website: \nwww.getonit.ai</p><p>We built this because we believe:\nUniversal Access: AI assistants should be accessible from anywhere on my computer, not just in the browser or in specific apps\nProvider Freedom: Consumers should have the choice between providers (anthropic, openAI, etc.) not be locked into a single one (ChatGPT desktop only has OpenAI models)\nLocal first: AI is more useful with access to your data. But that doesn't count for much if you have to upload personal files to an untrusted server. Onit will always provide options for local processing. No personal data leaves your computer without approval\nCustomizability: Onit is your assistant. You should be able to configure it to your liking\nExtensibility: Onit should allow the community to build and share extensions, making it more useful for everyone.</p><p>The features for V1 include:\n Local mode - chat with any model running locally on Ollama! No internet connection required\n Multi-provider support - Top models for OpenAI, Anthropic, xAI, and GoogleAI\n File upload - add images or files for context (bonus: Drag &amp; drop works too!)\n History - revisit prior chats through the history view or with a simple up/down arrow shortcut\n Customizable Shortcut - you pick your hotkey to launch the chat window. (Command+zero by default)</p><p>What data are you collecting?\nOnit V1 does not have a server. Local requests are handled locally, and remote requests are sent to model providers directly from the client. We collect crash reports through Firebase and a single \"chat sent\" event through PostHog analytics. We don't store your prompts or responses.</p><p>How to does Onit support local mode? \nFor use local mode, run Ollama. You can get Ollama here: <a href=\"https://ollama.com/\">https://ollama.com/</a> \nOnit gets a list of your local models through Ollama’s API.</p><p>Which models do you support? \nFor remote models, Onit V1 supports Anthropic, OpenAI, xAI and GoogleAI. Default models include (o1, o1-mini, GPT-4o, Claude3.5 Sonnet, Claude3.5 Haiku, Gemini 2.0, Grok 2, Grok 2 Vision).\nFor local mode, Onit supports any models you can run locally on Ollama!</p><p>What license is Onit under? \nWe’re releasing V1 available on a Creative Commons Non-Commercial license. We believe the transparency of open-source is critical. We also want to make sure individuals can customize Onit to their needs (please submit PRs!). However, we don’t want people to sell the code as their own.</p><p>Where is the monetization?\nWe’re not monetizing V1. In the future we may add paid premium features. Local chat will- of course- always remain free. If you disagree with a monetized feature, you can always build from source!</p><p>Why not Linux or Windows? \nGotta start somewhere! If the reception is positive, we’ll work hard to add further support.</p><p>Who are we? \nWe are Synth, Inc, a small team of developers in San Francisco building at the frontier of AI progress. Other projects include Checkbin (www.checkbin.dev) and Alias (deprecated - www.alias.inc).</p><p>We’d love to hear from you! Feel free to reach out at contact@getonit dot ai.</p><p>Future roadmap includes:\n Autocontext - automatically pull context from computer, rather than having to repeatedly upload. \n Local-RAG - let users index and create context from their files without uploading anything. \n Local-typeahead - i.e. Cursor Tab but for everywhere\n Additional support - add Linux/Windows, Mistral/Deepseek etc etc.\n (maybe) Bundle Ollama to avoid double-download\n And lot’s more!</p>","contentLength":3758,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42817438"},{"title":"Show HN: A new native app for 20 year old OS X","url":"https://uppercut.chadbibler.com/","date":1737679615,"author":"chadkeck","guid":174,"unread":true,"content":"<img src=\"https://uppercut.chadbibler.com/Uppercut/images/icon.png\" alt=\"Uppercut Logo\"><p>\n                        Built for OS X Tiger (10.4), Uppercut streamlines access to the Xbins Xbox homebrew FTP server with a single click. \n                        The tool we all wished we had back in 2005 for homebrew development and exploration.\n                    </p>","contentLength":271,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42809518"},{"title":"Show HN: Open-source AI video editor","url":"https://github.com/fal-ai-community/video-starter-kit","date":1737657278,"author":"drochetti","guid":173,"unread":true,"content":"<p>Hey HN community! I'm one of the lead devs of this project at fal.ai and we created an open source lightweight video editor powered by the latest media AI models. The main goal was to tackle some challenges when dealing with complex media handling and encoding on the browser.</p><p>It all started as an internal experiment but as we tackled some of the issues it was clear there could be some value sharing it with the open source community.</p><p>Some of the key points and tech stack details:</p><p>- It uses IndexedDb, so all data is local (i.e. no auth, no cloud db)</p><p>- Multiple AI models for video, image, music and voice-over. APIs are provided by fal.ai</p><p>- Built with the typical React+Next.js, Shadcn front-end</p><p>- Used remotion.dev for the realtime video preview (this is such a great project, without it the codebase would be twice as large)</p><p>- File uploads so you can bring your own media by uploadthing.com</p><p>- ffmpeg for encoding the final video and also some ui tricks, like the audio waveform</p><p>We deployed a version of it and for now it's free to use. We do plan to add some rate limiting and a bring your own API Key next, but it's open source and I'm curious about what the community will build on top of it, or derive from it. Customize your own video app and if you do, please share.</p><p>If you have any questions, hit me up!</p>","contentLength":1305,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42806616"},{"title":"Show HN: I organized Bluesky feeds by categories and growth rankings","url":"https://www.bskyinfo.com/feeds/","date":1737595612,"author":"laimingj","guid":170,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42799574"},{"title":"Show HN: Trolling SMS spammers with Ollama","url":"https://evan.widloski.com/software/sms_llm/","date":1737573828,"author":"Evidlo","guid":168,"unread":true,"content":"<p>I occasionally get unsolicited texts from real estate brokers looking to buy specific properties in my hometown where I own no property and don't even live.  I assume they scrape cell phone numbers from WhitePages and just spray-and-pray hoping to get a response.</p><p>My parents own some undeveloped land in the middle of town which lies mostly in a flood zone and the usable acreage is much less than it appears on paper.  Of course the brokers don't know this, so the prospect of buying up a big plot which has been vacant for decades for cheap probably gets their mouths watering.</p><p>Over Christmas break I worked on a system for controlling my phone's SMS application over MQTT from a remote workstation running Ollama.  Below is an overview of the system:</p><div><pre><code>                      ANDROID PHONE                  LLM SERVER    \n\n                    +---------------+      |                         \n                    | SMS Messaging |      |                        \n  SMS Victims ------|     App       |                              \n                    +---------------+      |                        \n                            |              |                        \n                    +---------------+              +---------------+\n                    |  Gateway App  |--------------|  MQTT Broker  |\n                    +---------------+              +---------------+\n                                           |               |        \n                                           |       +---------------+\n                                                   |    llm.py     |\n                                           |       +---------------+\n                                           |               |        \n                                                   +---------------+\n                                           |       | Ollama Server |\n                                           |       +---------------+\n</code></pre></div><p>The first step is to forward text messages somehow to the LLM workstation.  There are several SMS forwarding tools on both F-Droid and the Play store, but most of them only supported one-way forwarding received SMS via POST request to some REST endpoint.  I saw one application which supports POSTing messages back to the phone, but since the phone is behind a CGLAN, I really wanted some kind of long-running socket connection to the workstation.</p><p>I ended up finding the verbosely named <a href=\"https://github.com/ibnux/Android-SMS-Gateway-MQTT\">Android-SMS-Gateway-MQTT</a>, which runs in the background and waits to send/receive messages and works without changing the default messaging app.</p><p>For some reason the app can be commanded to send messages via MQTT, but received messages are forwarded via POST request only.  I made some modifications to use MQTT for communication both ways.</p><p>I really don't enjoy touching Android development, so I gave a shot at using Cursor.ai to make the changes and it worked perfectly first try!  The prompt I used is below:</p><div><pre><code>[SMSListener.java (41-46)]\nHow do I turn this POST request into an MQTT message?  I'd like to use the MQTT connection already present in the file `BackgroundService.java` if possible.\n</code></pre></div><p>Disabling battery optimization is necessary for the application to run reliably in the background.  Fortunately the power consumption for the app is insignificant.  The .apk is available in the project files.</p><p>The job of the Python script is simply to listen on MQTT for new SMS messages and send generated LLM responses back to the Android application.\nI want the language model to be able to give responses that make sense in context, so I store each ongoing conversation in a separate JSON file and feed the last N messages to the language model when generating responses.</p><figure><div><pre><code>[\n    {\n        \"role\": \"user\",\n        \"content\": \"I forgore to register for ece500 :(\"\n    },\n    {\n        \"role\": \"assistant\",\n        \"content\": \"that sucks bro, did u talk to the prof about gettin in tho?\"\n    },\n    {\n        \"role\": \"user\",\n        \"content\": \"Tf\"\n    },\n    {\n        \"role\": \"assistant\",\n        \"content\": \"lol what's that supposed to mean, are u gonna try to crash the class or somethin?\"\n    },\n    {\n        \"role\": \"user\",\n        \"content\": \"Hello\"\n    },\n    {\n        \"role\": \"assistant\",\n        \"content\": \"hey whats good, just got back from leg day and i'm hella sore btw\"\n    },\n    {\n        \"role\": \"user\",\n        \"content\": \"Ok bro\"\n    }\n]\n</code></pre></div></figure><p>A big part of the fun is being able to create different ridiculous personalities and backstories.  The Python script reads from a config where I can assign different personalities to conversations.</p><p>The Ollama TUI also makes it really convenient to experiment with different prompts and update these personas.  I don't even have to restart the script!</p><figure><div><pre><code>[evan@copernicus ~] ollama run llama3.3\n\n&gt;&gt;&gt; /set system \"you are a college bro responding via SMS.  you want to sell your property.  you only respond with single sentences and use millenial speak. your responses are very short and you don't capitalize letters.  you always want to sell.  everything you write is lowercase and your property is for sale. you should be open to negotiation and accept even low offers\"\n\nSet system message.\n\n&gt;&gt;&gt; Hey this is Bob with [redacted].  We're looking to buy vacant land near the one you own in [redacted].  Are you interested in a fair offer?\n\nmy property in [redacted] goes hard and i'm down to sell for a lowkey decent price, hit me with an offer fam\n\n&gt;&gt;&gt; /save llama3.3bro\n</code></pre></div><figcaption>Experimentation in the Ollama shell</figcaption></figure><p>And now for what you've been waiting for!  The first message in these screenshots is written by me to get the other person to respond after I've whitelisted the conversation.  These chats are all I have at the moment, but I may come back and add more as more spam rolls in.</p><ul><li><p>I started off the project using Phi4, but I had difficulty keeping the LLM responses short.  After switching to llama3.3, this seems to have improved a lot.</p></li><li><p>I'm not sure what the legal implications are of agreeing to sell land that I don't even own, so lately I've instructed the models to never actually close on anything.</p></li><li><p>People have mentioned that responding to SMS spam helps the spammers to \"warm up\" a number and build carrier reputation so they can send more spam texts.  I figure that reporting and blocking the numbers after I've had my fun is a reasonable compromise.</p></li><li><p>I do get some spam calls in addition to texts, but I haven't noticed an increase in either quite yet.</p></li></ul>","contentLength":6406,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42796496"},{"title":"Show HN: BrowserAI – Run LLMs directly in browser using WebGPU (open source)","url":"https://github.com/sauravpanda/BrowserAI","date":1737567609,"author":"shreyash_gupta","guid":167,"unread":true,"content":"<p>Check out this impressive project that enables running LLMs entirely in the browser using WebGPU.</p><p>Key features:\n- Zero token costs, no cloud infrastructure required\n- Complete data privacy through local processing\n- Simple 3-line code integration\n- Built on MLC and Transformer.js</p><p>The benchmarks show smaller models can effectively handle many common tasks.</p><p>Currently the project roadmap includes:\n- No-code AI pipeline builder\n- Browser-based RAG for document chat\n- Analytics/logging\n- Model fine-tuning interface</p>","contentLength":512,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42795375"},{"title":"Show HN: I made a service to convert WordPress blogs to Hugo","url":"https://wp2hugo.blogdb.org/","date":1737566900,"author":"symkat","guid":166,"unread":true,"content":"<p>Get started on a WordPress to Hugo conversion</p><p>WordPress 2 Hugo converts your WordPress content into files Hugo uses to build your website.</p><p>Let us save you from hours of manually copying and reformatting your posts.</p><div><div><p>Login to your WordPress control panel and select  and then </p></div></div><div><div><p>Click the  button to start your export.</p></div></div><div><div><p>Click the  link to save your export to your computer.</p></div></div><p> Upload the export file you just downloaded</p><div><div><div><div><ul></ul><p>Your download will be available a few moments after you click the  button — no credit card will be requested.</p></div></div></div><div><div><div><ul></ul><p>You've tried free — now you want everything converted.  You'll have the option to convert all your pages and blog posts for a one-time payment.</p></div></div></div></div><p>Send us an email at hello@blogdb.org</p>","contentLength":698,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42795249"},{"title":"Show HN: Stratoshark, a sibling application to Wireshark","url":"https://stratoshark.org/","date":1737559532,"author":"geraldcombs","guid":165,"unread":true,"content":"\n\n    The latest release of Stratoshark is 0.9.0.\n    You can get it at the following locations:\n\n    <p>\n      Stratoshark lets you explore and investigate the application-level behavior of your systems.\n      You can capture system call and log activity and use a variety of advanced features to troubleshoot and analyze that activity.\n      If you've ever used Wireshark, Stratoshark will look very familiar!\n      It's a sibling application that shares the same dissection and filtering engine and much of the same user interface.\n      It supports the same file format as Falco and Sysdig CLI, which lets you pivot seamlessly between each tool.\n      As an added bonus, it's open source, just like Wireshark and Falco.\n    </p><figure><figcaption>Stratoshark Tutorial: Getting Started with Gerald Combs by Chris Greer</figcaption></figure><figure><figcaption>Stratoshark demo by Ross Bagurdes</figcaption></figure>","contentLength":828,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42793777"},{"title":"Show HN: NotepadJs – A cross-platform love letter to Notepad","url":"https://github.com/itamarom/notepadjs","date":1737547169,"author":"itkeman","guid":164,"unread":true,"content":"<p>As a native Windows user who switched to macOS a few years back, one thing I never got over was the simplicity and usefulness of the old school Notepad app. This app aims to recreate that very same experience, cross-platform and easily installable as a PWA.</p><p>I've been using this for personal use for around 2 years and I figured it was time to share it with the world. Criticism, issues and PRs are welcome. Thanks!</p>","contentLength":414,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42791820"},{"title":"Show HN: Habby – A straightforward bullet journal with habit tracking","url":"https://habby.day/","date":1737538027,"author":"acarreras","guid":163,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42790828"}],"tags":["dev"]}