{"id":"82kPqomaPXmNomrHzpZWfbkQxiiNUBTAYKxHR5qZBEpf","title":"Hacker News: Show HN","displayTitle":"HN Show","url":"https://hnrss.org/show?points=60","feedLink":"https://news.ycombinator.com/shownew","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":15,"items":[{"title":"Show HN: Open-source AI video editor","url":"https://github.com/fal-ai-community/video-starter-kit","date":1737657278,"author":"drochetti","guid":183,"unread":true,"content":"<p>Hey HN community! I'm one of the lead devs of this project at fal.ai and we created an open source lightweight video editor powered by the latest media AI models. The main goal was to tackle some challenges when dealing with complex media handling and encoding on the browser.</p><p>It all started as an internal experiment but as we tackled some of the issues it was clear there could be some value sharing it with the open source community.</p><p>Some of the key points and tech stack details:</p><p>- It uses IndexedDb, so all data is local (i.e. no auth, no cloud db)</p><p>- Multiple AI models for video, image, music and voice-over. APIs are provided by fal.ai</p><p>- Built with the typical React+Next.js, Shadcn front-end</p><p>- Used remotion.dev for the realtime video preview (this is such a great project, without it the codebase would be twice as large)</p><p>- File uploads so you can bring your own media by uploadthing.com</p><p>- ffmpeg for encoding the final video and also some ui tricks, like the audio waveform</p><p>We deployed a version of it and for now it's free to use. We do plan to add some rate limiting and a bring your own API Key next, but it's open source and I'm curious about what the community will build on top of it, or derive from it. Customize your own video app and if you do, please share.</p><p>If you have any questions, hit me up!</p>","contentLength":1305,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42806616"},{"title":"Show HN: I built an active community of trans people online","url":"https://t4t.social/","date":1737608855,"author":"t4t","guid":182,"unread":true,"content":"<li><a href=\"https://t4t.social/@ScornerHusky\"></a><a href=\"https://t4t.social/p/52746\"></a><p>Is something I have that if there for me always when I want cuddles… I don’t have a cuddle buddy so a hot futa woman on a body pillow is the next best thing.</p></li><li><a href=\"https://t4t.social/@Arlo_\"></a><a href=\"https://t4t.social/p/52740\"></a><p>Someone message me I’m so bored I need conversation tbhhh</p></li><li><a href=\"https://t4t.social/@Felix\"></a><a href=\"https://t4t.social/p/52734\"></a><p>I really want to be fucked passionately by a hung trans woman, God that's the dream.As she slowly enters me, gradually getting faster, rose pedals on the bed, while a candle light is our only light source.</p></li><li><a href=\"https://t4t.social/@Arlo_\"></a><a href=\"https://t4t.social/p/52731\"></a><p>I’m so fucking horny right now but like lowkey I just want my ex but idk is that too much to say cuz ik he don’t fuck with me like that rn 😔 I’m just horny asf tbh</p></li><li><a href=\"https://t4t.social/@Ruby\"></a><a href=\"https://t4t.social/p/52730\"></a><p>I have the most abominable teammates in a ranked game of marvel rivals</p></li><li><a href=\"https://t4t.social/@reeseofpieces\"></a><a href=\"https://t4t.social/p/52729\"></a><p>god i love dollification so much i wish i could play with a dolly rn</p></li>","contentLength":735,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42800893"},{"title":"Show HN: I organized Bluesky feeds by categories and growth rankings","url":"https://www.bskyinfo.com/feeds/","date":1737595612,"author":"laimingj","guid":181,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42799574"},{"title":"Show HN: BrowserAI – Run LLMs directly in browser using WebGPU (open source)","url":"https://github.com/sauravpanda/BrowserAI","date":1737567609,"author":"shreyash_gupta","guid":178,"unread":true,"content":"<p>Check out this impressive project that enables running LLMs entirely in the browser using WebGPU.</p><p>Key features:\n- Zero token costs, no cloud infrastructure required\n- Complete data privacy through local processing\n- Simple 3-line code integration\n- Built on MLC and Transformer.js</p><p>The benchmarks show smaller models can effectively handle many common tasks.</p><p>Currently the project roadmap includes:\n- No-code AI pipeline builder\n- Browser-based RAG for document chat\n- Analytics/logging\n- Model fine-tuning interface</p>","contentLength":512,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42795375"},{"title":"Show HN: I made a service to convert WordPress blogs to Hugo","url":"https://wp2hugo.blogdb.org/","date":1737566900,"author":"symkat","guid":177,"unread":true,"content":"<p>Get started on a WordPress to Hugo conversion</p><p>WordPress 2 Hugo converts your WordPress content into files Hugo uses to build your website.</p><p>Let us save you from hours of manually copying and reformatting your posts.</p><div><div><p>Login to your WordPress control panel and select  and then </p></div></div><div><div><p>Click the  button to start your export.</p></div></div><div><div><p>Click the  link to save your export to your computer.</p></div></div><p> Upload the export file you just downloaded</p><div><div><div><div><ul></ul><p>Your download will be available a few moments after you click the  button — no credit card will be requested.</p></div></div></div><div><div><div><ul></ul><p>You've tried free — now you want everything converted.  You'll have the option to convert all your pages and blog posts for a one-time payment.</p></div></div></div></div><p>Send us an email at hello@blogdb.org</p>","contentLength":698,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42795249"},{"title":"Show HN: Stratoshark, a sibling application to Wireshark","url":"https://stratoshark.org/","date":1737559532,"author":"geraldcombs","guid":176,"unread":true,"content":"\n\n    The latest release of Stratoshark is 0.9.0.\n    You can get it at the following locations:\n\n    <p>\n      Stratoshark lets you explore and investigate the application-level behavior of your systems.\n      You can capture system call and log activity and use a variety of advanced features to troubleshoot and analyze that activity.\n      If you've ever used Wireshark, Stratoshark will look very familiar!\n      It's a sibling application that shares the same dissection and filtering engine and much of the same user interface.\n      It supports the same file format as Falco and Sysdig CLI, which lets you pivot seamlessly between each tool.\n      As an added bonus, it's open source, just like Wireshark and Falco.\n    </p><figure><figcaption>Stratoshark Tutorial: Getting Started with Gerald Combs by Chris Greer</figcaption></figure><figure><figcaption>Stratoshark demo by Ross Bagurdes</figcaption></figure>","contentLength":828,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42793777"},{"title":"Show HN: NotepadJs – A cross-platform love letter to Notepad","url":"https://github.com/itamarom/notepadjs","date":1737547169,"author":"itkeman","guid":175,"unread":true,"content":"<p>As a native Windows user who switched to macOS a few years back, one thing I never got over was the simplicity and usefulness of the old school Notepad app. This app aims to recreate that very same experience, cross-platform and easily installable as a PWA.</p><p>I've been using this for personal use for around 2 years and I figured it was time to share it with the world. Criticism, issues and PRs are welcome. Thanks!</p>","contentLength":414,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42791820"},{"title":"Show HN: I made a app that uses NFC as a physical switch to block distractions","url":"https://www.foqos.app/","date":1737478362,"author":"awaseem","guid":174,"unread":true,"content":"<h2>, Private, and Open Source Forever\n        </h2><p>\n          No subscriptions. No tracking. No data collection. Just a simple tool\n          to help you stay focused.\n        </p>","contentLength":168,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42782295"},{"title":"Show HN: Pica – Rust-based agentic AI infrastructure (open-source)","url":"https://www.picaos.com/","date":1737472660,"author":"moekatib","guid":173,"unread":true,"content":"<div><code></code></div>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42781017"},{"title":"Show HN: Amurex – An open source AI meeting copilot","url":"https://sansyrox.github.io/amurex_ce/","date":1737462562,"author":"jtswole","guid":172,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42779378"},{"title":"Show HN: Using YOLO to Detect Office Chairs in 40M Hotel Photos","url":"https://news.ycombinator.com/item?id=42779330","date":1737462146,"author":"nomad86","guid":171,"unread":true,"content":"I used the YOLO object detection library from Ultralytics to scan over 40 million hotel photos and identify images with office chairs. This helped me create a map showing hotels suitable for remote work.<p>The whole process was done on a home Mac without the use of any LLMs. It's based on traditional object detection technology.</p>","contentLength":327,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42779330"},{"title":"Show HN: Printercow – Turn any thermal printer into an API endpoint","url":"https://www.printercow.com/","date":1737457572,"author":"lionpixel","guid":170,"unread":true,"content":"<p data-astro-cid-cieln4ax=\"\"><strong data-astro-cid-cieln4ax=\"\">Free &amp; Open Source Forever:</strong>\nPrintercow's core is <strong data-astro-cid-cieln4ax=\"\">100% free and open-source</strong>, with  on usage. Self-host\n                    it on your infrastructure and print as much as your hardware\n                    allows. All features included.<strong data-astro-cid-cieln4ax=\"\">Hosted Service for Enterprises:</strong>\nFor companies needing , compliance, or fully managed infrastructure, we offer:\n✅ SLA-backed uptime (99.9%) with auto-scaling for peak traffic.<p>\n✅ Dedicated cloud environments and instant previews.</p>\n✅ Email support for deployment/infrastructure issues.<em data-astro-cid-cieln4ax=\"\">Exclusive Enterprise Support:</em>\n🔒 24/7 dedicated support channel.<p>\n🔒 Priority troubleshooting and architectural guidance.</p>\n🔒 Assistance with upgrades and Printercow-specific optimizations.\nPrintercow's open-source version will \nhide features behind paywalls. Enterprises fund the project so\n                    creators and hobbyists can thrive.<p>\nNeed a custom enterprise plan? Email </p><a href=\"mailto:hello@printercow.com\" data-astro-cid-cieln4ax=\"\">hello@printercow.com</a> or message us on X at <a href=\"https://x.com/printercow_com\" target=\"_blank\" data-astro-cid-cieln4ax=\"\">@printercow_com</a>. Let's build something awesome! 🐄\n</p>","contentLength":1004,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42778771"},{"title":"Show HN: Magenta.nvim – AI coding plugin for Neovim focused on tool use","url":"https://github.com/dlants/magenta.nvim","date":1737428827,"author":"anonymid","guid":169,"unread":true,"content":"<p>I've been developing this on and off for a few weeks. There are a few videos on the README page showing demos of the plugin.</p><p>I just shipped an update today, which adds:\n- inline editing with forced tool use\n- better pinned context management\n- prompt caching for anthropic\n- port to node (from bun)</p>","contentLength":297,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42776029"},{"title":"Show HN: Personalized Duolingo (kind of) for vocabulary building","url":"https://github.com/baturyilmaz/wordpecker-app","date":1737390442,"author":"arbayi","guid":168,"unread":true,"content":"<p>Hi! Wanted to share the project I really wanted to have. TLDR; this app lets you create your own list of words and you get a Duolingo-like experience (kind of, still needs a lot of features) practicing those words in their context.</p><p>My English is not the best but not the worst either. But I realized I can't boost it up after a certain level! In my belief, in order to truly learn a language, you need to be exposed to that language often. Vocabulary is the key factor here if you really want to improve in any language.</p><p>My experience is that when I read a book to improve my English vocabulary, I encounter words that I don't know so often and my reading gets disturbed. I go look for the meaning, come back, put it in context, re-read it, etc. It didn't work for me. So I tried listening to audiobooks - I listen to the book and read along, and whenever I encounter a word, I write it down. I get these 50 words in 2-3 pages and I ask ChatGPT to give me their meanings. I read them, take the book, and now read it myself. That helps for sure, but still after a while I lose those words because I never encounter them again. Well then, in order to not forget those words, I need some kind of exercise, right? A flashcard app maybe? Well, I still need to go out there, ask ChatGPT to create questions, put them in a flashcard app, etc. It's still time-consuming and this is supposed to be fun!</p><p>I need to be exposed to English in my daily life. I just need to save the words somewhere and whenever I want, I need to be able to practice them in a fun way, in Duolingo style maybe? So then I realized would it be better to store words in their own context? I mean, say I read Harry Potter and have a list of words I encountered in it, say I watch Breaking Bad and have a list of words I encountered watching it. I believe seeing those words together and practicing together makes it easier to remember them.</p><p>But I shouldn't be the one adding the meaning of the word and the one to generate exercises, right? It all should be automated. The exercise part will be handled by LLM for sure, but for the meaning of the word, I can fetch from a dictionary? But I really don't like the dictionary definitions and one word can have multiple meanings in their own context. So then I need to use LLM for this task too and have the word's meaning in its own context.</p><p>You create a list for your context, you add words, meanings get added automatically, and I see the word added in a different color (coloring is also a method used to remember words). It all takes seconds. And whenever I want to practice these lists, I can use learn mode to learn and test my knowledge in quiz mode. So I basically built this app ((thanks to Claude 3.5 Sonnet)). I want it to be like Duolingo, but of course I still have a way ahead to go, but wanted to share it in hopes of getting contributors.</p><p>You can read more in the repository. I would love to get your thoughts on this.</p>","contentLength":2939,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42770200"},{"title":"Show HN: Interactive systemd – a better way to work with systemd units","url":"https://isd-project.github.io/isd/","date":1737217323,"author":"kai-tub","guid":167,"unread":true,"content":"<p>I created a TUI for systemd/systemctl called isd (interactive systemd).</p><p>It provides a fuzzy search for units, auto-refreshing previews, smart sudo handling, and a fully customizable, keyboard-focused interface for power users and newcomers alike.</p><p>It is a more powerful (but heavier) version of sysz, which was the inspiration for the project.</p><p>This should be a huge timesaver for anybody who frequently interacts with or edits systemd units/services. And if not, please let me know why! :)</p>","contentLength":485,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42749402"}]}