{"id":"B69zEhWZA8UEAMn3PhHgwARc5WGncWEYFkmfHhvUDpmmwCTb86SBbpJu5kTKr3v5o6YroQ4JppqEFxmGRGmiRESeGsJuLMU6AM6VCzYY","title":"CNCF [Cloud Native Computing Foundation]","displayTitle":"Dev - CNCF","url":"https://www.youtube.com/feeds/videos.xml?channel_id=UCvqbFHwN-nwalWPjPUKpvTA","feedLink":"https://www.youtube.com/channel/UCvqbFHwN-nwalWPjPUKpvTA","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":15,"items":[{"title":"What’s Going on in the Containerd Neighborhood? - P. Estes, S. Karp, A. Suda, M. Brown, K. Ashok","url":"https://www.youtube.com/watch?v=kCNhgNXVdxw","date":1737848649,"author":"CNCF [Cloud Native Computing Foundation]","guid":358,"unread":true,"content":"<article>Don't miss out! Join us at our next Flagship Conference: KubeCon + CloudNativeCon Europe in London from April 1 - 4, 2025. Connect with our current graduated, incubating, and sandbox projects as the community gathers to further the education and advancement of cloud native computing. Learn more at https://kubecon.io\n\nWhat’s Going on in the Containerd Neighborhood? - Phil Estes, AWS; Samuel Karp, Google; Akihiro Suda, NTT; Michael Brown, IBM; Kirtana Ashok, Microsoft\n\nOur recent maintainer sessions have covered the soon-to-launch containerd v2.0. During this session led by maintainers we will give a brief update on 2.0, but will spend more time looking at the ecosystem around us. Why does containerd exist? What value does it bring to the overall cloud native world? How are other projects using it to build and extend containerd in useful ways? We’ll spend some time on containerd’s largest subproject, nerdctl, which also has an upcoming 2.0 release, and additionally catch the community up on activity in our Rust subproject ecosystem, the runwasi containerd shim, and lazy loading snapshotters. Since this is KubeCon, we’ll also provide an update on CRI changes and KEP-driven additions around NRI, DRA, and checkpoint/restore. Attendees will leave with a broad view of the larger containerd ecosystem of projects as well as key information on how to get involved if you are interested to help and contribute in any way to the “containerd neighborhood!”</article>","contentLength":1477,"flags":null,"enclosureUrl":"https://www.youtube.com/v/kCNhgNXVdxw?version=3","enclosureMime":"","commentsUrl":null},{"title":"Welcome & Introduction: A Hitchhiker's Guide to the CNCF Landscape- Katherine Druckman, Lori Lorusso","url":"https://www.youtube.com/watch?v=hTCAOa0-VdU","date":1737848276,"author":"CNCF [Cloud Native Computing Foundation]","guid":357,"unread":true,"content":"<article>Don't miss out! Join us at our next Flagship Conference: KubeCon + CloudNativeCon Europe in London from April 1 - 4, 2025. Connect with our current graduated, incubating, and sandbox projects as the community gathers to further the education and advancement of cloud native computing. Learn more at https://kubecon.io\n\nWelcome and Introduction: A Hitchhiker's Guide to the CNCF Landscape - Katherine Druckman and Lori Lorusso, CNCF Ambassador\n\n“Get your hiking boots ready because we are about to traverse the wild, wonderful world of the CNCF Landscape. Why you ask? We currently have over 190 projects, and finding information about them can be a challenge. “Just go to the website” isn’t enough, sometimes you need a guide to show you the ropes. In these introductory sessions we will go over some of the diverse set of projects inside the CNCF so that you’re well equipped to find what you’re looking for at KubeCon.</article>","contentLength":932,"flags":null,"enclosureUrl":"https://www.youtube.com/v/hTCAOa0-VdU?version=3","enclosureMime":"","commentsUrl":null},{"title":"Navigating the Cgroup Transition: Bridging the Gap Between Kubernetes and User Expec... S. Kunkerkar","url":"https://www.youtube.com/watch?v=JWwwtW8Hbjs","date":1737838186,"author":"CNCF [Cloud Native Computing Foundation]","guid":356,"unread":true,"content":"<article>Don't miss out! Join us at our next Flagship Conference: KubeCon + CloudNativeCon Europe in London from April 1 - 4, 2025. Connect with our current graduated, incubating, and sandbox projects as the community gathers to further the education and advancement of cloud native computing. Learn more at https://kubecon.io\n\nNavigating the Cgroup Transition: Bridging the Gap Between Kubernetes and User Expectations - Sohan Kunkerkar, Red Hat Inc\n\nAs Kubernetes and container technologies evolve, shifting from cgroup v1 to cgroup v2 has become a pivotal development. With cgroup v2 available in Kubernetes since v1.25, we're at a crossroads where many users and organizations must decide when and how to transition fully to this new system. Despite the benefits of cgroup v2, including better resource management and enhanced capabilities, users frequently encounter unexpected challenges signaling a gap in readiness and understanding. This talk will address the practical implications of moving to cgroup v2, discuss the coordinated efforts to deprecate cgroup v1, and propose actionable strategies to bridge the gap between the Kubernetes community, system administrators, and developers. By focusing on real-world experiences and providing clear guidance, this session aims to equip you with the knowledge and tools to navigate this significant change confidently.</article>","contentLength":1364,"flags":null,"enclosureUrl":"https://www.youtube.com/v/JWwwtW8Hbjs?version=3","enclosureMime":"","commentsUrl":null},{"title":"Lightning Talk: Minimizing Data Loss Within the OpenTelemetry (OTel) Collector - Alex Kats","url":"https://www.youtube.com/watch?v=xxRkfVXdy9E","date":1737837526,"author":"CNCF [Cloud Native Computing Foundation]","guid":355,"unread":true,"content":"<article>Don't miss out! Join us at our next Flagship Conference: KubeCon + CloudNativeCon Europe in London from April 1 - 4, 2025. Connect with our current graduated, incubating, and sandbox projects as the community gathers to further the education and advancement of cloud native computing. Learn more at https://kubecon.io\n\nLightning Talk: Minimizing Data Loss Within the OpenTelemetry (OTel) Collector - Alex Kats, Capital One\n\nThe OTel collector is meant to serve as a reliable and highly performant data pipeline. However, as a single component in a wider observability architecture, it is only as reliable as the downstream platforms/services it exports data to. The OTel collector has several built in mechanisms that aim to minimize the impact of unhealthy downstream exporters, including an out of the box sending queue with an additional configuration parameter for persistent queueing. There is a new component in the OTel contrib distribution, the Failover Connector. The Failover Connector allows for dynamic routing or “failover” of telemetry data based on downstream exporter health. This provides significant improvement to the data resiliency of the collector, as telemetry data can be continuously exported to a set of stable secondary locations, while the issues with the primary are resolved.</article>","contentLength":1309,"flags":null,"enclosureUrl":"https://www.youtube.com/v/xxRkfVXdy9E?version=3","enclosureMime":"","commentsUrl":null},{"title":"KubeSlice: Migrate Kubernetes Services With Confidence! | Project Lightning Talk","url":"https://www.youtube.com/watch?v=Xkl7EnILe-o","date":1737836485,"author":"CNCF [Cloud Native Computing Foundation]","guid":354,"unread":true,"content":"<article>Don't miss out! Join us at our next Flagship Conference: KubeCon + CloudNativeCon Europe in London from April 1 - 4, 2025. Connect with our current graduated, incubating, and sandbox projects as the community gathers to further the education and advancement of cloud native computing. Learn more at https://kubecon.io\n\nKubeSlice: Migrate Kubernetes Services With Confidence! | Project Lightning Talk\n\nSREs have been constantly asked to look for solutions to help them migrate K8S services from one Cloud cluster to another Cloud cluster while continuing to provide secure access to managed Cloud services left behind in the original Cloud.\n\nThe K8S services securely access these managed services using private endpoint FQDN. When SREs are asked to move the K8S services to a different Cloud cluster they hit a roadblock - there is no easy solution to provide private endpoint FQDN access to a managed service from a remote Cloud cluster.\n\nCNCF sandbox project KubeSlice solves this use case in an elegant way.\n\nKubeSlice enables SREs to create a Slice across clusters and slice overlay network connects services in the clusters. An external services gateway on the Slice in the original Cloud cluster will provide access to managed services via alias service FQDN import. Services in other clusters can reach the cloud service via the same private endpoint FQDN resolved by the Slice DNS.</article>","contentLength":1389,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Xkl7EnILe-o?version=3","enclosureMime":"","commentsUrl":null},{"title":"Now You See Me: Tame MTTR with Real-Time Anomaly Dete... Kruthika Prasanna Simha & Prschita Prschita","url":"https://www.youtube.com/watch?v=Ipc0SOhB9OM","date":1737834180,"author":"CNCF [Cloud Native Computing Foundation]","guid":353,"unread":true,"content":"<article>Don't miss out! Join us at our next Flagship Conference: KubeCon + CloudNativeCon Europe in London from April 1 - 4, 2025. Connect with our current graduated, incubating, and sandbox projects as the community gathers to further the education and advancement of cloud native computing. Learn more at https://kubecon.io\n\nNow You See Me: Tame MTTR with Real-Time Anomaly Detection - Kruthika Prasanna Simha &amp; Prschita Prschita, Apple Inc.\n\nPicture this! You are running an application on a Kubernetes cluster &amp; you notice that your nodes have been restarting and your users are noticing that your application is unreachable. As an engineer, you want to identify these failures in real-time &amp; differentiate these from known states, at scale. But we know, static thresholds fail for dynamic metrics! This session explores real-time anomaly detection for cloud-native systems. We'll show you how to reduce MTTR and mean time to analyse by proactively identifying abnormal application behavior using statistical &amp; machine learning algorithms on time series data from Prometheus. Learn to pinpoint issues, identify missing instrumentation, and visualize anomalies using Grafana. This session equips you to achieve faster issue resolution and maintain optimal application health. We'll demo practical techniques for metrics selection, anomaly detection and proactive issue identification to manage your cloud-native applications.</article>","contentLength":1420,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Ipc0SOhB9OM?version=3","enclosureMime":"","commentsUrl":null},{"title":"Nothing but NATS - Going Beyond Cloud Native - Byron Ruth & Kevin Hoffman, Synadia","url":"https://www.youtube.com/watch?v=ypsAus_OBmo","date":1737761567,"author":"CNCF [Cloud Native Computing Foundation]","guid":352,"unread":true,"content":"<article>Don't miss out! Join us at our next Flagship Conference: KubeCon + CloudNativeCon Europe in London from April 1 - 4, 2025. Connect with our current graduated, incubating, and sandbox projects as the community gathers to further the education and advancement of cloud native computing. Learn more at https://kubecon.io\n\nNothing but NATS - Going Beyond Cloud Native - Byron Ruth &amp; Kevin Hoffman, Synadia\n\nThese days building so-called cloud-native apps involves assembling a custom stack of tools 10x bigger than the app we're building. Additionally, applications increasingly need to expand out to the edge and cloud-native stacks simply don't work in those environments. Fortunately with NATS, we don't need a stack. In this session you'll see how we can leverage compute, storage, and connectivity to build cloud-to-edge native apps more powerful than ever, with less code, effort, and frustration.</article>","contentLength":899,"flags":null,"enclosureUrl":"https://www.youtube.com/v/ypsAus_OBmo?version=3","enclosureMime":"","commentsUrl":null},{"title":"ChatLoopBackOff - Episode 43 (KubeVela)","url":"https://www.youtube.com/watch?v=ClbJB-m0Kc4","date":1737698511,"author":"CNCF [Cloud Native Computing Foundation]","guid":351,"unread":true,"content":"<article>KubeVela, an incubating CNCF project, is a modern application delivery platform that simplifies the deployment and management of cloud-native applications. It uses the Open Application Model (OAM) to create an application centric approach via \"deployment as code\".\n\nJoin CNCF Ambassador, Andy Suderman as he explores KubeVela’s value for teams by highlighting its integration with CI processes, built-in observability, multi-tenancy and security support.</article>","contentLength":456,"flags":null,"enclosureUrl":"https://www.youtube.com/v/ClbJB-m0Kc4?version=3","enclosureMime":"","commentsUrl":null},{"title":"Multi-Zone Clusters Inside and Out - Tom Dean & Phil Henderson, Buoyant","url":"https://www.youtube.com/watch?v=WhFsYVHmg6E","date":1737683394,"author":"CNCF [Cloud Native Computing Foundation]","guid":350,"unread":true,"content":"<article>Don't miss out! Join us at our next Flagship Conference: KubeCon + CloudNativeCon Europe in London from April 1 - 4, 2025. Connect with our current graduated, incubating, and sandbox projects as the community gathers to further the education and advancement of cloud native computing. Learn more at https://kubecon.io\nMulti-Zone Clusters Inside and Out - Tom Dean &amp; Phil Henderson, Buoyant\n\nMulti-zone clusters are a great tool for improving application reliability — and also a great way to spend a ton of cash. Why? What really happens when you set these things up? How do you use them effectively without bankrupting your whole organization? In this session, we'll dig into the nuts and bolts of what goes on under the hood of a multi-zone cluster, including what a zone is, what Kubernetes understands about zones, how zones affect routing, and why multi-zone clusters can drive costs up. We'll spend some time on Kubernetes' Topology Aware Routing, covering its advantages as well as its very real limitations. Finally, we'll dive into how you can influence Kubernetes' choices to take advantage of multi-zone clusters' reliability while containing costs. Join us for learning and live demos!</article>","contentLength":1199,"flags":null,"enclosureUrl":"https://www.youtube.com/v/WhFsYVHmg6E?version=3","enclosureMime":"","commentsUrl":null},{"title":"Goodbye etcd! Running Kubernetes on Distributed PostgreSQL - Denis Magda, Yugabyte","url":"https://www.youtube.com/watch?v=VdF1tKfDnQ0","date":1737682409,"author":"CNCF [Cloud Native Computing Foundation]","guid":349,"unread":true,"content":"<article>Don't miss out! Join us at our next Flagship Conference: KubeCon + CloudNativeCon Europe in London from April 1 - 4, 2025. Connect with our current graduated, incubating, and sandbox projects as the community gathers to further the education and advancement of cloud native computing. Learn more at https://kubecon.io\n\nGoodbye etcd! Running Kubernetes on Distributed PostgreSQL - Denis Magda, Yugabyte\n\nKubernetes once favored Etcd as a database for all cluster data. Back then, relational databases lacked the availability and scalability characteristics required by Kubernetes. However, as Etcd encountered challenges with various Kubernetes workloads, relational databases continued to evolve. This session is a practical guide for deploying fault-tolerant and scalable Kubernetes clusters on distributed PostgreSQL. We’ll begin with Kine, which integrates into the Kubernetes architecture, enabling relational databases for cluster metadata management. Then, we’ll use Kine to deploy Kubernetes on a single-server PostgreSQL instance. After that, we’ll migrate to a multi-node PostgreSQL instance, allowing Kubernetes to tolerate zone and region outages and scale to thousands of nodes on demand.</article>","contentLength":1206,"flags":null,"enclosureUrl":"https://www.youtube.com/v/VdF1tKfDnQ0?version=3","enclosureMime":"","commentsUrl":null},{"title":"Efficient LLM Deployment: A Unified Approach with Ray, VLLM, and Kubernetes - Lily (Xiaoxuan) Liu","url":"https://www.youtube.com/watch?v=K3NW-gV1OtA","date":1737680375,"author":"CNCF [Cloud Native Computing Foundation]","guid":348,"unread":true,"content":"<article>Don't miss out! Join us at our next Flagship Conference: KubeCon + CloudNativeCon Europe in London from April 1 - 4, 2025. Connect with our current graduated, incubating, and sandbox projects as the community gathers to further the education and advancement of cloud native computing. Learn more at https://kubecon.io\n\nEfficient LLM Deployment: A Unified Approach with Ray, VLLM, and Kubernetes - Lily (Xiaoxuan) Liu, UC Berkeley, Anyscale\n\nWith the groundbreaking release of ChatGPT, large language models (LLMs) have taken the world by storm: they have enabled new applications, have exacerbated GPU shortage, and raised new questions about their answers’ veracity. This talk delves into an AI stack, encompassing cloud-native orchestration, distributed computing, and advanced LLMOps. Key topics include: - Kubernetes: The foundational technology that seamlessly manages AI workloads across diverse cloud environments. - Ray: The versatile, open-source framework that streamlines the development and scaling of distributed applications. - vLLM: The cutting-edge, high-performance, and memory-efficient inference and serving engine designed specifically for large language models. Attendees will gain insights into the architecture and integration of these powerful tools, driving innovation and efficiency in the deployment of AI solutions.</article>","contentLength":1345,"flags":null,"enclosureUrl":"https://www.youtube.com/v/K3NW-gV1OtA?version=3","enclosureMime":"","commentsUrl":null},{"title":"Navigating the Future: Exploring the Latest in Kubernetes Dashboard Dev... M. Maciaszczyk, S. Florek","url":"https://www.youtube.com/watch?v=7BV1QAgTCxI","date":1737677765,"author":"CNCF [Cloud Native Computing Foundation]","guid":347,"unread":true,"content":"<article>Don't miss out! Join us at our next Flagship Conference: KubeCon + CloudNativeCon Europe in London from April 1 - 4, 2025. Connect with our current graduated, incubating, and sandbox projects as the community gathers to further the education and advancement of cloud native computing. Learn more at https://kubecon.io\n\nNavigating the Future: Exploring the Latest in Kubernetes Dashboard Development - Marcin Maciaszczyk &amp; Sebastian Florek, Plural\n\nJoin us for an insightful presentation on the latest updates from the Kubernetes SIG-UI, focusing on the evolution of the Kubernetes Dashboard project. Dive into a comprehensive overview of key changes, enhancements, and advancements, including a detailed exploration of the project's new architecture. Gain valuable insights into how these developments shape the future of Kubernetes management and user experience. Whether you're a seasoned Kubernetes user or new to the ecosystem, this presentation promises to provide valuable perspectives on the cutting-edge developments in Kubernetes Dashboard.</article>","contentLength":1049,"flags":null,"enclosureUrl":"https://www.youtube.com/v/7BV1QAgTCxI?version=3","enclosureMime":"","commentsUrl":null},{"title":"Navigating Cross SIG Collaborations with SIG Docs - Panel","url":"https://www.youtube.com/watch?v=wrbWvv6Un2U","date":1737677670,"author":"CNCF [Cloud Native Computing Foundation]","guid":346,"unread":true,"content":"<article>Don't miss out! Join us at our next Flagship Conference: KubeCon + CloudNativeCon Europe in London from April 1 - 4, 2025. Connect with our current graduated, incubating, and sandbox projects as the community gathers to further the education and advancement of cloud native computing. Learn more at https://kubecon.io\n\nNavigating Cross SIG Collaborations with SIG Docs - Rey Lejano &amp; Savitha Raghunathan, Red Hat; Divya Mohan, SUSE; Xander Grzywinski, Defense Unicorns\n\nAs one of the largest open source projects, Kubernetes is divided into twenty-four Special Interest Groups (SIGs). All SIGs share a common goal of advancing the project, and collaboration across SIGs is required to do so. In this session, learn how SIG Docs collaborates with other SIGs on Kubernetes releases, improving Kubernetes security and driving Kubernetes adoption with documentation.</article>","contentLength":862,"flags":null,"enclosureUrl":"https://www.youtube.com/v/wrbWvv6Un2U?version=3","enclosureMime":"","commentsUrl":null},{"title":"Kubernetes SIG Storage: Intro & Deep Dive - Michelle Au, Xing Yang & Hemant Kumar","url":"https://www.youtube.com/watch?v=DkpQSCX6KqQ","date":1737677622,"author":"CNCF [Cloud Native Computing Foundation]","guid":345,"unread":true,"content":"<article>Don't miss out! Join us at our next Flagship Conference: KubeCon + CloudNativeCon Europe in London from April 1 - 4, 2025. Connect with our current graduated, incubating, and sandbox projects as the community gathers to further the education and advancement of cloud native computing. Learn more at https://kubecon.io\n\nKubernetes SIG Storage: Intro &amp; Deep Dive - Michelle Au, Google; Xing Yang, VMware by Broadcom; Hemant Kumar, Red Hat\n\nKubernetes SIG Storage is responsible for ensuring that different types of file and block storage are available wherever a container is scheduled, storage capacity management (container ephemeral storage usage, volume resizing, etc.), influencing scheduling of containers based on storage (data gravity, availability, etc.), and generic operations on storage (snapshotting, etc.). SIG Storage also has a project that provides APIs for object storage support in Kubernetes. In this session, we will deep dive into some projects that SIG Storage is currently working on, provide an update on the current status, and discuss what might be coming in the future.</article>","contentLength":1095,"flags":null,"enclosureUrl":"https://www.youtube.com/v/DkpQSCX6KqQ?version=3","enclosureMime":"","commentsUrl":null},{"title":"SIG-Node: Intro and Deep Dive - Sergey Kanzhelev & Dawn Chen, Google; Mrunal Patel, Red Hat","url":"https://www.youtube.com/watch?v=bb0Op1G6XjQ","date":1737677538,"author":"CNCF [Cloud Native Computing Foundation]","guid":344,"unread":true,"content":"<article>Don't miss out! Join us at our next Flagship Conference: KubeCon + CloudNativeCon Europe in London from April 1 - 4, 2025. Connect with our current graduated, incubating, and sandbox projects as the community gathers to further the education and advancement of cloud native computing. Learn more at https://kubecon.io\n\nSIG-Node: Intro and Deep Dive - Sergey Kanzhelev &amp; Dawn Chen, Google; Mrunal Patel, Red Hat\n\nKubernetes SIG Node maintainers track session will cover the latest updates in the Kubernetes Node subsystem. The emergence of Generative AI has introduced new challenges and workload behaviors. And SIG Node is up for the challenge. SIG Node owns components and interactions between pods and host resources, including the Kubelet, Container Runtime Interface, and Node API. SIG Node is responsible for the Pod’s lifecycle from allocation to teardown, to liveness checks and shared resource management. We work with various container runtimes, kernels, networking, storage, and more; anything a pod touches is SIG Node’s responsibility! The session will be led by Kubernetes SIG Node leads and will be interesting for seasoned contributors as well as people seeking to get involved in the project. Attendees will leave the session with a better understanding of the latest developments in the Kubernetes Node subsystem. The session is open to all Kubernetes users, regardless of experience level.</article>","contentLength":1411,"flags":null,"enclosureUrl":"https://www.youtube.com/v/bb0Op1G6XjQ?version=3","enclosureMime":"","commentsUrl":null}],"tags":["dev"]}