{"id":"B69zEhWZA8UEAMn3PhHgwARc5WGncWEYFkmfHhvUDpmmwCTb86SBbpJu5kTKr3v5o6YroQ4JppnTPmKLxpU2tRhdtRTKSt57YWBdJkQg","title":"Closer To Truth","displayTitle":"Podcast - Closer to Truth","url":"https://www.youtube.com/feeds/videos.xml?channel_id=UCl9StMQ79LtEvlrskzjoYbQ","feedLink":"https://www.youtube.com/channel/UCl9StMQ79LtEvlrskzjoYbQ","isQuery":false,"isEmpty":false,"isHidden":false,"items":[{"title":"How are humans and animals different?","url":"https://www.youtube.com/watch?v=TKCKyKIeQ3M","date":1736193613,"author":"Closer To Truth","unread":true,"content":"Philosopher Eleanor Stump explores the question: What’s so special about human nature? #shorts","flags":null,"enclosureUrl":"https://www.youtube.com/v/TKCKyKIeQ3M?version=3","enclosureMime":""},{"title":"Deepak Chopra - Must the Universe Contain Consciousness?","url":"https://www.youtube.com/watch?v=WMkL45G9pkk","date":1736179227,"author":"Closer To Truth","unread":true,"content":"Do you enjoy our content? Make a donation of any amount to help support Closer To Truth continue making videos like this one: https://shorturl.at/OnyRq\n\nOur universe seems fine-tuned for life, with the constants of physical laws having to be within tight boundaries. Does this mean that the universe has a goal of consciousness? Is there a directedness of the universe toward consciousness? Is consciousness entirely contingent or is it something special, even a ultimate object of universal development?\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nDeepak Chopra is an Indian-American author, new age guru, and alternative medicine advocate. A prominent figure in the New Age movement, his books and videos have made him one of the best-known and wealthiest figures in alternative medicine. \n\nShop Closer To Truth merchandise for unique gifts like notebooks, mugs, and apparel: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/WMkL45G9pkk?version=3","enclosureMime":""},{"title":"William Lane Craig - Is God Outside of Time?","url":"https://www.youtube.com/watch?v=WFPLksxE4cE","date":1736092833,"author":"Closer To Truth","unread":true,"content":"Sign up for a Closer To Truth membership to receive special exclusives like early access to new episodes and more: https://closertotruth.com/.\n\nIf God exists outside of time—not in time, but timeless and eternal—what would that mean about God’s nature? God would never ‘lose’ the past or anticipate the future. God would not need to know the future, because to a timeless God, there would be no future. Everything would be ever-present in one timeless moment. But how could a timeless God relate to human beings?\n\nSupport the show with a donation of any amount to help Closer To Truth continue exploring life's deepest questions: shorturl.at/OnyRq\n\nWilliam Lane Craig is an American analytic philosopher, Christian apologist, author, and Wesleyan theologian who upholds the view of Molinism and neo-Apollinarianism. He is a professor of philosophy at Houston Christian University and at the Talbot School of Theology of Biola University.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/WFPLksxE4cE?version=3","enclosureMime":""},{"title":"Rupert Sheldrake - How Much More to Physical Reality?","url":"https://www.youtube.com/watch?v=E9wKkNIPLbE","date":1736006417,"author":"Closer To Truth","unread":true,"content":"Follow us on X for daily articles, updates, and more: https://x.com/CloserToTruth\n\nWhat is the farthest extent of the physical world, not only cosmologically across the universe but also conceptually across laws of nature? Can there be radical new discoveries in the 21st century as relativity and quantum mechanics were in the 20th century? Some speculate that a true understanding of consciousness will require laws as yet unknown.\n\nRegister for a Closer To Truth membership to receive special exclusives like early access to new episodes and more: https://closertotruth.com/.\n\nAlfred Rupert Sheldrake is an English author and parapsychology researcher. He proposed the concept of morphic resonance, a conjecture that lacks mainstream acceptance and has been widely criticized as pseudoscience.\n\nShop Closer To Truth merch for unique items like notebooks, mugs, and apparel: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/E9wKkNIPLbE?version=3","enclosureMime":""},{"title":"Raymond Tallis - The Search for Meaning","url":"https://www.youtube.com/watch?v=OuHcElCQfO4","date":1735934422,"author":"Closer To Truth","unread":true,"content":"Subscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nTo search for meaning, God or something like God is often involved. But this need not be so. How can meaning be found, or purpose realized, without invoking supernatural forces? Scientists and philosophers who do not believe in God search for ‘meaning’ in what seems to be a meaningless cosmos. They do generate a kind of ‘meaning’. Are they fooling themselves?\n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nRaymond C. Tallis is a philosopher, poet, novelist, cultural critic and a retired medical physician and clinical neuroscientist. \n\nShop Closer To Truth merch like mugs, hoodies, and T-shirts to show your support of the show: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/OuHcElCQfO4?version=3","enclosureMime":""},{"title":"Michael Ruse - Philosophy of Sex, Sexuality, and Gender","url":"https://www.youtube.com/watch?v=_ZvNgquqENA","date":1735920034,"author":"Closer To Truth","unread":true,"content":"Follow us on X for daily news, updates, articles, and more: https://x.com/CloserToTruth\n\nSexual questions abound. What is “normal” sexual behavior vs. multiple variations? How to appreciate LGBTQ+ issues? What can be learned from sex in animal models that is relevant for human sexuality? A philosophical perspective can provide clarity.\n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nMichael Escott Ruse FRSC was a British-born Canadian philosopher of science who specialized in the philosophy of biology and worked on the relationship between science and religion, the creation–evolution controversy, and the demarcation problem within science.\n\nGet special exclusives and discounts with a free Closer To Truth membership today: https://closertotruth.com/.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/_ZvNgquqENA?version=3","enclosureMime":""},{"title":"William Dembski - Fine-Tuning in the Universe","url":"https://www.youtube.com/watch?v=n4o_aUHoaPs","date":1735833641,"author":"Closer To Truth","unread":true,"content":"Sign up for a Closer To Truth membership to receive special exclusives like early access to new episodes and more: https://closertotruth.com/.\n\nWe human beings sit roughly midway between the sizes of atoms and galaxies, and both must be so perfectly structured for us to exist. It’s called ‘fine-tuning’ and it’s all so breathtakingly precise that it cries out for explanation. To some, fine-tuning leads to God. To others, there are non-supernatural explanations. Both are startling.\n\nSupport the show with a donation of any amount to help Closer To Truth continue exploring life's deepest questions: shorturl.at/OnyRq\n\nWilliam Albert Dembski is an American mathematician, philosopher, and theologian. He was a proponent of intelligent design pseudoscience, specifically the concept of specified complexity, and was a senior fellow of the Discovery Institute's Center for Science and Culture.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/n4o_aUHoaPs?version=3","enclosureMime":""},{"title":"Eric Schwitzgebel - What is Belief?","url":"https://www.youtube.com/watch?v=ffFhD8mJk18","date":1735761618,"author":"Closer To Truth","unread":true,"content":"Listen to the Closer To Truth podcast on Apple, Spotify, or wherever you get your podcasts. Subscribe today: https://shorturl.at/mtJP4\n\nEveryone has beliefs—some are simple and basic (e.g., my name, age), others complex and controversial (e.g., God? Soul? Politics? Morality?). But what is the concept of ‘belief’? What does it take for some statement to be a ‘belief’? And what distinguishes among ‘belief’, ‘true belief’, and ‘knowledge’? Before asking what we believe, let’s understand ‘belief’.\n\nMake a tax-deductible donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nEric Schwitzgebel is an American professor of philosophy at the University of California, Riverside. His main interests include connections between empirical psychology, philosophy of mind, and the nature of belief, as well as Classical Chinese philosophy.\n\nShow your support for the show with a Closer To Truth merch purchase: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/ffFhD8mJk18?version=3","enclosureMime":""},{"title":"Bernard Carr - Physics of Fine-Tuning","url":"https://www.youtube.com/watch?v=zIfVNSHk8Cg","date":1735747253,"author":"Closer To Truth","unread":true,"content":"Follow us on Instagram for daily news, announcements, and exciting updates: https://shorturl.at/p2IhM\n\nThe fine-tuning of the constants of nature, which seems required for the existence of stars and planets and certainly for life and mind, is a fascinating feature of our universe. But before grand metaphysical schemes are advanced by philosophers, theologians, and even scientists, proper understanding of the underlying assumptions and fundamental physics are needed.\n\nDonate to Closer To Truth to help us keep our content free and without paywalls: https://shorturl.at/OnyRq\n\nBernard J. Carr is a British professor of mathematics and astronomy at Queen Mary University of London. His research interests include the early universe, dark matter, general relativity, primordial black holes, and the anthropic principle.\n\nGet member exclusives like early access to new content with a free Closer To Truth account: https://closertotruth.com/\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/zIfVNSHk8Cg?version=3","enclosureMime":""},{"title":"Jeffery Martin - What is Enlightenment?","url":"https://www.youtube.com/watch?v=bgJFvckO_VE","date":1735660829,"author":"Closer To Truth","unread":true,"content":"Shop hoodies, mugs, notebooks, and more in the Closer To Truth merch store: https://bit.ly/3P2ogje\n\nEnlightenment is the claimed higher mental states that characterize various Eastern religious and philosophical traditions. Such enlightenment is usually achieved through kinds of meditative practices. While there is no doubt that deep and protracted mediation can alter normal conscious states, is there any real reach to ultimate reality?\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nJeffery Martin is a social scientist and the current director of the Center for the Study of Non-Symbolic Consciousness. He specializes in bringing rigorous empirical research and testing to transformational techniques and theories that have previously been supported anecdotally. Martin is a leading expert on persistent non-symbolic consciousness (enlightenment, nonduality, mystical experience, union with God/nature, etc.).\n\nMake a donation of any amount to help support Closer To Truth reach new audiences and continue exploring deep questions: https://shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/bgJFvckO_VE?version=3","enclosureMime":""},{"title":"Elliott Sober - Philosophy of Evolution & Religion","url":"https://www.youtube.com/watch?v=ludXsEiLWKM","date":1735574444,"author":"Closer To Truth","unread":true,"content":"Enjoying our videos? Make a donation of any amount to help support Closer To Truth continue making content like this: https://shorturl.at/OnyRq\n\nTwo kinds of questions describe the relationship between evolution and religion. The first explores discrepancies, even contradictions, between the science of evolution and the beliefs of religion. The second examines how religion itself evolved.\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nElliott R. Sober is Hans Reichenbach Professor and William F. Vilas Research Professor Emeritus in the Department of Philosophy at University of Wisconsin–Madison. Sober is noted for his work in philosophy of biology and general philosophy of science.\n\nShop Closer To Truth merchandise for unique gifts like notebooks, mugs, and apparel: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/ludXsEiLWKM?version=3","enclosureMime":""},{"title":"What does it mean to be human?","url":"https://www.youtube.com/watch?v=I5UFcwHp2YY","date":1735567215,"author":"Closer To Truth","unread":true,"content":"Harvard's Greg Epstein explores humanity, the nature of the universe, and more #shorts","flags":null,"enclosureUrl":"https://www.youtube.com/v/I5UFcwHp2YY?version=3","enclosureMime":""},{"title":"Alan Torrance - Do Major Religions Worship the Same God?","url":"https://www.youtube.com/watch?v=dhzTSvcNVe4","date":1735488036,"author":"Closer To Truth","unread":true,"content":"Register for a Closer To Truth membership to receive special exclusives like early access to new episodes and more: https://closertotruth.com/.\n\nThe many different religions of the world proclaim radically different, often opposing and contradictory doctrines about God. How then can their believers be worshipping the same God? Can the very general, soft areas of agreement compensate for the very specific, hard tenets of disagreement?\n\nAlan Torrance is professor of systematic theology at St Mary's College of the University of St. Andrews. Previously he lectured at King's College London where he was also Director of the Research Institute in Systematic Theology. During this time he served as Senior Research Fellow at the Erasmus Institute, University of Notre Dame. He previously lectured at Knox Theological Hall and the University of Otago, Dunedin, New Zealand.\n\nSupport the show with a donation of any amount to help Closer To Truth continue exploring life's deepest questions: shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/dhzTSvcNVe4?version=3","enclosureMime":""},{"title":"William Dembski - How Should We Think About God's Existence?","url":"https://www.youtube.com/watch?v=XPlHwIQPZf4","date":1735401633,"author":"Closer To Truth","unread":true,"content":"Follow us on X for daily articles, updates, and more: https://x.com/CloserToTruth\n\nGod exists? God does not exist? What kinds of Gods? It’s no challenge to find flaws and fallacies on all sides. Can we step away from old arguments and ask how to approach God’s existence? What’s the process? What’s the way of thinking? What are issues, problems, questions about God and God’s existence? Can conventional wisdom be avoided? Can progress be made?\n\nRegister for a Closer To Truth membership to receive special exclusives like early access to new episodes and more: https://closertotruth.com/.\n\nWilliam Albert Dembski is an American mathematician, philosopher and theologian. He was a proponent of intelligent design pseudoscience, specifically the concept of specified complexity, and was a senior fellow of the Discovery Institute's Center for Science and Culture.\n\nShop Closer To Truth merch for unique items like notebooks, mugs, and apparel: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/XPlHwIQPZf4?version=3","enclosureMime":""},{"title":"Bahador Bahrami - How Art Affects the Self","url":"https://www.youtube.com/watch?v=RjhAg1Em_A4","date":1735329611,"author":"Closer To Truth","unread":true,"content":"Subscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nThere is increasing evidence in the field of neuroscience that art enhances brain function by impacting brain wave patterns, emotions, and the nervous system. But more abstractly, does art have the power to affect the self? That is, a person’s beliefs, thoughts, feelings, identity. What impact does art have on the individual consuming it?\n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nBahador Bahrami is a Senior Scientist and Director of Crowd Cognition Lab in Department of Psychology at Ludwig Maximilian University in Munich, Germany and Professor of Social Neuroscience at Department of Psychology at Royal Holloway University of London.\n\nShow your support for the show (and snag a unique holiday gift!) with a Closer To Truth merch purchase: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.","flags":null,"enclosureUrl":"https://www.youtube.com/v/RjhAg1Em_A4?version=3","enclosureMime":""}]}