{"id":"CQdwDV8xyajeX5DKoSYfBQhN4kkXBaTmXPYgJyANUWHyjCo5BpHUjy5gJhgngST","title":"Slashdot: Linux","displayTitle":"Dev - Slashdot - Linux","url":"http://rss.slashdot.org/Slashdot/slashdotLinux","feedLink":"https://linux.slashdot.org/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":9,"items":[{"title":"Linux 6.14 Brings Some Systems Faster Suspend and Resume","url":"https://linux.slashdot.org/story/25/01/25/2343225/linux-614-brings-some-systems-faster-suspend-and-resume?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737909240,"author":"EditorDavid","guid":250,"unread":true,"content":"Amid the ongoing Linux 6.14 kernel development cycle, Phoronix spotted a pull request for ACPI updates which \"will allow for faster suspend and resume cycles on some systems.\" \n\nWikipedia defines ACPI as \"an open standard that operating systems can use to discover and configure computer hardware components\" for things like power management and putting unused hardware components to sleep. Phoronix reports:\n\nThe ACPI change worth highlighting for Linux 6.14 is switching from msleep() to usleep_range() within the acpi_os_sleep() call in the kernel. This reduces spurious sleep time due to timer inaccuracy. Linux ACPI/PM maintainer Rafael Wysocki of Intel who authored this change noted that it could \"spectacularly\" reduce the duration of system suspend and resume transitions on some systems... \n\nRafael explained in the patch making the sleep change: \n\n \"The extra delay added by msleep() to the sleep time value passed to it can be significant, roughly between 1.5 ns on systems with HZ = 1000 and as much as 15 ms on systems with HZ = 100, which is hardly acceptable, at least for small sleep time values.\" \nOne 2022 bug report complained a Dell XPS 13 using Thunderbolt took \"a full 8 seconds to suspend and a full 8 seconds to resume even though no physical devices are connected.\" In November an Intel engineer posted on the kernel mailing list that the fix gave a Dell XPS 13 a 42% improvement in kernel resume time (from 1943ms to 1127ms).","contentLength":1452,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Could New Linux Code Cut Data Center Energy Use By 30%?","url":"https://hardware.slashdot.org/story/25/01/25/2111225/could-new-linux-code-cut-data-center-energy-use-by-30?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737848040,"author":"EditorDavid","guid":267,"unread":true,"content":"Two computer scientists at the University of Waterloo in Canada believe changing 30 lines of code in Linux \"could cut energy use at some data centers by up to 30 percent,\" according to the site Data Centre Dynamics. \n\nIt's the code that processes packets of network traffic, and Linux \"is the most widely used OS for data center servers,\" according to the article:\n\nThe team tested their solution's effectiveness and submitted it to Linux for consideration, and the code was published this month as part of Linux's newest kernel, release version 6.13. \"All these big companies — Amazon, Google, Meta — use Linux in some capacity, but they're very picky about how they decide to use it,\" said Martin Karsten [professor of Computer Science in the Waterloo's Math Faculty]. \"If they choose to 'switch on' our method in their data centers, it could save gigawatt hours of energy worldwide. Almost every single service request that happens on the Internet could be positively affected by this.\" \n\nThe University of Waterloo is building a green computer server room as part of its new mathematics building, and Karsten believes sustainability research must be a priority for computer scientists. \"We all have a part to play in building a greener future,\" he said. The Linux Foundation, which oversees the development of the Linux OS, is a founder member of the Green Software Foundation, an organization set up to look at ways of developing \"green software\" — code that reduces energy consumption. \n\nKarsten \"teamed up with Joe Damato, distinguished engineer at Fastly\" to develop the 30 lines of code, according to an announcement from the university. \"The Linux kernel code addition developed by Karsten and Damato was based on research published in ACM SIGMETRICS Performance Evaluation Review\" (by Karsten and grad student Peter Cai). \n\nTheir paper \"reviews the performance characteristics of network stack processing for communication-heavy server applications,\" devising an \"indirect methodology\" to \"identify and quantify the direct and indirect costs of asynchronous hardware interrupt requests (IRQ) as a major source of overhead... \n\n\"Based on these findings, a small modification of a vanilla Linux system is devised that improves the efficiency and performance of traditional kernel-based networking significantly, resulting in up to 45% increased throughput...\"","contentLength":2374,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.14 Adds Support For The Microsoft Copilot Key Found On New Laptops","url":"https://linux.slashdot.org/story/25/01/23/2333254/linux-614-adds-support-for-the-microsoft-copilot-key-found-on-new-laptops?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737678000,"author":"BeauHD","guid":266,"unread":true,"content":"The Linux 6.14 kernel now maps out support for Microsoft's \"Copilot\" key \"so that user-space software can determine the behavior for handling that key's action on the Linux desktop,\" writes Phoronix's Michael Larabel. From the report: A change made to the atkbd keyboard driver on Linux now maps the F23 key to support the default copilot shortcut action. The patch authored by Lenovo engineer Mark Pearson explains [...]. Now it's up to the Linux desktop environments for determining what to do if the new Copilot key is pressed. The patch was part of the input updates now merged for the Linux 6.14 kernel.","contentLength":608,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.13 Released","url":"https://linux.slashdot.org/story/25/01/20/0555227/linux-613-released?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1737362040,"author":"EditorDavid","guid":265,"unread":true,"content":"\"Nothing horrible or unexpected happened last week,\" Linux Torvalds posted tonight on the Linux kernel mailing list, \"so I've tagged and pushed out the final 6.13 release.\" \n\nPhoronix says the release has \"plenty of fine features\":\nLinux 6.13 comes with the introduction of the AMD 3D V-Cache Optimizer driver for benefiting multi-CCD Ryzen X3D processors. The new AMD EPYC 9005 \"Turin\" server processors will now default to AMD P-State rather than ACPI CPUFreq for better power efficiency.... \nLinux 6.13 also brings more Rust programming language infrastructure and more.\n \nPhoronix notes that Linux 6.13 also brings \"the start of Intel Xe3 graphics bring-up, support for many older (pre-M1) Apple devices like numerous iPads and iPhones, NVMe 2.1 specification support, and AutoFDO and Propeller optimization support when compiling the Linux kernel with the LLVM Clang compiler.\" \n\nAnd some lucky Linux kernel developers will also be getting a guitar pedal soldered by Linus Torvalds himself, thanks to a generous offer he announced a week ago:\n\nFor _me_ a traditional holiday activity tends to be a LEGO build or two, since that's often part of the presents... But in addition to the LEGO builds, this year I also ended up doing a number of guitar pedal kit builds (\"LEGO for grown-ups with a soldering iron\"). Not because I play guitar, but because I enjoy the tinkering, and the guitar pedals actually do something and are the right kind of \"not very complex, but not some 5-minute 555 LED blinking thing\"... \n[S]ince I don't actually have any _use_ for the resulting pedals (I've already foisted off a few only unsuspecting victims^Hfriends), I decided that I'm going to see if some hapless kernel developer would want one.... as an admittedly pretty weak excuse to keep buying and building kits... \n\n\"It may be worth noting that while I've had good success so far, I'm a software person with a soldering iron. You have been warned... [Y]ou should set your expectations along the lines of 'quality kit built by a SW person who doesn't know one end of a guitar from the other.'\"","contentLength":2084,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Parallels Can Now Run x86 Windows and Linux On Apple Silicon Mac","url":"https://tech.slashdot.org/story/25/01/15/0216248/parallels-can-now-run-x86-windows-and-linux-on-apple-silicon-mac?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1736924400,"author":"BeauHD","guid":264,"unread":true,"content":"Parallels Desktop now supports running 64-bit x86 operating systems on Apple Silicon Macs through its proprietary emulation engine, enabling users to run traditional Windows and Linux distributions. However, performance is said to be \"really slow.\" How-To Geek reports: The latest Parallels Desktop 20.2 update adds early support for x86 emulation on Apple Silicon, allowing traditional x86 PC operating systems to work on newer Mac computers. There were already apps like UTM that could do it (most of them are based on QEMU), but this feature uses Parallels' \"proprietary emulation engine\" paired with Apple's built-in hypervisor. [...] Parallels on Apple Silicon can now \"run existing x86_64 Windows 10, Windows 11*, Windows Server 2019/2022, and some Linux distributives with UEFI BIOS via Parallels Emulator.\" You can also create new Windows 10 21H2 and Windows Server 2022 virtual machines if needed.\n \nThere are some big limitations. You can only run 64-bit x86 operating systems -- sorry, FreeDOS fans -- but those 64-bit operating systems can run 32-bit applications. There's also no support for USB devices, nested virtualization (so WSL2 won't work), or the Parallels hypervisor. Performance will also be \"really slow,\" since x86 instructions have to be translated to ARM. The company said, \"Windows boot time is about 2-7 minutes, depending on your hardware. Windows operating system responsiveness is also low.\"","contentLength":1424,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linus Torvalds Offers to Build Guitar Effects Pedal For Kernel Developer","url":"https://linux.slashdot.org/story/25/01/13/2131230/linus-torvalds-offers-to-build-guitar-effects-pedal-for-kernel-developer?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1736810400,"author":"BeauHD","guid":263,"unread":true,"content":"Linux creator Linus Torvalds announced a playful giveaway for kernel contributors: he'll hand-build a guitar effects pedal for one lucky developer selected at random, using his holiday hobby skills with pedal kits. To qualify, developers must have a 2024 commit in Torvalds' kernel git tree and email him with the subject \"I WANT A GUITAR PEDAL\". He'll pick a winner at random, use his own money to buy a pedal kit from a company called Aion FX, and then 'build it with my own shaky little fingers, and send it to the victim by US postal services.'\" The Register reports: The odd offer appeared in his weekly state-of-the-kernel post, which on Sunday US time informed the Linux world that release candidate (rc) seven for version 6.13 of the Linux kernel \"is slightly bigger than normal, but considering the timing, it's pretty much where I would have expected, and nothing really stands out.\" Torvalds therefore expects version 6.13 to debut next week, meaning it will arrive after his preferred seven release candidates and without delays caused by the usual holiday-period slowdown. Torvalds then added a postscript in which he revealed that he often uses the holiday season to build LEGO, which he frequently receives for Christmas and his late December birthday.\n \nHe kept up that tradition last year, but \"also ended up doing a number of guitar pedal kit builds\" which he described as \"LEGO for grown-ups with a soldering iron.\" [...] Torvalds doesn't play guitar, but did the builds \"because I enjoy the tinkering, and the guitar pedals actually do something and are the right kind of \"not very complex, but not some 5-minute 555 LED blinking thing.'\" He enjoyed the experience and wants to build more pedals, so has decided to give one away to a random kernel developer -- both as an act of generosity and to \"check to see if anybody actually ever reads these weekly rc announcements of mine.\" Torvalds rated his past pedal-building efforts a \"good success so far\" but warned entrants \"I'm a software person with a soldering iron.\"\n \n\"I will test the result to the best of my abilities, and the end result may actually work ... but you should set your expectations along the lines of \"quality kit built by a SW person who doesn't know one end of a guitar from the other.'\"","contentLength":2280,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Will Nvidia Spark a New Generation of Linux PCs?","url":"https://linux.slashdot.org/story/25/01/13/006249/will-nvidia-spark-a-new-generation-of-linux-pcs?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1736730420,"author":"EditorDavid","guid":262,"unread":true,"content":"\"I know, I know: 'Year of the Linux desktop ... yadda, yadda',\" writes Steven Vaughan-Nichols, a ZDNet senior contributing editor. \"You've heard it all before. But now there's a Linux-powered PC that many people will want...\" \n\nHe's talking about Nvidia's newly-announced Project Digits, describing it as \"a desktop with AI supercomputer power that runs DGX OS, a customized Ubuntu Linux 22.04 distro.\"\n\nPowered by MediaTek and Nvidia's Grace Blackwell Superchip, Project DIGITS is a $3,000 personal AI that combines Nvidia's Blackwell GPU with a 20-core Grace CPU built on the Arm architecture... At CES, Nvidia CEO Jensen Huang confirmed plans to make this technology available to everyone, not just AI developers. \"We're going to make this a mainstream product,\" Huang said. His statement suggests that Nvidia and MediaTek are positioning themselves to challenge established players — including Intel and AMD — in the desktop CPU market. This move to the desktop and perhaps even laptops has been coming for a while. As early as 2023, Nvidia was hinting that a consumer desktop chip would be in its future... [W]hy not use native Linux as the primary operating system on this new chip family? \n\nLinux, after all, already runs on the Grace Blackwell Superchip. Windows doesn't. It's that simple. Nowadays, Linux runs well with Nvidia chips. Recent benchmarks show that open-source Linux graphic drivers work with Nvidia GPUs as well as its proprietary drivers. Even Linus Torvalds thinks Nvidia has gotten its open-source and Linux act together. In August 2023, Torvalds said, \"Nvidia got much more involved in the kernel. Nvidia went from being on my list of companies who are not good to my list of companies who are doing really good work.\" Canonical, Ubuntu Linux's parent company, has long worked closely with Nvidia. Ubuntu already provides Blackwell drivers.\n \nThe article strays into speculation, when it adds \"maybe you wouldn't pay three grand for a Project DIGITS PC. But what about a $1,000 Blackwell PC from Acer, Asus, or Lenovo? All three of these companies are already selling MediaTek-powered Chromebooks....\" \n\n\"The first consumer products featuring this technology are expected to hit the market later this year. I'm looking forward to running Linux on it. Come on in! The operating system's fine.\"","contentLength":2323,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Steam On Linux Ends 2024 With Small Marketshare Boost, AMD Linux CPU Use Near 74%","url":"https://linux.slashdot.org/story/25/01/05/0251206/steam-on-linux-ends-2024-with-small-marketshare-boost-amd-linux-cpu-use-near-74?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1736094840,"author":"EditorDavid","guid":261,"unread":true,"content":"Phoronix reports on Valve's \"Steam Survey\" results for December 2024, saying the new numbers \"reflect a nice upward trend for the Linux gaming statistics and a high point in recent times.\"\n\n In November the Steam Survey reflected a 2.03% marketshare for Linux... Roughly inline with what we have been seeing for Linux right at around the 2% threshold. With the just-published December survey numbers, there is a 0.29% increase to 2.29%...! When looking at the Linux numbers, SteamOS Holo accounts for around 36% of all Linux gamers... SteamOS Holo being the operating system of the Steam Deck and beginning to appear on other devices as well... Driven in large part by the Steam Deck relying on a custom AMD SoC/APU and AMD being popular with Linux gamers/enthusiasts for their open-source driver support, AMD CPU use on Linux commands a 73.6% marketshare. \n\n In fact, December \"saw AMD reach another record-high share among participants of Valve's survey,\" according to TechSpot — \"up 3.02% last month, taking its total to 38.7% as Intel fell slightly to 63.4%...\"\nElsewhere, Windows 11 is now comfortably the most popular OS in the survey. It pulled ahead another 2% to an almost 55% share in December as Windows 10 dropped to 42.3%... However, it's a different story when looking at global users: Windows 10's share has increased two months in a row to 62.7% while Windows 11 has declined to 34.1%.\nRounding up the rest of the survey, 16GB of RAM remains the most popular amount of system RAM but it's lead is declining as second-place 32GB grows; a trend that is mirrored in the VRAM category... \n\nPhoronix adds that the Windows percent \"pulled back by 0.51% to 96.1% while Apple macOS also gained 0.22% going up to a 1.61% marketshare.\"","contentLength":1743,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Is 2025 the Year of the Linux Desktop?","url":"https://linux.slashdot.org/story/24/12/31/205245/is-2025-the-year-of-the-linux-desktop?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735676400,"author":"msmash","guid":260,"unread":true,"content":"The long-anticipated \"year of the Linux desktop\" could see renewed interest in 2025 as Microsoft's planned end of support for Windows 10 approaches, potentially driving users to explore alternatives. \n\nWith Windows 10 reaching end of support in October 2025, many users will face decisions about upgrading hardware for Windows 11 or considering different operating systems entirely. Linux distributions have evolved to offer increasingly polished desktop experiences, with improving hardware compatibility and familiar user interfaces. \n\n2024 saw Linux adoption grow thanks to the Steam Deck's success, reaching a 4.04% market share in December, up from 3.85% during the same time last year. More Linux laptops, improved gaming compatibility, and growing awareness of its benefits also contributed to its steady rise.","contentLength":817,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev"]}