{"id":"ETKeSdT1Jvn","title":"Podcasts","displayTitle":"Podcasts","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":50,"items":[{"title":"Rodney Holder - Christology and Science?","url":"https://www.youtube.com/watch?v=MGrYfxT9TVk","date":1739116816,"author":"Closer To Truth","guid":602,"unread":true,"content":"<article>Find us on Facebook for daily videos, updates, and more: https://shorturl.at/tak4l\n\nChristology is the theology of Jesus—the person, life, nature, essence and meaning of the Godhead Being who was incarnated in the human person Jesus. Some Christian theologians claim that aspects of Christology can articulate with fundamental understandings of science. Most scientists would be baffled by the claim.\n\nMake a tax-deductible donation of any amount to help Closer To Truth continue exploring the world's deepest questions: https://shorturl.at/OnyRq\n\nThe Revd Dr. Rodney Holder was Course Director of the Faraday Institute from its inception in 2006 until 2013, and remains a Bye Fellow of St. Edmund’s College and a Faraday Associate.\n\nWear your support for the show with a Closer To Truth merch purchase: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1152,"flags":null,"enclosureUrl":"https://www.youtube.com/v/MGrYfxT9TVk?version=3","enclosureMime":"","commentsUrl":null},{"title":"Alan Love - Philosophy of Reductionism & Emergence","url":"https://www.youtube.com/watch?v=FLlFxTU_vfY","date":1739116816,"author":"Closer To Truth","guid":603,"unread":true,"content":"<article>Make a tax-deductible donation of any amount to help support Closer To Truth continue making content like this: https://shorturl.at/OnyRq\n\nCan biology be explained entirely in terms of chemistry and then physics? If so, that’s “reductionism.” Or are there “emergent” properties at higher levels of the hierarchy of life that cannot be explained by properties at lower or more basic levels?\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nAlan C. Love, Ph.D., is a professor in the College of Liberal Arts at the University of Minnesota. He also serves as director of the Minnesota Center for Philosophy of Science.\n\nShop Closer To Truth merchandise for unique items like notebooks, mugs, and sweatshirts: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1123,"flags":null,"enclosureUrl":"https://www.youtube.com/v/FLlFxTU_vfY?version=3","enclosureMime":"","commentsUrl":null},{"title":"JRE Fight Companion - February 8, 2025","url":"https://www.youtube.com/watch?v=IGL1vitx_rM","date":1739087156,"author":"PowerfulJRE","guid":618,"unread":true,"content":"<article>Joe is joined by Matt Serra, Brendan Schaub &amp; Bryan Callen to watch the fights on February 8, 2025.</article>","contentLength":99,"flags":null,"enclosureUrl":"https://www.youtube.com/v/IGL1vitx_rM?version=3","enclosureMime":"","commentsUrl":null},{"title":"The state of homelab tech (2025) (Friends)","url":"https://changelog.com/friends/79","date":1738969200,"author":"","guid":157,"unread":true,"content":"<p>Techno Tim joins Adam to catch up on the state of Homelab for 2025, the state of AI at home and on-prem (AI Homelab) and where that’s heading, building a creator PC, choosing the parts for your build, GPU availability, Windows being user hostile, and why Tim is happy to be using Windows, Mac AND Linux.</p><p><a href=\"https://changelog.com/++\" rel=\"payment\">Changelog++</a> members save 8 minutes on this episode because they made the ads disappear. Join today!</p><ul><li><a href=\"https://retool.com/changelog\">Retool</a> – <strong>The low-code platform for developers to build internal tools</strong> — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at <a href=\"https://retool.com/changelog\">retool.com/changelog</a></li><li><a href=\"https://temporal.io\">Temporal</a> – Build invincible applications. Manage failures, network outages, flaky endpoints, long-running processes and more, ensuring your workflows never fail. Register for <a href=\"https://replay.temporal.io\">Replay in London, March 3-5</a> to break free from the status quo.\n</li><li><a href=\"https://joindeleteme.com\">DeleteMe</a> – Text  to 64000 to join DeleteMe. They make it quick, easy, and safe to remove your personal data online.\n</li><li><a href=\"https://fly.io/\">Fly.io</a> – <strong>The home of Changelog.com</strong> — Deploy your apps close to your users — global Anycast load-balancing, zero-configuration private networking, hardware isolation, and instant WireGuard VPN connections. Push-button deployments that scale to thousands of instances. <a href=\"https://fly.io/speedrun/\">Check out the speedrun</a> to get started in minutes.\n</li></ul>","contentLength":1428,"flags":null,"enclosureUrl":"https://op3.dev/e/https://cdn.changelog.com/uploads/friends/79/changelog--friends-79.mp3","enclosureMime":"","commentsUrl":null},{"title":"David Hunt - Big Questions in Free Will","url":"https://www.youtube.com/watch?v=d-GhJlwgD3w","date":1738958422,"author":"Closer To Truth","guid":601,"unread":true,"content":"<article>Follow us on X for daily articles, updates, and more: https://x.com/CloserToTruth\n\nFree will seems obvious, simple, common; but it’s subtle, profound, maddening. Free will probes the deep nature of human existence. But big questions have big problems. How to make progress? Can bringing together scientists, philosophers and theologians help? That’s what the ‘Big Questions in Free Will’ project is doing.\n\nMake a tax-deductible donation of any amount to help support Closer To Truth continue making content like this: https://shorturl.at/OnyRq\n\nDavid Hunt was a Professor and Department Chair of the Department of Philosophy at Whittier College in Whittier, CA. He earned a BA from Pomona College and a PhD from Vanderbilt University. His academic interests included Ancient and Early Medieval Philosophy (especially Plato, Plotinus, and Augustine), Metaphysics, Action Theory, and the Philosophy of Religion.\n\nShop Closer To Truth merchandise in our Bonfire storefront to support the show: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1344,"flags":null,"enclosureUrl":"https://www.youtube.com/v/d-GhJlwgD3w?version=3","enclosureMime":"","commentsUrl":null},{"title":"Lawrence Krauss - Are there Extra Dimensions?","url":"https://www.youtube.com/watch?v=HEJhpTRzNgQ","date":1738944030,"author":"Closer To Truth","guid":600,"unread":true,"content":"<article>Shop Closer To Truth merch like apparel, home goods, and more to show your support of the show: https://bit.ly/3P2ogje\n\nExtra dimensions—beyond length, width, height—seem like the stuff of science fiction. What would extra dimensions be like? Is time the fourth dimension? Does string theory require ten or eleven dimensions? Could deep reality be so strange? And, anyway, why would we care?\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nLawrence Maxwell Krauss is a Canadian-American theoretical physicist and cosmologist who taught at Arizona State University, Yale University, and Case Western Reserve University. He founded ASU's Origins Project in 2008 to investigate fundamental questions about the universe and served as the project's director.\n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1296,"flags":null,"enclosureUrl":"https://www.youtube.com/v/HEJhpTRzNgQ?version=3","enclosureMime":"","commentsUrl":null},{"title":"Robustness, Detectability, and Data Privacy in AI // Vinu Sankar Sadasivan // #289","url":"https://podcasters.spotify.com/pod/show/mlops/episodes/Robustness--Detectability--and-Data-Privacy-in-AI--Vinu-Sankar-Sadasivan--289-e2ui4si","date":1738939463,"author":"Demetrios","guid":329,"unread":true,"content":"<p><a href=\"https://www.linkedin.com/in/vinusankars/\" target=\"_blank\" rel=\"noopener noreferer\"></a>is a CS PhD ... Currently, I am working as a full-time&nbsp;<a href=\"https://deepmind.google/\" target=\"_blank\" rel=\"noopener noreferer\"></a>&nbsp;on jailbreaking multimodal AI models.\n\nRobustness, Detectability, and Data Privacy in AI // MLOps Podcast #289 with Vinu Sankar Sadasivan, Student Researcher at Google DeepMind.\n\n// Abstract\nRecent rapid advancements in Artificial Intelligence (AI) have made it widely applicable across various domains, from autonomous systems to multimodal content generation. However, these models remain susceptible to significant security and safety vulnerabilities. Such weaknesses can enable attackers to jailbreak systems, allowing them to perform harmful tasks or leak sensitive information. As AI becomes increasingly integrated into critical applications like autonomous robotics and healthcare, the importance of ensuring AI safety is growing. Understanding the vulnerabilities in today’s AI systems is crucial to addressing these concerns.\n\n// Bio\nVinu Sankar Sadasivan is a final-year Computer Science PhD candidate at The University of Maryland, College Park, advised by Prof. Soheil Feizi. His research focuses on Security and Privacy in AI, with a particular emphasis on AI robustness, detectability, and user privacy. Currently, Vinu is a full-time Student Researcher at Google DeepMind, working on jailbreaking multimodal AI models. Previously, Vinu was a Research Scientist intern at Meta FAIR in Paris, where he worked on AI watermarking.\n\nVinu is a recipient of the 2023 Kulkarni Fellowship and has earned several distinctions, including the prestigious Director’s Silver Medal. He completed a Bachelor’s degree in Computer Science &amp; Engineering at IIT Gandhinagar in 2020. Prior to their PhD, Vinu gained research experience as a Junior Research Fellow in the Data Science Lab at IIT Gandhinagar and through internships at Caltech, Microsoft Research India, and IISc.\n\n// MLOps Swag/Merch\nhttps://shop.mlops.community/\n\n// Related Links\nWebsite: https://vinusankars.github.io/\n \n--------------- ✌️Connect With Us ✌️ -------------\nJoin our slack community: https://go.mlops.community/slack\nFollow us on Twitter: @mlopscommunity\nSign up for the next meetup: https://go.mlops.community/register\nCatch all episodes, blogs, newsletters, and more: https://mlops.community/\n\nConnect with Demetrios on LinkedIn: https://www.linkedin.com/in/dpbrinkm/\nConnect with Richard on LinkedIn: https://www.linkedin.com/in/vinusankars/\n\n</p>","contentLength":2396,"flags":null,"enclosureUrl":"https://anchor.fm/s/174cb1b8/podcast/play/98160978/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2025-1-7%2F394458992-44100-2-ab419176af6b.mp3","enclosureMime":"","commentsUrl":null},{"title":"Nostradamus","url":"https://shows.acast.com/dansnowshistoryhit/episodes/nostradamus","date":1738888200,"author":"","guid":644,"unread":true,"content":"<p>For centuries, Nostradamus has been hailed as the man who saw the future—his cryptic quatrains allegedly foretelling everything from the French Revolution and the rise of Hitler to the 9/11 attacks and the Covid-19 pandemic. But how much is true, and how much is myth?</p><p>Joining Dan in this episode to unravel the true history of the French soothsayer is John Hogue, a renowned Nostradamus scholar. Together they explore Nostradamus' life as a plague doctor, the occult during the Renaissance, his most famous predictions and why they still captivate us today.</p><p>With special thanks to listener Tamarah Palmer.</p><p>Produced by Mariana Des Forges and edited by Dougal Patmore.</p>","contentLength":666,"flags":null,"enclosureUrl":"https://sphinx.acast.com/p/acast/s/dansnowshistoryhit/e/679cc24fc4b7d8845b36df9e/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=tJID3CacAlgwHCr-e1tu9CX9tQRepvmUuo5lvYGT7OQ","enclosureMime":"","commentsUrl":null},{"title":"Matthews Grant - What is Predestination?","url":"https://www.youtube.com/watch?v=vG-dDjVooCE","date":1738872027,"author":"Closer To Truth","guid":599,"unread":true,"content":"<article>Subscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you get your podcasts. Listen today: https://shorturl.at/mtJP4\n\nPredestination is ultimate destiny, fate. It is the claim by some religions that a Supreme Being, whether a personal God or a cosmic force, has determined for individual lives their ultimate course. When God foreordains, whether for salvation or for damnation, nothing can resist. Is this fair? Does this make sense? Would you like such a God?\n\nMake a tax-deductible donation to Closer To Truth to help us continue exploring the world's deepest questions without paywalls: https://shorturl.at/OnyRq\n\nMatthews Grant is an Associate Professor in the Department of Philosophy at the University of St. Thomas in St. Paul, Minnesota.\n\nBrowse the Closer To Truth merch store to purchase unique items like T-shirts, hoodies, mugs, and more: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1214,"flags":null,"enclosureUrl":"https://www.youtube.com/v/vG-dDjVooCE?version=3","enclosureMime":"","commentsUrl":null},{"title":"Joe Rogan Experience #2269 - Bret Weinstein","url":"https://www.youtube.com/watch?v=7ted-qUqqU4","date":1738864805,"author":"PowerfulJRE","guid":617,"unread":true,"content":"<article>Dr. Bret Weinstein is an evolutionary biologist, podcaster, and author. He co-wrote \"A Hunter-Gatherer's Guide to the 21st Century: Evolution and the Challenges of Modern Life\" with his wife, Dr. Heather Heying, who is also a biologist. They both host the podcast \"The DarkHorse Podcast.\"\n\nhttp://www.bretweinstein.net\n\nGo to https://www.expressvpn.com/ROGANYT and find out how you can get 4 months of ExpressVPN free!\n\nDon’t miss out on all the action this week at DraftKings! Download the DraftKings app today! Sign-up using http://dkng.co/rogan or through my promo code ROGAN.\n\nGAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit http://gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit http://ccpg.org (CT) or visit http://www.mdgamblinghelp.org (MD).21+ and present in most states. (18+ DC/KY/NH/WY). Void in ONT/OR/NH. Eligibility restrictions apply. On behalf of Boot Hill Casino &amp; Resort (KS). 1 per new customer. Min. $5 deposit. Min. $5 bet. Max. $200 issued as non-withdrawable Bonus Bets that expire in 7 days (168 hours). Stake removed from payout. Terms: http://dkng.co/dk-offer-terms. Ends 2/9/25 at 11:59 PM ET. Sponsored by DK.</article>","contentLength":1226,"flags":null,"enclosureUrl":"https://www.youtube.com/v/7ted-qUqqU4?version=3","enclosureMime":"","commentsUrl":null},{"title":"Robert John Russell - Does God Intervene in Human Affairs?","url":"https://www.youtube.com/watch?v=3OsvkkQ-omM","date":1738857604,"author":"Closer To Truth","guid":598,"unread":true,"content":"<article>Follow us on Instagram for daily news, announcements, and exciting updates: https://shorturl.at/p2IhM\n\nIs God, if there is a God, the ‘God of History’? Does God make specific interventions in the course of human events to ensure that God’s purpose be fulfilled, for nations as well as for individuals? Or did God so set the laws of nature before the foundation of the world such that God’s goals would be achieved without God’s special, active interventions?\n\nMake a tax-deductible donation of any amount to help us continue exploring the world's deepest questions: https://closertotruth.com/donate/\n\nRobert John Russell is founder and Director of the Center for Theology and the Natural Sciences. He is also the Ian G. Barbour Professor of Theology and Science in Residence at the Graduate Theological Union. He has written and edited extensively on possible scientific mechanisms of Christian belief.\n\nGet member exclusives like early access to new content with a free Closer To Truth account: https://closertotruth.com/\n\nCloser To Truth, hosted by Robert Lawrence Kuhn, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1324,"flags":null,"enclosureUrl":"https://www.youtube.com/v/3OsvkkQ-omM?version=3","enclosureMime":"","commentsUrl":null},{"title":"Secure Communications in Embedded Systems with Ismael Valenzuela and John Wall","url":"https://softwareengineeringdaily.com/2025/02/06/secure-communications-in-embedded-systems-with-ismael-valenzuela-and-john-wall/?utm_source=rss&utm_medium=rss&utm_campaign=secure-communications-in-embedded-systems-with-ismael-valenzuela-and-john-wall","date":1738836047,"author":"SEDaily","guid":720,"unread":true,"content":"<div><p><a href=\"https://www.blackberry.com/\">BlackBerry</a> is a Canadian company known for its pivotal role in the smartphone market during the 2000s. Today, BlackBerry has adopted a major focus on cybersecurity.</p></div><div><p><a href=\"https://www.linkedin.com/in/john-wall-07b8604/\">John Wall</a> is the Chief Operating Officer and Head of Products, Engineering and Services at QNX, which is a division of BlackBerry. <a href=\"https://x.com/aboutsecurity\">Ismael Valenzuela</a> is the former Vice President of Threat Research and Intelligence at BlackBerry, where he led threat research, intelligence, and defensive innovation. John and Ismael join the podcast to talk about cybersecurity at Blackberry, including secure communications in embedded systems.</p></div>","contentLength":591,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED6211023223.mp3","enclosureMime":"","commentsUrl":null},{"title":"Build software that lasts! (Interview)","url":"https://changelog.com/podcast/627","date":1738786500,"author":"","guid":156,"unread":true,"content":"<p>After 30+ years in the software industry, Bert Hubert has experienced a lot. He founded PowerDNS, published articles for places like IETF / IEEE, and built his own parliament monitoring system. That just scratches the surface.</p><p>Recently, Bert wrote about what it takes to build software for the long term. Let’s dig in.</p><p><a href=\"https://changelog.com/++\" rel=\"payment\">Changelog++</a> members get a bonus 10 minutes at the end of this episode and zero ads. Join today!</p><ul><li><a href=\"https://retool.com/changelog\">Retool</a> – <strong>The low-code platform for developers to build internal tools</strong> — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at <a href=\"https://retool.com/changelog\">retool.com/changelog</a></li><li><a href=\"https://temporal.io\">Temporal</a> – Build invincible applications. Manage failures, network outages, flaky endpoints, long-running processes and more, ensuring your workflows never fail. Register for <a href=\"https://replay.temporal.io\">Replay in London, March 3-5</a> to break free from the status quo.\n</li><li><a href=\"https://joindeleteme.com\">DeleteMe</a> – Text  to 64000 to join DeleteMe. They make it quick, easy, and safe to remove your personal data online.\n</li></ul>","contentLength":1115,"flags":null,"enclosureUrl":"https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/627/the-changelog-627.mp3","enclosureMime":"","commentsUrl":null},{"title":"Joe Rogan Experience #2268 - Rick Caruso","url":"https://www.youtube.com/watch?v=-44tAVI7OEg","date":1738778400,"author":"PowerfulJRE","guid":616,"unread":true,"content":"<article>Rick Caruso is a businessman, civic leader, and philanthropist. He is the owner and executive chairman of Caruso, one of the largest privately held real estate companies in the world, and founder of Steadfast LA: a nonprofit focused on private-sector involvement in rebuilding wildfire-affected communities.\nhttp://www.steadfastla.com\n\nThis episode is brought to you by AG1.\nTake ownership of your health with AG1 and get a FREE bottle of Vitamin D3+K2 AND 5 free Travel Packs with your first subscription. \n\nGo to http://drinkag1.com/joerogan\n\nDon’t miss out on all the action this week at DraftKings! Download the DraftKings app today! Sign-up using http://dkng.co/rogan or through my promo code ROGAN. \n\nGAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit http://gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit http://ccpg.org (CT) or visit http://www.mdgamblinghelp.org (MD).21+ and present in most states. (18+ DC/KY/NH/WY). Void in ONT/OR/NH. Eligibility restrictions apply. On behalf of Boot Hill Casino &amp; Resort (KS). 1 per new customer. Min. $5 deposit. Min. $5 bet. Max. $200 issued as non-withdrawable Bonus Bets that expire in 7 days (168 hours). Stake removed from payout. Terms: http://dkng.co/dk-offer-terms. Ends 2/9/25 at 11:59 PM ET. Sponsored by DK.</article>","contentLength":1352,"flags":null,"enclosureUrl":"https://www.youtube.com/v/-44tAVI7OEg?version=3","enclosureMime":"","commentsUrl":null},{"title":"Nathan Lents on Sex, Gender, and Mating | Closer To Truth Chats","url":"https://www.youtube.com/watch?v=tolSDNRwyR0","date":1738771206,"author":"Closer To Truth","guid":597,"unread":true,"content":"<article>Make a tax-deductible donation of any amount to help us continue exploring the world's deepest questions: https://closertotruth.com/donate/\n\nEvolutionary biologist Nathan Lents argues that many of our supposedly modern ideas about gender and human sexuality are, in fact, deeply rooted in our animal ancestors. In this Chat, Lents discusses his new book, \"The Sexual Evolution: How 500 Million Years of Sex, Gender, and Mating Shape Modern Relationships\", a fascinating exploration of sexual behavior throughout the animal kingdom.\n\nLents' book, The Sexual Evolution, is available for purchase now: https://amzn.to/4jNV5iC\n\nWatch more CTT Chats here: https://t.ly/jJI7e\n\nNathan H. Lents is an American scientist, author, and university professor. He has been on the faculty of John Jay College since 2006 and is currently the director of the Cell and Molecular Biology program and the former head of the honors program and the campus Macaulay Honors College program.</article>","contentLength":966,"flags":null,"enclosureUrl":"https://www.youtube.com/v/tolSDNRwyR0?version=3","enclosureMime":"","commentsUrl":null},{"title":"Caves of Qud with Brian Bucklew","url":"https://softwareengineeringdaily.com/2025/02/05/caves-of-qud-with-brian-bucklew/?utm_source=rss&utm_medium=rss&utm_campaign=caves-of-qud-with-brian-bucklew","date":1738749653,"author":"SEDaily","guid":719,"unread":true,"content":"<div><p>Caves of Qud is a roguelike game set in a richly detailed, post-apocalyptic world blending science fiction and fantasy. The game is known for its deep lore, emergent gameplay, and wildly creative character customization. It is a massive indie success, and recently hit a major milestone with the release of version 1.0 after 15 years of development.</p></div><div><p><a href=\"https://x.com/unormal\">Brian Bucklew</a> is the cofounder of <a href=\"https://www.freeholdgames.com/\">Freehold games</a> which develops Caves of Qud. Brian joins the show to talk about his engineering background and the development of his game.</p></div><p>Joe Nash is a developer, educator, and award-winning community builder, who has worked at companies including GitHub, Twilio, Unity, and PayPal. Joe got his start in software development by creating mods and running servers for Garry’s Mod, and game development remains his favorite way to experience and explore new technologies and concepts.</p>","contentLength":866,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED9626101996.mp3","enclosureMime":"","commentsUrl":null},{"title":"2. The English Civil War: Roundheads vs Cavaliers","url":"https://shows.acast.com/dansnowshistoryhit/episodes/the-english-civil-war-roundheads-vs-cavaliers","date":1738715400,"author":"","guid":643,"unread":true,"content":"<p>Episode 2/2. This week, we have a two-part series on the catastrophic English Civil War in the 17th century. We trace the twists and turns of this tumultuous period from the perspective of Bulstrode Whitelocke and Edward Hyde, two close friends who reluctantly found themselves on opposing sides of the conflict that split England in two.</p><p>For this, Dan is joined by Minoo Dinshaw, author of 'Friends in Youth: Choosing Sides in the English Civil War'. In this second episode, we hear about some of the bloodiest battles between Roundheads and Cavaliers, the leaders who came to the fore during these trying years and how the two sides eventually arrived at a shaky truce.</p><p>Produced by James Hickmann and edited by Max Carrey.</p>","contentLength":722,"flags":null,"enclosureUrl":"https://sphinx.acast.com/p/acast/s/dansnowshistoryhit/e/679cc11d2a5cfef56231a2d5/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=V1L4cEQrcEb8e7NDrKGupBXQ9sApROngh652x1OG2IA","enclosureMime":"","commentsUrl":null},{"title":"Joe Rogan Experience #2267 - Dan Richards","url":"https://www.youtube.com/watch?v=Ol7PofIyZPI","date":1738692016,"author":"PowerfulJRE","guid":615,"unread":true,"content":"<article>Dan Richards is an independent researcher whose YouTube channel, \"DeDunking the Past,\" examines lost civilizations and alternative history.\n\nhttp://www.youtube.com/@DeDunking\n\nThis episode is brought to you by BetterHelp. \nGet working on a better you with therapy.\nVisit http://BetterHelp.com/JRE today to get 10% off your first month.\n\nDon’t miss out on all the action this week at DraftKings! Download the DraftKings app today! Sign-up using http://dkng.co/rogan or through my promo code ROGAN. \n\nGAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit http://gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit http://ccpg.org (CT) or visit http://www.mdgamblinghelp.org (MD).21+ and present in most states. (18+ DC/KY/NH/WY). Void in ONT/OR/NH. Eligibility restrictions apply. On behalf of Boot Hill Casino &amp; Resort (KS). 1 per new customer. Min. $5 deposit. Min. $5 bet. Max. $200 issued as non-withdrawable Bonus Bets that expire in 7 days (168 hours). Stake removed from payout. Terms: http://dkng.co/dk-offer-terms. Ends 2/9/25 at 11:59 PM ET. Sponsored by DK.</article>","contentLength":1144,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Ol7PofIyZPI?version=3","enclosureMime":"","commentsUrl":null},{"title":"AI & Aliens: New Eyes on Ancient Questions // Richard Cloete // #288","url":"https://podcasters.spotify.com/pod/show/mlops/episodes/AI--Aliens-New-Eyes-on-Ancient-Questions--Richard-Cloete--288-e2udn14","date":1738690292,"author":"Demetrios","guid":328,"unread":true,"content":"<p><a href=\"https://www.linkedin.com/in/richard-cloete/\" target=\"_blank\" rel=\"noopener noreferer\"></a> is a computer scientist and a Laukien-Oumuamua Postdoctoral Research Fellow at the Center for Astrophysics, Harvard University. He is a member of the Galileo Project working under the supervision of Professor Avi, having recently held a postdoctoral position at the University of Cambridge, UK.\n\nAI &amp; Aliens: New Eyes on Ancient Questions // MLOps Podcast #288 with Richard Cloete, \nLaukien-Oumuamua Postdoctoral Research Fellow at Harvard University.\n\n// Abstract\nDemetrios speaks with Dr. Richard Cloete, a Harvard computer scientist and founder of SEAQR Robotics, about his AI-driven work in tracking Unidentified Aerial Phenomena (UAPs) through the Galileo Project. Dr. Cloete explains their advanced sensor setup and the challenges of training AI in this niche field, leading to the creation of AeroSynth, a synthetic data tool.\n\nHe also discusses his collaboration with the Minor Planet Center on using AI to classify interstellar objects and upcoming telescope data. Additionally, he introduces Seeker Robotics, applying similar AI techniques to oceanic research with unmanned vehicles for marine monitoring. The conversation explores AI’s role in advancing our understanding of space and the ocean.\n\n// Bio\nRichard is a computer scientist and Laukien-Oumuamua Postdoctoral Research Fellow at the Center for Astrophysics, Harvard University. As a member of the Galileo Project under Professor Avi Loeb's supervision, he develops AI models for detecting and tracking aerial objects, specializing in Unidentified Anomalous Phenomena (UAP). \n\nBeyond UAP research, he collaborates with astronomers at the Minor Planet Center to create AI models for identifying potential interstellar objects using the upcoming Vera C. Rubin Observatory. \n\nRichard is also the CEO and co-founder of SEAQR Robotics, a startup developing advanced unmanned surface vehicles to accelerate the discovery of novel life and phenomena in Earth's oceans and atmosphere. \n\nBefore joining Harvard, he completed a postdoctoral fellowship at the University of Cambridge, UK, where his research explored the intersection of emerging technologies and law.Grew up in Cape Town, South Africa, where I used to build Tesla Coils, plasma globes, radio stethoscopes, microwave guns, AM radios, and bombs...\n\n// MLOps Swag/Merch\nhttps://shop.mlops.community/\n\n// Related Links\nWebsite: www.seaqr.net\nhttps://itc.cfa.harvard.edu/people/richard-cloete\n \n--------------- ✌️Connect With Us ✌️ -------------\nJoin our slack community: https://go.mlops.community/slack\nFollow us on Twitter: @mlopscommunity\nSign up for the next meetup: https://go.mlops.community/register\nCatch all episodes, blogs, newsletters, and more: https://mlops.community/\n\nConnect with Demetrios on LinkedIn: https://www.linkedin.com/in/dpbrinkm/\nConnect with Richard on LinkedIn: https://www.linkedin.com/in/richard-cloete/\n\n</p>","contentLength":2869,"flags":null,"enclosureUrl":"https://anchor.fm/s/174cb1b8/podcast/play/98015716/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2025-1-4%2F394277793-44100-2-45d73bbd25586.mp3","enclosureMime":"","commentsUrl":null},{"title":"Chris Evans - Neuroscience and Philosophy","url":"https://www.youtube.com/watch?v=eOqOj9qDcwI","date":1738684840,"author":"Closer To Truth","guid":596,"unread":true,"content":"<article>Register for a Closer To Truth membership to receive special exclusives like early access to new episodes and more: https://closertotruth.com/.\n\n‘Neurophilosophy’ is the view that all that is mental or mind or consciousness can be solved ultimately by neuroscience. ‘Neuromania’ is the view that trying to explain consciousness by physical processes alone is impossible (if not ridiculous). The two views are diametrically opposed. Appreciate the arguments of each. Then decide, which is correct?\n\nSupport the show with a donation of any amount to help Closer To Truth continue exploring life's deepest questions: shorturl.at/OnyRq\n\nChristopher Evans is the former Director of the UCLA Brain Research Institute and the Stefan Hatos Professor directing the Shirley and Stefan Hatos Center for Neurophamacology in the UCLA Semel Institute.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1167,"flags":null,"enclosureUrl":"https://www.youtube.com/v/eOqOj9qDcwI?version=3","enclosureMime":"","commentsUrl":null},{"title":"New interview with Nathan Lents: Coming February 5","url":"https://www.youtube.com/watch?v=c5NWezORyEQ","date":1738677642,"author":"Closer To Truth","guid":595,"unread":true,"content":"<article>Evolutionary biologist Nathan Lents compares sexual behavior in the animal kingdom with that of humankind #shorts</article>","contentLength":113,"flags":null,"enclosureUrl":"https://www.youtube.com/v/c5NWezORyEQ?version=3","enclosureMime":"","commentsUrl":null},{"title":"Maximizing Cloud Efficiency with Jerzy Grzywinski and Brent Segner","url":"https://softwareengineeringdaily.com/2025/02/04/maximizing-cloud-efficiency-with-jerzy-grzywinski-and-brent-segner/?utm_source=rss&utm_medium=rss&utm_campaign=maximizing-cloud-efficiency-with-jerzy-grzywinski-and-brent-segner","date":1738663208,"author":"SEDaily","guid":718,"unread":true,"content":"<p>Compute optimization in a cloud environment is a common challenge because of the need to balance performance, cost, and resource availability. The growing use of GPUs for workloads, including AI, is also increasing the complexity and importance of optimization given the relatively high cost of GPU cloud computation.</p><p><a href=\"https://www.linkedin.com/in/jerzy-grzywinski/\">Jerzy Grzywinski</a> is a Senior Director of Software Engineering and leads FinOps at <a href=\"https://www.capitalone.com/\">Capital One</a>. <a href=\"https://www.linkedin.com/in/brent-segner/\">Brent Segner</a> is a distinguished engineer at Capital One and is focused on performance engineering and cloud cost optimization. Jerzy and Brent joined the show with Sean Falconer to talk about methods to measure compute efficiency, horizontal versus vertical scaling, how to think about adopting new instance types, the effect of different languages on compute efficiency, and much more.</p><p><em>Full Disclosure: This episode is sponsored by .</em></p>","contentLength":845,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED1045788818.mp3","enclosureMime":"","commentsUrl":null},{"title":"Everyone knows your location (News)","url":"https://changelog.com/news/130","date":1738614600,"author":"","guid":155,"unread":true,"content":"<p>Tim Sh tracked himself down through in-app ads, Sniffnet comfortably monitors your Internet traffic, Cate Huston opines on what makes a good team, Victor Shepelev draws on 25 years of coding to share seven things he now knows &amp; Grant Slatton tells you how to write a good design document.</p><p><a href=\"https://changelog.com/++\" rel=\"payment\">Changelog++</a> members support our work, get closer to the metal, and make the ads disappear. Join today!</p><ul><li><a href=\"https://www.augmentcode.com\">Augment Code</a> – Developer AI that uses deep understanding of your large codebase and how you build software to deliver personalized code suggestions and insights. Augment provides relevant, contextualized code right in your IDE or Slack. It transforms scattered knowledge into code or answers, eliminating time spent searching docs or interrupting teammates.\n</li></ul>","contentLength":750,"flags":null,"enclosureUrl":"https://op3.dev/e/https://cdn.changelog.com/uploads/news/130/changelog-news-130.mp3","enclosureMime":"","commentsUrl":null},{"title":"Ian McFarland - Cosmology and Creation","url":"https://www.youtube.com/watch?v=5KadleXsiSQ","date":1738598404,"author":"Closer To Truth","guid":594,"unread":true,"content":"<article>Are you a Closer To Truth member? Sign up for free to receive exclusive benefits like early access to episodes, event discounts, and more at https://closertotruth.com/.\n\nHow do physicists and philosophers who believe in God harmonize the discoveries of cosmology with the doctrine of creation? How does cosmology enhance or erode their belief in God? If God exists, must the universe have had a beginning? Conversely, if the universe had a beginning, must God exist?\n\nSupport the show with a donation of any amount to help Closer To Truth continue exploring life's deepest questions: shorturl.at/OnyRq\n\nIan Alexander McFarland is a Lutheran theologian and Robert W. Woodruff Professor of Theology at Emory University's Candler School of Theology. Previously, he was the Regius Professor of Divinity at the University of Cambridge. He holds degrees from Trinity College, Union Theological Seminary, the Lutheran School of Theology at Chicago, the University of Cambridge, and Yale University.\n\nLike us on Facebook for daily videos, updates, and more: https://shorturl.at/tak4l\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1397,"flags":null,"enclosureUrl":"https://www.youtube.com/v/5KadleXsiSQ?version=3","enclosureMime":"","commentsUrl":null},{"title":"Story: One Million Checkboxes - The Viral Game That Defied Convention","url":"https://corecursive.com/one-million-checkboxes-with-nolen-royalty/","date":1738580400,"author":"Adam@corecursive.com (Adam@corecursive.com)","guid":290,"unread":true,"content":"<p>What if internet trolls could become your greatest collaborators? Nolen Royalty discovered this unexpected truth when his simple checkbox game went viral.</p><p>It began with a school email prank that crashed servers but sparked a philosophy: creative constraints breed innovation. From \"Flappy Dird\" to \"One Million Checkboxes,\" Nolen built games that turned limitations into playgrounds.</p><p>But when his checkbox project became a battleground of organized chaos, Nolen faced a choice: suppress the chaos or lean into it.</p><p>Discover how systematic constraints can channel creative anarchy - and why one developer now believes the best user experiences emerge when you code for controlled chaos of strangers meeting on the internet.</p>","contentLength":718,"flags":null,"enclosureUrl":"https://traffic.libsyn.com/secure/corecursive/omcb.mp3?dest-id=628353","enclosureMime":"","commentsUrl":null},{"title":"1. The English Civil War: Rising Tensions","url":"https://shows.acast.com/dansnowshistoryhit/episodes/the-english-civil-war-rising-tensions","date":1738542600,"author":"","guid":642,"unread":true,"content":"<p>Episode 1/2. This week, we have a two-part series on the catastrophic English Civil War in the 17th century. We trace the twists and turns of this tumultuous period from the perspective of Bulstrode Whitelocke and Edward Hyde, two close friends who reluctantly found themselves on opposing sides of the conflict that split England in two.</p><p>For this, Dan is joined by Minoo Dinshaw, author of 'Friends in Youth: Choosing Sides in the English Civil War'. In this first episode, we learn how subtle religious and political differences upset the balance of power in England, and plunged the kingdom into chaos.</p><p>Produced by James Hickmann and edited by Max Carrey.</p>","contentLength":656,"flags":null,"enclosureUrl":"https://sphinx.acast.com/p/acast/s/dansnowshistoryhit/e/679cb3ac9bbbbb6213943e5d/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=w0TZHctIzk6d5Q2HDkNBYuQRsuCSJN9LsuEBugPIBS0","enclosureMime":"","commentsUrl":null},{"title":"DeepSeek, China, OpenAI, NVIDIA, xAI, TSMC, Stargate, and AI Megaclusters | Lex Fridman Podcast #459","url":"https://www.youtube.com/watch?v=_1f-o0nqpEI","date":1738541533,"author":"Lex Fridman","guid":621,"unread":true,"content":"<article>Dylan Patel is the founder of SemiAnalysis, a research &amp; analysis company specializing in semiconductors, GPUs, CPUs, and AI hardware. Nathan Lambert is a research scientist at the Allen Institute for AI (Ai2) and the author of a blog on AI called Interconnects.\nThank you for listening ❤ Check out our sponsors: https://lexfridman.com/sponsors/ep459-sb\nSee below for timestamps, transcript, and to give feedback, submit questions, contact Lex, etc.\n\n*Transcript:*\nhttps://lexfridman.com/deepseek-dylan-patel-nathan-lambert-transcript\n\n*CONTACT LEX:*\n*Feedback* - give feedback to Lex: https://lexfridman.com/survey\n*AMA* - submit questions, videos or call-in: https://lexfridman.com/ama\n*Hiring* - join our team: https://lexfridman.com/hiring\n*Other* - other ways to get in touch: https://lexfridman.com/contact\n\n*EPISODE LINKS:*\nDylan's X: https://x.com/dylan522p\nSemiAnalysis: https://semianalysis.com/\nNathan's X: https://x.com/natolambert\nNathan's Blog: https://www.interconnects.ai/\nNathan's Podcast: https://www.interconnects.ai/podcast\nNathan's Website: https://www.natolambert.com/\nNathan's YouTube: https://youtube.com/@natolambert\nNathan's Book: https://rlhfbook.com/\n\n*SPONSORS:*\nTo support this podcast, check out our sponsors &amp; get discounts:\n*Invideo AI:* AI video generator.\nGo to https://lexfridman.com/s/invideoai-ep459-sb\n*GitHub:* Developer platform and AI code editor.\nGo to https://lexfridman.com/s/github-ep459-sb\n*Shopify:* Sell stuff online.\nGo to https://lexfridman.com/s/shopify-ep459-sb\n*NetSuite:* Business management software.\nGo to https://lexfridman.com/s/netsuite-ep459-sb\n*AG1:* All-in-one daily nutrition drinks.\nGo to https://lexfridman.com/s/ag1-ep459-sb\n\n*OUTLINE:*\n0:00 - Introduction\n3:33 - DeepSeek-R1 and DeepSeek-V3\n25:07 - Low cost of training\n51:25 - DeepSeek compute cluster\n58:57 - Export controls on GPUs to China\n1:09:16 - AGI timeline\n1:18:41 - China's manufacturing capacity\n1:26:36 - Cold war with China\n1:31:05 - TSMC and Taiwan\n1:54:44 - Best GPUs for AI\n2:09:36 - Why DeepSeek is so cheap\n2:22:55 - Espionage\n2:31:57 - Censorship\n2:44:52 - Andrej Karpathy and magic of RL\n2:55:23 - OpenAI o3-mini vs DeepSeek r1\n3:14:31 - NVIDIA\n3:18:58 - GPU smuggling\n3:25:36 - DeepSeek training on OpenAI data\n3:36:04 - AI megaclusters\n4:11:26 - Who wins the race to AGI?\n4:21:39 - AI agents\n4:30:21 - Programming and AI\n4:37:49 - Open source\n4:47:01 - Stargate\n4:54:30 - Future of AI\n\n*PODCAST LINKS:*\n- Podcast Website: https://lexfridman.com/podcast\n- Apple Podcasts: https://apple.co/2lwqZIr\n- Spotify: https://spoti.fi/2nEwCF8\n- RSS: https://lexfridman.com/feed/podcast/\n- Podcast Playlist: https://www.youtube.com/playlist?list=PLrAXtmErZgOdP_8GztsuKi9nrraNbKKp4\n- Clips Channel: https://www.youtube.com/lexclips\n\n*SOCIAL LINKS:*\n- X: https://x.com/lexfridman\n- Instagram: https://instagram.com/lexfridman\n- TikTok: https://tiktok.com/@lexfridman\n- LinkedIn: https://linkedin.com/in/lexfridman\n- Facebook: https://facebook.com/lexfridman\n- Patreon: https://patreon.com/lexfridman\n- Telegram: https://t.me/lexfridman\n- Reddit: https://reddit.com/r/lexfridman</article>","contentLength":3106,"flags":null,"enclosureUrl":"https://www.youtube.com/v/_1f-o0nqpEI?version=3","enclosureMime":"","commentsUrl":null},{"title":"Derek Turner - Evolution and Morality","url":"https://www.youtube.com/watch?v=C9I3RBjrf5c","date":1738512020,"author":"Closer To Truth","guid":593,"unread":true,"content":"<article>Like us on Facebook for daily videos, updates, and more: https://shorturl.at/tak4l\n\nAltruism, selfless concern for others, seems a challenge for evolution, as it seems the opposite of “survival of the fittest.” Why then is altruism so important in evolutionary studies? How does animal altruism relate to human morality?\n\nMake a tax-deductible donation of any amount to help Closer To Truth continue exploring the world's deepest questions: https://shorturl.at/OnyRq\n\nDerek Turner teaches philosophy at Connecticut College where he is also the Karla Heurich Harrison ’28 Director of the Goodwin-Niering Center for the Environment. He regularly teaches Introduction to Philosophy, Logic, Bioethics, Environmental Philosophy, Philosophy of Science, Philosophy of Biology, The Science and Ethics of Extinction, and Darwin.\n\nWear your support for the show with a Closer To Truth merch purchase: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1241,"flags":null,"enclosureUrl":"https://www.youtube.com/v/C9I3RBjrf5c?version=3","enclosureMime":"","commentsUrl":null},{"title":"Robin Collins - Were Multiple Universes Created?","url":"https://www.youtube.com/watch?v=X40wit5ulss","date":1738425635,"author":"Closer To Truth","guid":592,"unread":true,"content":"<article>Make a tax-deductible donation of any amount to help support Closer To Truth continue making content like this: https://shorturl.at/OnyRq\n\nWhat is the extent of God’s creation? If there are multiple universes, did God create each of them? If an infinite number of universes, did God create all of them? Theists may be conflicted: the centrality of human beings in this one universe, and, for Christians, the incarnation on Earth, versus the magnification of God with multiple universes.\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nRobin Alan Collins is an American philosopher. He currently, as of at least August 2020 serves as the Distinguished Professor of Philosophy and chair of the Department of Philosophy at Messiah University in Mechanicsburg, Pennsylvania.\n\nShop Closer To Truth merchandise for unique items like notebooks, mugs, and sweatshirts: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1271,"flags":null,"enclosureUrl":"https://www.youtube.com/v/X40wit5ulss?version=3","enclosureMime":"","commentsUrl":null},{"title":"Over the top auth strategies (Friends)","url":"https://changelog.com/friends/78","date":1738355400,"author":"","guid":154,"unread":true,"content":"<p>Dan Moore from FusionAuth joins us for a wide-ranging discussion about modern auth strategies. We talk magic links, OTP, MFA, passkeys, password managers &amp; so much more.</p><p><a href=\"https://changelog.com/++\" rel=\"payment\">Changelog++</a> members get a bonus 9 minutes at the end of this episode and zero ads. Join today!</p><ul><li><a href=\"https://retool.com/changelog\">Retool</a> – <strong>The low-code platform for developers to build internal tools</strong> — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at <a href=\"https://retool.com/changelog\">retool.com/changelog</a></li><li><a href=\"https://temporal.io\">Temporal</a> – Build invincible applications. Manage failures, network outages, flaky endpoints, long-running processes and more, ensuring your workflows never fail. Register for <a href=\"https://replay.temporal.io\">Replay in London, March 3-5</a> to break free from the status quo.\n</li><li><a href=\"http://notion.com/changelog\">Notion</a> – Notion is a place where any team can write, plan, organize, and rediscover the joy of play. It’s a workspace designed not just for making progress, but getting inspired. Notion is for everyone — whether you’re a Fortune 500 company or freelance designer, starting a new startup or a student juggling classes and clubs.\n</li></ul><h4>A few more links from Dan</h4>","contentLength":1207,"flags":null,"enclosureUrl":"https://op3.dev/e/https://cdn.changelog.com/uploads/friends/78/changelog--friends-78.mp3","enclosureMime":"","commentsUrl":null},{"title":"Anjan Chatterjee - Physics and Neuroscience in Art","url":"https://www.youtube.com/watch?v=j4jT5YgwNgk","date":1738353633,"author":"Closer To Truth","guid":591,"unread":true,"content":"<article>Follow us on X for daily articles, updates, and more: https://x.com/CloserToTruth\n\nHow can aesthetics be explained by the brain and its underlying biological, chemical, and physical processes? Neuroscience is explaining ever more about art, but will neuroscience ever explain everything about art?\n\nMake a tax-deductible donation of any amount to help support Closer To Truth continue making content like this: https://shorturl.at/OnyRq\n\nAnjan Chatterjee is a professor of neurology at the Perelman School of Medicine at the University of Pennsylvania. He is director of the Penn Center for Neuroaesthetics and a member of the Center for Cognitive Neuroscience. His research focuses on spatial cognition and its relationship to language.\n\nShop Closer To Truth merchandise for unique items like notebooks, mugs, and apparel: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1168,"flags":null,"enclosureUrl":"https://www.youtube.com/v/j4jT5YgwNgk?version=3","enclosureMime":"","commentsUrl":null},{"title":"Joe Rogan Experience #2266 - Brian Simpson","url":"https://www.youtube.com/watch?v=ZBCf4SogPpI","date":1738346434,"author":"PowerfulJRE","guid":614,"unread":true,"content":"<article>Brian Simpson is a stand-up comic who hosts the \"Bottom of the Barrel\" improvised comedy show at the Comedy Mothership and his own podcast, \"BS with Brian Simpson.\" Watch his new special, \"Brian Simpson: Live from the Mothership,\" on Netflix.\nhttp://www.briansimpsoncomedy.com\n\nTake ownership of your health with AG1 and get a FREE bottle of Vitamin D3+K2 AND 5 free Travel Packs with your first subscription. Go to http://drinkag1.com/joerogan\n\nDon’t miss out on all the action this week at DraftKings! Download the DraftKings app today! Sign-up using http://dkng.co/rogan or through my promo code ROGAN.\n\nGAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit http://gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit http://ccpg.org (CT) or visit http://www.mdgamblinghelp.org (MD).21+ and present in most states. (18+ DC/KY/NH/WY). Void in ONT/OR/NH. Eligibility restrictions apply. On behalf of Boot Hill Casino &amp; Resort (KS). 1 per new customer. Min. $5 deposit. Min. $5 bet. Max. $200 issued as non-withdrawable Bonus Bets that expire in 7 days (168 hours). Stake removed from payout. Terms: http://dkng.co/dk-offer-terms. Ends 2/9/25 at 11:59 PM ET. Sponsored by DK.</article>","contentLength":1252,"flags":null,"enclosureUrl":"https://www.youtube.com/v/ZBCf4SogPpI?version=3","enclosureMime":"","commentsUrl":null},{"title":"Subhash Kak - ESP and Synchronicity?","url":"https://www.youtube.com/watch?v=IKo3RYkVxG8","date":1738339227,"author":"Closer To Truth","guid":590,"unread":true,"content":"<article>Shop Closer To Truth merch like mugs, hoodies, and T-shirts to show your support of the show: https://bit.ly/3P2ogje\n\nSynchronicity makes an extraordinary claim about reality—events may be linked in diverse and strange ways that defy all physical law, causality and common sense. What would it mean if events may relate to each other only by some kind of meaning, however obscure, not by some kind of physical interaction? This type of extraordinary claim demands extraordinary evidence.\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nSubhash Kak is an Indian-American computer scientist and historical revisionist. He is the Regents Professor of Computer Science Department at Oklahoma State University–Stillwater, an honorary visiting professor of engineering at Jawaharlal Nehru University, and a member of the Indian Prime Minister's Science, Technology, and Innovation Advisory Council (PM-STIAC).\n\nMake a donation to Closer To Truth to help us continue exploring the world's deepest questions without the need for paywalls: https://shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1446,"flags":null,"enclosureUrl":"https://www.youtube.com/v/IKo3RYkVxG8?version=3","enclosureMime":"","commentsUrl":null},{"title":"Real LLM Success Stories: How They Actually Work // Alex Strick van Linschoten // #287","url":"https://podcasters.spotify.com/pod/show/mlops/episodes/Real-LLM-Success-Stories-How-They-Actually-Work--Alex-Strick-van-Linschoten--287-e2tvfr2","date":1738336554,"author":"Demetrios","guid":327,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"https://anchor.fm/s/174cb1b8/podcast/play/97549602/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2025-0-25%2F393695538-44100-2-283541e0a6446.mp3","enclosureMime":"","commentsUrl":null},{"title":"Auschwitz Commandant: Rudolf Höss","url":"https://shows.acast.com/dansnowshistoryhit/episodes/rudolf-hoss-the-commandant-of-auschwitz","date":1738283400,"author":"","guid":641,"unread":true,"content":"<p>Every day Rudolf Höss oversaw the killing of thousands of people at the death camp and then went home and acted like a doting father to his family. Höss was brought in by top Nazis to pioneer the industrialisation of the mass murder of Europe's Jews and others. He lived in a house that shared a wall with Auschwitz, metres from the crematorium, where he and his family enjoyed a happy domestic life - his wife once described their life at the house as 'paradise'.</p><p>The house was home to a Polish family until last year when it was taken over by the Counter Extremism Project who invited History Hit to explore the house, which is largely as it was when the Hoss family lived there. Dan travels to Poland with historian and best-selling author Thomas Harding to discover more about Höss' role in the Holocaust and what the house teaches us about 'the banality of evil'. They learn about what went on there, what Holocaust artefacts were recently found in the attic and the future of the house as a centre to combat hate.</p><p><strong>Warning: this episode contains descriptions of human suffering and genocide which some listeners may find upsetting.</strong></p><p>With special thanks to the Counter Extremism Project, Dr Hans-Jakob Schindler, Keith Burnet and Thomas Harding.</p><p>You can see the History Hit film about the house <a href=\"https://www.youtube.com/watch?v=4p9qU1sQPs4\" rel=\"noopener noreferrer\" target=\"_blank\">here:</a></p><p>You can find out more in Thomas' book 'Hanns and Rudolf: The German Jew and the Hunt for the Kommandant of Auschwitz'. He also has a new book out for children. It's called 'The House on the Canal: The Story of the House that Hid Anne Frank.'</p><p>Produced by Mariana Des Forges and edited by Max Carrey and Dougal Patmore</p>","contentLength":1617,"flags":null,"enclosureUrl":"https://sphinx.acast.com/p/acast/s/dansnowshistoryhit/e/679a82fea7ace681d87aecfc/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=mPHD4kSeeG0cwmdvUu1dnItqTSj8rEcl2v0UcC3JD98","enclosureMime":"","commentsUrl":null},{"title":"Joe Rogan Experience #2265 - Kurt Metzger","url":"https://www.youtube.com/watch?v=CSPkPOFzQvE","date":1738260014,"author":"PowerfulJRE","guid":613,"unread":true,"content":"<article>Kurt Metzger is a stand-up comic, writer, and host of the \"Can't Get Right with Kurt Metzger\" podcast. His latest special, \"30 Minutes with Kurt Metzger,\" is available on YouTube.  https://youtu.be/9JcfMyYKe5E?si=XucqhN2Fo8vjxLMB\n\nhttp://www.kurtmetzgercomedy.com\n\nTake ownership of your health with AG1 and get a FREE bottle of Vitamin D3+K2 AND 5 free Travel Packs with your first subscription. Go to http://drinkag1.com/joerogan\n\nDon’t miss out on all the action this week at DraftKings! Download the DraftKings app today! Sign-up using http://dkng.co/rogan or through my promo code ROGAN.\n\nGAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit http://gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit http://ccpg.org (CT) or visit http://www.mdgamblinghelp.org (MD).21+ and present in most states. (18+ DC/KY/NH/WY). Void in ONT/OR/NH. Eligibility restrictions apply. On behalf of Boot Hill Casino &amp; Resort (KS). 1 per new customer. Min. $5 deposit. Min. $5 bet. Max. $200 issued as non-withdrawable Bonus Bets that expire in 7 days (168 hours). Stake removed from payout. Terms: http://dkng.co/dk-offer-terms. Ends 2/9/25 at 11:59 PM ET. Sponsored by DK.</article>","contentLength":1239,"flags":null,"enclosureUrl":"https://www.youtube.com/v/CSPkPOFzQvE?version=3","enclosureMime":"","commentsUrl":null},{"title":"Richard Swinburne on Evidence Against God: The Problem of Evil | Closer To Truth Chats","url":"https://www.youtube.com/watch?v=jRp6ZHiDaYY","date":1738252849,"author":"Closer To Truth","guid":589,"unread":true,"content":"<article>Make a tax-deductible donation of any amount to help us continue exploring the world's deepest questions: https://closertotruth.com/donate/\n\nRobert Lawrence Kuhn sits down with esteemed philosophy Richard Swinburne to discuss how the problem of evil may provide a strong argument against theism, the theory of the Trinity, animals in evolution, and more.\n\nRichard Granville Swinburne FBA is an English philosopher. He is an Emeritus Professor of Philosophy at the University of Oxford. Over the last 50 years, Swinburne has been a proponent of philosophical arguments for the existence of God. His philosophical contributions are primarily in the philosophy of religion and philosophy of science. He aroused much discussion with his early work in the philosophy of religion, a trilogy of books consisting of \"The Coherence of Theism\", \"The Existence of God\", and \"Faith and Reason\". He has been influential in reviving substance dualism as an option in philosophy of mind.\n\nWatch more CTT Chats here: https://t.ly/jJI7e</article>","contentLength":1019,"flags":null,"enclosureUrl":"https://www.youtube.com/v/jRp6ZHiDaYY?version=3","enclosureMime":"","commentsUrl":null},{"title":"Turso is rewriting SQLite in Rust (Interview)","url":"https://changelog.com/podcast/626","date":1738242000,"author":"","guid":153,"unread":true,"content":"<p>Glauber Costa, co-founder and CEO of Turso, joins us to discuss libSQL, Limbo, and how they’re rewriting SQLite in Rust. We discuss their efforts with libSQL, the challenge of SQLite being in the public domain but not being open for contribution, their choice to rewrite everything with Limbo, how this all plays into the future of the Turso platform, how they test Limbo with Deterministic Simulation Testing (DST), and their plan to replace SQLite.</p><p><a href=\"https://changelog.com/++\" rel=\"payment\">Changelog++</a> members save 6 minutes on this episode because they made the ads disappear. Join today!</p><ul><li><a href=\"https://retool.com/changelog\">Retool</a> – <strong>The low-code platform for developers to build internal tools</strong> — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at <a href=\"https://retool.com/changelog\">retool.com/changelog</a></li><li><a href=\"https://temporal.io\">Temporal</a> – Build invincible applications. Manage failures, network outages, flaky endpoints, long-running processes and more, ensuring your workflows never fail. Register for <a href=\"https://replay.temporal.io\">Replay in London, March 3-5</a> to break free from the status quo.\n</li><li><a href=\"http://notion.com/changelog\">Notion</a> – Notion is a place where any team can write, plan, organize, and rediscover the joy of play. It’s a workspace designed not just for making progress, but getting inspired. Notion is for everyone — whether you’re a Fortune 500 company or freelance designer, starting a new startup or a student juggling classes and clubs.\n</li><li><a href=\"https://fly.io/\">Fly.io</a> – <strong>The home of Changelog.com</strong> — Deploy your apps close to your users — global Anycast load-balancing, zero-configuration private networking, hardware isolation, and instant WireGuard VPN connections. Push-button deployments that scale to thousands of instances. <a href=\"https://fly.io/speedrun/\">Check out the speedrun</a> to get started in minutes.\n</li></ul>","contentLength":1793,"flags":null,"enclosureUrl":"https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/626/the-changelog-626.mp3","enclosureMime":"","commentsUrl":null},{"title":"NVIDIA’s Agentic AI for Container Security with Amanda Saunders and Allan Enemark","url":"https://softwareengineeringdaily.com/2025/01/30/nvidias-agentic-ai-for-container-security-with-amanda-saunders-and-allan-enemark/?utm_source=rss&utm_medium=rss&utm_campaign=nvidias-agentic-ai-for-container-security-with-amanda-saunders-and-allan-enemark","date":1738231234,"author":"SEDaily","guid":717,"unread":true,"content":"<div><p>Docker container vulnerability analysis involves identifying and mitigating security risks within container images. This is done to ensure that containerized applications can be securely deployed. Vulnerability analysis can often be time intensive, which has motivated the use of AI and ML to accelerate the process.</p></div><div><p><a href=\"https://x.com/AmandaMSaunders\">Amanda Saunders</a> is the Director of Enterprise Generative AI Software at NVIDIA, and <a href=\"https://x.com/exactlyallan\">Allan Enemark</a> works on NVIDIA’s Morpheus cybersecurity SDK team.</p></div><div><p>Amanda and Allan join the podcast with Gregor Vand to talk about Blueprints and their application to vulnerability and container security.</p></div>","contentLength":604,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED6652749715.mp3","enclosureMime":"","commentsUrl":null},{"title":"Joe Rogan Experience #2264 - Lenval Logan & Jason Sands","url":"https://www.youtube.com/watch?v=PJ2YwE0R-xM","date":1738173616,"author":"PowerfulJRE","guid":612,"unread":true,"content":"<article>Lenval Logan is a retired U.S. Air Force intelligence analyst and former UAP Task Force member. He is the CEO of Phenom LLC, which develops the Phenom app for reporting UAP and paranormal sightings. Logan appears in James Fox's documentary, \"The Program,\" Dan Farah and Lue Elizondo's \"The Age of Disclosure,\" and season five of The History Channel's \"The Proof Is Out There.\" \n\nhttps://phenom.earth/contact/\n\nJason Sands is a retired U.S. Air Force veteran and former legacy UAP program member. His latest initiative, the Firsthand Fund, helps UAP share their experiences. Jason was featured in James Fox's documentary, \"The Program.\" \n\nhttps://x.com/JasonTSands\n\nThis Valentine’s Day good things come in big packages at MeUndies. Score huge sitewide savings at http://MeUndies.com/ROGAN\n\nDon’t miss out on all the action this week at DraftKings! Download the DraftKings app today! Sign-up using http://dkng.co/rogan or through my promo code ROGAN.\n\nGAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit http://gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit http://ccpg.org (CT) or visit http://www.mdgamblinghelp.org (MD).21+ and present in most states. (18+ DC/KY/NH/WY). Void in ONT/OR/NH. Eligibility restrictions apply. On behalf of Boot Hill Casino &amp; Resort (KS). 1 per new customer. Min. $5 deposit. Min. $5 bet. Max. $200 issued as non-withdrawable Bonus Bets that expire in 7 days (168 hours). Stake removed from payout. Terms: http://dkng.co/dk-offer-terms. Ends 2/9/25 at 11:59 PM ET. Sponsored by DK.</article>","contentLength":1598,"flags":null,"enclosureUrl":"https://www.youtube.com/v/PJ2YwE0R-xM?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Raylib C Library for Game Development with Ramon Santamaria","url":"https://softwareengineeringdaily.com/2025/01/29/the-raylib-c-library-for-game-development-with-ramon-santamaria/?utm_source=rss&utm_medium=rss&utm_campaign=the-raylib-c-library-for-game-development-with-ramon-santamaria","date":1738144830,"author":"SEDaily","guid":716,"unread":true,"content":"<div><p>Raylib is a lightweight, beginner-friendly, and open-source C library for game development, known for its simplicity and lack of external dependencies. It’s designed to streamline the creation of 2D and 3D games, and has an intuitive API for managing graphics, audio, and input.</p></div><div><p><a href=\"https://x.com/raysan5\">Ramon Santamaria</a> is the Founder and Lead Developer of <a href=\"https://www.raylibtech.com/\">Raylib</a>. He joins the show with Joe Nash to talk about the Raylib project.</p></div><p>Joe Nash is a developer, educator, and award-winning community builder, who has worked at companies including GitHub, Twilio, Unity, and PayPal. Joe got his start in software development by creating mods and running servers for Garry’s Mod, and game development remains his favorite way to experience and explore new technologies and concepts.</p>","contentLength":752,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED9835831252.mp3","enclosureMime":"","commentsUrl":null},{"title":"The Hunt for Pablo Escobar","url":"https://shows.acast.com/dansnowshistoryhit/episodes/the-hunt-for-pablo-escobar","date":1738110600,"author":"","guid":640,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"https://sphinx.acast.com/p/acast/s/dansnowshistoryhit/e/679272d3a6c96ea7801bd5df/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=CUFxdCHJi5iIedPFQ4LlWuvmk4afDp4PmFcw-INAY9E","enclosureMime":"","commentsUrl":null},{"title":"Joe Rogan Experience #2263 - Gad Saad","url":"https://www.youtube.com/watch?v=vhJ_6YyOU2A","date":1738087247,"author":"PowerfulJRE","guid":611,"unread":true,"content":"<article>Gad Saad is Visiting Professor and Global Ambassador at Northwood University, and an expert in the application of evolutionary psychology in marketing and consumer behavior. He is the host of \"The Saad Truth with Dr. Saad\" podcast, and the author of several books, including \"The Saad Truth about Happiness: 8 Secrets for Leading the Good Life.\" \nhttp://www.gadsaad.com\n\nTake ownership of your health with AG1 and get a FREE bottle of Vitamin D3+K2 AND 5 free Travel Packs with your first subscription. Go to http://drinkag1.com/joerogan\n\nThis episode is brought to you by ZipRecruiter — 4 out of 5 employers who post on ZipRecruiter get a quality candidate within the first day. Try ZipRecruiter FOR FREE at http://ziprecruiter.com/rogan</article>","contentLength":740,"flags":null,"enclosureUrl":"https://www.youtube.com/v/vhJ_6YyOU2A?version=3","enclosureMime":"","commentsUrl":null},{"title":"Anduril with Gokul Subramanian","url":"https://softwareengineeringdaily.com/2025/01/28/anduril-with-gokul-subramanian/?utm_source=rss&utm_medium=rss&utm_campaign=anduril-with-gokul-subramanian","date":1738058438,"author":"SEDaily","guid":715,"unread":true,"content":"<div><p>Anduril is a technology defense company with a focus on drones, computer vision, and other problems related to national security. It is a full-stack company that builds its own hardware and software, which leads to a great many interesting questions about cloud services, engineering workflows, and management.</p></div><div><p><a href=\"https://www.anduril.com/profile/gokul-subramanian/\">Gokul Subramanian</a> is Senior Vice President of Engineering for Software Programs at <a href=\"https://www.anduril.com/\">Anduril</a> Industries. He joins the show to share his knowledge of the national security problem set, how Anduril operates and what the company has built.</p></div>","contentLength":544,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED5987055178.mp3","enclosureMime":"","commentsUrl":null},{"title":"DeepSeek-R1's epic pull request (News)","url":"https://changelog.com/news/129","date":1738009800,"author":"","guid":152,"unread":true,"content":"<p>Xuan-Son Nguyen opened a low-level code PR written 99% by DeepSeek-R1, Adam Wathan announces the release of Tailwind CSS 4.0, Matheus Lima opens up the Computer Science history books to create list of influential papers, Namanyay Goel thinks AI is creating a generation of illiterate programmers &amp; Russell Baylis shares what he’s learned about optimizing WFH lighting to reduce eye strain.</p><p><a href=\"https://changelog.com/++\" rel=\"payment\">Changelog++</a> members support our work, get closer to the metal, and make the ads disappear. Join today!</p>","contentLength":493,"flags":null,"enclosureUrl":"https://op3.dev/e/https://cdn.changelog.com/uploads/news/129/changelog-news-129.mp3","enclosureMime":"","commentsUrl":null},{"title":"Navigating Machine Learning Careers: Insights from Meta to Consulting // Ilya Reznik // #286","url":"https://podcasters.spotify.com/pod/show/mlops/episodes/Navigating-Machine-Learning-Careers-Insights-from-Meta-to-Consulting--Ilya-Reznik--286-e2tui16","date":1737994189,"author":"Demetrios","guid":326,"unread":true,"content":"<p>In his 13 years of software engineering, <a href=\"https://www.linkedin.com/in/ibreznik/\" target=\"_blank\" rel=\"ugc noopener noreferrer\"></a> has specialized in commercializing machine learning solutions and building robust ML platforms. He's held technical lead and staff engineering roles at premier firms like Adobe, Twitter, and Meta. Currently, Ilya channels his expertise into his travel startup, Jaunt, while consulting and advising emerging startups.\n\nNavigating Machine Learning Careers: Insights from Meta to Consulting // MLOps Podcast #286 with Ilya Reznik, ML Engineering Thought Leader at Instructed Machines, LLC.\n\n// Abstract\nIlya Reznik's insights into machine learning and career development within the field. With over 13 years of experience at leading tech companies such as Meta, Adobe, and Twitter, Ilya emphasizes the limitations of traditional model fine-tuning methods. He advocates for alternatives like prompt engineering and knowledge retrieval, highlighting their potential to enhance AI performance without the drawbacks associated with fine-tuning.\n\nIlya's recent discussions at the NeurIPS conference reflect a shift towards practical applications of Transformer models and innovative strategies like curriculum learning. Additionally, he shares valuable perspectives on navigating career progression in tech, offering guidance for aspiring ML engineers aiming for senior roles. His narrative serves as a blend of technical expertise and practical career advice, making it a significant resource for professionals in the AI domain.\n\n// Bio\nIlya has navigated a diverse career path since 2011, transitioning from physicist to software engineer, data scientist, ML engineer, and now content creator. He is passionate about helping ML engineers advance their careers and making AI more impactful and beneficial for society.\n\nPreviously, Ilya was a technical lead at Meta, where he contributed to 12% of the company’s revenue and managed approximately 30 production ML models. He also worked at Twitter, overseeing offline model evaluation, and at Adobe, where his team was responsible for all intelligent services within Adobe Analytics.\n\nBased in Salt Lake City, Ilya enjoys the outdoors, tinkering with Arduino electronics, and, most importantly, spending time with his family.\n\n// MLOps Swag/Merch\n<a href=\"https://shop.mlops.community/\" target=\"_blank\" rel=\"ugc noopener noreferrer\">https://shop.mlops.community/</a>\n\n// Related Links\nWebsite: <a href=\"https://podcasters.spotify.com/pod/show/mlops/episodes/mlepath.com\" target=\"_blank\" rel=\"ugc noopener noreferrer\">mlepath.com\n</a> \n--------------- ✌️Connect With Us ✌️ -------------\nJoin our slack community: <a href=\"https://go.mlops.community/slack\" target=\"_blank\" rel=\"ugc noopener noreferrer\">https://go.mlops.community/slack</a>\nFollow us on Twitter: <a href=\"https://podcasters.spotify.com/pod/show/mlops/episodes/@mlopscommunity\" target=\"_blank\" rel=\"ugc noopener noreferrer\">@mlopscommunity</a>\nSign up for the next meetup: <a href=\"https://go.mlops.community/register\" target=\"_blank\" rel=\"ugc noopener noreferrer\">https://go.mlops.community/register</a>\nCatch all episodes, blogs, newsletters, and more: <a href=\"https://mlops.community/\" target=\"_blank\" rel=\"ugc noopener noreferrer\">https://mlops.community/</a>\n\nConnect with Demetrios on LinkedIn: <a href=\"https://www.linkedin.com/in/dpbrinkm/\" target=\"_blank\" rel=\"ugc noopener noreferrer\">https://www.linkedin.com/in/dpbrinkm/</a>\nConnect with Ilya on LinkedIn: <a href=\"https://www.linkedin.com/in/ibreznik/\" target=\"_blank\" rel=\"ugc noopener noreferrer\">https://www.linkedin.com/in/ibreznik/</a></p>","contentLength":2742,"flags":null,"enclosureUrl":"https://anchor.fm/s/174cb1b8/podcast/play/97519078/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2025-0-24%2F393657905-44100-2-fda7c9be7256c.mp3","enclosureMime":"","commentsUrl":null},{"title":"A History of Auschwitz","url":"https://shows.acast.com/dansnowshistoryhit/episodes/a-history-of-auschwitz","date":1737937800,"author":"","guid":639,"unread":true,"content":"<p>On January 27th 1945, the Red Army liberated the concentration camp at Auschwitz unveiling its almost unspeakable horrors to the world.&nbsp;</p><p>The concentration camp system began almost immediately after Adolf Hitler became Chancellor of Germany in 1933. It was an integral part of the Nazi regime's rapid dismantling of German democracy. Within weeks, the first concentration camp, Dachau, was opened to imprison political opponents, marking the start of a vast and brutal system of camps across Germany and later in the occupied territories. The camps began as places to imprison political enemies and people the Nazis deemed to be “undesirables”. But, as the Second World War progressed, these camps became centres of industrial-scale genocide, with Auschwitz becoming perhaps the most infamous.&nbsp;</p><p>In this episode, Dan is joined by Nikolaus Wachsmann, Professor of Modern European History at Birkbeck University of London. They discuss the historical context and horrors of Auschwitz, marking Holocaust Memorial Day on the 80th anniversary of its liberation by the Red Army.</p><p><strong><u>Warning: This episode contains a detailed discussion of the Holocaust and genocide which some listeners may find upsetting.</u></strong></p>","contentLength":1197,"flags":null,"enclosureUrl":"https://sphinx.acast.com/p/acast/s/dansnowshistoryhit/e/6793b2a4ae8b037c91dcda93/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJzdGF0dXMiOiJwdWJsaWMifQ==&sig=udjMUcAw-wAWjSBZ-eazgP0DmE0yhKpUfRSBCGrH3ek","enclosureMime":"","commentsUrl":null},{"title":"Marc Andreessen: Trump, Power, Tech, AI, Immigration & Future of America | Lex Fridman Podcast #458","url":"https://www.youtube.com/watch?v=OHWnPOKh_S0","date":1737924462,"author":"Lex Fridman","guid":620,"unread":true,"content":"<article>Marc Andreessen is an entrepreneur, investor, co-creator of Mosaic, co-founder of Netscape, and co-founder of the venture capital firm Andreessen Horowitz.\nThank you for listening ❤ Check out our sponsors: https://lexfridman.com/sponsors/ep458-sb\nSee below for timestamps, transcript, and to give feedback, submit questions, contact Lex, etc.\n\n*Transcript:*\nhttps://lexfridman.com/marc-andreessen-2-transcript\n\n*CONTACT LEX:*\n*Feedback* - give feedback to Lex: https://lexfridman.com/survey\n*AMA* - submit questions, videos or call-in: https://lexfridman.com/ama\n*Hiring* - join our team: https://lexfridman.com/hiring\n*Other* - other ways to get in touch: https://lexfridman.com/contact\n\n*EPISODE LINKS:*\nMarc's X: https://x.com/pmarca\nMarc's Substack: https://pmarca.substack.com\nMarc's YouTube: https://www.youtube.com/@a16z\nAndreessen Horowitz: https://a16z.com\n\n*SPONSORS:*\nTo support this podcast, check out our sponsors &amp; get discounts:\n*Encord:* AI tooling for annotation &amp; data management.\nGo to https://lexfridman.com/s/encord-ep458-sb\n*GitHub:* Developer platform and AI code editor.\nGo to https://lexfridman.com/s/github-ep458-sb\n*Notion:* Note-taking and team collaboration.\nGo to https://lexfridman.com/s/notion-ep458-sb\n*Shopify:* Sell stuff online.\nGo to https://lexfridman.com/s/shopify-ep458-sb\n*LMNT:* Zero-sugar electrolyte drink mix.\nGo to https://lexfridman.com/s/lmnt-ep458-sb\n\n*OUTLINE:*\n0:00 - Introduction\n1:09 - Best possible future\n10:32 - History of Western Civilization\n19:51 - Trump in 2025\n27:32 - TDS in tech\n40:19 - Preference falsification\n56:15 - Self-censorship\n1:11:18 - Censorship\n1:19:57 - Jon Stewart\n1:22:43 - Mark Zuckerberg on Joe Rogan\n1:31:32 - Government pressure\n1:42:19 - Nature of power\n1:55:08 - Journalism\n2:00:43 - Bill Ackman\n2:05:40 - Trump administration\n2:13:19 - DOGE\n2:27:11 - H1B and immigration\n3:05:05 - Little tech\n3:17:25 - AI race\n3:26:15 - X\n3:29:47 - Yann LeCun\n3:33:21 - Andrew Huberman\n3:34:53 - Success\n3:37:49 - God and humanity\n\n*PODCAST LINKS:*\n- Podcast Website: https://lexfridman.com/podcast\n- Apple Podcasts: https://apple.co/2lwqZIr\n- Spotify: https://spoti.fi/2nEwCF8\n- RSS: https://lexfridman.com/feed/podcast/\n- Podcast Playlist: https://www.youtube.com/playlist?list=PLrAXtmErZgOdP_8GztsuKi9nrraNbKKp4\n- Clips Channel: https://www.youtube.com/lexclips\n\n*SOCIAL LINKS:*\n- X: https://x.com/lexfridman\n- Instagram: https://instagram.com/lexfridman\n- TikTok: https://tiktok.com/@lexfridman\n- LinkedIn: https://linkedin.com/in/lexfridman\n- Facebook: https://facebook.com/lexfridman\n- Patreon: https://patreon.com/lexfridman\n- Telegram: https://t.me/lexfridman\n- Reddit: https://reddit.com/r/lexfridman</article>","contentLength":2680,"flags":null,"enclosureUrl":"https://www.youtube.com/v/OHWnPOKh_S0?version=3","enclosureMime":"","commentsUrl":null},{"title":"JRE MMA Show #165 with Jiri Prochazka","url":"https://www.youtube.com/watch?v=lpfgsPUMCaM","date":1737828036,"author":"PowerfulJRE","guid":610,"unread":true,"content":"<article>Joe sits down with Jiří Procházka, a professional mixed martial artist currently competing in the Light Heavyweight division of the Ultimate Fighting Championship.\n\nhttps://www.ufc.com/athlete/jiri-prochazka\n\nTake ownership of your health with AG1 and get a FREE bottle of Vitamin D3+K2 AND 5 free Travel Packs with your first subscription. Go to http://drinkag1.com/joerogan\n\nDon’t miss out on all the action this week at DraftKings! Download the DraftKings app today! Sign-up using http://dkng.co/rogan or through my promo code ROGAN.\n\nGAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit http://gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit http://ccpg.org (CT) or visit http://www.mdgamblinghelp.org (MD).21+ and present in most states. (18+ DC/KY/NH/WY). Void in ONT/OR/NH. Eligibility restrictions apply. On behalf of Boot Hill Casino &amp; Resort (KS). 1 per new customer. Min. $5 deposit. Min. $5 bet. Max. $200 issued as non-withdrawable Bonus Bets that expire in 7 days (168 hours). Stake removed from payout. Terms: http://dkng.co/dk-offer-terms. Ends 2/9/25 at 11:59 PM ET. Sponsored by DK.</article>","contentLength":1186,"flags":null,"enclosureUrl":"https://www.youtube.com/v/lpfgsPUMCaM?version=3","enclosureMime":"","commentsUrl":null},{"title":"Joe Rogan Experience #2262 - Dr. Mark Gordon","url":"https://www.youtube.com/watch?v=WZDckDvN4sA","date":1737741622,"author":"PowerfulJRE","guid":609,"unread":true,"content":"<article>Dr. Mark Gordon is an expert in the field of neuroregenerative medicine and the treatment of Traumatic Brain Injuries.\n\nwww.millenniumhealthstore.com\n\nThis episode is brought to you by BetterHelp. Get working on a better you with therapy. Visit http://www.BetterHelp.com/JRE today to get 10% off your first month.\n\nDon’t miss out on all the action this week at DraftKings! Download the DraftKings app today! Sign-up using http://dkng.co/rogan or through my promo code ROGAN.\n\nGAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit http://gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit http://ccpg.org (CT) or visit http://www.mdgamblinghelp.org (MD).21+ and present in most states. (18+ DC/KY/NH/WY). Void in ONT/OR/NH. Eligibility restrictions apply. On behalf of Boot Hill Casino &amp; Resort (KS). 1 per new customer. Min. $5 deposit. Min. $5 bet. Max. $200 issued as non-withdrawable Bonus Bets that expire in 7 days (168 hours). Stake removed from payout. Terms: http://dkng.co/dk-offer-terms. Ends 2/9/25 at 11:59 PM ET. Sponsored by DK.</article>","contentLength":1121,"flags":null,"enclosureUrl":"https://www.youtube.com/v/WZDckDvN4sA?version=3","enclosureMime":"","commentsUrl":null}],"tags":["podcast"]}