{"id":"F7pXcmPnWkLEHkvQBb3zXkgdiHy14GQcP2RQp","title":"Aphyr: Posts","displayTitle":"Dev - Aphyr","url":"http://aphyr.com/posts.atom","feedLink":"http://aphyr.com/posts.atom","items":[{"title":"Threads Won't Take You South of Market","url":"https://aphyr.com/posts/371-threads-wont-take-you-south-of-market","date":1733065296,"author":"Aphyr","unread":true,"desc":"","content":"<p>In June 2023, when <a href=\"https://threads.net\">Threads</a> announced their <a href=\"https://techcrunch.com/2023/07/05/adam-mosseri-says-metas-threads-app-wont-have-activitypub-support-at-launch/\">plans to federate</a> with other <a href=\"https://en.wikipedia.org/wiki/Fediverse\">Fediverse instances</a>, there was a good deal of <a href=\"https://fedipact.online/\">debate</a> around whether smaller instances should allow federation or block it pre-emptively. As one of the admins of <a href=\"https://woof.group\">woof.group</a>, I wrote about some of the <a href=\"https://blog.woof.group/announcements/considering-large-instance-federation\">potential risks and rewards</a> of federating with Threads. We decided to <a href=\"https://blog.woof.group/announcements/deferring-threads-federation\">wait and see</a>.</p>\n<p>In my queer and leather circles, Facebook and Instagram have been generally understood as hostile environments for over a decade. In 2014, their <a href=\"https://www.eff.org/deeplinks/2014/09/facebooks-real-name-policy-can-cause-real-world-harm-lgbtq-community\">“Real Name” policy</a> made life particularly difficult for trans people, drag queens, sex workers, and people who, for various reasons, needed to keep their real name disconnected from their queer life. My friends have been repeatedly suspended from both platforms for showing too much skin, or using the peach emoji. Meta’s moderation has been aggressive, opaque, and wildly inconsistent: sometimes full nudity is fine; other times a kiss or swimsuit is beyond the line. In some circles, maintaining a series of backup accounts in advance of one’s ban became de rigueur.</p>\n<p>I’d hoped that federation between Threads and the broader Fediverse might allow a <a href=\"https://blog.woof.group/mods/the-shape-of-social-space\">more nuanced spectrum</a> of moderation norms. Threads might opt for a more conservative environment locally, but through federation, allow their users to interact with friends on instances with more liberal norms. Conversely, most of my real-life friends are still on Meta services—I’d love to see their posts and chat with them again. Threads could communicate with Gay Fedi (using the term in the broadest sense), and de-rank or hide content they don’t like on a per-post or per-account basis.</p>\n<p>This world seems technically feasible. Meta reports <a href=\"https://techcrunch.com/2024/11/03/threads-now-has-275m-monthly-active-users/\">275 million Monthly Active Users (MAUs)</a>, and over <a href=\"https://www.statista.com/statistics/1092227/facebook-product-dau/\">three billion</a> accross other Meta services. Fediverse has something like <a href=\"https://fedidb.org/\">one million MAUs across various instances</a>. This is not a large jump in processing or storage; nor would it seem to require a large increase in moderation staff. Threads has already committed to doing the requisite engineering, user experience, and legal work to allow federation across a broad range of instances. Meta is swimming in cash.</p>\n<p>All this seems a moot point. A year and a half later, Threads <a href=\"https://www.theverge.com/24107998/threads-fediverse-mastodon-how-to\">is barely half federated</a>. It publishes Threads posts to the world, but only if you dig in to the settings and check the “Fediverse Sharing” box. Threads users can see replies to their posts, but can’t talk back. Threads users can’t mention others, see mentions from other people, or follow anyone outside Threads. This may work for syndication, but is essentially unusable for conversation.</p>\n<p>Despite the fact that Threads users can’t follow or see mentions from people on other instances, Threads has already <a href=\"https://www.threads.net/moderated_servers\">opted to block</a> a slew of instances where gay &amp; leather people congregate. Threads blocks <a href=\"https://hypno.social\">hypno.social</a>, <a href=\"rubber.social\">rubber.social</a>, <a href=\"https://4bear.com\">4bear.com</a>, <a href=\"https://nsfw.lgbt\">nsfw.lgbt</a>, <a href=\"https://kinkyelephant.com\">kinkyelephant.com</a>, <a href=\"https://kinktroet.social\">kinktroet.social</a>, <a href=\"https://barkclub.xyz\">barkclub.xyz</a>, <a href=\"https://mastobate.social\">mastobate.social</a>, and <a href=\"https://kinky.business\">kinky.business</a>. They also block the (now-defunct) instances <a href=\"https://bear.community\">bear.community</a>, <a href=\"https://gaybdsm.group\">gaybdsm.group</a>, and <a href=\"https://gearheads.social\">gearheads.social</a>. They block more general queer-friendly instances like <a href=\"https://bark.lgbt\">bark.lgbt</a>, <a href=\"https://super-gay.co\">super-gay.co</a>, <a href=\"https://gay.camera\">gay.camera</a>, and <a href=\"https://gaygeek.social\">gaygeek.social</a>. They block sex-positive instances like <a href=\"https://nsfwphotography.social\">nsfwphotography.social</a>, <a href=\"https://nsfw.social\">nsfw.social</a>, and <a href=\"https://net4sw.com\">net4sw.com</a>. All these instances are blocked for having “violated our Community Standards or Terms of Use”. Others like <a href=\"https://fisting.social\">fisting.social</a>, <a href=\"https://mastodon.hypnoguys.com\">mastodon.hypnoguys.com</a>, <a href=\"https://abdl.link\">abdl.link</a>, <a href=\"https://qaf.men\">qaf.men</a>, and <a href=\"https://social.rubber.family\">social.rubber.family</a>, are blocked for having “no publicly accessible feed”. I don’t know what this means: hypnoguys.social, for instance, has the usual Mastodon <a href=\"https://mastodon.hypnoguys.com/public/local\">publically accessible local feed</a>.</p>\n<p>It’s not like these instances are hotbeds of spam, hate speech, or harassment: woof.group federates heavily with most of the servers I mentioned above, and we rarely have problems with their moderation. Most have reasonable and enforced media policies requiring sensitive-media flags for genitals, heavy play, and so on. Those policies are generally speaking looser than Threads (woof.group, for instance, allows butts!) but there are plenty of accounts and posts on these instances which would be anodyne under Threads’ rules.</p>\n<p>I am shocked that woof.group is <em>not</em> on Threads’ blocklist yet. We have similar users who post similar things. Our content policies are broadly similar—several of the instances Threads blocks actually adopted woof.group’s specific policy language. I doubt it’s our size: Threads blocks several instances with less than ten MAUs, and woof.group has over seven hundred.</p>\n<p>I’ve been out of the valley for nearly a decade, and I don’t have insight into Meta’s policies or decision-making. I’m sure Threads has their reasons. Whatever they are, Threads, like all of Meta’s services, feels distinctly uncomfortable with sex, and sexual expression is a vibrant aspect of gay culture.</p>\n<p>This is part of why I started woof.group: we deserve spaces moderated with our subculture in mind. But I also hoped that by designing a moderation policy which compromised with normative sensibilities, we might retain connections to a broader set of publics. This particular leather bar need not be an invite-only clubhouse; it can be a part of a walkable neighborhood. For nearly five years we’ve kept that balance, retaining open federation with most all the Fediverse. I get the sense that Threads intends to wall its users off from our world altogether—to make “bad gays” invisible. If Threads were a taxi service, it wouldn’t take you <a href=\"https://sfleatherdistrict.org/wp-content/uploads/2021/04/Rubin-Valley-of-Kings.pdf\">South of Market</a>.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""}]}