{"id":"USgKoryE83j5SszZjyr68sh7DjLn4j6MWUagcNjQES7kQ1n2HXebXN4bJpBn8stf6LqSMrbny1unc4R1hi6qmf","title":"top scoring links : golang","displayTitle":"Reddit - Go","url":"https://www.reddit.com/r/golang/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/golang/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Asking for a feedback","url":"https://www.reddit.com/r/golang/comments/1rine9u/asking_for_a_feedback/","date":1772440123,"author":"/u/chronos_alfa","guid":501,"unread":true,"content":"<p>While learning Go, I've created this cli tool for encrypted archiving</p><p>User supplies a folder that will be zipped; this zipped data is then fed to AES-GCM to be sealed.</p><p>User supplies a passphrase and I hash the passphrase with SHA256 together with 256B salt I have generated from the crypto/rand. The hash is repeated 1.000.000 times total to slow down the process of the key generation a bit.</p><p>Then I encrypt the data and write the generated salt and data to the file. This way, each execution yields a unique output file.</p><p>For extraction I first read the salt from the file and then the rest of the encrypted data.</p><p>I tried my best with just the standard library.</p>","contentLength":656,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"chromakey: high performance chroma key background removal","url":"https://github.com/t7ru/chromakey","date":1772433832,"author":"/u/gatrixgd","guid":502,"unread":true,"content":"<p>Hey, I recently made a very fast chroma key removal package that I think still has a bit more of a wiggle room to make it even faster (especially with the non RGBA type). It can process 4Ks at sub 10, which I think is pretty impressive.</p><p>I'd love to know if you guys have any ideas on how to make it even faster.</p>","contentLength":310,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/golang/comments/1rilokw/chromakey_high_performance_chroma_key_background/"},{"title":"Releases my new Golang tool: gomon","url":"https://www.reddit.com/r/golang/comments/1rig7jd/releases_my_new_golang_tool_gomon/","date":1772417134,"author":"/u/CurveDouble7584","guid":503,"unread":true,"content":"<p>I’ve been using Go for a while now, but before Go I spent many years in the Node.js ecosystem, where tools like nodemon were part of my daily workflow. Saving a file and seeing the app restart automatically made developing really smooth.  workflows are a common request in the Go community too.</p><p>Some time ago I started building a small watcher for my own use that rebuilt and restarted Go binaries on file changes. After using it daily and polishing the experience, I decided to open source it: . It’s simple, Go-idiomatic, and focused on a clean  loop.</p><p>A few things I learned building it:</p><ul><li>Developer experience matters. Smoother rebuild/restart loops make local dev feel better.</li><li>Handling processes and signal restarts in Go has nuances.</li><li>Good defaults that work without config reduce friction.</li></ul><p>I welcome feedback, suggestions, and honest evaluations.</p>","contentLength":847,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"What cancelled my Go context?","url":"https://www.reddit.com/r/golang/comments/1rhzdxd/what_cancelled_my_go_context/","date":1772377263,"author":"/u/sigmoia","guid":506,"unread":true,"content":"<p>TLDR; Recording ctx cancellation cause is still quite a bit of work.</p><p>In our prod system at work,  or <code>context deadline exceeded</code> w/o any extra info has been a big headache.</p><p>This is partly because majority of the folks writing Go in my workplace are fairly new to the language. But it's also because in languages like Kotlin/Python, you can run a finalizer that'll just capture and log why the context was canceled. People are just used to it. </p><p>But in Go it requires a bit more work. Before 1.20 there wasn't even a way to record why a context was canceled. The context might be cancelled because the client bailed, or because the task actually succeeded and the deferred cancel just ran.</p><p>Recording the context cancellation reason requires some song &amp; dance. So internally we ended up writing a wrapper around the context package to enforce  and  instead of their barebone variants. But  is easy to misuse.</p><p>Wrote a piece on that and it got picked up by <a href=\"https://golangweekly.com/link/181338/web\">Golang Weekly</a>. You might find the design decisions useful.</p>","contentLength":1003,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"GoDoc Live — Auto-generate interactive API docs from your Go source code","url":"https://www.reddit.com/r/golang/comments/1rhyrnu/godoc_live_autogenerate_interactive_api_docs_from/","date":1772375687,"author":"/u/goddeschunk","guid":504,"unread":true,"content":"<p>I built a CLI tool that statically analyzes your Go HTTP services (chi &amp; gin) and generates beautiful, interactive API documentation — no annotations, no code changes needed.</p><p>It uses  and  to extract routes, path/query params, request/response bodies, and auth patterns (JWT, API key, basic auth) directly from your handlers.</p><p>Also has a watch mode with live reload via SSE:</p><p><code>godoclive watch --serve :8080 ./...</code></p><p>Currently supports chi and gin, with gorilla/mux, echo, and fiber planned. 100% detection accuracy across 37 test endpoints. MIT licensed.</p>","contentLength":546,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Who's Hiring","url":"https://www.reddit.com/r/golang/comments/1rhy0xe/whos_hiring/","date":1772373745,"author":"/u/jerf","guid":505,"unread":true,"content":"<p>Please adhere to the following rules when posting:</p><ul><li>Don't create top-level comments; those are for employers.</li><li>Feel free to reply to top-level comments with on-topic questions.</li><li>Meta-discussion should be reserved for the distinguished mod comment.</li></ul><ul><li>To make a top-level comment you must be hiring directly, or a focused third party recruiter with <strong>specific jobs with named companies</strong> in hand. No recruiter fishing for contacts please.</li><li>The job must be currently open. It is permitted to post in multiple months if the position is still open, especially if you posted towards the end of the previous month.</li><li>The job must involve working with Go on a regular basis, even if not 100% of the time.</li><li>One top-level comment per employer. If you have multiple job openings, please consolidate their descriptions or mention them in replies to your own top-level comment.</li><li>Please base your comment on the following template:</li></ul><p><em>[Company name; ideally link to your company's website or careers page.]</em></p><p><em>[Full time, part time, internship, contract, etc.]</em></p><p><em>[What does your team/company do, and what are you using Go for? How much experience are you seeking and what seniority levels are you hiring for? The more details the better.]</em></p><p><em>[Where are your office or offices located? If your workplace language isn't English-speaking, please specify it.]</em></p><p><em>[Please attempt to provide at least a rough expectation of wages/salary.If you can't state a number for compensation, omit this field. Do not just say \"competitive\". Everyone says their compensation is \"competitive\".If you are listing several positions in the \"Description\" field above, then feel free to include this information inline above, and put \"See above\" in this field.If compensation is expected to be offset by other benefits, then please include that information here as well.]</em></p><p><em>[Do you offer the option of working remotely? If so, do you require employees to live in certain areas or time zones?]</em></p><p><em>[Does your company sponsor visas?]</em></p><p><em>[How can someone get in touch with you?]</em></p>","contentLength":1985,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev","reddit","go"]}