{"id":"VMK7D8tQvwsLtnxKHzNdF9c4Yhtuqm","title":"Hacker News: Best","displayTitle":"HN","url":"https://hnrss.org/best","feedLink":"https://news.ycombinator.com/best","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":30,"items":[{"title":"TikTok goes dark in the US","url":"https://techcrunch.com/2025/01/18/tiktok-goes-dark-in-the-u-s/","date":1737258709,"author":"mfiguiere","guid":201,"unread":true,"content":"<p>TikTok went dark in the U.S. on Saturday night as a result of a federal law that bans the popular short-form video app for millions of Americans. However, <a href=\"https://techcrunch.com/2025/01/19/tiktok-says-is-restoring-service-in-the-us/\">the company began restoring service</a> by midday Sunday.</p><p>TikTok users began receiving a message about the ban around 10:30 p.m. Eastern on Saturday evening, and the app also disappeared from the Apple and Google Play app stores. As of Sunday morning, some users in the U.S.  could still access TikTok via the web.</p><p>“Sorry, TikTok isn’t available right now,” the company’s message reads. “A law banning TikTok has been enacted in the U.S. Unfortunately, that means you can’t use TikTok for now.”</p><p>The message also suggested this might only be a temporary disappearance. TikTok credited President-elect Donald Trump for indicating “he will work with us on a solution to reinstate TikTok once he takes office,” with users urged to “stay tuned!”</p><p>The company warned earlier this week the app’s disappearance was imminent, <a href=\"https://techcrunch.com/2025/01/18/tiktok-says-it-will-go-dark-sunday-unless-biden-offers-definitive-statement/\">saying Friday that it would “go dark”</a> unless President Joe Biden’s administration made a “definitive statement” that it wouldn’t enforce the ban.</p><p>The Supreme Court issued a ruling <a href=\"https://techcrunch.com/2025/01/17/supreme-court-upholds-tiktok-ban/\">upholding the law Friday</a>; and the Biden administration seemed inclined to<a href=\"https://techcrunch.com/2025/01/18/tiktok-says-it-will-go-dark-sunday-unless-biden-offers-definitive-statement/\"> leave the app’s fate in the hands of the next president</a>. White House Press Secretary Karine Jean-Pierre noted that with the law taking effect right before Trump’s inauguration on Monday, “actions to implement the law simply must fall to the next Administration.” Deputy Attorney General Lisa Monaco issued a similar statement that “the next phase of this effort — implementing and ensuring compliance with the law after it goes into effect on January 19 — will be a process that plays out over time.”</p><p>TikTok, however, suggested this was not enough assurance for “critical service providers” to continue listing or hosting the app in the United States unless the Biden administration made the aforementioned “definitive statement.” Jean-Pierre called TikTok’s response “a stunt” and claimed there’s “no reason for TikTok or other companies to take actions in the next few days before the Trump administration takes office on Monday.”</p><p>As for the app’s long-term prospects, Trump has said he plans to “negotiate a resolution” that would presumably involve a sale or other concessions from ByteDance, which has repeatedly said it’s not interested in selling yet <a href=\"https://techcrunch.com/2025/01/17/tiktok-ceo-responds-to-trump-thanks-him-for-trying-to-solve-us-ban/\">seems optimistic about its prospects under Trump</a>. </p><p>Trump <a rel=\"nofollow\" href=\"https://www.nbcnews.com/politics/donald-trump/trump-likely-give-tiktok-90-day-extension-avoid-ban-rcna188258\">reiterated to NBC News</a> on Saturday that he will “most likely” give TikTok a 90-day reprieve from the ban once he takes office Monday.</p><p>“I think that would be, certainly, an option that we look at. The 90-day extension is something that will be most likely done, because it’s appropriate. You know, it’s appropriate. We have to look at it carefully. It’s a very big situation,” Trump told the outlet.</p><p>There was even a report suggesting that the Chinese government was <a href=\"https://techcrunch.com/2025/01/17/tiktok-ceo-responds-to-trump-thanks-him-for-trying-to-solve-us-ban/\">considering a sale to Elon Musk</a> as part of a broader deal with the Trump administration. A TikTok spokesperson called that report “pure fiction.”</p><p><em>This post has been updated to reflect that TikTok is restoring service. It was previously updated to reflect Trump’s statements Sunday morning, as well as the additional apps that have been blocked by the law.</em></p>","contentLength":3346,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42753396"},{"title":"Supreme Court upholds TikTok ban, but Trump might offer lifeline","url":"https://www.cnbc.com/2025/01/17/supreme-court-rules-to-uphold-tiktok-ban.html","date":1737127438,"author":"kjhughes","guid":200,"unread":true,"content":"<div data-test=\"InlineImage\"><div><div><div>Jaap Arriens | Nurphoto | Getty Images</div></div></div></div><div><p>The <a href=\"https://www.cnbc.com/supreme-court-us/\">Supreme Court</a> on Friday upheld the law requiring China-based ByteDance to divest its ownership of TikTok by Sunday or face <a href=\"https://www.cnbc.com/2024/12/06/tiktok-divestment-law-upheld-by-federal-appeals-court.html\">an effective ban</a> of the popular social video app in the U.S.</p><p>ByteDance has so far refused to sell TikTok, meaning many U.S. users could <a href=\"https://www.cnbc.com/2025/01/15/how-vpns-might-allow-americans-to-continue-using-tiktok-.html\">lose access</a> to the app this weekend. The app may still work for those who already have TikTok on their phones, although ByteDance has also threatened to shut the app down.</p><p>In a unanimous decision, the Supreme Court sided with the Biden administration, upholding&nbsp;the Protecting Americans from Foreign Adversary Controlled Applications Act, which President <a href=\"https://www.cnbc.com/joe-biden/\">Joe Biden</a><a href=\"https://www.cnbc.com/2024/04/24/biden-signs-israel-ukraine-tiktok-bill-into-law.html\">signed</a> in April.</p><p>\"There is no doubt that, for more than 170 million Americans, TikTok offers a distinctive and expansive outlet for expression, means of engagement, and source of community,\" the Supreme Court's opinion said. \"But Congress has determined that divestiture is necessary to address its well-supported national security concerns regarding TikTok's data collection practices and relationship with a foreign adversary.\"</p><p>Supreme Court Justices Sonia Sotomayor and Neil Gorsuch wrote concurrences.</p><p><a href=\"https://www.cnbc.com/2024/11/13/trump-victory-may-provide-tiktok-a-lifeline-to-remain-in-the-us.html\">TikTok's fate</a> in the U.S. now lies in the hands of President-elect <a href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a>, &nbsp;who originally favored a TikTok ban during his first administration, but has since flip-flopped on the matter. In December, Trump <a href=\"https://www.supremecourt.gov/DocketPDF/24/24-656/336151/20241227163400981_2024-12-27%20-%20TikTok%20v.%20Garland%20-%20Amicus%20Brief%20of%20President%20Donald%20J.%20Trump.pdf\" target=\"_blank\">asked</a> the Supreme Court to <a href=\"https://www.nbcnews.com/politics/donald-trump/trump-urges-supreme-court-hit-pause-law-ban-tiktok-us-month-rcna185606\" target=\"_blank\">pause the law's implementation</a> and&nbsp;allow his administration \"the opportunity to pursue a political resolution of the questions at issue in the case.\"</p><p>In a post on his social media app Truth Social, Trump wrote that the decision was expected \"and everyone must respect it.\"</p><p>\"My decision on TikTok will be made in the not too distant future, but I must have time to review the situation. Stay tuned!\" Trump wrote.</p><p>Trump began to speak more favorably of TikTok after he<a href=\"https://www.businessinsider.com/trump-tiktok-comments-meeting-with-billionaire-investor-jeff-yass-2024-3\" target=\"_blank\">&nbsp;met in February</a>&nbsp;with billionaire Republican megadonor Jeff Yass. Yass is a major ByteDance investor who also owns a stake in the owner of&nbsp;<a href=\"https://www.cnbc.com/quotes/DJT/\">Truth Social</a>.</p><p>In a video posted on TikTok, Chew thanked Trump \"for his commitment to work with us to find a solution that keeps TikTok available\" in the U.S. He said use of TikTok is a First Amendment right, adding that over 7 million American businesses use it to make money and find customers.</p><p>\"Rest assured, we will do everything in our power to ensure our platform thrives as your online home for limitless creativity and discovery as well as a source of inspiration and joy for years to come,\" he said.  </p></div><div><p>The nation's highest court said in the opinion that while \"data collection and analysis is a common practice in this digital age,\" the sheer size of TikTok and its \"susceptibility to foreign adversary control, together with the vast swaths of sensitive data the platform collects\" poses a national security concern.</p><p>Under the terms of the law, third-party internet service providers such as  and  will be penalized for supporting&nbsp;a ByteDance-owned&nbsp;TikTok after the Jan. 19 deadline.</p><p>If service providers and app store owners comply, consumers will be unable to install the necessary updates that make the app functional.</p><p>Representatives of TikTok did not immediately respond to requests for comment.</p></div><h2>Users look for alternatives</h2><div><p>White House press secretary Karine Jean-Pierre reiterated Biden's support for the law in a statement, saying \"TikTok should remain available to Americans, but simply under American ownership or other ownership that addresses the national security concerns identified by Congress in developing this law.\"</p><p>\"Given the sheer fact of timing, this Administration recognizes that actions to implement the law simply must fall to the next Administration, which takes office on Monday,\" Pierre said.</p><p>Attorney General Merrick Garland and Lisa Monaco, his deputy, said in a release that the decision \"enables the Justice Department to prevent the Chinese government from weaponizing TikTok to undermine America's national security.\"</p><p>Kate Ruane, the director of the Center for Democracy and Technology nonprofit, criticized the ruling, saying in a statement that it \"harms the free expression of hundreds of millions of TikTok users in this country and around the world.\"</p><p>In December, members of the House Select Committee on the Chinese Communist Party <a href=\"https://www.cnbc.com/2024/12/13/apple-google-instructed-by-house-committee-to-prepare-to-dump-tiktok.html\">sent letters</a> to Apple CEO Tim Cook and Google CEO Sundar Pichai, urging the executives to begin preparing to comply with the law.</p></div><div data-test=\"InlineImage\"><div><div><div>Shou Zi Chew, CEO of TikTok, speaks to reporters outside the office of Sen. John Fetterman (D-PA) at the Russell Senate Office Building on March 14, 2024 in Washington, DC.</div><div>Anna Moneymaker | Getty Images</div></div></div></div><div><p>On Jan. 10, the<a href=\"https://www.cnbc.com/2025/01/09/supreme-court-set-to-hear-oral-arguments-on-challenge-to-tiktok-ban.html\"> Supreme Court heard oral arguments</a> from lawyers representing TikTok, content creators and the U.S. government. TikTok's lead lawyer, Noel Francisco, argued that the law violates the First Amendment rights of the app's 170 million American users. U.S. Solicitor General Elizabeth Prelogar argued that the app's alleged ties to the Chinese government pose a national security threat. &nbsp;</p><p>Many TikTok creators have been telling their fans to find them on competing social platforms such as Google's YouTube and  Facebook and Instagram, CNBC <a href=\"https://www.cnbc.com/2025/01/12/tiktok-creators-ask-followers-to-migrate-ahead-of-ban-to-meta-youtube.html\">reported</a>.&nbsp;Additionally, Instagram leaders scheduled meetings after the Jan. 10 Supreme Court hearing to direct workers to prepare for a wave of users if the court upholds the law.</p><p>Chinese social media app and <a href=\"https://www.cnbc.com/2025/01/13/as-tiktok-faces-us-ban-chinasr-rednote-tops-apple-app-store.html\">TikTok look-alike RedNote rose to the top</a> of Apple's app store Monday, indicating that TikTok's millions of users were seeking alternatives.<p>The Chinese government also weighed a </p><a href=\"https://www.cnbc.com/2025/01/13/china-considers-selling-tiktok-us-operations-to-musk-bloomberg-.html\">contingency plan</a> that would have X owner <a href=\"https://www.cnbc.com/elon-musk/\">Elon Musk</a> acquire TikTok's U.S. operations as part of several options intended to keep the app from its effective ban in the U.S., Bloomberg News <a href=\"https://www.bloomberg.com/news/articles/2025-01-14/china-discusses-sale-of-tiktok-us-to-musk-as-one-possible-option\" target=\"_blank\">reported</a> Monday.</p><p>Should ByteDance decide to sell TikTok to a U.S. company or group of investors, potential buyers may have to pay between <a href=\"https://www.cnbc.com/2025/01/15/tiktoks-us-unit-could-be-worth-as-much-as-50-billion-in-a-sale.html\">$40 billion and $50 billion</a>, according to an estimate by CFRA Research Senior Vice President Angelo Zino.</p></div>","contentLength":5982,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42738464"},{"title":"Canon wants us to pay for using our own camera as a webcam","url":"https://romanzipp.com/blog/no-you-cant-use-your-6299-canon-camera-as-a-webcam","date":1737103845,"author":"romanzipp","guid":199,"unread":true,"content":"<p><em>: Thanks for the feedback and suggestions, looks like many of you feel the same way. Reporting done on this article: <a target=\"_blank\" href=\"https://news.ycombinator.com/item?id=42735393\">Hacker News</a>, <a target=\"_blank\" href=\"https://arstechnica.com/gadgets/2025/01/canon-charges-50-per-year-to-use-a-900-camera-as-a-functional-webcam/\">Ars Technica</a>, <a target=\"_blank\" href=\"https://youtu.be/xYLMZuKWLfE\">Louis Rossmann</a>. Also there's now a <a href=\"https://romanzipp.com/rss\">RSS feed</a> if you want to be updated, I've reached to Canon myself.</em></p><p>Companies squeezing every last penny out of their customers is no news. And <a target=\"_blank\" href=\"https://www.digitalcameraworld.com/features/has-canon-stopped-putting-its-customers-first\">Canon</a><a target=\"_blank\" href=\"https://petapixel.com/2024/07/21/canon-doesnt-win-on-price-technology-or-public-opinion/\">is</a><a target=\"_blank\" href=\"https://petapixel.com/2024/08/13/canon-says-its-not-blocking-third-party-batteries-in-the-r5-ii/\">no</a><a target=\"_blank\" href=\"https://petapixel.com/2022/09/06/canon-confirms-its-going-after-lens-makers-for-patent-infringement/\">stranger</a>.</p><p>Last year, I've bought a Canon G5 X II camera which I wanted to use mainly for taking pictures at concerts. For me, it was the perfect match of focal range () and sensor size () for any compact camera I've compared. </p><p>Because I'm only using this camera for a small range of events, it's just collecting dust in the meantime. </p><p>So, why don't <strong>use it as a webcam with my Macbook</strong>?</p><p>Admittedly, it did not cost me the $6300 from the article's title, much closer to $900. Nonetheless, everything I'm describing translates to every other Canon camera model!</p><h2>Problems Problems Problems</h2><p>I've tried this at first in 2024 with macOS 14, which did not work. I <a target=\"_blank\" href=\"https://romanzipp.com/blog/fujifilm-webcam-x-macos-issues\">had similar experience</a> with FUJIFILM's X Webcam software where either the camera will not get recognized by the software or the camera feed will freeze or simply be not available within other apps.</p><p>As of January 2025 with macOS 15 Sequoia, these issues have been resolved for me.</p><p>Well actually, only if you are able to <strong>download the software at all</strong>. Seems like their Microsoft IIS server is having some issues. The following error page will be presented to you, after they asked you for your full legal name and mail address - without which you can not download the software.</p><p>So I've been really excited when I finally found a downloadable file on the Canon webpage which was not blocked by a faulty newsletter grift and saw the live feed of my camera!</p><p>Well the excitement didn't last long since nearly every single setting is disabled if you're using the software without a paying Canon account.</p><p>No brightness adjustments, no color correction, only 720p. Even in the paid version there doesn't seem to be a white balance adjustment setting.</p><p>Canon will happily take your credit card for you to pay a small monthly price of $4.99 per month or even a discounted $49.99 per year!</p><blockquote><p><em>** The 30-day free trial is valued at $4.99 and can be cancelled at any time during the free trial period through your MyCanon Account Dashboard. After the free trial period, your subscription will automatically be rolled over into the annual or monthly non-refundable, auto-renewable subscription selected upon enrollment in the free trial, which can be cancelled at any time through your MyCanon Account Dashboard. The current available subscription plans are $49.99/year or $4.99/month.</em></p></blockquote><p>In a <a target=\"_blank\" href=\"https://www.usa.canon.com/content/dam/canon-assets/product-assets/Cameras/camera-misc-pages/ewu/pdf/How%20to%20Subscribe.pdf\">support document</a>, Canon lists all differences between the free and paid version. So you can be very gladful, they allow you to even connect the camera.</p><p>Software development isn’t free, and I’m happy to pay for software I use regularly. However, Canon is a hardware company, not a software company, and they should—due to the lack of standards—provide software that allows you to use their cameras as intended. Aside from development costs, there’s no justification for a subscription model, particularly from a company earning nearly <a target=\"_blank\" href=\"https://global.canon/en/ir/finance/highlight.html\">$1.9 billion in profit</a>*.</p><p>So Canon will not allow you to use  camera on  computer with  cables the way you intent to without paying for another subscription.</p><p>* In an earlier version of this article I wrote \"$3 billion in profit\"</p>","contentLength":3409,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42735393"},{"title":"Starship Flight 7","url":"https://www.spacex.com/launches/mission/?missionId=starship-flight-7?submit","date":1737062724,"author":"chinathrow","guid":198,"unread":true,"content":"<p>\n        On its flight to the International Space Station, Dragon executes a series of burns that position the vehicle\n        progressively closer to the station before it performs final docking maneuvers, followed by pressurization of\n        the vestibule, hatch opening, and crew ingress.\n      </p><p>\n        On its flight to the International Space Station, Dragon executed a series of burns that positioned the vehicle\n        progressively closer to the station before it performed final docking maneuvers, followed by pressurization of\n        the vestibule, hatch opening, and crew ingress.\n      </p>","contentLength":601,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42731091"},{"title":"David Lynch has died","url":"https://variety.com/2025/film/news/david-lynch-dead-director-blue-velvet-twin-peaks-1236276106/","date":1737051649,"author":"wut42","guid":197,"unread":true,"content":"<p>\n\tDirector-writer <a href=\"https://variety.com/t/david-lynch/\" data-tag=\"david-lynch\">David Lynch</a>, who radicalized American film with with a dark, surrealistic artistic vision in films like “<a href=\"https://variety.com/t/blue-velvet/\" data-tag=\"blue-velvet\">Blue Velvet</a>” and “Mulholland Drive” and network television with “<a href=\"https://variety.com/t/twin-peaks/\" data-tag=\"twin-peaks\">Twin Peaks</a>,” has died. He was 78.</p><p>\n\tLynch revealed in 2024 that he had been diagnosed with emphysema after a lifetime of smoking, and would likely not be able to leave his house to direct any longer. His family announced his death in a <a href=\"https://www.facebook.com/davidlynchofficial/posts/pfbid04LuZED6SrWevszQ1UZoEED6x95znKc7scJxXFL5B1icBKgCiu4T2qYLHsErFNzELl?rdid=581XjlBlb3GqM8zP#\" rel=\"nofollow\" target=\"_blank\">Facebook post</a>, writing, “There’s a big hole in the world now that he’s no longer with us. But, as he would say, ‘Keep your eye on the donut and not on the hole.'”</p><p>\n\tThe “Twin Peaks” TV show and films such as “Blue Velvet,” “Lost Highway” and “Mulholland Drive” melded elements of horror, film noir, the whodunit and classical European surrealism. Lynch wove tales, not unlike those of his Spanish predecessor Luis Bunuel, which proceeded with their own impenetrable logic.\n\n\t</p><p>\n\tA four-time Oscar nominee, Lynch received an honorary Oscar for lifetime achievement in 2020.</p><p>\n\tAfter years spent as a painter and a maker of short animated and live action films, Lynch burst onto the scene with his 1977 feature debut “Eraserhead,” a horrific, black-humored work that became a disturbing fixture on the midnight movie circuit. His outré and uncompromising style quickly won the attention of the Hollywood and international movie-making establishment.</p><p>\n\tHe was hired by Mel Brooks’ production company to write and direct “The Elephant Man,” a deeply affecting drama about a horrifically deformed sideshow freak in Victorian England who became a national celebrity. The feature captured eight Academy Award nominations, including Lynch’s first for best director.</p><p>\n\tHe found less success with his 1984 adaptation of Frank Herbert’s sprawling science fiction novel “Dune.” The production, made on a budget of $40 million during an arduous three-year shoot, was a colossal box office flop.</p><p>\n\tHowever, Lynch rebounded from the disaster with two films that defined his mature style: “Blue Velvet” (1986), a frightening hellride through the psychosexual underbelly of a small American town, and the sexed-up, violent road movie “Wild at Heart” (1990), which was honored with the Cannes Film Festival’s Palme d’Or.</p><p>\n\tIn 1990, he revolutionized American episodic TV with “Twin Peaks,” a series he created with writer Mark Frost. With action springing from the investigation of a high school girl’s mysterious murder in a Washington lumber mill town, the weekly ABC show plumbed disquieting, theretofore taboo subject matter and made the inexplicable a fixture of modern narrative television.\n\n\t</p><p>\n\tA major hit in its first season, “Twin Peaks” lost its momentum and ultimately its audience in year two. However, it spawned a feature-length prequel, 1992’s over-the-top “Twin Peaks: Fire Walk With Me”; 25 years later, the ongoing affection of a loyal cult of viewers sparked a limited-run third season for Showtime that picked up where the second season left off.</p><p>\n\tLater in his career, in such features as “Lost Highway” (1997), “Mulholland Drive” (which won him the best director award at Cannes in 2001) and “Inland Empire” (2006), Lynch flexed a super-heated style that pivoted on plots emphasizing doubled personalities, unexplained transformations and shocking acts of violence. The quiet yet quirky “The Straight Story” (1999) harkened back to the more reserved emotional pull of “The Elephant Man.”</p><p>\n\tThe director himself was consistently reticent about sorting the meaning of his work for his viewers. In the book-length collection of interviews “Lynch On Lynch” (2005), he addressed the enigmatic core of his work with writer Chris Rodley.</p><p>\n\t“Well,” Lynch said, “imagine if you did find a book of riddles, and you could start unraveling them, but they were really complicated. Mysteries would become apparent and thrill you. We all find this book of riddles and it’s just what’s going on. And you can figure them out. The problem is, you figure them out inside yourself, and even if you told somebody, they wouldn’t believe you or understand it in the same way you do.”</p><p>\n\tIn addition to his honorary Oscar, Lynch’s one-of-a-kind career was acknowledged by a special award (shared with his frequent star Laura Dern) at the 2007 Independent Spirit Awards and a Golden Lion at the 2006 Venice Film Festival.</p><p>\n\tHe was born Jan. 20, 1946, in Missoula, Montana. His father was a research scientist for the Department of Agriculture, and his peripatetic family lived in the plains states, the Pacific Northwest and the Southeast before settling in Alexandria, Virginia, where Lynch attended high school.</p><p>\n\tAn indifferent student, Lynch focused on painting. A one-year stay at the School of the Museum of Fine Arts in Boston and an abortive trip to Europe with his friend Jack Fisk (later a noted Hollywood production designer) were succeeded by his enrollment at Philadelphia’s Pennsylvania Academy of Fine Arts in 1965.\n\n\t</p><p>\n\tLiving in a forbidding Philly neighborhood with his first wife and infant daughter Jennifer (later a director herself), Lynch began to dabble in film, directing the animated shorts “Six Men Getting Sick (Six Times)” and “The Alphabet” (1968).</p><p>\n\t“The Grandmother” (1970), a combination of animation and live action, was filmed with money obtained from a grant by the newly founded American Film Institute. In 1971, Lynch moved to Los Angeles to study filmmaking at the AFI’s Conservatory for Advanced Film Studies, headquartered in the former Doheny mansion in Beverly Hills.</p><p>\n\tBeginning in 1972, Lynch began work on a feature at the AFI. Inspired by his bleak years as a print engraver and struggling artist in Philadelphia, a 21-page initial script began to take shape; Lynch would later say he had no memory of writing it. Over the course of the next five years, he made the film with several collaborators who would remain constants in his career, including sound designer Alan Splet, cinematographer Frederick Elmes and actor Jack Nance.</p><p>\n\tShot laboriously, cheaply and on the fly for five years, “Eraserhead” was released by indie distributor Libra Films International in 1977. The disquieting black-and-white film followed the psychological descent of its maladroit hero Henry Spencer (Nance) after the birth of his monstrously malformed baby.</p><p>\n\tCritics were decidedly alarmed by the picture when it premiered at L.A.’s Filmex in 1977, but it took on a commercial life of its own when Libra opened the picture at midnight screenings in New York, San Francisco and Los Angeles. Lynch would frequently appear at L.A. screenings, admonishing his mystified audiences, “Don’t ask about the baby.”</p><p>\n\tOne enthusiastic viewer at a midnight show at L.A.’s Nuart Theatre was Stuart Cornfeld, a producer at Mel Brooks’ Brooksfilms. He urged Brooks to employ Lynch, and, after viewing “Eraserhead,” Brooks offered the director a job.</p><p>\n\tFor his project, Lynch took on the story of John Merrick, whose sensational life story had already inspired Bernard Pomerance’s hit 1977 play. The film version of “The Elephant Man” was an entirely new enterprise, co-written by Lynch and starring a heavily made-up John Hurt as the sensitive Merrick, Anthony Hopkins as the London Hospital surgeon who became his guardian, and Brooks’ wife Anne Bancroft as a sympathetic West End stage star.\n\n\t</p><p>\n\t“The Elephant Man” had a powerful emotional impact, and became a box office and critical hit; Lynch received Oscar nods as best director and for best adapted screenplay, with the film also taking a nomination for best picture. The triumph led to a multiple-picture deal with Dino Di Laurentiis.</p><p>\n\tThe sprawling space opera “Dune,” about galactic family dynasties warring over possession of a space-travel “spice” mined on a desert planet, had already defeated projected adaptations by Alejandro Jodorowsky and Ridley Scott when Lynch took on the material.</p><p>\n\tFilmed laboriously on Mexican soundstages with an enormous international cast, “Dune” sported an unusual Flash Gordon-meets-Antonio Gaudi production design, a memorable gallery of demented Lynchian villains and the director’s trademark amniotic visuals.</p><p>\n\tThe picture satisfied no one: Both audiences attuned to the boisterous heroics of “Star Wars” and impatient critics rejected Lynch’s contorted, confusing and harshly digested reading of Herbert’s novel, and the film tanked on arrival. Lynch later told Chris Rodley that at the conclusion of the ordeal, “I was almost dead. Almost dead!”</p><p>\n\tHowever, Lynch’s second film for De Laurentiis defined the contours of his mature style. “Blue Velvet” starred Kyle McLachlan, who had played the messianic hero of “Dune,” as a small-town boy who is plunged into a whirlpool of sexual violence, murder and sadomasochism.</p><p>\n\tFeaturing a potent cast that included Isabella Rossellini (with whom Lynch became involved romantically), Laura Dern, Dean Stockwell and, most notably, Dennis Hopper as its deranged, out-of-control villain, “Blue Velvet” polarized critics, but it cemented Lynch’s reputation as a fearless and daring film author. The film was the start of his collaboration with composer Angelo Badalamenti.</p><p>\n\tFour years later, the Lynch style was brought to the small screen with “Twin Peaks.” Starring McLachlan as eccentric FBI agent Dale Cooper, the series used the investigation of the murder of homecoming queen Laura Palmer as a springboard into a swirling narrative vortex involving sexual intrigue, drug addiction, prostitution, madness and demonic possession. TV audiences tuned in to track the mystery and remained for the series’ complexly interwoven characters and perverse, at times supernatural plot twists.\n\n\t</p><p>\n\tThe show’s first season scored 14 Emmy nominations, including nods for Lynch for writing and directing the pilot, but declining ratings after the drawn-out revelation of Palmer’s killer and Lynch’s diminishing participation due to production of a new feature led to a cliffhanging wrap-up at the end of season two.</p><p>\n\tHowever, the “Twin Peaks” saga had legs. Actress Sheryl Lee was brought back from the dead to play Laura Palmer in “Twin Peaks: Fire Walk With Me,” which tracked the fateful last week of Palmer’s life in lurid, screaming detail. And Showtime cable audiences were baffled anew by 2017’s much-belated third season, which reunited McLachlan and several members of the original cast.</p><p>\n\tThe truest legacy of “Twin Peaks” may have been its impact on the development of unusual long-form episodic series. Successors ranging from “Wild Palms” to “True Detective” all bore Lynch’s distinctive stylistic fingerprints.</p><p>\n\tLynch’s first feature after “Twin Peaks,” 1990’s “Wild at Heart,” was an oddball exodus, based on a novel by Barry Gifford, in which an Elvis-fixated ex-con (Nicolas Cage) and his hot-to-trot girlfriend (Laura Dern) are pursued by the murderous minions of the girl’s jealous mother (Dern’s own mother Diane Ladd). Domestic reaction was mixed to the gory, sexually frank mix of “Detour” and “The Wizard of Oz,” but the Cannes jury was wowed.</p><p>\n\tLynch’s association with Gifford continued with “Lost Highway,” for which the two collaborated on an original screenplay. A doppelganger murder mystery that foreshadowed “Mulholland Drive,” the disquieting, brutally effective thriller starred Bill Pullman, Balthazar Getty and Patricia Arquette as the players in a homicidal foursome.</p><p>\n\tAfter spending most of the decade on the far side of narrative coherence, Lynch came back down to earth with “The Straight Story,” the first feature in which he took no hand in writing. In the incongruously Disney-distributed picture, based on a true story, Richard Farnsworth starred as an Iowa man who drives from Iowa to Wisconsin on a power mower to visit his seriously ill brother.</p><p>\n\tThough not a major hit, the film was critically well received, and proved to Lynch’s naysayers that he was capable of bringing life to material that was not extravagantly outrageous. Farnsworth received an Oscar nomination for his performance; the veteran actor and stunt man, who was suffering from terminal prostate cancer during the production of the film, died by suicide in 2000.\n\n\t</p><p>\n\tAn enlarged version of a prospective pilot for a new TV series became what may have been Lynch’s most widely acclaimed film, and a defining summation of the filmmaker’s themes and narrative obsessions.</p><p>\n\t“Mulholland Drive” served a darkly satirical comment on the ways of Hollywood in the story of a young actress (Naomi Watts) whose relationship with an amnesiac stranger (Laura Elena Harring) becomes a hall-of-mirrors story of manipulation, betrayal and suicide. Lynch was nominated for a 2002 best director Oscar.</p><p>\n\tSome of the same themes came to the fore in “Inland Empire,” Lynch’s first film to be shot entirely on digital video, with Laura Dern starring as an on-the-skids actress involved in typical Lynchian psychic disorder. Owing to its format, still a relative rarity theatrically in 2007, the three-hour feature was little seen after its 2007 premiere at the Venice Film Festival.</p><p>\n\tIn 2022, he appeared as John Ford in Steven Spielberg’s “The Fablemans,” and also provided the voice of the mad scientist in “Robot Chicken.”</p><p>\n\tBeyond his work in film and TV, Lynch exhibited his paintings internationally and issued many solo and collaborative albums of music. He contributed a weekly comic strip, “The Angriest Dog in the World,” to the alternative weekly the Los Angeles Reader for eight years. His wry, deadpan weather reports were aired daily on the L.A. rock station Indie 103.1 for several years and continued on social media.</p><p>\n\tA devotee of transcendental meditation from the 1970s on, he established his David Lynch Foundation to promote the Eastern practice, and enlisted such stars as Paul McCartney, Ringo Starr and Donovan for fund-raising concerts.</p><p>\n\tDespite persistent rumors of new feature and TV projects after “Twin Peaks” came to an end in 2017, Lynch focused on making music videos and composing music with collaborators including Christabell. He offered his name to the David Lynch Graduate School of Cinematic Arts at Maharishi University and a line of coffee beans and designed Silencio nightclubs in Paris and New York. </p><p>\n\tLynch was married four times. He is survived by two daughters and two sons.</p><p>\n\tThe first reference to David Lynch in  came in the Dec. 6, 1968, edition of , in a story noting that he had received a $5,000 grant from the American Film Institute for his short film “The Grandmother.” </p>","contentLength":14762,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42728862"},{"title":"No Calls","url":"https://keygen.sh/blog/no-calls/","date":1737037051,"author":"ezekg","guid":196,"unread":true,"content":"<p>When I first started Keygen, I had this idea in my head that I could create a\ncompany where I never had to get on a sales call — or any call. Being an\nintrovert, I absolutely hated calls. They're not only awkward, but a 30 minute\ncall takes up hours of my headspace. I quickly learned that I didn't want to\ndo them, and so I decided that I wouldn't.</p><p>I instituted a bonkers  policy at work.</p><p>(Even I thought I was being crazy.)</p><p>However, as Keygen grew, I wanted to start to move more up-market. I wanted\nlarger customers, because the bigger a customer got, the less support they\ntypically needed, and of course, the more they paid me. And the bigger\nlogos help gain trust in a market.</p><p>The first thing I tried was taking sales calls. I threw up a big \nbutton on my enterprise pricing page — but I obviously hated it.</p><p>(What about for non-enterprise leads? Well, I can't justify a call for $49/mo,\nI'll tell you that much, especially when they may not buy.)</p><p>I felt like I was wasting my time, the lead's time, and I could never close a\nsale. It felt awkward. I tried for months. I never felt prepared. I felt like\nI was constantly talking to the wrong people, slowly climbing the ladder to an\nactual stakeholder, repeating myself over and over every call — and then\nrepeating myself  in a summary email.</p><p><em>\"Couldn't this have all been an email?\"</em></p><p>(Yes, it could — and should — have been.)</p><p><em>\"This would be easier if it was async so I could think about my answer.\"</em></p><p><em>\"This person isn't somebody that has the authority to even close.\"</em></p><p><em>\"Is this person even involved in the project?\"</em></p><p><em>\"How do I talk to engineering?\"</em></p><p><em>\"Why am I talking to this person again?\"</em></p><p>One day, I woke up and out of frustration, I nuked the  button\nfrom my pricing page.</p><p>When the next person asked for a call, I responded with a simple <em>\"No, we don't\ndo calls, but happy to help via email. Feel free to CC any relevant team\nmembers onto this thread.\"</em></p><p>Their response was surprising. They  what I suggested — they CC'd\nthe engineering department onto the email, they asked their questions, and we\nstarted chatting integration strategies.</p><p>Instead of speaking with somebody who was multiple positions removed from the\nproject, I was speaking with the actual people who could champion Keygen within\nthe organization — the people who're directly involved — </p><p>I thought to myself, <em>\"did I just bypass all of the red tape?\"</em></p><p>That month, I closed my first enterprise sale.</p><p>Nearly everybody I sent that to  to skip the calls too. (I've even had\npeople <em>literally say that to me in their response!</em>)</p><p>Sometimes, it didn't work out, and that's okay. I don't expect Keygen to be a\nfit for everybody; and not everybody is a fit for Keygen.</p><p>Am I leaving money on the table?</p><p>But I personally don't  like I am. I feel like I get to wake up every\nmorning and do the kind of work that I love to do. And I feel like I have\nthe freedom to avoid the type of work that I hate to do.</p><p>I think about it like this: I don't provide white-glove integration or\nconsulting services, even though I might be able to earn more money if\nI did. (And lots of people ask for it!)</p><p>But that's not what I want to do. That's not why I built Keygen.</p><p>In the same way, I don't want to do calls.</p><p>So, in enterprise sales, why do calls happen? Enterprises often default to\ncalls for these 4 totally-solvable reasons:</p><ol><li>They don't understand what you offer.</li><li>They don't know how to use it.</li><li>They don't know your price.</li></ol><p>If you want to try , you need to solve these problems.</p><h4>1. They don't understand what you offer</h4><p>This comes down to messaging. If your messaging is vague, people will need to\nget on a call to understand what you actually offer. If your product offering\nis too wide (i.e. <a href=\"https://keygen.sh/blog/good-saas-products-are-like-unix-tools/\">you do too much</a>), people will feel like\nthey need to get on a call just to understand if your product is a good fit\nfor their much more narrow use-case.</p><p>But if you narrow down your focus, and really nail your messaging — make it\nclear what you actually do — you can eliminate the question entirely. Drop the\n taglines and actually sell the product. (And now, it\nmight be easier to see  some companies use these taglines — it's like\na sales call siren song!)</p><h4>2. They don't know how to use it</h4><p>If your product isn't self-serve, and if your onboarding sucks, people will\nfeel like have they to book a call in order to get started.</p><p>If you don't provide enough information on your website to scope a POC or an\nintegration, they're going to need to somehow obtain that information. And\nthat typically requires a call.</p><p>e.g. if you don't have public documentation, you guessed it — call.</p><p>(And why would you not have public documentation?)</p><h4>3. They don't know your price</h4><p>Price is the big one. Enterprises are used to the dance. You book a call, size\neach other up, and then come up with a b.s. price. It's all so tiring. And if\nyou want to skip calls, you have to dip out of the dance.</p><p>You can do this by putting enterprise pricing up front and center. I don't care\nhow large the number is — put it on your pricing page. If you feel like you're\ngiving up too much money, maybe  isn't for you.</p><p>When somebody asks for a call to discuss pricing, all you have to do is say\nsomething simple like, <em>\"Our enterprise pricing is available here. Let me\nknow if you have any questions.\"</em></p><p>Last, but most certainly not least, is trust. If an enterprise doesn't trust\nyou, they will not buy from you —  How do you gain trust? Well, first\noff, <a href=\"https://keygen.sh/blog/dont-die/\">don't die</a>. Trust is a function of time — i.e. the longer you\nexist, the more people will trust that you'll continue to exist.</p><p>But there are other facets of trust as well, and enterprises will send you huge\ntime-consuming questionnaires to alleviate all of their concerns. They might\neven want to jump on a call. All they're trying to do is be compliant, and you\ncan help them be compliant without calls.</p><p>You can do that by clearly articulating how your company handles data, how you\nhandle security, and how you handle incidents. I'm sure SOC2, HIPAA, and PCI\ncertifications would help, too, but we don't hold those yet (but our\ninfrastructure providers do).</p><p>(At Keygen, we have a <a href=\"https://keygen.sh/security/\">security</a> page that outlines all of this, and\nessentially answers the questions that are in most security questionnaires\nwe've seen.)</p><p>It may be controversial (I'm almost sure of it), but here's my philosophy on\nenterprise sales while avoiding sales calls entirely:</p><ul><li>No sales calls, except for a short  if absolutely needed.\nDiscovery calls are just a formality.</li><li>Use email. Ask leads to CC relevant teammates (e.g. engineering).</li><li>Explain your value clearly. Don't muddy the waters by doing too much. Avoid\nvague messaging that prompts more questions.</li><li>Focus on security, and spell it out in public docs.</li><li>Document every problem to avoid repeating answers (i.e. allow them to easily\nfind the answers themselves).</li><li>Use fixed- or transparent-pricing. (If you like calls, ignore this.)</li><li>Make onboarding self-serve.</li></ul><p>I'm sure some people will scoff at some or all of this, but maybe others who are\nlike myself will read this and realize they don't have to do sales like everybody\nelse. Enterprise sales don't have to be crazy.</p><p>If you want to go , maybe try out some of the things above.</p><p>If you want to do calls, do the opposite of all of these things.</p><p><small> some readers have (rightfully) <a href=\"https://news.ycombinator.com/item?id=42725385\">pointed out</a> that we do indeed have\n  a  button on our enterprise pricing page, and so there seems to\n  be a disconnect. I've been practicing a strict  philosophy for years\n  and years and years, and the  button being back is relatively\n  new.</small></p><small><p>  I briefly touched on this in the conclusion, but this call is a short 15 min\n  ,  a sales call. It's essentially a formality to intro\n  each other, make sure we're human, and move onto email for any further\n  discussion. There is no further call.</p><p>  Essentially, over the years of strictly , I discovered that not all\n  enterprises will shoot you a cold email to start the conversation, so this\n  call is to capture those leads, with the end-goal of having all real\n  discussion in email.</p><p>  The point of  is to dip out of the dance, not of all communication.</p><p>  tl;dr: some enterprises will bounce if they don't see a  button.</p></small>","contentLength":8086,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42725385"},{"title":"Nepenthes is a tarpit to catch AI web crawlers","url":"https://zadzmo.org/code/nepenthes/","date":1737035863,"author":"blendergeek","guid":195,"unread":true,"content":"<p>This is a tarpit intended to catch web crawlers. Specifically, it's targetting crawlers that scrape data\nfor LLM's - but really, like the plants it is named after, it'll eat just about anything that finds it's\nway inside.</p><p>It works by generating an endless sequences of pages, each of which with dozens of links, that simply go\nback into a the tarpit. Pages are randomly generated, but in a deterministic way, causing them to appear\nto be flat files that never change. Intentional delay is added to prevent crawlers from bogging down your\nserver, in addition to wasting their time. Lastly, optional Markov-babble can be added to the pages, to\ngive the crawlers something to scrape up and train their LLMs on, hopefully accelerating model collapse.</p><p>THIS IS DELIBERATELY MALICIOUS SOFTWARE INTENDED TO CAUSE HARMFUL ACTIVITY.\nDO NOT DEPLOY IF YOU AREN'T FULLY COMFORTABLE WITH WHAT YOU ARE DOING.</p><p>LLM scrapers are relentless and brutual. You may be able to keep them at bay\nwith this software - but it works by providing them with a neverending stream\nof exactly what they are looking for. YOU ARE LIKELY TO EXPERIENCE SIGNIFICANT\nCONTINUOUS CPU LOAD, ESPECIALLY WITH THE MARKOV MODULE ENABLED.</p><p>There is not currently a way to differentiate between web crawlers that\nare indexing sites for search purposes, vs crawlers that are training\nAI models. ANY SITE THIS SOFTWARE IS APPLIED TO WILL LIKELY DISAPPEAR\nFROM ALL SEARCH RESULTS.</p><p>Expected usage is to hide the tarpit behind nginx or Apache, or whatever else you have implemented your\nsite in. Directly exposing it to the internet is ill advised. We want it to look as innocent and normal\nas possible; in addition HTTP headers are used to configure the tarpit.</p><p>I'll be using nginx configurations for examples. Here's a real world snippet for the demo above:</p><pre><code>    location /nepenthes-demo/ {\n            proxy_pass http://localhost:8893;\n            proxy_set_header X-Prefix '/nepenthes-demo';\n            proxy_set_header X-Forwarded-For $remote_addr;\n            proxy_buffering off;\n    }\n</code></pre><p>You'll see several headers are added here: \"X-Prefix\" tells the tarpit that all links should go to that\npath. Make this match what is in the 'location' directive. X-Forwarded-For is optional, but will make any\nstatistics gathered significantly more useful.</p><p>The proxy_buffering directive is important. LLM crawlers typically disconnect if not given a response within\na few seconds; Nepenthes counters this by drip-feeding a few bytes at a time. Buffering breaks this workaround.</p><p>You can have multiple proxies to an individual Nepenthes instance; simply set the X-Prefix header accordingly.</p><p>You can use Docker, or install manually.</p><p>A Dockerfile and compose.yaml is provided in the <a href=\"https://svn.zadzmo.org/repo/nepenthes/head/docker/\">/docker directory.</a>\nSimply tweak the configuration file to your preferences, 'docker compose up'. You will still need to bootstrap\na Markov corpus if you enable the feature (see next section.)</p><p>For Manual installation, you'll need to install Lua (5.4 preferred), SQLite (if using Markov), and OpenSSL.\nThe following Lua modules need to be installed - if they are all present in your package manager, use that;\notherwise you will need to install <a href=\"https://luarocks.org/\">Luarocks</a> and use it to install the following:</p><p>Create a nepenthes user (you REALLY don't want this running as root.) Let's assume the user's home\ndirectory is also your install directory.</p><pre><code>cd scratch/\ntar -xvzf nepenthes-1.0.tar.gz\n    cp -r nepenthes-1.0/* /home/nepenthes/\n</code></pre><p>Tweak config.yml as you prefer (see below for documentation.) Then you're\nready to start:</p><pre><code>    su -l -u nepenthes /home/nepenthes/nepenthes /home/nepenthes/config.yml\n</code></pre><p>Sending SIGTERM or SIGINT will shut the process down.</p><h2>Bootstrapping the Markov Babbler</h2><p>The Markov feature requires a trained corpus to babble from. One was intentionally omitted because, ideally,\neveryone's tarpits should look different to evade detection. Find a source of text in whatever language you\nprefer; there's lots of research corpuses out there, or possibly pull in some very long Wikipedia articles,\nmaybe grab some books from Project Gutenberg, the Unix fortune file, it really doesn't matter at all. Be creative!</p><p>Training is accomplished by sending data to a POST endpoint. This only needs to be done once. Sending training\ndata more than once cumulatively adds to the existing corpus, allowing you to mix different texts - or train in\nchunks.</p><p>Once you have your body of text, assuming it's called corpus.txt, in your working directory, and you're running\nwith the default port:</p><pre><code>curl -XPOST -d ./@corpus.txt -H'Content-type: text/plain' http://localhost:8893/train\n</code></pre><p>This could take a very, VERY long time - possibly hours. curl may potentially time out. See\n<a href=\"https://svn.zadzmo.org/repo/nepenthes/head/load.sh\">load.sh</a> in the nepenthes distribution for a script that\nincrementally loads training data.</p><p>The Markov module returns an empt string if there is no corpus. Thus, the tarpit will continue to function\nas a tarpit without a corpus loaded. The extra CPU consumed for this check is almost nothing.</p><p>Want to see what prey you've caught? There are several statistics endpoints, all returning JSON. To see everything:</p><pre><code>http://{http_host:http_port}/stats\n</code></pre><p>To see user agent strings only:</p><pre><code>http://{http_host:http_port}/stats/agents\n</code></pre><p>Or IP addresses only:\n3\nhttp://{http_host:http_port}/stats/ips/</p><p>These can get quite big; so it's possible to filter both 'agents' and 'ips', simply add a minimum hit count to the\nURL. For example, to see a list of all IPs that have visted more than 100 times:</p><pre><code>http://{http_host:http_port}/stats/ips/100\n</code></pre><p>Simply curl the URLs, pipe into 'jq' to pretty-print as desired. Script away!</p><h2>Nepenthes used Defensively</h2><p>A link to a Nepenthes location from your site will flood out valid URLs\nwithin your site's domain name, making it unlikely the crawler will access\nreal content.</p><p>In addition, the aggregated statistics will provide a list of IP addresses\nthat are almost certainly crawlers and not real users. Use this list to\ncreate ACLs that block those IPs from reaching your content - either return\n403, 404, or just block at the firewall level.</p><p>Integration with fail2ban or blocklistd (or similar) is a future possibility,\nallowing realtime reactions to crawlers, but not currently implemented.</p><p>Using Nepenthes defensively, it would be ideal to turn off the Markov\nmodule, and set both max_delay and min_delay to something large, as a\nway to conserve your CPU.</p><h2>Nepenthes used Offensively</h2><p>Let's say you've got horsepower and bandwidth to burn, and just want to\nsee these AI models burn. Nepenthes has what you need:</p><p>Don't make any attempt to block crawlers with the IP stats. Put the delay\ntimes as low as you are comfortable with. Train a big Markov corpus and\nleave the Markov module enabled, set the maximum babble size to something\nbig. In short, let them suck down as much bullshit as they have diskspace\nfor and choke on it.</p><p>All possible directives in config.yaml:</p><ul><li>http_host : sets the host that Nepenthes will listen on; default is localhost only.</li><li>http_port : sets the listening port number; default 8893</li><li>prefix: Prefix all generated links should be given. Can be overriden with the X-Prefix HTTP header. Defaults to nothing.</li><li>templates: Path to the template files. This should be the '/templates' directory inside your Nepenthes installation.</li><li>detach: If true, Nepenthes will fork into the background and redirect logging output to Syslog.</li><li>pidfile: Path to drop a pid file after daemonization. If empty, no pid file is created.</li><li>max_wait: Longest amount of delay to add to every request. Increase to slow down crawlers; too slow they might not come back.</li><li>min_wait: The smallest amount of delay to add to every request. A random value is chosen between max_wait and min_wait.</li><li>real_ip_header: Changes the name of the X-Forwarded-For header that communicates the actual client IP address for statistics gathering.</li><li>prefix_header: Changes the name of the X-Prefix header that overrides the prefix configuration variable.</li><li>forget_time: length of time, in seconds, that a given user-agent can go missing before being deleted from the statistics table.</li><li>forget_hits: A user-agent that generates more than this number of requests will not be deleted from the statistics table.</li><li>persist_stats: A path to write a JSON file to, that allows statistics to survive across crashes/restarts, etc</li><li>seed_file: Specifies location of persistent unique instance identifier. This allows two instances with the same corpus to have different looking tarpits.</li><li>words: path to a dictionary file, usually '/usr/share/dict/words', but could vary depending on your OS.</li><li>markov: Path to a SQLite database containing a Markov corpus. If not specified, the Markov feature is disabled.</li><li>markov_min: Minimum number of words to babble on a page.</li><li>markov_max: Maximum number of words to babble on a page. Very large values can cause serious CPU load.</li></ul><p>Version numbers use a simple process: If the only changes are fully backwards\ncompatible, the minor number changes. If the user/administrator needs to change\nanything after or part of the upgrade, the major number changes and the minor\nnumber resets to zero.</p>","contentLength":8996,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42725147"},{"title":"Nintendo announces the Switch 2 [video]","url":"https://www.youtube.com/watch?v=itpcsQQvgAQ","date":1737032894,"author":"HelloUsername","guid":194,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42724621"},{"title":"I ditched the algorithm for RSS","url":"https://joeyehand.com/blog/2025/01/15/i-ditched-the-algorithm-for-rssand-you-should-too/","date":1737029912,"author":"DearNarwhal","guid":193,"unread":true,"content":"<p>I waste too much time scrolling through social media.  It's bad for my health, so why do I keep doing it?  </p><p>Because once in a while, I'll find a post so good that it teaches me something I never knew before, and all the scrolling feels worth it.\nBut I've stumbled upon an old piece of free and open source tech, relatively unknown today, which is THE solution of solving the problems with modern media without sacrificing accessible, good content: RSS. </p><p>Reddit, Facebook, Twitter — platforms built for engagement, not efficiency. Instead of showing you high-quality posts upfront, they pad your feed with memes, spam, and astroturfing. There is only so much 'good' content created in a day. By padding your feed with trash, they make the limited amount of good posts \"last longer\". \nThese sites want you to spend more time scrolling on their website, so they feed you scraps which makes the occasional great post feels like a jackpot.\nThis concept, operant conditioning, was developed by B.F. Skinner — Yes, the mind behind the <a href=\"https://www.simplypsychology.org/what-is-a-skinner-box.html\">Skinnerbox</a>.</p><p>While some sites offer filtering or sorting options, manually settings these options every time you want to access a subreddit is just not doable.  </p><p>You could, of course, stop consuming content from these websites. However, this would mean potentially missing really good content; content you'd learn from, interesting ideas, and more.\nBut it doesn't have to be this way. You can reclaim your attention span while still having access to the same quality content as before.  </p><p>RSS is like your youtube subscription feed in hyperdrive. Subscribe to sites you love and decide what shows up — no exploitative social media algorithm needed. No more ads or algorithms deciding how to keep you doomscrolling. This 1999 tech actually solves a lot of 2025 problems.\nHere's the kicker: Most websites, even social media, quietly support RSS feeds.</p><p>You can filter out keywords, set minimum upvotes or like counts, and much more! Modern RSS clients allow you to make filters using <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_expressions\">Regex</a>, and there are a  of software and services you can use to tune up your filtering to 11.</p><p>TL;DR: Never see noise, and never miss hidden gems again!</p><p>But how do you get started with RSS? It's easier than you think!</p><p>I personally <a href=\"https://en.wikipedia.org/wiki/Self-hosting_(web_services)\">self-host</a> an open source RSS reader: <a href=\"https://tt-rss.org/\">Tiny Tiny RSS</a>\nIf you don't want to host it yourself, you can google for companies offering easy and accessible RSS readers.</p><p>To make it easier, let's differentiate between three levels of ease when it comes to adding a website to RSS: Easy, medium, and hard.\nI'll be going over how to add several popular sites to your feed.</p><p>Want a youtube channel in your RSS feed? Just copy the channel's URL and subscribe to it in your reader. Done.</p><p>If you like games, you might want to subscribe to <a href=\"https://ign.com\">IGN</a>. There's no clear RSS button, so the best course of action would be to google \"IGN RSS\".</p><p>This leads to a nice <a href=\"https://corp.ign.com/feeds\">IGN RSS Feeds</a> page with multiple categorized feeds for you to pick from. If you wanted to subscribe to \"Game Articles\", you'd right-click on the game articles link, press \"copy link\", go to your RSS reader of choice and subscribe to the link you copied.  </p><p>Now all IGN Game Articles will show up in your RSS feed as they are published!</p><div><p>Some websites don't have a dedicated RSS button, but still support RSS. You can discover their RSS urls by adding .rss, atom.xml, feed, etc. at the end of the site's URL, for example <code>https://website.com/atom.xml</code>. Almost all RSS readers support Atom feeds. For more examples, check <a href=\"https://www.reddit.com/r/rss/comments/12782um/comment/jee0lpx/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button\">this</a> Reddit comment.</p></div><p>Some sites like HackerNews have RSS support. However, this RSS can be extremely limited if you want to filter posts so your feed isn't spammed by low effort content. Some people are nice enough to set up a \"middleman\" between your RSS feed and the website, so you can pull the RSS feed through the middleman while doing actions like filtering it.</p><p>For example, if you wanted to subscribe to HackerNews but filter out low upvote count posts, you could subscribe to <a href=\"https://hnrss.github.io/\">HNRSS</a> instead of through HN directly. For example, I filter out posts below 150 upvotes by to this url: <code>https://hnrss.org/newest?points=150</code>\nSometimes these services open-source their code so you can <a href=\"https://github.com/hnrss/hnrss\">self-host</a> the 'middleman'.</p><div><p>When removing the optional search term from a reddit search URL, don't forget to remove the \nWhen removing the sort options\nIf adding more search terms, add a + between them!</p></div><p>I love managing my homelab. I follow <a href=\"https://www.reddit.com/r/homelab/\">/r/homelab</a>. Some posts are really good and teach me a lot.\nHowever, there's a lot of noise posted to that subreddit; I do not want to see memes, and pictures of people's hardware setup gets boring quick. I'm interested in hidden gems, threads where a lot of interesting info is explained, things I can really learn a lot from.</p><h4>Step 1: Filter out picture posts.</h4><p>Reddit hack: Filter out picture posts by searching for 'self:true' in a subreddit. Bonus: You can subscribe to that specific search query as a RSS feed for text posts only.</p><p>So instead of subscribing to a subreddit's RSS directly, you do a search for posts in that subreddit and then subscribe to  RSS feed.\nThe RSS link you should subscribe to should look someting like this:\n<code>https://www.reddit.com/r/homelab/search.rss?q=self%3Atrue&amp;restrict_sr=on</code>\nYou can change 'homelab' to your subreddit of choice.</p><div><p>The  parameter in the URL (probably) means \"Restrict_subreddit\". Removing this from the search will yield results from different subreddits than the one you're searching in. If you think that parameter is redundant, I agree.</p></div><p>There are a  of text-only submissions on /r/homelab. Gems are relatively sparce. Lots of low quality content. It's not the subreddit's fault; this is standard across Reddit.</p><h4>Step 2: Filter for quality</h4><p>Seems easy; let's add a 'minimal upvotes' query to the search, right?\nSadly, Reddit doesn't support that.. a shame, really.<p>\nHowever, a workaround is sorting by 'Top' and asking the search to show us the 'top posts of this week'. Note: 'This week' would mean 'past 7 days' instead of 'posted this week'.</p></p><p>Filtering by 'Top of ...' always returns 25 items. This means that if you sort by 'top of this week', on average of 25/7=3,57 NEW posts get added to your feed each day! This is a great way to only see the highest scoring posts of each day.</p><p>Adding this sort on top of the RSS feed from step 1 results in an URL like this:\n<code>https://www.reddit.com/r/homelab/search.rss?q=self%3Atrue&amp;restrict_sr=on&amp;sort=top&amp;t=year</code></p><div><p>If you don't care about only seeing text posts, removing  does  work for RSS feeds, even though it does work for direct searches. Instead, subscribe to the subreddit's \"top\" RSS and filter by time. For example: <code>https://www.reddit.com/r/homelab/top.rss?t=month</code></p></div><p>For reference, here is how many posts you would get in your RSS feed, depening on your reddit sorting:</p><p>And just like that, we converted a high-noise subreddit to an RSS feed which only gives us the best the subreddit has to offer.</p><div><p>If you wanted to subscribe to all new posts in a subreddit, you would subscribe to an url like <code>https://www.reddit.com/r/SUBREDDIT_NAME/new/.rss?sort=new</code>. For a more extensive Reddit RSS guide, see <a href=\"https://www.reddit.com/r/pathogendavid/comments/tv8m9/pathogendavids_guide_to_rss_and_reddit/\">this post</a></p></div><p>Some sites might not have support for an RSS feed. Sometimes you can get away with a neat google trick:</p><p>Most of the time you'd need something to generate the RSS for you. You could use one of many RSS feed generators available online, or host one yourself. Most of these feed generators have enhanced filtering tools as well.</p><p>I haven't had to do this yet, however I've heard really good things about the open source <a href=\"https://github.com/RSS-Bridge/rss-bridge\">RSS-Bridge</a></p><p>How you'd set up a feed generator depends on the software, so I won't expand upon that here.</p><p>Separating yourself from the algorithmic whims of social media platform is easier than ever. With RSS, you can stay informed, save time, and never miss the content that truly matters.</p><p>To end this post, here is a list of (RSS supported) sites I think are really interesting.\nLinked are excellent articles for first-time readers!</p>","contentLength":7927,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42724284"},{"title":"I have made the decision to disband Hindenburg Research","url":"https://hindenburgresearch.com/gratitude/","date":1736976235,"author":"toomuchtodo","guid":192,"unread":true,"content":"<p>As I’ve shared with family, friends and our team since late last year, I have made the decision to disband Hindenburg Research. The plan has been to wind up after we finished the pipeline of ideas we were working on. And as of the last Ponzi cases we just completed and are sharing with regulators, that day is today.</p><p>I write this from a place of joy. Building this has been a life’s dream.</p><p>I did not know at the outset if it would be possible to find a fulfilling path. This wasn’t an easy option, but I was naïve to the danger and felt drawn to it magnetically.</p><p>When I started this, I doubted I was capable. I didn’t have a traditional finance background. None of my relatives are in this field. I went to a state school. I’m not a slick salesperson. I don’t know any of the right clothes to wear. I can’t play golf. I’m not some superhuman that can function on 4 hours of sleep. In most of my jobs I was a good worker but mostly looked over. I had no money when I started—and after catching 3 lawsuits immediately out of the gate, I quickly had less than no money. I would have failed right at the starting line had it not been for the support of world-class whistleblower lawyer <a href=\"https://www.pugsleywood.com/lawyers/bryan-a-wood/\">Bryan Wood</a>, who took the cases on despite my lack of financial resources. I had a newborn child and was facing eviction at the time. I was terrified, but knew that if I stayed still I would crumble. The only option I had was to keep moving forward.</p><p>It is very easy to succumb to negative thoughts and believe what others think of you, especially when things feel low. But it is possible to shatter all of that. I was passionate about this and I let that carry me forward despite my fears and insecurities.</p><p>And then this slowly started to flourish.</p><p>One at a time, and without a clear plan, we built a team of 11 incredible people. I hired each of them not because we needed workers, but because when our paths crossed and I could see who they were, I realized it was madness not to bring them on.</p><p>They are all smart, focused, and fun to work with. Little to no ego. When you meet them, they are all very nice and polite. But when it comes to this field, they are ruthless assassins, capable of world-class work. Like me, our team didn’t come from traditional finance backgrounds. My first hire often describes himself as a former bartender. We all have a shared view of the world, a mostly calm exterior, and a similar burning underlying intensity. They are all family to me.</p><p>We have all worked extremely hard, with a focus on precision and letting the evidence dictate our words.</p><p>Sometimes this meant taking big swings and taking on fights that are much bigger than any of us as individuals. Fraud, corruption, and negativity often seem overwhelming. Early on, a sense of justice was usually elusive. When it happened, it was tremendously fulfilling. It kept us going when we needed it.</p><p>And boy did we have an impact, eventually—more than I imagined was possible at the outset. Nearly 100 individuals have been charged civilly or criminally by regulators at least in part through our work, including billionaires and oligarchs. We shook some empires that we felt needed shaking.</p><p>Over time, people began to see what I hoped we could show—that having an impact is possible, no matter who you are.</p><p>It has also been rather intense, and at times, all-encompassing. I often wake up from my dreams because I’ve thought of a new investigative thread to pull on in my sleep, or an edit that clarifies a point I didn’t realize I was troubled by during the day. Or from the general pressure of it all. We are not fearless—we just have faith in the truth and hope it leads us down the right path.</p><p>I’m grateful for all of it. We have days of bizarre, hilarious and ridiculous stories and we’ve had a lot of fun amidst the pressure and challenges. It has been the adventure of a lifetime.</p><p>So, why disband now? There is not one specific thing—no particular threat, no health issue, and no big personal issue.</p><p>Someone once told me that at a certain point a successful career becomes a selfish act. Early on, I felt I needed to prove some things to myself. I have now finally found some comfort with myself, probably for the first time in my life. I probably could have had it all along had I let myself, but I needed to put myself through a bit of hell first. The intensity and focus has come at the cost of missing a lot of the rest of the world and the people I care about. I now view Hindenburg as a chapter in my life, not a central thing that defines me.</p><p>Beyond my own desire for relief, it also feels selfish to keep the knowledge we’ve accumulated trapped within our small team. I have more than enough. In the past several years we’ve been flooded with thousands of messages from many of you asking how we do what we do, or whether you can join the team. I read them all and I’ve been trying to figure out how to respond in a way that can answer everyone—so over the next 6 months or so I plan to work on a series of materials and videos to open-source every aspect of our model and how we conduct our investigations.</p><p>My hope is that after we fully share our process, in a couple years I will get an unsolicited message from someone who reads this (maybe you), who embraces the same passion, learns the craft, and finds the confidence to shed some light on a subject that needs it, despite the obstacles in your way. That would make my day, even if I’m off trying to learn music or planting a garden or whatever I end up doing next.</p><p>For now, I will be focused on making sure everyone on our team lands where they want to be next. Some are going to start their own research firm, which I will strongly and publicly encourage, even as I will have no personal involvement. There are others on our team who are now free agents—so feel free to reach out to me if you have a need for anyone who is brilliant, focused, and easy to work with, as they all are.</p><p>It wasn’t always obvious to me, but I now view all of this as a love story. To my wife, you have been so patient with me. It has not been easy, to put it mildly, and I am forever grateful that you have sacrificed so much and pushed forward with me. And now, my dear, we get to enjoy it together for as long as this world will let us.</p><p>To my family and friends, I’m sorry for the times I have ignored you while I let my attention be drawn away. I can’t wait to have more time to share with you together.</p><p>Lastly, I want to express how grateful I am to our readers. Your messages of kindness and encouragement through the years have gone a long way to help give us the strength to continue. And it constantly reminds me that the world is filled with good. Thank you for all of it—I couldn’t ask for more. It is all a blessing.</p><p>With unfathomable levels of gratitude,</p><p>(P.S. If you are chasing something you think you want or need, or are doubting whether you are enough, take a minute and give this a <a href=\"https://www.youtube.com/watch?v=h96MGcsi7GQ\">listen</a>. It had a big impact on me at a pivotal time.)</p>","contentLength":7011,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42717234"},{"title":"TikTok preparing for U.S. shut-off on Sunday","url":"https://www.reuters.com/technology/tiktok-preparing-us-shut-off-sunday-information-reports-2025-01-15/","date":1736945851,"author":"xnhbx","guid":191,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42710339"},{"title":"Nobody cares","url":"https://grantslatton.com/nobody-cares","date":1736914543,"author":"fzliu","guid":190,"unread":true,"content":"<p>N.B. I'm in a mood tonight, so this will be less of a well-considered essay and more of a rant, partially in the vein of <a href=\"https://kieranhealy.org/files/papers/fuck-nuance.pdf\"></a>. Don't take anything here  seriously.</p><p><strong>Why does nobody care about anything?</strong> The world is full of stuff that could be excellent with just 1% more effort. But people don't care.</p><p>Have you been to the DMV? It sucked? There is a human being whose job it is to be in charge of the DMV. They do not care that it sucks.</p><p>Ever used a piece of software that's buggy as hell, looks bad, but still costs money, presumably because the company behind it has found some regulatory capture to justify their existence? The programmer who wrote it probably doesn't care. Their manager definitely doesn't care. The regulators don't care.</p><p>I've met a few people that work for municipal governments. Not politicians, just career bureaucrats deep in the system. I ask them what their favorite part of the job is. They all say \"stability\" or \"job security\" as their #1. It takes 18 months to get the city to permit your shed? They. Do. Not. Care.</p><p>Here's a dumb example. This bike lane ends at the bottom of a hill near me. It merges onto the sidewalk at a crazy sharp angle. Cyclists are coming down this hill at 20mph or so. Tons of people can't make this angle at that speed and hit the vertical curb face, damaging their bike and injuring themselves. If they're unlucky, they go flying into the signpost.</p><p>Why does this ramp suck so much? For literally the exact same effort it took to build, it could have been built 10x better. Make the angle 20 degrees instead of 70. Put the ramp just after the sign instead of just before it. Make the far curb face sloped instead of vertical. Put some visual indication the lane ends 50 feet uphill. Why wasn't this done?</p><p><strong>Because the engineer who designed it and the managers at the department of transportation do not give a shit</strong>.</p><p>This isn't even a pro- or anti-bikes thing. The ramp was getting built by whatever mandate. You're the engineer. Do you make it bad, or do you spend 1% more time thinking about it and make it good for literally the same cost? You make it bad, because you do not care.</p><p>I actually pointed this ramp out to the director of the Seattle Department of Transportation during a walking tour. He made a note of it over a year ago that I assume was promptly forgotten about. He does not care.</p><p>These new lights objectively suck to anyone not driving. If your house is near one, they suck. If you're walking your dog at night (which starts at 5PM for much of the year in Seattle), they  suck.</p><p>But whoever made the decision to switch the lights does not care. It's entirely possible they don't even live in the city, but instead live in a pleasant exurb. Or maybe they don't walk at night and have never considered that other people do.</p><p>White LEDs reduce car crashes by 0.1% and that is measurable, but sleep quality and aesthetics are not measurable. You just have to care about them. And nobody cares.</p><p>But that's enough city stuff. Plenty of people don't care about plenty of other things.</p><p>You put on your turn signal in traffic to merge. The person who could let you in is looking straight ahead, zoned out. Why would they look around to see if they could cooperate with anyone? They're already in the lane they need to be in. They. Do. Not. Care.</p><p>You're at the airport. There's a group in front of you on the escalator taking up the full width, preventing anyone from walking by. They do not care.</p><p>You're on the sidewalk and someone has headphones in, walking in the center of the path. A mom and stroller are behind them. They can't hear her \"excuse me\" to get their attention. They have not even considered the possibility that anyone in the world exists but them. They do not care.</p><p>The McDonald's touch-screen self-order kiosk takes 27 clicks to get a meal. They try to up-sell you 3 times. Just let me pay for my fucking burger, Jesus Christ. The product manager, the programmer, the executives. None of these people care.</p><p>At work the junior engineer sends you some code to review. The code was clearly written in a first draft, and then just iteratively patched until the tests passed, then immediately sent to you to review without any further improvement. They do not care.</p><p>The guy on the hiking trail is playing his shitty EDM on his bluetooth speaker, ruining nature for everyone else. He does not care.</p><p>The doctor misdiagnoses your illness whose symptoms are in the first paragraph of the trivially googleable wikipedia article. He does not care.</p><p>People don't pick up after their dogs. The guy at the gym doesn't re-rack the weights. The lady at the grocery store leaves the cart in the middle of the parking lot. They. Do. Not. Care.</p><p>I could continue in this vein for another few pages, but it would be boring and you get the point. We are surrounded by antisocial bastards.</p><p>Some of them like the people who don't pick up after their dogs are legitimately just assholes.</p><p>Others, like the bureaucrats in the city who mess up our lives in more indirect ways are more victims of The System. But they are still guilty of lacking the personal agency to fight it or leave in protest, and I still — potentially unjustly — condemn them.</p><p>We have examples like Elon who, through sheer force of will, defeats armies of people who don't care. For his many faults, you can't say the man doesn't care.</p><p>When I  my former Big Tech job, everyone cared. Over time, <a href=\"https://blog.sbensu.com/posts/incentives-as-selection-effects/\">incentives attracted</a> a different set of people who didn't care as much. Eventually those people became the majority. It's painful to work with people who don't care if you care a lot, and eventually I left because of it.</p><p>Now, I'm at a small startup full of people who care. Customer bug reports go right to our chatroom. We fix them immediately. I feel guilty I wrote the bugs at all. We reach out to users to see if we can make their lives better. We care.</p><p>I want to live in a community where everyone cares.</p><p>The one place in the world you get this vibe is probably Japan. Most people just . Patrick McKenzie refers to this as <a href=\"https://x.com/search?q=from%3Apatio11+nice+things\"><em>the will to have nice things</em></a>. Japan has it, and the US mostly does not.</p><p>In Japan, you get the impression that everyone takes their job and role in society seriously. The median Japanese 7-11 clerk takes their job more seriously than the median US city bureaucrat. And the result is obvious if you visit both places.</p><p>Is it possible for us to care in the US? To foster the will to have nice things? I think we actually had this in the aftermath of WW2. The country was mostly on the same page about progress, values, the future. But over a few generations, more and more people defect. Living among defectors is demoralizing and causes more defections (much like my own departure from my Big Tech job!). Eventually society is full of defectors.</p><p>But I don't think this is a full explanation. Most people aren't , they merely won't go  to add to the world. And I can feel myself getting pulled in that direction.</p><p>I used to go a lot more out of my way to add to the world. A few years ago, <a href=\"https://x.com/GrantSlatton/status/1742621644022305246\">I installed</a> a bunch of dog bag dispensers on the telephone poles of my neighborhood. I still keep them stocked.</p><p>I was, somewhat naively, hoping that somehow I could get a snowball of care going. I built curb ramps on legacy curbs that lacked them. I lobbied the city to <a href=\"https://maps.app.goo.gl/dGoH7hL9ytXKNXaRA\">open new park space</a>. Improve crosswalks. And much more!</p><p>But the snowball never started. Nobody cares. Rather, there is a tiny minority of activists who care. They spend all their free time doing activist stuff — basically fighting the city to try to make the bureaucrats care about little bits here and there.</p><p>But I've come to accept that I just don't have the disposition to fight all the time. I'm not a fighter. I care  and I just want to live in a place where other people care.</p><p>We're not going to move to Japan, but would absolutely be willing to move within the US.</p><p>Does such a community really exist? Where  cares? Or at least a supermajority? Or does it need to be built?</p>","contentLength":7948,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42707238"},{"title":"FFmpeg by Example","url":"https://ffmpegbyexample.com/","date":1736848695,"author":"piyushsthr","guid":189,"unread":true,"content":"<p>If you feel like this example could be improved, you may edit this example <a href=\"https://ffmpegbyexample.com/edit/TWD0BMI3\">here</a>.</p>","contentLength":80,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42695547"},{"title":"WordPress Is in Trouble","url":"https://anderegg.ca/2025/01/11/wordpress-is-in-trouble","date":1736794531,"author":"ulrischa","guid":188,"unread":true,"content":"<p><a href=\"https://anderegg.ca/2024/11/01/using-wordpress-is-risky\">Since I last wrote about WordPress</a>, things have gone off the rails. This after a brief period when things were blissfully quiet. Matt Mullenweg stopped commenting for a while, though his company had launched <a href=\"https://wordpressenginetracker.com/\">WP Engine Tracker</a> — a site for tracking WordPress-driven websites that moved away from WP Engine. I think this is a bit gauche, but it seems like fair marketing given everything that’s going on. It should be noted that many sites are leaving for Pressable — owned by Mullenweg’s company, Automattic —&nbsp;because of <a href=\"https://pressable.com/wpe-contract-buyout/\">a sweetheart deal</a>.</p><p>On December 20th, <a href=\"https://wptavern.com/matt-mullenweg-declares-holiday-break-for-wordpress-org-services\">Mullenweg announced</a> that WordPress.org would be on holiday break for an unspecified amount of time. <a href=\"https://wordpress.org/news/2024/12/holiday-break/\">In a post on the WordPress.org blog</a>, he again mentioned being “compelled to provide free labor and services to WP Engine thanks to the success of their expensive lawyers”. He also invited people to fund legal attacks against him by signing up for WP Engine services, and hoped to have the “time, energy, and money to reopen all of this sometime in the new year”.</p><p>This was the first time WordPress.org had ever gone on break, and it was another instance of Mullenweg using a core part of the WordPress community to send a message. WordPress.org <a href=\"https://wptavern.com/wordpress-org-services-resume-after-holiday-break\">returned to service on January 4th</a>, but plugin and theme updates weren’t being reviewed until then. I’m all for giving volunteers time off, but this came as a surprise to the community and there was initially no indication when the break would end. Mullenweg’s “woe is me” language around maybe, possibly, being able to find the resources to reopen a core piece of WordPress infrastructure didn’t help things. It <a href=\"https://www.theverge.com/2024/10/4/24262232/matt-mullenweg-wordpress-org-wp-engine\">further cemented</a> that Matt Mullenweg’s current mood is an important function of whether or not the WordPress community operates smoothly.</p><p>While WordPress.org was on hiatus, Mullenweg also reached out to the WPDrama community on Reddit, asking <a href=\"https://www.reddit.com/r/WPDrama/comments/1hlp08d/what_drama_should_i_create_in_2025/\">what drama he should create in 2025</a>. A couple of years ago, this sort of thing would have been some tongue-in-cheek fun from a person who’s always been a bit of a goof. These days it comes off a bit differently.</p><p>Automattic noted it would focus its open source hours on “security and critical updates”. The other hours would be redirected to <a href=\"https://automattic.com/2025/01/09/aligning-automattics-sponsored-contributions-to-wordpress/#:~:text=for%2Dprofit%20projects%20within%20Automattic%2C%20such%20as%20WordPress.com%2C%20Pressable%2C%20WPVIP%2C%20Jetpack%2C%20and%20WooCommerce\">for-profit projects like WordPress.com</a>. This means that the community will be expected to take up the slack if it wants WordPress to improve. I worry that 45 hours a week isn’t enough time to keep WordPress secure and bug-free. Hopefully others will step up, here.</p><p>But you know what? In a normal world, having the community taking the lead would be fine. I’d be all for it! The problem is that Mullenweg has final say over some very important parts of the WordPress community. He also seems recently to be acting more childishly and impulsively than usual.</p><p>Another thing that <a href=\"https://www.threads.net/@karaswisher/post/DEniSxyS01i\">came to light yesterday</a> was that the WordPress Sustainability committee was shuttered after a core member, Thijs Buijs, stepped down. In a post on the WordPress Slack, Buijs cited the “2025 drama” post on Reddit as the reason he was leaving, and called for a change in WordPress community leadership. In response, Mullenweg responded in part with “[t]oday I learned that we have a sustainability team”, and closed the channel.</p><p>The <a href=\"https://make.wordpress.org/sustainability/\">WordPress Sustainability Team</a> had four core members, and <a href=\"https://github.com/WordPress/sustainability/graphs/contributors\">11 people</a> who had contributed on GitHub. As far as I can tell, they were all community members, and none were Automattic employees. Even if it wasn’t producing amazing results, I can’t see what harm it was doing. The sin was pointing out something stupid that Mullenweg did, and having a member wanting change. The optics, <a href=\"https://www.cbc.ca/news/world/los-angeles-wildfires-1.7429025\">especially given current world events</a>, are definitely not great. The wildest part of this to me is that there’s video of Mullenweg — <a href=\"https://www.youtube.com/live/Qq1SBFzByDw?si=S2RfSBj2ioLl3WPC&amp;t=28744\">live on stage at Word Camp Europe in 2022</a> — requesting the creation of the Slack channel he was turning off. Guess that slipped his mind.</p><p>All of this bodes poorly for the open source version of WordPress. I think it’s perfectly fair for Automattic to switch gears and focus on for-profit projects — it’s a company after all. The problem is that there’s a void being left. Automattic had, for better or worse, lead the development of both the commercial and open source pieces of the WordPress ecosystem. Now it seems like the community needs to take over, but Mullenweg still holds all the keys.</p><p>In the announcement, <a href=\"https://automattic.com/2025/01/09/aligning-automattics-sponsored-contributions-to-wordpress/#:~:text=Part%20of%20this%20will%20be%20making%20WordPress.com%20much%20closer%20to%20a%20core%20WordPress%20experience%2C%20instead%20of%20having%20a%20different%20interface\">Automattic said</a> that WordPress.com would be updated to be more in line with the open source version of WordPress. This also makes sense to me, as WordPress.com has always been a <a href=\"https://wordpress.com/support/com-vs-org/\">weird version</a> of the software. Of course, having slight differences to the core WordPress experience is the argument that Mullenweg initially used to call WP Engine a “<a href=\"https://wordpress.org/news/2024/09/wp-engine/\">cancer</a>”, but who’s keeping track? I’d also like to point out again that Automattic <a href=\"https://automattic.com/ventures/#:~:text=by%20Silver%20Lake-,Series%20A,-Managed%20WordPress%20hosting\">invested in WP Engine in 2011</a>. It also <a href=\"https://automattic.com/ventures/#:~:text=2012-,Acquired%20by%20Automattic,-Convertible%20Note\">acquired Pressable in 2016</a>, likely because it was a hosting service that offered a “real” version of WordPress, unlike WordPress.com.</p><p>It’s hard to see how to move forward from here. I think the best bet would be for people to rally around new community-driven infrastructure. This would likely require a fork of WordPress, though, and that’s going to be a messy. The current open source version of WordPress <a href=\"https://github.com/search?q=repo%3AWordPress%2FWordPress%20%22wordpress.org%22&amp;type=code\">relies on the sites and services Mullenweg controls</a>. Joost de Valk, the original creator of an extremely popular <a href=\"https://yoast.com/wordpress/plugins/seo/\">SEO plugin</a>, wrote a <a href=\"https://joost.blog/wordpress-leadership/\">blog post with some thoughts on the matter</a>. I’m hoping that more prominent people in the community step up like this, and that some way forward can be found.</p><p>: Moments after posting this, I was pointed to a <a href=\"https://techcrunch.com/2025/01/11/matt-mullenweg-deactivates-wordpress-accounts-of-contributors-planning-a-fork/\">story on TechCrunch</a> about Mullenweg deactivating the WordPress.org accounts of users planning a “fork”. This after he <a href=\"https://wordpress.org/news/2024/10/spoon/\">previously promoted</a> (though in a slightly mocking way) the idea of forking open source software. In both cases, the people he mentioned weren’t actually planning forks, but musing about future ways forward for WordPress. Mullenweg framed the account deactivations as giving people the push they need to get started. Remember that WordPress.org accounts are required to submit themes, plugins, or core code to the WordPress project. These recent events really make it seem like you’re no longer welcome to contribute to WordPress if you question Matt Mullenweg.</p>","contentLength":6313,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42687121"},{"title":"The Origins of Wokeness","url":"https://paulgraham.com/woke.html","date":1736767261,"author":"crbelaus","guid":187,"unread":true,"content":"January 2025<p>The word \"prig\" isn't very common now, but if you look up\nthe definition, it will sound familiar. Google's isn't bad:\n</p><blockquote>\n  A self-righteously moralistic person who behaves as if\n  superior to others.\n</blockquote>\nThis sense of the word originated in the 18th century, and\nits age is an important clue: it shows that although\nwokeness is a comparatively recent phenomenon, it's an\ninstance of a much older one.<p>There's a certain kind of person who's attracted to a\nshallow, exacting kind of moral purity, and who demonstrates\nhis purity by attacking anyone who breaks the rules. Every\nsociety has these people. All that changes is the rules they\nenforce. In Victorian England it was Christian virtue. In\nStalin's Russia it was orthodox Marxism-Leninism. For the\nwoke, it's social justice.</p><p>So if you want to understand wokeness, the question to ask\nis not why people behave this way. Every society has prigs.\nThe question to ask is why our prigs are priggish about\nthese ideas, at this moment. And to answer that we have to\nask when and where wokeness began.</p><p>The answer to the first question is the 1980s. Wokeness is a\nsecond, more aggressive wave of political correctness, which\nstarted in the late 1980s, died down in the late 1990s, and\nthen returned with a vengeance in the early 2010s, finally\npeaking after the riots of 2020.</p><p>This was not the original meaning of woke, but it's rarely\nused in the original sense now. Now the pejorative sense is\nthe dominant one. What </p> it mean now? I've often been\nasked to define both wokeness and political correctness by\npeople who think they're meaningless labels, so I will. They\nboth have the same definition:\n<blockquote>\n  An aggressively performative focus on social justice.\n</blockquote>\nIn other words, it's people being prigs about social\njustice. And that's the real problem — the\nperformativeness, not the social justice.<p>Racism, for example, is a genuine problem. Not a problem on\nthe scale that the woke believe it to be, but a genuine one.\nI don't think any reasonable person would deny that. The\nproblem with political correctness was not that it focused\non marginalized groups, but the shallow, aggressive way in\nwhich it did so. Instead of going out into the world and\nquietly helping members of marginalized groups, the\npolitically correct focused on getting people in trouble for\nusing the wrong words to talk about them.</p><p>As for where political correctness began, if you think about\nit, you probably already know the answer. Did it begin\noutside universities and spread to them from this external\nsource? Obviously not; it has always been most extreme in\nuniversities. So where in universities did it begin? Did it\nbegin in math, or the hard sciences, or engineering, and\nspread from there to the humanities and social sciences?\nThose are amusing images, but no, obviously it began in the\nhumanities and social sciences.</p><p>Why there? And why then? What happened in the humanities and\nsocial sciences in the 1980s?</p><p>A successful theory of the origin of political correctness\nhas to be able to explain why it didn't happen earlier. Why\ndidn't it happen during the protest movements of the 1960s,\nfor example? They were concerned with much the same issues.\n</p><p>The reason the student protests of the 1960s didn't lead to\npolitical correctness was precisely that — they were\nstudent movements. They didn't have any real power. The\nstudents may have been talking a lot about women's\nliberation and black power, but it was not what they were\nbeing taught in their classes. Not yet.</p><p>But in the early 1970s the student protestors of the 1960s\nbegan to finish their dissertations and get hired as\nprofessors. At first they were neither powerful nor\nnumerous. But as more of their peers joined them and the\nprevious generation of professors started to retire, they\ngradually became both.</p><p>The reason political correctness began in the humanities and\nsocial sciences was that these fields offered more scope for\nthe injection of politics. A 1960s radical who got a job as\na physics professor could still attend protests, but his\npolitical beliefs wouldn't affect his work. Whereas research\nin sociology and modern literature can be made as political\nas you like.\n</p><p>I saw political correctness arise. When I started college in\n1982 it was not yet a thing. Female students might object if\nsomeone said something they considered sexist, but no one\nwas getting </p> for it. It was still not a thing when\nI started grad school in 1986. It was definitely a thing in\n1988 though, and by the early 1990s it seemed to pervade\ncampus life.<p>What happened? How did protest become punishment? Why were\nthe late 1980s the point at which protests against male\nchauvinism (as it used to be called) morphed into formal\ncomplaints to university authorities about sexism?\nBasically, the 1960s radicals got tenure. They became the\nEstablishment they'd protested against two decades before.\nNow they were in a position not just to speak out about\ntheir ideas, but to enforce them.</p><p>A new set of moral rules to enforce was exciting news to a\ncertain kind of student. What made it particularly exciting\nwas that they were allowed to attack professors. I remember\nnoticing that aspect of political correctness at the time.\nIt wasn't simply a grass-roots student movement. It was\nfaculty members encouraging students to attack other faculty\nmembers. In that respect it was like the Cultural\nRevolution. That wasn't a grass-roots movement either; that\nwas Mao unleashing the younger generation on his political\nopponents. And in fact when Roderick MacFarquhar started\nteaching a class on the Cultural Revolution at Harvard in\nthe late 1980s, many saw it as a comment on current events.\nI don't know if it actually was, but people thought it was,\nand that means the similarities were obvious.\n</p><p>College students larp. It's their nature. It's usually\nharmless. But larping morality turned out to be a poisonous\ncombination. The result was a kind of moral etiquette,\nsuperficial but very complicated. Imagine having to explain\nto a well-meaning visitor from another planet why using the\nphrase \"people of color\" is considered particularly\nenlightened, but saying \"colored people\" gets you fired. And\nwhy exactly one isn't supposed to use the word \"negro\" now,\neven though Martin Luther King used it constantly in his\nspeeches. There are no underlying principles. You'd just\nhave to give him a long list of rules to memorize.\n</p><p>\nThe danger of these rules was not just that they created\nland mines for the unwary, but that their elaborateness made\nthem an effective substitute for virtue. Whenever a society\nhas a concept of heresy and orthodoxy, orthodoxy becomes a\nsubstitute for virtue. You can be the worst person in the\nworld, but as long as you're orthodox you're better than\neveryone who isn't. This makes orthodoxy very attractive to\nbad people.</p><p>But for it to work as a substitute for virtue, orthodoxy\nmust be difficult. If all you have to do to be orthodox is\nwear some garment or avoid saying some word, everyone knows\nto do it, and the only way to seem more virtuous than other\npeople is to actually be virtuous. The shallow, complicated,\nand frequently changing rules of political correctness made\nit the perfect substitute for actual virtue. And the result\nwas a world in which good people who weren't up to date on\ncurrent moral fashions were brought down by people whose\ncharacters would make you recoil in horror if you could see\nthem.</p><p>One big contributing factor in the rise of political\ncorrectness was the lack of other things to be morally pure\nabout. Previous generations of prigs had been prigs mostly\nabout religion and sex. But among the cultural elite these\nwere the deadest of dead letters by the 1980s; if you were\nreligious, or a virgin, this was something you tended to\nconceal rather than advertise. So the sort of people who\nenjoy being moral enforcers had become starved of things to\nenforce. A new set of rules was just what they'd been\nwaiting for.</p><p>Curiously enough, the tolerant side of the 1960s left helped\ncreate the conditions in which the intolerant side\nprevailed. The relaxed social rules advocated by the old,\neasy-going hippy left became the dominant ones, at least\namong the elite, and this left nothing for the naturally\nintolerant to be intolerant about.</p><p>Another possibly contributing factor was the fall of the\nSoviet empire. Marxism had been a popular focus of moral\npurity on the left before political correctness emerged as a\ncompetitor, but the pro-democracy movements in Eastern Bloc\ncountries took most of the shine off it. Especially the fall\nof the Berlin Wall in 1989. You couldn't be on the side of\nthe Stasi. I remember looking at the moribund Soviet Studies\nsection of a used bookshop in Cambridge in the late 1980s\nand thinking \"what will those people go on about now?\" As it\nturned out the answer was right under my nose.</p><p>One thing I noticed at the time about the first phase of\npolitical correctness was that it was more popular with\nwomen than men. As many writers (perhaps most eloquently\nGeorge Orwell) have observed, women seem more attracted than\nmen to the idea of being moral enforcers. But there was\nanother more specific reason women tended to be the\nenforcers of political correctness. There was at this time a\ngreat backlash against sexual harassment; the mid 1980s were\nthe point when the definition of sexual harassment was\nexpanded from explicit sexual advances to creating a\n\"hostile environment.\" Within universities the classic form\nof accusation was for a (female) student to say that a\nprofessor made her \"feel uncomfortable.\" But the vagueness\nof this accusation allowed the radius of forbidden behavior\nto expand to include talking about heterodox ideas. Those\nmake people uncomfortable too.\n</p><p>Was it sexist to propose that Darwin's greater male\nvariability hypothesis might explain some variation in human\nperformance? Sexist enough to get Larry Summers pushed out\nas president of Harvard, apparently. One woman who heard the\ntalk in which he mentioned this idea said it made her feel\n\"physically ill\" and that she had to leave halfway through.\nIf the test of a hostile environment is how it makes people\nfeel, this certainly sounds like one. And yet it does seem\nplausible that greater male variability explains some of the\nvariation in human performance. So which should prevail,\ncomfort or truth? Surely if truth should prevail anywhere,\nit should be in universities; that's supposed to be their\nspecialty; but for decades starting in the late 1980s the\npolitically correct tried to pretend this conflict didn't\nexist.\n</p><p>Political correctness seemed to burn out in the second half\nof the 1990s. One reason, perhaps the main reason, was that\nit literally became a joke. It offered rich material for\ncomedians, who performed their usual disinfectant action\nupon it. Humor is one of the most powerful weapons against\npriggishness of any sort, because prigs, being humorless,\ncan't respond in kind. Humor was what defeated Victorian\nprudishness, and by 2000 it seemed to have done the same\nthing to political correctness.</p><p>Unfortunately this was an illusion. Within universities the\nembers of political correctness were still glowing brightly.\nAfter all, the forces that created it were still there. The\nprofessors who started it were now becoming deans and\ndepartment heads. And in addition to their departments there\nwere now a bunch of new ones explicitly focused on social\njustice. Students were still hungry for things to be morally\npure about. And there had been an explosion in the number of\nuniversity administrators, many of whose jobs involved\nenforcing various forms of political correctness.</p><p>In the early 2010s the embers of political correctness burst\ninto flame anew. There were several differences between this\nnew phase and the original one. It was more virulent. It\nspread further into the real world, although it still burned\nhottest within universities. And it was concerned with a\nwider variety of sins. In the first phase of political\ncorrectness there were really only three things people got\naccused of: sexism, racism, and homophobia (which at the\ntime was a neologism invented for the purpose). But between\nthen and 2010 a lot of people had spent a lot of time trying\nto invent new kinds of -isms and -phobias and seeing which\ncould be made to stick.</p><p>The second phase was, in multiple senses, political\ncorrectness metastasized. Why did it happen when it did? My\nguess is that it was due to the rise of social media,\nparticularly Tumblr and Twitter, because one of the most\ndistinctive features of the second wave of political\ncorrectness was the </p>: a mob of angry people\nuniting on social media to get someone ostracized or fired.\nIndeed this second wave of political correctness was\noriginally called \"cancel culture\"; it didn't start to be\ncalled \"wokeness\" till the 2020s.<p>One aspect of social media that surprised almost everyone at\nfirst was the popularity of outrage. Users seemed to </p>\nbeing outraged. We're so used to this idea now that we take\nit for granted, but really it's pretty strange. Being\noutraged is not a pleasant feeling. You wouldn't expect\npeople to seek it out. But they do. And above all, they want\nto share it. I happened to be running a forum from 2007 to\n2014, so I can actually quantify how much they want to share\nit: our users were about three times more likely to upvote\nsomething if it outraged them.<p>This tilt toward outrage wasn't due to wokeness. It's an\ninherent feature of social media, or at least this\ngeneration of it. But it did make social media the perfect\nmechanism for fanning the flames of wokeness.\n</p><p>It wasn't just public social networks that drove the rise of\nwokeness though. Group chat apps were also critical,\nespecially in the final step, cancellation. Imagine if a\ngroup of employees trying to get someone fired had to do it\nusing only email. It would be hard to organize a mob. But\nonce you have group chat, mobs form naturally.</p><p>Another contributing factor in this second wave of political\ncorrectness was the dramatic increase in the polarization of\nthe press. In the print era, newspapers were constrained to\nbe, or at least seem, politically neutral. The department\nstores that ran ads in the New York Times wanted to reach\neveryone in the region, both liberal and conservative, so\nthe Times had to serve both. But the Times didn't regard\nthis neutrality as something forced upon them. They embraced\nit as their duty as a </p> — as one of the big\nnewspapers that aimed to be chronicles of their times,\nreporting every sufficiently important story from a neutral\npoint of view.<p>When I grew up the papers of record seemed timeless, almost\nsacred institutions. Papers like the New York Times and\nWashington Post had immense prestige, partly because other\nsources of news were limited, but also because they did make\nsome effort to be neutral.</p><p>Unfortunately it turned out that the paper of record was\nmostly an artifact of the constraints imposed by print.\n</p>\nWhen your market was determined by geography, you had\nto be neutral. But publishing online enabled — in fact\nprobably forced — newspapers to switch to serving markets\ndefined by ideology instead of geography. Most that remained\nin business fell in the direction they'd already been\nleaning: left. On October 11, 2020 the New York Times\nannounced that \"The paper is in the midst of an evolution\nfrom the stodgy paper of record into a juicy collection of\ngreat narratives.\"\n\nMeanwhile journalists, of a sort,\nhad arisen to serve the right as well. And so journalism,\nwhich in the previous era had been one of the great\ncentralizing forces, now became one of the great polarizing\nones.<p>The rise of social media and the increasing polarization of\njournalism reinforced one another. In fact there arose a new\nvariety of journalism involving a loop through social media.\nSomeone would say something controversial on social media.\nWithin hours it would become a news story. Outraged readers\nwould then post links to the story on social media, driving\nfurther arguments online. It was the cheapest source of\nclicks imaginable. You didn't have to maintain overseas news\nbureaus or pay for month-long investigations. All you had to\ndo was watch Twitter for controversial remarks and repost\nthem on your site, with some additional comments to inflame\nreaders further.</p><p>For the press there was money in wokeness. But they weren't\nthe only ones. That was one of the biggest differences\nbetween the two waves of political correctness: the first\nwas driven almost entirely by amateurs, but the second was\noften driven by professionals. For some it was their whole\njob. By 2010 a new class of administrators had arisen whose\njob was basically to enforce wokeness. They played a role\nsimilar to that of the political commissars who got attached\nto military and industrial organizations in the USSR: they\nweren't directly in the flow of the organization's work, but\nwatched from the side to ensure that nothing improper\nhappened in the doing of it. These new administrators could\noften be recognized by the word \"inclusion\" in their titles.\nWithin institutions this was the preferred euphemism for\nwokeness; a new list of banned words, for example, would\nusually be called an \"inclusive language guide.\"\n</p><p>This new class of bureaucrats pursued a woke agenda as if\ntheir jobs depended on it, because they did. If you hire\npeople to keep watch for a particular type of problem,\nthey're going to find it, because otherwise there's no\njustification for their existence.\n</p>\nBut these\nbureaucrats also represented a second and possibly even\ngreater danger. Many were involved in hiring, and when\npossible they tried to ensure their employers hired only\npeople who shared their political beliefs. The most\negregious cases were the new \"DEI statements\" that some\nuniversities started to require from faculty candidates,\nproving their commitment to wokeness. Some universities used\nthese statements as the initial filter and only even\nconsidered candidates who scored high enough on them. You're\nnot hiring Einstein that way; imagine what you get instead.<p>Another factor in the rise of wokeness was the Black Lives\nMatter movement, which started in 2013 when a white man was\nacquitted after killing a black teenager in Florida. But\nthis didn't launch wokeness; it was well underway by 2013.</p><p>Similarly for the Me Too Movement, which took off in 2017\nafter the first news stories about Harvey Weinstein's\nhistory of raping women. It accelerated wokeness, but didn't\nplay the same role in launching it that the 80s version did\nin launching political correctness.</p><p>The election of Donald Trump in 2016 also accelerated\nwokeness, particularly in the press, where outrage now meant\ntraffic. Trump made the New York Times a lot of money:\nheadlines during his first administration mentioned his name\nat about four times the rate of previous presidents.</p><p>In 2020 we saw the biggest accelerant of all, after a white\npolice officer asphyxiated a black suspect on video. At this\npoint the metaphorical fire became a literal one, as violent\nprotests broke out across America. But in retrospect this\nturned out to be peak woke, or close to it. By every measure\nI've seen, wokeness peaked in 2020 or 2021.</p><p>Wokeness is sometimes described as a mind-virus. What makes\nit viral is that it defines new types of impropriety. Most\npeople are afraid of impropriety; they're never exactly sure\nwhat the social rules are or which ones they might be\nbreaking. Especially if the rules change rapidly. And since\nmost people already worry that they might be breaking rules\nthey don't know about, if you tell them they're breaking a\nrule, their default reaction is to believe you. Especially\nif multiple people tell them. Which in turn is a recipe for\nexponential growth. Zealots invent some new impropriety to\navoid. The first people to adopt it are fellow zealots,\neager for new ways to signal their virtue. If there are\nenough of these, the initial group of zealots is followed by\na much larger group, motivated by fear. They're not trying\nto signal virtue; they're just trying to avoid getting in\ntrouble. At this point the new impropriety is now firmly\nestablished. Plus its success has increased the rate of\nchange in social rules, which, remember, is one of the\nreasons people are nervous about which rules they might be\nbreaking. So the cycle accelerates.\n</p><p>What's true of individuals is even more true of\norganizations. Especially organizations without a powerful\nleader. Such organizations do everything based on \"best\npractices.\" There's no higher authority; if some new \"best\npractice\" achieves critical mass, they </p> adopt it. And\nin this case the organization can't do what it usually does\nwhen it's uncertain: delay. It might be committing\nimproprieties right now! So it's surprisingly easy for a\nsmall group of zealots to capture this type of organization\nby describing new improprieties it might be guilty of. \n<p>How does this kind of cycle ever end? Eventually it leads to\ndisaster, and people start to say enough is enough. The\nexcesses of 2020 made a lot of people say that.</p><p>Since then wokeness has been in gradual but continual\nretreat. Corporate CEOs, starting with Brian Armstrong, have\nopenly rejected it. Universities, led by the University of\nChicago and MIT, have explicitly confirmed their commitment\nto free speech. Twitter, which was arguably the hub of\nwokeness, was bought by Elon Musk in order to neutralize it,\nand he seems to have succeeded — and not, incidentally, by\ncensoring left-wing users the way Twitter used to censor\nright-wing ones, but without censoring either.\n</p>\nConsumers have emphatically rejected brands that ventured\ntoo far into wokeness. The Bud Light brand may have been\npermanently damaged by it. I'm not going to claim Trump's\nsecond victory in 2024 was a referendum on wokeness; I think\nhe won, as presidential candidates always do, because he was\nmore <a href=\"https://paulgraham.com/charisma.html\"></a>; but voters' \ndisgust with wokeness must have helped.<p>So what do we do now? Wokeness is already in retreat.\nObviously we should help it along. What's the best way to do\nthat? And more importantly, how do we avoid a third\noutbreak? After all, it seemed to be dead once, but came\nback worse than ever.</p><p>In fact there's an even more ambitious goal: is there a way\nto prevent any similar outbreak of aggressively performative\nmoralism in the future — not just a third outbreak of\npolitical correctness, but the next thing like it? Because\nthere will be a next thing. Prigs are prigs by nature. They\nneed rules to obey and enforce, and now that Darwin has cut\noff their traditional supply of rules, they're constantly\nhungry for new ones. All they need is someone to meet them\nhalfway by defining a new way to be morally pure, and we'll\nsee the same phenomenon again.</p><p>Let's start with the easier problem. Is there a simple,\nprincipled way to deal with wokeness? I think there is: to\nuse the customs we already have for dealing with religion.\nWokeness is effectively a religion, just with God replaced\nby protected classes. It's not even the first religion of\nthis kind; Marxism had a similar form, with God replaced by\nthe masses.\n</p>\nAnd we already have well-established\ncustoms for dealing with religion within organizations. You\ncan express your own religious identity and explain your\nbeliefs, but you can't call your coworkers infidels if they\ndisagree, or try to ban them from saying things that\ncontradict its doctrines, or insist that the organization\nadopt yours as its official religion.<p>If we're not sure what to do about any particular\nmanifestation of wokeness, imagine we were dealing with some\nother religion, like Christianity. Should we have people\nwithin organizations whose jobs are to enforce woke\northodoxy? No, because we wouldn't have people whose jobs\nwere to enforce Christian orthodoxy. Should we censor\n</p><a href=\"https://www.telegraph.co.uk/news/2023/02/17/roald-dahl-books-rewritten-offensive-matilda-witches-twits/\"></a> or \n<a href=\"https://x.com/KoustaStavroula/status/1562034502897106946\"></a> whose work contradicts woke doctrines?\nNo, because we wouldn't do this to people whose work\ncontradicted Christian teachings. Should job candidates be\nrequired to write DEI statements? Of course not; imagine an\nemployer requiring proof of one's religious beliefs. Should\nstudents and employees have to participate in woke\nindoctrination sessions in which they're required to answer\nquestions about their beliefs to ensure compliance? No,\nbecause we wouldn't dream of catechizing people in this way\nabout their religion.\n<p>One shouldn't feel bad about not wanting to watch woke\nmovies any more than one would feel bad about not wanting to\nlisten to Christian rock. In my twenties I drove across\nAmerica several times, listening to local radio stations.\nOccasionally I'd turn the dial and hear some new song. But\nthe moment anyone mentioned Jesus I'd turn the dial again.\nEven the tiniest bit of being preached to was enough to make\nme lose interest.</p><p>But by the same token we should not automatically reject\neverything the woke believe. I'm not a Christian, but I can\nsee that many Christian principles are good ones. It would\nbe a mistake to discard them all just because one didn't\nshare the religion that espoused them. It would be the sort\nof thing a religious zealot would do.</p><p>If we have genuine pluralism, I think we'll be safe from\nfuture outbreaks of woke intolerance. Wokeness itself won't\ngo away. There will for the foreseeable future continue to\nbe pockets of woke zealots inventing new moral fashions. The\nkey is not to let them treat their fashions as normative.\nThey can change what their coreligionists are allowed to say\nevery few months if they like, but they mustn't be allowed\nto change what we're allowed to say.\n</p><p>The more general problem — how to prevent similar outbreaks\nof aggressively performative moralism — is of course\nharder. Here we're up against human nature. There will\nalways be prigs. And in particular there will always be the\nenforcers among them, the \n</p><a href=\"https://paulgraham.com/conformism.html\"><u>aggressively conventional-minded</u></a>.\nThese people are born that way. Every society has them. So\nthe best we can do is to keep them bottled up.<p>The aggressively conventional-minded aren't always on the\nrampage. Usually they just enforce whatever random rules are\nnearest to hand. They only become dangerous when some new\nideology gets a lot of them pointed in the same direction at\nonce. That's what happened during the Cultural Revolution,\nand to a lesser extent (thank God) in the two waves of\npolitical correctness we've experienced.</p><p>We can't get rid of the aggressively conventional-minded.\n</p>\nAnd we couldn't prevent people from creating new\nideologies that appealed to them even if we wanted to. So if\nwe want to keep them bottled up, we have to do it one step\ndownstream. Fortunately when the aggressively\nconventional-minded go on the rampage they always do one\nthing that gives them away: they define new <a href=\"https://paulgraham.com/heresy.html\"></a> to\npunish people for. So the best way to protect ourselves from\nfuture outbreaks of things like wokeness is to have powerful\nantibodies against the concept of heresy.<p>We should have a conscious bias against defining new forms\nof heresy. Whenever anyone tries to ban saying something\nthat we'd previously been able to say, our initial\nassumption should be that they're wrong. Only our initial\nassumption of course. If they can prove we should stop\nsaying it, then we should. But the burden of proof is on\nthem. In liberal democracies, people trying to prevent\nsomething from being said will usually claim they're not\nmerely engaging in censorship, but trying to prevent some\nform of \"harm\". And maybe they're right. But once again, the\nburden of proof is on them. It's not enough to claim harm;\nthey have to prove it.</p><p>As long as the aggressively conventional-minded continue to\ngive themselves away by banning heresies, we'll always be\nable to notice when they become aligned behind some new\nideology. And if we always fight back at that point, with\nany luck we can stop them in their tracks.</p><p>The number of true things we </p><a href=\"https://paulgraham.com/say.html\"></a>\nshould not increase. If it does, something is wrong.]\nWhy did 1960s radicals focus on the causes they did?\nOne of the people who reviewed drafts of this essay\nexplained this so well that I asked if I could quote him:\n<blockquote>\n  The middle-class student protestors of the New Left\n  rejected the socialist/Marxist left as unhip. They were\n  interested in sexier forms of oppression uncovered by\n  cultural analysis (Marcuse) and abstruse \"Theory\". Labor\n  politics became stodgy and old-fashioned. This took a\n  couple generations to work through. The woke ideology's\n  conspicuous lack of interest in the working class is the\n  tell-tale sign. Such fragments as are, er, left of the old\n  left are anti-woke, and meanwhile the actual working class\n  shifted to the populist right and gave us Trump. Trump and\n  wokeness are cousins.<p>The middle-class origins of wokeness smoothed its way\n  through the institutions because it had no interest in\n  \"seizing the means of production\" (how quaint such phrases\n  seem now), which would quickly have run up against hard\n  state and corporate power. The fact that wokeness only\n  expressed interest in other kinds of class (race, sex,\n  etc) signalled compromise with existing power: give us\n  power within your system and we'll bestow the resource we\n  control — moral rectitude — upon you. As an ideological\n  stalking horse for gaining control over discourse and\n  institutions, this succeeded where a more ambitious\n  revolutionary program would not have.\n</p></blockquote>\n[]\nIt helped that the humanities and social sciences also\nincluded some of the biggest and easiest undergrad majors.\nIf a political movement had to start with physics students,\nit could never get off the ground; there would be too few of\nthem, and they wouldn't have the time to spare.<p>At the top universities these majors are not as big as they\nused to be, though. A \n</p><a href=\"https://www.newyorker.com/magazine/2023/03/06/the-end-of-the-english-major\"></a> found that only 7% of\nHarvard undergrads plan to major in the humanities, vs\nnearly 30% during the 1970s. I expect wokeness is at least\npart of the reason; when undergrads consider majoring in\nEnglish, it's presumably because they love the written word\nand not because they want to listen to lectures about\nracism.]\nThe puppet-master-and-puppet character of political\ncorrectness became clearly visible when a bakery near\nOberlin College was falsely accused of race discrimination\nin 2016. In the subsequent civil trial, lawyers for the\nbakery produced a text message from Oberlin Dean of Students\nMeredith Raimondo that read \"I'd say unleash the students if\nI wasn't convinced this needs to be put behind us.\"]\nThe woke sometimes claim that wokeness is simply\ntreating people with respect. But if it were, that would be\nthe only rule you'd have to remember, and this is comically\nfar from being the case. My younger son likes to imitate\nvoices, and at one point when he was about seven I had to\nexplain which accents it was currently safe to imitate\npublicly and which not. It took about ten minutes, and I\nstill hadn't covered all the cases.]\nIn 1986 the Supreme Court ruled that creating a\nhostile work environment could constitute sex\ndiscrimination, which in turn affected universities via\nTitle IX. The court specified that the test of a hostile\nenvironment was whether it would bother a reasonable person,\nbut since for a professor merely being the subject of a\nsexual harassment complaint would be a disaster whether the\ncomplainant was reasonable or not, in practice any joke or\nremark remotely connected with sex was now effectively\nforbidden. Which meant we'd now come full circle to\nVictorian codes of behavior, when there was a large class of\nthings that might not be said \"with ladies present.\"]\nMuch as they tried to pretend there was no conflict\nbetween diversity and quality. But you can't simultaneously\noptimize for two things that aren't identical. What\ndiversity actually means, judging from the way the term is\nused, is proportional representation, and unless you're\nselecting a group whose purpose is to be representative,\nlike poll respondents, optimizing for proportional\nrepresentation has to come at the expense of quality. This\nis not because of anything about representation; it's the\nnature of optimization; optimizing for x has to come at the\nexpense of y unless x and y are identical.]\nMaybe societies will eventually develop antibodies to\nviral outrage. Maybe we were just the first to be exposed to\nit, so it tore through us like an epidemic through a\npreviously isolated population. I'm fairly confident that it\nwould be possible to create new social media apps that were\nless driven by outrage, and an app of this type would have a\ngood chance of stealing users from existing ones, because\nthe smartest people would tend to migrate to it.]\nI say \"mostly\" because I have hopes that journalistic\nneutrality will return in some form. There is some market\nfor unbiased news, and while it may be small, it's valuable.\nThe rich and powerful want to know what's really going on;\nthat's how they became rich and powerful.]\nThe Times made this momentous announcement very\ninformally, in passing in the middle of an \n<a href=\"https://www.nytimes.com/2020/10/11/business/media/new-york-times-rukmini-callimachi-caliphate.html\"></a> about a\nTimes reporter who'd been criticized for inaccuracy. It's\nquite possible no senior editor even approved it. But it's\nsomehow appropriate that this particular universe ended with\na whimper rather than a bang.]\nAs the acronym DEI goes out of fashion, many of these\nbureaucrats will try to go underground by changing their\ntitles. It looks like \"belonging\" will be a popular option.]\nIf you've ever wondered why our legal system includes\nprotections like the separation of prosecutor, judge, and\njury, the right to examine evidence and cross-examine\nwitnesses, and the right to be represented by legal counsel,\nthe de facto \n<a href=\"https://www.nytimes.com/2020/03/18/magazine/title-ix-sexual-harassment-accusations.html\">parallel legal system</a>\nestablished by Title IX\nmakes that all too clear.]\nThe invention of new improprieties is most visible in\nthe rapid evolution of woke nomenclature. This is\nparticularly annoying to me as a writer, because the new\nnames are always worse. Any religious observance has to be\ninconvenient and slightly absurd; otherwise gentiles would\ndo it too. So \"slaves\" becomes \"enslaved individuals.\" But\nweb search can show us the leading edge of moral growth in\nreal time: if you search for \"individuals experiencing\nslavery\" you will as of this writing find five legit\nattempts to use the phrase, and you'll even find two for\n\"individuals experiencing enslavement.\"]\nOrganizations that do dubious things are particularly\nconcerned with propriety, which is how you end up with\nabsurdities like tobacco and oil companies having higher ESG\nratings than Tesla.]\nElon did something else that tilted Twitter rightward\nthough: he gave more visibility to paying users. Paying\nusers lean right on average, because people on the far left\ndislike Elon and don't want to give him money. Elon\npresumably knew this would happen. On the other hand, the\npeople on the far left have only themselves to blame; they\ncould tilt Twitter back to the left tomorrow if they wanted\nto.]\nIt even, as James Lindsay and Peter Boghossian\npointed out, has a concept of original sin: privilege. Which\nmeans unlike Christianity's egalitarian version, people have varying\ndegrees of it. An able-bodied straight white\nAmerican male is born with such a load of sin that only by\nthe most abject repentance can he be saved.<p>Wokeness also shares something rather funny with many actual\nversions of Christianity: like God, the people for whose\nsake wokeness purports to act are often revolted by the\nthings done in their name.</p>]\nThere is one exception to most of these rules: actual\nreligious organizations. It's reasonable for them to insist\non orthodoxy. But they in turn should declare that they're\nreligious organizations. It's rightly considered shady\nwhen something that appears to be an ordinary business or\npublication turns out to be a religious organization.]\nI don't want to give the impression that it will be\nsimple to roll back wokeness. There will be places where the\nfight inevitably gets messy — particularly within\nuniversities, which everyone has to share, yet which are\ncurrently the most pervaded by wokeness of any institutions.]\nYou can however get rid of aggressively\nconventional-minded people within an organization, and in\nmany if not most organizations this would be an excellent\nidea. Even a handful of them can do a lot of damage. I bet\nyou'd feel a noticeable improvement going from a handful to\nnone.","contentLength":36284,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42682305"},{"title":"I created an open-source Hardware Hacking Wiki – with tutorials for beginners","url":"https://www.hardbreak.wiki/","date":1736681392,"author":"hw-f3nter","guid":186,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42672821"},{"title":"Kenney.nl: Free Game Assets","url":"https://www.kenney.nl/","date":1736659070,"author":"memalign","guid":185,"unread":true,"content":"<p>With our tools, you don't need any knowledge of complex software or frameworks to create 3D models. At a very affordable price, you can get instant results that can be used in most game engines.</p>","contentLength":194,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42671472"},{"title":"Meta's memo to employees rolling back DEI programs","url":"https://www.axios.com/2025/01/10/meta-dei-memo-employees-programs","date":1736531284,"author":"bsilvereagle","guid":184,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42657901"},{"title":"I've acquired a new superpower","url":"https://danielwirtz.com/blog/spot-the-difference-superpower","date":1736519674,"author":"wirtzdan","guid":183,"unread":true,"content":"<div>Yesterday, I was browsing Reddit. Midway through my feed, I stumbled upon <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.reddit.com/r/toptalent/s/ZyjjQGvQiM\">a video from a German TV show</a>, where a 9-year-old girl demonstrated her ability to quickly identify the difference between two seemingly similar images.</div><div>She repeated this with other images, always almost instantly calling out the differences. I was baffled. How is this possible?</div><div>I turned my attention to the comments to see how Reddit reacted to this genius of a kid. </div><div>The top comment immediately caught my attention:</div><div>Wait, what? This can't be the case.</div><div>I paused the video, trying to cross my eyes, but without luck. To give it another chance, I googled for \"simple spot-the-difference puzzle\" and tried again.</div><div>For a moment, the images just seemed to blur over each other. But then suddenly, the images seemed to lock together in the middle, creating a third image between the two others that I was able to focus on.</div><div>And the top Reddit comment was right. In the third image, some parts of the image stuck out. They looked a bit like they were shimmering or being lifted from the page. I was instantly able to call out the differences.</div><div>I went back to the more difficult images from the video. Having trained to cross my eyes helped. It took me a second, but I was able to cross my eyes and get the third image to lock in. And again, I instantly spotted a shimmering detail in the image—the one small difference between the two images.</div><div>In high anticipation, I demonstrated my newly found skill to my fiancée. She wasn’t as impressed as I thought she would be, but it still felt like I had just drunk a magic potion and gained a special superpower.</div><div>Down below, you will find an easy, hard, and superhuman spot-the-difference puzzle.</div><div>Practice on the easy one first, then work your way forward.</div><div>Here is the step-by-step technique, that worked for me:</div><ul><li>Get a bit closer to the screen so you can see both images clearly.</li></ul><ul><li>Now, cross your eyes and aim to overlap both images.</li></ul><ul><li>When the images are overlapping, try to focus on the image in the middle.</li></ul><ul><li>At one point, it should come into focus, and you can relax your eyes.</li></ul><ul><li>Now look at the image, and the shimmering details should stand out to you.</li></ul><div> I’ve posted this on Hacker News and it sparked a thread of interesting comments and stories. <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://news.ycombinator.com/item?id=42655870\">Here a link to the post</a>. \n\nWoah, I wouldn’t have expected so many readers! Funny to imagine how many people started crossing their eyes at their office or at home because of this small article. Some asked me how I build my website. It’s actually open-source, and you can <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/wirtzdan/website\">find the Github repo here</a>.</div>","contentLength":2544,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42655870"},{"title":"Show HN: Tetris in a PDF","url":"https://th0mas.nl/downloads/pdftris.pdf","date":1736429493,"author":"ThomasRinsma","guid":182,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42645218"},{"title":"Luigi Mangione's account has been renamed on Stack Overflow","url":"https://substack.evancarroll.com/p/the-erasure-of-luigi-mangione","date":1736402558,"author":"OsrsNeedsf2P","guid":181,"unread":true,"content":"<p><a href=\"https://en.wikipedia.org/wiki/Stack_Exchange\" rel=\"\">Stack Exchange</a><a href=\"https://cooking.stackexchange.com\" rel=\"\">cooking</a><a href=\"https://politics.stackexchange.com/\" rel=\"\">politics</a><a href=\"https://judaism.stackexchange.com/\" rel=\"\">Judaism</a><a href=\"https://islam.stackexchange.com/\" rel=\"\">Islam</a><a href=\"https://en.wikipedia.org/wiki/Prosus\" rel=\"\">Prosus</a><a href=\"https://en.wikipedia.org/wiki/Stack_Overflow\" rel=\"\">Stack Overflow</a></p><p><a href=\"https://creativecommons.org/\" rel=\"\">Creative Commons</a></p><blockquote><p><a href=\"https://meta.stackexchange.com/users/332043/zoe-save-the-data-dump\" rel=\"\">Zoe - Save the data dump</a></p></blockquote><p><a href=\"https://en.wikipedia.org/wiki/Ross_Ulbricht\" rel=\"\">Ross Ulbricht</a></p><blockquote><p>you grant Stack Overflow the perpetual and irrevocable right and license to access, use, process, copy, distribute, export, display and to commercially exploit such Subscriber Content, even if such Subscriber Content has been contributed and subsequently removed by you as reasonably necessary to, for example (without limitation):</p><ul><li><p>Provide, maintain, and update the public Network</p></li><li><p>Process lawful requests from law enforcement agencies and government agencies</p></li><li><p>Prevent and address security incidents and data security features, support features, and to provide technical assistance as it may be required</p></li><li><p>Aggregate data to provide product optimization</p></li></ul><p>This means that you cannot revoke permission for Stack Overflow to publish, distribute, store and use such content and to allow others to have derivative rights to publish, distribute, store and use such content.</p></blockquote><p>As of yet, Stack Exchange has not replied to the above post, but they did promptly and within hours gave me a year-long ban for merely raising the question. Of course, they did draft a letter which credited the action to other events that occurred weeks before where I merely upvoted contributions from Luigi and bountied a few of his questions.</p><p>It’s important to grasp the severity of my suspension: suspending a professional resource for one year will create a hardship for me. And, I’m one of the largest producers of content on the network (by any measure I’m in the top 0.1% of members). All of that said, with the growth of AI and competition in their industry it’s never been easier to weather a ban from Stack Exchange, even if they are the big player.</p><blockquote><p><a href=\"https://meta.stackexchange.com/q/405208\" rel=\"\">Removing attribution because someone was charged but not convicted with a crime?</a><strong>yes, that question brought a </strong><strong> more attention to the overall situation, which includes your targeted voting/bounties. If you had not posted that question, it's unclear when your targeted voting/bountied would have been seen by Stack Overflow moderators.</strong></p></blockquote><p>That reads to me like “yes, it was retribution.” My response to this was simple,</p><blockquote><p><strong>if an employee steals a pen and he's fired from it only after reporting sexual harassment the company's defense can't be \"we would have eventually fired you for stealing the pen\", right? That's not a defense the employer can reasonably make at that point despite being otherwise actionable.</strong></p></blockquote><p>I concluded with the following,</p><blockquote><p>That's all I'm doing here in asking the question.</p></blockquote><p>How does this sit with how other tech sites react?</p><p>While all of these companies took different approaches the only one that chose to both erase him and keep the content, is Stack Exchange.</p>","contentLength":2710,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42642089"},{"title":"I had to take down my course-swapping site or be expelled","url":"https://www.linkedin.com/posts/jdkaim_github-jdkaimhuskyswap-huskyswap-project-activity-7282609173316415488-1jdb","date":1736371632,"author":"jdkaim","guid":180,"unread":true,"content":"<p dir=\"ltr\" data-test-id=\"main-feed-activity-card__commentary\">Choices software professionals make today have become exponentially more complicated. Every day, some programmer somewhere is wondering: Which framework to learn?, what tech stack to use?, monolith or multi-tier or microservices architecture?, on-premise or cloud?, if cloud then AWS or GCP or Azure or something else?, and even more choices on databases, programming languages, operating systems, different versions, etc. The most complicated award probably goes to choosing the right JavaScript framework, that is if you even can keep up with new releases!!! 😱\n\nAfter 25 years in the industry, here are my two cents:\n\n1. Conquer the basics when you're learning. Low level language, data structures, algorithms, design patterns, and web fundamentals (HTML, CSS and plain JavaScript before any framework). Also form a habit to complete learning one before going to the next.\n\n2. After that, keep it simple and go with the flow based on the problem you're solving. Understanding the problem you're solving, thinking about it, designing the solution, running it by a few others before even starting to code would take you further than most others.\n\n3. Develop other things along the way that are equally material, vital and rewarding than being just a good programmer. These include: presentation skills; positive, moving-forward attitude; knowledge-sharing, and continuous learning mindset.\n\n4. Most important of all: Have fun! Despite all the chaos, I still find it to be a lot of fun.</p>","contentLength":1488,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42638626"},{"title":"NeuralSVG: An Implicit Representation for Text-to-Vector Generation","url":"https://sagipolaczek.github.io/NeuralSVG/","date":1736360197,"author":"lnyan","guid":179,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42636873"},{"title":"Show HN: Atlas of Space","url":"https://atlasof.space/","date":1736347654,"author":"pieix","guid":178,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42634787"},{"title":"Cracking a 512-bit DKIM key for less than $8 in the cloud","url":"https://dmarcchecker.app/articles/crack-512-bit-dkim-rsa-key","date":1736339554,"author":"awulf","guid":177,"unread":true,"content":"<p>Driven by curiosity, we decided to explore whether we could crack one of these keys. Our goal was to extract the private key from a public RSA key, enabling us to sign emails as if we were the original sender. We were also curious to see whether emails signed with this compromised key would pass the DKIM verification checks of major email providers like Gmail, Outlook.com, and Yahoo Mail, or if they would outright refuse to verify a signature generated with such a short key.</p><p>For our experiment, we chose redfin.com after discovering a 512-bit RSA public key at <i>key1._domainkey.redfin.com</i> (now no longer available):</p><pre>$ dig +short TXT key1._domainkey.redfin.com\n\"k=rsa; p=MFwwDQYJKoZIhvcNAQEBBQADSwAwSAJBAMx7VnoRmk/wFPeFWxrVUde6AJQI51/uPFL2CbiHGMnRSnLjPs72AgxAVHIe5QrNQ2riR5+7u47Sgh5R5va/d0cCAwEAAQ==\"</pre><h2>Decoding the RSA Public Key</h2><p>The public key, located in the DKIM record’s  tag, is encoded in <a href=\"https://en.wikipedia.org/wiki/X.690#DER_encoding\" target=\"_blank\">ASN.1 DER format</a>, and further encoded as Base64. To decode the key to obtain the modulus () and the public exponent (), we used a couple of lines of Python code:</p><pre>$ python3\n&gt;&gt;&gt; from Crypto.PublicKey import RSA\n&gt;&gt;&gt; RSA.import_key('-----BEGIN PUBLIC KEY-----\\n' + 'MFwwDQYJKoZIhvcNAQEBBQADSwAwSAJBAMx7VnoRmk/wFPeFWxrVUde6AJQI51/uPFL2CbiHGMnRSnLjPs72AgxAVHIe5QrNQ2riR5+7u47Sgh5R5va/d0cCAwEAAQ==' + '\\n-----END PUBLIC KEY-----')\nRsaKey(n=10709580243955269690347257968368575486652256021267387585731784527165077094358215924099792804326677548390607229176966588251215467367272433485332943072098119, e=65537)</pre><h2>Factorizing the RSA Modulus</h2><p>With the modulus  in hand, our next step was to identify the two prime numbers,  and , whose product equals . This process, known as factoring, can be quite challenging to perform efficiently. Fortunately, we found a powerful open-source tool called <a href=\"https://cado-nfs.gitlabpages.inria.fr/\" target=\"_blank\">CADO-NFS</a>, which offers an easy-to-use implementation of the Number Field Sieve (NFS) algorithm — the most efficient method available for factoring large integers.</p><p>Since factoring takes a lot of computing power and we didn’t want to tie up our computers for days, we went with renting a cloud server. We chose a server with 8 dedicated vCPUs (AMD EPYC 7003 series) and 32 GB of RAM from Hetzner, installing Ubuntu as the OS. Setting up CADO-NFS was straightforward:</p><pre>git clone https://gitlab.inria.fr/cado-nfs/cado-nfs.git\ncd cado-nfs\nmake</pre><p>To ensure the server had enough memory for the task, we added 32 GB of swap space:</p><pre>sudo fallocate -l 32G /swapfile\nsudo chmod 600 /swapfile\nsudo mkswap /swapfile\nsudo swapon /swapfile</pre><p>We started the factorization by calling the  script with  as the input:</p><pre>./cado-nfs.py 10709580243955269690347257968368575486652256021267387585731784527165077094358215924099792804326677548390607229176966588251215467367272433485332943072098119</pre><p>The process took approximately 86 hours on our 8-vCPU server, successfully factorizing  into  and :</p><pre>Info:Complete Factorization / Discrete logarithm: Total cpu/elapsed time for entire Complete Factorization 2.20529e+06/309865 [3d 14:04:25]\n97850895333751392558280999318309697780438485965134147739065017624372104720767 109447953515671602102748820944693252789237215829169932130613751100276125683257</pre><p>Although opting for a more powerful server or distributing the workload across several systems (a process simplified by CADO-NFS) could have expedited the task, we weren’t pressed for time and didn’t mind the wait.</p><h2>Constructing the RSA Private Key</h2><p>After determining  and , we had all the necessary components to construct the RSA private key. The process involved using Python and the PyCryptodome library:</p><pre>$ python3\n&gt;&gt;&gt; from Crypto.PublicKey import RSA\n&gt;&gt;&gt; from Crypto.Util.number import inverse\n&gt;&gt;&gt; p = 97850895333751392558280999318309697780438485965134147739065017624372104720767\n&gt;&gt;&gt; q = 109447953515671602102748820944693252789237215829169932130613751100276125683257\n&gt;&gt;&gt; e = 65537\n&gt;&gt;&gt; n = p * q\n&gt;&gt;&gt; phi = (p-1) * (q-1)\n&gt;&gt;&gt; d = inverse(e, phi)\n&gt;&gt;&gt; key = RSA.construct((n, e, d, p, q))\n&gt;&gt;&gt; private_key = key.export_key()\n&gt;&gt;&gt; print(private_key.decode())</pre><p>These Python lines output the private key in PEM format, ready for use:</p><pre>-----BEGIN RSA PRIVATE KEY-----\nMIIBOgIBAAJBAMx7VnoRmk/wFPeFWxrVUde6AJQI51/uPFL2CbiHGMnRSnLjPs72\nAgxAVHIe5QrNQ2riR5+7u47Sgh5R5va/d0cCAwEAAQJAPliEv2dKk4DyA54nbwEH\nmSzfLEOiuD8dKXZW9GpMhou72DYYcc5YD0PeQW0uGGsusnTZXRU3Kd3cmVfeR+np\n4QIhANhVpOQ440Gqlda3nqCOAag12jq8ET+qr1G7VL8x9PF/AiEA8flYr5rUO6Io\n/5HRoHq6p7dA75PRK+7v79o0/ijfTjkCIEdWPpCPfckKomxykllpWnyIfZT+rUVs\nWHHAL1r480erAiAz3xD87ALtGbESQE8gyM50n5sjAJwJf/odf7h2d4qPOQIhAKwr\nNv6s5cQiwbYgm1KND83nrkxe6uFQlu9ilkdwAIY4\n-----END RSA PRIVATE KEY-----</pre><h2>Sending DKIM-Signed Test Mails From @redfin.com</h2><p>With the RSA private key integrated into our OpenDKIM setup, we proceeded to the testing phase. We crafted a simple email with a FROM address of security@redfin.com, then sent it to a variety of email hosting services. Although most providers correctly identified the 512-bit key as insecure and rejected our DKIM signature, three major providers — Yahoo Mail, Mailfence, and Tuta — reported a  result.</p><p>Here’s how each provider responded:</p><ul></ul><p>Given that redfin.com also has a valid DMARC record (<code>v=DMARC1;p=reject;pct=100;rua=mailto:a+99923342@fdmarc.net;ruf=mailto:f+99923342@fdmarc.net;ri=3600;fo=1;</code>), passing the DKIM check for  also means that our email passed DMARC verification and met the requirements for <a href=\"https://bimigroup.org/\" target=\"_blank\">BIMI</a>.</p><p>Three decades ago, breaking a 512-bit RSA public key was a feat achievable only with a supercomputer. Today, it’s possible to do so in just a few hours for less than US$8 on a cloud server. And if you have a powerful computer at home with 16 or more cores, you could accomplish this even more swiftly and cost-effectively.</p><p>There’s no good reason to use 512 or 768-bit keys these days. Email providers should automatically reject any DKIM signature generated with an RSA key shorter than 1,024 bits. We’ve alerted Yahoo, Mailfence, and Tuta about our findings and shared this advice with them.</p><p>Domain owners must also take action by reviewing their DNS settings for any outdated DKIM records that don’t comply with the 1,024-bit minimum standard. A simple way to check a DKIM record’s  tag is to count its Base64 characters: a 1,024-bit RSA public key will have at least 216 characters.</p>","contentLength":6200,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42633501"},{"title":"Operating System in 1,000 Lines – Intro","url":"https://operating-system-in-1000-lines.vercel.app/en","date":1736320730,"author":"ingve","guid":176,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42631873"},{"title":"Magic/tragic email links: don't make them the only option","url":"https://recyclebin.zip/posts/annoyinglinks/","date":1736283984,"author":"gepeto42","guid":175,"unread":true,"content":"<p>The term “Magic Links” once meant a <a href=\"https://en.wikipedia.org/wiki/Magic_Link\">futuristic PDA</a>. Nowdays, companies like <a href=\"https://auth0.com/docs/authenticate/passwordless/authentication-methods/email-magic-link\">Auth0</a> use it to refer to the slightly-magical feat of including a login link in an email.</p><p>Last week, the great website you should subscribe to if you haven’t already (it’s great, when you’re not logged out), <a href=\"https://www.404media.co/\">404 Media</a>, posted <a href=\"https://www.404media.co/we-dont-want-your-password-3/\">“We Don’t Want Your Password”</a> in defense of so-called magic links.</p><p>Of course, as stated in the article, such email links are harder to phish than passwords, can’t lead to a breach of passwords, and protect the site itself against users who might reuse passwords previously compromised.</p><p>The article even covers some of my annoyances with this system, but throws out this sentence:</p><p>Easier than what? Easier than a long password, without a password manager? Easier than a passkey? Easier than an OTP sent to the same email address?</p><p>This sentence reads to me as one written by someone mostly working and  from a single laptop and mobile device. The second part of the sentence, calling for more sites to do this is why I am writing this.</p><p>For any scenario with a minimal amount of complexity, like users with multiple computers, and you’re looking at a scenario where the site’s unwillingness to deal with other login methods shoves friction on the end-user.</p><ol><li>Multiple devices. Who doesn’t use at least a few computers weekly? I don’t have my email on my gaming PC, nor do I have it on my work laptops.</li><li>Slower. From 2 seconds slower to minutes slower, depending on SMTP delays as well as how awkward it is to get the link to the right browser.</li><li>Anti-mobile. As mentioned by 404 in their own article, this breaks the ability to use in-app browsers, which is quite annoying especially for RSS reader type apps. It makes interacting with any local link in the RSS feed extremely annoying.</li><li>Indirect security downsides. Pushing people to access personal email on work devices (or vice-versa) isn’t exactly a win for security.</li></ol><p>Another annoying  system is to email or SMS an OTP the end user can type in.</p><p>While this sucks, it at least allows you to easily log in in situations where you don’t have a clear and easy copy/paste path from the email client to the browser you want to log in to.</p><p><a href=\"https://stratechery.com/\">Stratechery</a>, powered by <a href=\"https://passport.online\">Passport</a>, uses this type of scheme (click link OR type in OTP), which is still shifting annoyances onto end-users to free developers from implementing passkeys, but at least has a bit more of an appreciation for end-users.</p><p>If you insist on using magic/tragic links by default, at least consider offering a robust alternative, such as <a href=\"https://fidoalliance.org/passkeys/\">passkeys</a>, especially if your audience is technical and privacy-focused.</p>","contentLength":2624,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42627453"},{"title":"Mistakes engineers make in large established codebases","url":"https://www.seangoedecke.com/large-established-codebases/","date":1736282675,"author":"BerislavLopac","guid":174,"unread":true,"content":"<p>Working in large established codebases is one of the hardest things to learn as a software engineer. You can’t practice it beforehand (no, open source does not give you the same experience). Personal projects can never teach you how to do it, because they’re necessarily small and from-scratch. For the record, when I say “large established codebases”, I mean:</p><ul><li>Single-digit million lines of code (~5M, let’s say)</li><li>Somewhere between 100 and 1000 engineers working on the same codebase</li><li>The first working version of the codebase is at least ten years old</li></ul><p>I’ve now spent a decade working in these codebases. Here’s what I wish I’d known at the start.</p><h3>The cardinal mistake is inconsistency</h3><p>There’s one mistake I see more often than anything else, and it’s absolutely deadly: ignoring the rest of the codebase and just implementing your feature in the most sensible way. In other words, limiting your touch points with the existing codebase in order to keep your nice clean code uncontaminated by legacy junk. For engineers that have mainly worked on small codebases, this is very hard to resist. But you must resist it! In fact, you must sink as deeply into the legacy codebase as possible, <strong>in order to maintain consistency.</strong></p><p>Why is consistency so important in large codebases? Because it protects you from nasty surprises, it slows down the codebase’s progression into a mess, and it allows you to take advantage of future improvements.</p><p>Suppose you’re building an API endpoint for a particular type of user. You could put some “return 403 if current user isn’t of that type” logic in your endpoint. But you should first go and look to see what other API endpoints in the codebase do for auth. If they use some specific set of helpers, you should also use that helper (even if it’s ugly, hard to integrate with, or seems like overkill for your use case). <strong>You must resist the urge to make your little corner of the codebase nicer than the rest of it.</strong></p><p>The main reason to do this is because large codebases have a lot of landmines in them. For instance, you might not know that the codebase has a concept of “bots”, which are like users but not quite, and require special treatment for auth. You might not know that the internal support tooling in the codebase allows an engineer to sometimes authenticate on behalf of a user, which requires special treatment for auth. There’s definitely another hundred things you might not know. Existing functionality represents a safe path through the minefield. If you do your auth like other API endpoints that have stuck around for a long time, you can follow that path without having to know all the surprising things that the codebase does.</p><p>On top of that, lack of consistency is the primary long-term killer of large codebases, because it makes it impossible to make any general improvements. Sticking with our auth example, if you want to ever introduce a new type of user, a consistent codebase lets you update the existing set of auth helpers to accommodate that. In an inconsistent codebase, where some API endpoints are doing things differently, you’ll have to go and update and test every one of those implementations. In practice, that means that the general change does not happen, or that the hardest 5% of endpoints to update are just left out of scope - which in turn decreases consistency further, because now you have a user type that works for most-but-not-all API endpoints.</p><p>So when you sit down to implement anything in a large codebase, you should always first go and look around for prior art, and follow that if at all possible.</p><h3>Is anything else important?</h3><p>Consistency is the most important thing. Let me quickly run through some other concerns as well, though:</p><p>You need to develop a good sense of how the service is used in practice (i.e. by users). Which endpoints are hit the most often? Which endpoints are the most crucial (i.e. are used by paying customers and cannot gracefully degrade)? What latency guarantees must the service obey, and what code gets run in the hot paths? One common large-codebase mistake is to make a “tiny tweak” that is unexpectedly in the hot path for a crucial flow, and thus causes a big problem.</p><p>You can’t rely on your ability to test the code in development like you can in a small project. Any large project accumulates state over time (for instance, how many kinds of user do you think GMail supports?) At a certain point, you can’t test every combination of states, even with automation. Instead, you have to test the crucial paths, code defensively, and rely on slow rollouts and monitoring to catch problems.</p><p>Be very, very reluctant to introduce new dependencies. In large codebases, code often lives forever. Dependencies introduce an ongoing cost in security vulnerabilities and package updates that will almost certainly outlive your tenure at the company. If you have to, make sure you pick dependencies that are widely-used and reliable, or that are easy to fork if needed. </p><p>For related reasons, if you ever get the chance to remove code, take it with both hands. This is some of the riskiest work in large codebases, so don’t half-ass it: first instrument the code to identify callers in production and drive them down to zero, so you can be absolutely certain it’s safe to remove. But it’s still worth doing. There are few things in a large codebase more worthwhile than safely removing code.</p><p>Work in small PRs and front-load the changes that affect other teams’ code. This one is important in small projects too, but it’s critical in large ones. That’s because you’ll often be relying on the domain experts in other teams to anticipate things you’ve missed (since large projects are just too complex to anticipate it all yourself). If you keep your changes to risky areas small and easy-to-read, those domain experts have a much better chance of noticing problems and saving you from an incident.</p><p>Finally, I want to take a second to defend these codebases in general. One common take I’ve heard goes like this:</p><blockquote><p>Why would you ever decide to work in the legacy mess? Spending time knee-deep in spaghetti code might be hard, but it isn’t good engineering. When faced with a large established codebase, our job should be to shrink it by splitting out small elegant services instead of wading in and making the mess larger.</p></blockquote><p>I think this is totally wrong-headed. The main reason is that, as a general rule, <strong>large established codebases produce 90% of the value</strong>. In any big tech company, the majority of the revenue-producing activity (i.e. the work that actually pays your engineering salary) comes from a large established codebase. If you work at a big tech company and don’t think this is true, maybe you’re right, but I’ll only take that opinion seriously if you’re deeply familiar with the large established codebase you think isn’t providing value. I’ve seen multiple cases where a small elegant service powers some core feature of a high-revenue product, but all the actual productizing code (settings, user management, billing, enterprise reporting, etc) still lives in the large established codebase.</p><p>So you should know how to work in the “legacy mess” because that’s what your company actually does. Good engineering or not, . </p><p>The other reason is that <strong>you cannot split up a large established codebase without first understanding it</strong>. I have seen large codebases successfully split up, but I have never seen that done by a team that wasn’t already fluent at shipping features inside the large codebase. You simply cannot redesign any non-trivial project (i.e. a project that makes real money) from first-principles. There are too many accidental details that support tens of millions of dollars of revenue.</p><ul><li>Large codebases are worth working in because they usually pay your salary</li><li>By far the most important thing is consistency</li><li>Never start a feature without first researching prior art in the codebase</li><li>If you don’t follow existing patterns, you better have a very good reason for it</li><li>Understand the production footprint of the codebase</li><li>Don’t expect to be able to test every case - instead, rely on monitoring</li><li>Remove code any chance you get, but be very careful about it</li><li>Make it as easy as possible for domain experts to catch your mistakes</li></ul><p> this post was discussed <a href=\"https://news.ycombinator.com/item?id=42627227\">on Hacker News</a>, if you’d like to read comments.</p>","contentLength":8377,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42627227"},{"title":"Show HN: Tramway SDK – An unholy union between Half-Life and Morrowind engines","url":"https://racenis.github.io/tram-sdk/why.html","date":1736266929,"author":"racenis","guid":173,"unread":true,"content":"<p>Hello everyone, I would like to see if there is any interest in this little project that I have been working on for the past few years.</p><p>Could be relevant, seeing the direction in which the mainstream game engines are going.</p><p>I didn't really like any of the already existing options, so I tried to make my own and it turned out to be easier than expected.</p><p>It's sort of like a low-budget Unreal/Source, but with open-world streaming support and it is free and open source. Very old-school. But optimized for more modern hardware. Very fast too.</p><p>Still not production ready, but it seems like it is mostly working.</p><p>I want to finish a few larger projects with it to see what happens.</p><p>Btw, the name is probably temporary.</p>","contentLength":708,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42624116"},{"title":"Ending our third party fact-checking program and moving to Community Notes model","url":"https://about.fb.com/news/2025/01/meta-more-speech-fewer-mistakes/","date":1736252122,"author":"impish9208","guid":172,"unread":true,"content":"<h2>Ending Third Party Fact Checking Program, Moving to Community Notes</h2><ul><li><a href=\"https://www.facebook.com/help/contact/1914298425761977\"></a><a href=\"https://help.instagram.com/contact/1223551615403090\"></a><a href=\"https://help.instagram.com/contact/1638078013752611\"></a></li></ul><h2>A Personalized Approach to Political Content</h2>","contentLength":111,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42621627"}]}