{"id":"VMK7D8tQvwsLtnxKHzNdF9c4Yhtuqm","title":"Hacker News: Best","displayTitle":"HN","url":"https://hnrss.org/best","feedLink":"https://news.ycombinator.com/best","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":30,"items":[{"title":"Thank HN: My bootstrapped startup got acquired today","url":"https://news.ycombinator.com/item?id=42806247","date":1737655085,"author":"paraschopra","guid":231,"unread":true,"content":"Hello HN,<p>Today, I sold the company to a private equity firm for $200mn.</p><p>I was a 22 year old fresh graduate when I launched VWO on HN and got initial users. Feedback from people like @patio11 helped me get to PMF. And now, 15 years later, \"site:ycombinator.com\" is what I appended when I wanted to search for advice on what to keep in mind while selling my company.</p><p>Thank you HN for sharing inspiration and wisdom all along. I honestly don't think I would have been an entrepreneur had it not been for hacker news.</p><p>Every single day, HN is the first website I open! I'm feeling very grateful towards the community. Thanks @dang, and thank you Paul Graham for your essays and for creating this beautiful corner of the internet!</p>","contentLength":721,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42806247"},{"title":"Show HN: I made an open-source laptop from scratch","url":"https://www.byran.ee/posts/creation/","date":1737578512,"author":"Hello9999901","guid":180,"unread":true,"content":"<blockquote><p>I do not think there is any thrill that can go through the human heart like that felt by the inventor as he sees some creation of the brain unfolding to success\n– <a href=\"https://en.wikipedia.org/wiki/Nikola_Tesla\" target=\"_blank\">Nikola Tesla</a></p></blockquote><p><strong>It’s got a 4K AMOLED display, a Cherry MX mechanical keyboard, plays Minecraft at 4K, runs +7B LLMs, surfs the web, and has ~7h battery life. All open-source.</strong></p><p><em>How I Made A Laptop From Scratch (YouTube.com). Demo at 22:14.</em></p><p><strong>The writeup below pretty much abridges the video above.</strong></p><p>Imagine a skill-chart of qualities of technology: screen, audio, performance, build, tactility, touch-interaction, efficiency, size, and so many more. At the balancing point of all these qualities is the laptop. To that end, let’s build a laptop that hits as many qualities of a modern commercial thin &amp; light laptop—while trying to do as much from scratch as possible.</p><img src=\"https://www.byran.ee/img/photo.jpg\"><p><em>Booting and inserting magnetically attached keyboard</em></p><img src=\"https://www.byran.ee/img/minecraft.jpg\"><p><em>Epic Hypixel Bedwars gaming</em></p><h2>Finding an electron in a cloud</h2><p>I first made a mental map and transferred it into Obsidian:</p><p>Boiling it down, it landed me with a lofty list of goals:</p><ul><li><a href=\"https://www.rock-chips.com/uploads/pdf/2022.8.26/192/RK3588%20Brief%20Datasheet.pdf\" target=\"_blank\">RK3588</a> SoC Motherboard\n<ul></ul></li><li>Powertrain\n<ul><li>~60Wh Li-ion battery pack</li></ul></li><li>Peripherals\n<ul><li>Wireless mechanical keyboard</li><li>Glass-topped multi-touch trackpad</li></ul></li><li>Anodized aluminum CNC chassis</li></ul><p>I looked towards single-board computer SoCs, as board manufacturers commonly release schematics for reference. In many aspects, the Rockchip RK3588 is the fastest consumer-procurable chip on the market. Despite the spotty software support, the hardware documentation has lots of developer resources and <a href=\"https://wiki.friendlyelec.com/wiki/images/1/15/CM3588_NAS_SDK_2309_SCH.PDF\" target=\"_blank\">reference schematics</a> from SBC manufacturers.</p><ul><li>Quad core A76 and quad core A55</li><li>I/O: 8K display, dual USB3.1, PCIe 3.0 x 4, HDMI2.1/eDP 1.4, etc.</li></ul><p>With only a few months to work on this project, an SoM (system on module) like the Raspberry Pi CM5 presented the best option for its hardware compatibility and a high likelihood of a snug integration. Choosing an SoM also alleviates memory and other high-speed signaling concerns. Looking around for a RK3588 SoM, I came across the CM3588 by FriendlyElec. Cheap, well-documented, and easily procurable. Sounds good!</p><img src=\"https://www.byran.ee/img/cm3588.jpg\"><p>I hopped on <a href=\"https://www.panelook.com\" target=\"_blank\">panelook.com</a> and filtered by size and resolution. I’ve always been a sucker for high pixel density, so I went with a 4K AMOLED 13.3” display. Cross referencing stock availability on Taobao (Chinese domestic Aliexpress), the <a href=\"https://www.panelook.com/ATNA33TP11_Samsung_13.3_OLED_parameter_59424.html\" target=\"_blank\">ATNA33TP11</a> seemed to be the one with most  stock since OLED risked burn-in.</p><p>A highlight: during display evaluation, switching out a connector and shortening the board by 2mm improved signal integrity  for the 1.5GHz x 4 signals go pass through. Getting the display running on Linux meant finding system logs from Asus laptops that have this display, reverse-engineering the values, and tuning the power-on timings amongst other things . TLDR; getting a 4K AMOLED eDP display running on non-mainline Linux was a heck of a journey, so read <a href=\"https://www.byran.ee/posts/creation/\">this if you’re interested</a> (coming soon).</p><img src=\"https://www.byran.ee/img/screen.jpg\"><p><em>ATNA33TP11 working with display evaluation board V2 short</em></p><p>The cells had to be 6mm thin and four packs lined up should take roughly half of the entire chassis volume. Chinese manufacturers don’t stock batteries readily, and shipping them to the US would be a pain. Thus, I looked on the American side. I stumbled upon with <a href=\"https://www.batteryspace.com/polymerli-ionmodule37v4250mah157wh85arate-prewiredwithpcbpl5467100.aspx\" target=\"_blank\">these batteries</a> from AA Portable Power Corp. or batteryspace.com. or Powerizer. Doing the power calculations, we get: 4.250Ah  4S = 62.9 Wh with max 8A (so max 134.4W discharge)! Solid.</p><p>The total voltage is 4.2V (peak) * 4S = 16.8V. The system’s designed for up to 20V USB-C (AKA 100W) and passed into the <a href=\"https://www.ti.com/product/BQ25713\" target=\"_blank\">BQ25713</a> charging IC. The batteries are balanced with the <a href=\"https://www.ti.com/product/BQ77915\" target=\"_blank\">BQ77915</a> to ensure safe charging, and the power is tracked with an <a href=\"https://www.analog.com/en/products/ltc2943.html\" target=\"_blank\">LTC2943</a> to calculate a state-of-charge percentage. I popped in an ESP32-S3 module as the controller for everything, and set it to production.</p><p>After writing drivers and sitting on the undecipherable datasheets for days, I had the batteries charging. I successfully <a href=\"https://a.co/d/3b8R9mN\" target=\"_blank\">load tested</a> it to around 5A and powered the full system. There’s still a lot of quiescent current (about ~50mA), but I haven’t had the time to optimize the firmware.</p><p>The USB of the ESP32 connects to the internal USB on the motherboard to feed the power telemetry over UART. A Python script and kernel module in the OS forwards it to the battery service in the kernel to display it natively.</p><img src=\"https://www.byran.ee/img/powertrain.jpg\"><p><em>Powertrain V0.2 inside laptop</em></p><p>In settings, tick “Align controls with KiCad” for mouse pan/zoom/scroll</p><p>With those decisions made up, I aimed for &gt;90mm motherboard width based on a prelim CAD from the batteries and display dimensions.</p><p>On the physical I/O side, I settled on dual USB3.1 Type-C ports, a USB2.0 Type-A port, a headphone jack, and a microSD card slot. Internally, the M.2 E-key connects to an <a href=\"https://a.co/d/4lJDnwX\" target=\"_blank\">RTL8852BE</a> WiFi 6 (802.11ax) + BT5.2 wireless card and the M.2 M-key accommodates up to an 2242-sized NVMe SSD. A full size NVMe SSD can fit with some modifications of the chassis too.</p><p>Tangent over, this leaves me with around ~90mm of board height. Implementing all the features on the final mainboard would stretch this writeup too long, so read <a href=\"https://www.byran.ee/posts/creation/\">this if you’re interested</a> (coming soon).</p><p>In settings, tick “Align controls with KiCad” for mouse pan/zoom/scroll</p><img src=\"https://www.byran.ee/img/mainboard.jpg\"><p><em>Detailed hardware overview</em></p><p><a href=\"https://github.com/Joshua-Riek/ubuntu-rockchip\" target=\"_blank\">Joshua Riek’s ubuntu-rockchip</a> kernel/distro combined an out-of-the-box experience with lots of optimizations. Using Armbian’s kernel (I believe it’s still off Rockchip’s kernel) meant that it offered nearly all the features of the RK3588 on a developer-ready kernel configuration.</p><p>Since nearly all the work I needed to do was abstracted in the DeviceTree (DTS) hardware configuration language implemented with U-boot, the bootloader, I took advantage of their system-agnostic nature to speed up my trial-and-error process having never done any Linux work.</p><p>Instead of developing and compiling code on the RK3588 itself, I used my daily driver MacBook and Visual Studio Code. Once I made a change in the DTS, I’d use Orbstack (virtualization software) running Ubuntu 24.04 (shared filesystem and kernel with macOS) and compile the DeviceTree there.</p><pre tabindex=\"0\" data-language=\"txt\"><code></code></pre><p>Pointing U-Boot to a custom compiled DTB (devicetree binary), I ’ed the compiled  to the OS. A  regenerates the bootloader configurations, and a reboot updates the changes.</p><p>That’s how I did the hardware bringup—display configurations, PCIe, USB, and other low-level system tweaks. The rest is just a standard install of Ubuntu 24.04 LTS with Linux Kernel 6.1.</p><img src=\"https://www.byran.ee/img/working.jpg\"><p><em>Testing batteries and writing DTS</em></p><p><em>In-depth software overview</em></p><p>Imagine being able to just pull out your laptop’s keyboard and use it as just another wireless keyboard for literally anything! Just me? Maybe.</p><p>Being a mechanical keyboard addict with quite a few <a href=\"https://zmk.dev\" target=\"_blank\">ZMK keyboards</a> designed, I chose the <a href=\"https://github.com/pashutk/Cherry_MX_ULP\" target=\"_blank\">Cherry MX ULP mechanical switches</a> for the best feel. Of course, a battery and fully mechanical switches add  of height. I used a 1mm thin <a href=\"https://www.powerstream.com/thin-lithium-ion.htm\" target=\"_blank\">200mAh battery</a> and a custom battery protection board that sticks up between two rows of keys to cut down on ~1.6mm (PCB height). The nRF52840 SoC running ZMK Firmware is right underneath the spacebar. A sandwich of PLA and 6061 aluminum from Fabworks crammed everything under ~7mm.</p><p>Since the keycaps aren’t easily procurable, I got a <a href=\"https://www.printedsolid.com/products/e3d-revo-nozzles?srsltid=AfmBOopKMJDs7gFpzrJg3kHQ-aJLDFTjeFO0ZJAYf1hADzy5iurNlkLB\" target=\"_blank\">0.15mm nozzle</a> for my Bambu Lab X1C and printed them with PLA. It got me down a rabbit hole of tungsten nozzles, and I got quoted ~$400 for 20x 0.15mm nozzles. I’ve been thinking of trying that out too. But alas, printing out all the keycaps and assembling for the last time, the keyboard was done.</p><p>Moving on to the trackpad, it was quite quick. I knew from the start that I wanted a good trackpad, so making my own with zero capacitive tracking experience is a no-go. Searching online, I came across the Azoteq <a href=\"https://www.mouser.com/ProductDetail/Azoteq/PXM0057-401-S?qs=t7xnP681wgVkp9ZZYy6TPA%3D%3D\" target=\"_blank\">PXM0057-401</a> evaluation module on Mouser. It had it all—glass surface, multi-touch, and worked over USB. And, it was only 35 bucks or so. However, the trackpad has ceased production without many alternatives.</p><p>With the keyboard and trackpad working, it was time to put on the finishing touches.</p><p>In settings, tick “Align controls with KiCad” for mouse pan/zoom/scroll</p><img src=\"https://www.byran.ee/img/peripherals.jpg\"><p>*Counterclockwise from top left: keyboard side profile, typing on keyboard, trackpad, 1mm battery on back, nRF52840 SoC area</p><p><em>OnShape wireframe exploded view</em></p><p>Roughly the same time I began the system design, I sent a few CNC aluminum blocks off to JLC for evaluation with different anodization finishes. The dark gray anodization felt “best”, but I preferred the look of the matte black, so I settled on that.\nUsing PTC OnShape, I (attempted) CAD’ed a robust and minimalistic look and a blend of my two favorite laptop lineup designs, the Razer Blade and the MacBook Pro. Because of the removable keyboard, the bottom has no screws. Instead, the palm rest screws into the bottom chassis. <a href=\"https://cad.onshape.com/documents/a18bb6df7dbba66df24a7ec8/w/967d921e60c207e3b6f5cf7b/e/1f78a9387b17c2d178742295?renderMode=0&amp;uiState=678da20d5bee0d1ad2dd55f1\" target=\"_blank\">CAD Link here.</a></p><p>The hardest part about the chassis was the hinge. I used <a href=\"https://frame.work/products/display-hinge-kit?v=FRANFB0001\" target=\"_blank\">Framework’s 13.3” hinge</a> because it has a 3D model. I constrained it in OnShape so I can see the exact closing angles.</p><p>The chassis layout is fairly simple: batteries on the bottom, the power board on the right, motherboard on the left, and the hinge mechanism on top. Oh, and a transparent PETG FDM printed power button that lights up on a custom PCB. To balance out the asymmetric hinge (caused by the mainboard being too wide), a little <a href=\"https://www.mcmaster.com/2153T11/\" target=\"_blank\">carbon fiber rod</a> lines up on the left side too.</p><img src=\"https://www.byran.ee/img/chassis_empty.jpg\"><p>It was a battle to get the screen assembly to not hit anything while also covering\nAlthough I started considering thermals way in advance, hence the gap here for the heatpipe to go through, I still had difficulty fitting everything in. The distance between the bottom of the keyboard and the top of the heatsink is less than a half a millimeter. The cooling system is really constrained because I don’t have the resources to make a custom heatpipe and fin solution. So, I made a full copper CNC heatsink (from JLCCNC) and a heatpipe connected to a fan. It’s all connected with <a href=\"https://www.lttstore.com/products/ptm7950-phase-change-thermal-pad\" target=\"_blank\">PTM7950</a>.</p><p>I also added <a href=\"https://puiaudio.com/product/speakers-and-receivers/as04004mo-sp40\" target=\"_blank\">these</a> PUI audio speakers on either side. The audio from the CM3588’s DAC didn’t work and I ran out of debugging time, so I made a USB to audio converter board separately and shot it through an Class-D amplifier. I would’ve also made the amp, but I ran out of time.</p><p>As I reached final assembly, I used a mix of JLC’s selective laser sintering (SLS) of nylon powder and FDM printed PA6-CF for smaller structural parts. Putting it all together with the matte black CNC aluminum chassis, I finally had my laptop.</p><img src=\"https://www.byran.ee/img/inside.jpg\"><p><em>Inside full laptop assembly</em></p><p>The hardest class I’ve taken so far was quantum mechanics in my junior spring term. A few months before spending hours solving time-independent and dependent Schrödinger equations, I was on the squash bus (the sport, not the vegetable). My friend suggested I make a laptop for my senior project—and that was all.\nI came up with the name anyon_e in June, after I finished the quantum course.</p><p>Making this laptop was hard. Mentally pressured with a deadline, and a constant inter-disciplinary challenge across electrical, software, and mechanical systems. Summing up everything I’ve ever done. It took up most of my mind from May until now.</p><p>Inspired by open-source projects like <a href=\"https://zmk.dev\" target=\"_blank\">ZMK</a>, <a href=\"https://www.kicad.org\" target=\"_blank\">KiCAD</a>, <a href=\"https://www.blender.org\" target=\"_blank\">Blender</a>, and countless <a href=\"https://certification.oshwa.org/basics.html\" target=\"_blank\">OSHW</a> projects, I want to do my own little part. To put power in people’s hands in creation, innovation, imagination, or whatever else. To attempt the impossible.</p><img src=\"https://www.byran.ee/img/conclusion.jpg\">","contentLength":11328,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42797260"},{"title":"How to improve your WFH lighting to reduce eye strain","url":"https://rustle.ca/posts/articles/work-from-home-lighting","date":1737576537,"author":"jahfer","guid":230,"unread":true,"content":"<div><p><em>I work from home everyday, I am susceptible to eye strain, eye pain, and dizziness. Having a working environment that’s as easy on my eyes as possible is of critical importance. I hope that by sharing what I've learned, it can be helpful to you if you work from home, and like many, have experienced WFH eye strain.</em></p><p><em>Disclaimer: I'm not an ergonomist or optometrist. These tips are intended to help improve your work from home comfort based on my own personal experience.</em></p></div><div><ol><li>An even, diffused lighting environment is best for the eyes</li><li>When it comes to light brightness, too much is just as problematic as too little</li><li>Use natural light wherever possible&nbsp;</li><li>Quality of artificial light matters</li><li>The best lighting for camera, is not necessarily the best lighting for ergonomics</li><li>Even the perfect lighting environment will fatigue you — take breaks, and take care of yourself</li></ol></div><h2>What is it about computer screens that makes them fatiguing?</h2><div><p>Most monitors have some level of flicker. This flickering is generally not visually noticeable, but can still be fatiguing. Monitors at lower brightness levels exhibit more flicker - as they use PWM dimming (Pulse Width Modulation). In some monitors this is done by changing the ON/OFF intervals, increasing OFF timing, and lowering ON timing — while maintaining the same brightness! This creates an awful strobe-effect, and can be very exhausting — especially when working in an environment where the monitor is the sole light source.</p></div><div><p>High contrast lighting can exist in a few different formats. It can exist as  — that is for example light coming in from a window, into a dark room, illuminating a part of your desk. This glare is fatiguing on your eyes because they are accommodating for two levels of brightness simultaneously, while also trying to conduct tasks on a computer monitor — such as reading. High contrast can also exist in a room with bright light on the left, and darkness on the right. This is fatiguing for your eyes to compensate for.</p></div><div><p>When working at a computer, most of the time and the don't move significantly. We focus at the same distances for long periods of time. This causes our eye muscles to get tight and overworked. This can cause our eyes to get tired, spasm, or sometimes even make it very hard to relax our eyes. Although improved office lighting can help with this, the main way to solve for this problem is to take breaks practicing the 20/20/20 rule: Every 20 minutes, look up from your screen and focus on something approximately 20 feet away for at least 20 seconds.</p></div><div><p>Light in the office primarily comes in from the sun. The direct light causes glare, and because of the lack of diffusion, makes for dark corners in the room. Even with a light overhead, it's not enough to equal the amount from outside. This results in high contrast, dark spots behind the monitor, and harsh shadows. Blackout curtains are of little help because they only serve to reduce the size of the light coming in, as opposed to aiding with diffusion. Anytime it's dark outside, it's like working at night. Not fun.</p></div><div><p>Light primarily comes from above. Because of this single light source, it makes for harsh shadows, dark spots, and high contrast. The contrast issue is particularly apparent with the monitor, which although can be dimmed, creates a bright monitor, which also self-shades the wall behind resulting in a dark background.</p></div><h5>Window light sources, and filtering light</h5><div><p>Windows now have light-filtering curtains, which helps to not only reduce the amount of light on bright days, but also to heavily diffuse the light coming in, which makes for a beautiful glow in the room. In addition, I've installed wood-blinds (not shown) behind the curtains which helps to further control the amount of light entering the office on very bright days.<em>Products used: Sheer curtains • Wood Blinds</em></p></div><div><p>Each corner of the room now has a torchiere lamp, which helps to create an even lighting environment. These lamps point directly up and light the room indirectly through reflections off of the walls and ceiling. In the center of the ceiling, a fabric wrapped light fixture provides  diffused lighting. This light is dimmable and can be adjusted to match the amount of light from the standing lamps. </p></div><div><p>The desk now has even lighting. The brightness of the monitor is now matched by a dimmable flicker-free backlight, which makes working at the display less fatiguing. In addition, a monitor lightbar (not shown), provides indirect light to the desk, reflected off the surface which is completely dimmable and flicker-free. These two lights together help to make for an even lighting environment during the day, and a calm and cozy environment at night. In addition to the two lights, the Apple Studio display has an ambient light sensor, which adjusts the brightness to match the ambient light, which is a game changer for light sensitive people. </p></div><div><ol><li><p><strong>An even, diffused lighting environment is best for the eyes. </strong>Try to balance out dark/light spots with additional lighting, and diffusing strong light sources — like the sun.</p></li><li><p><strong>When it comes to light brightness, too much is just as problematic as too little. </strong>When dealing with too little light, add additional light sources which provide indirect, and reflective lights — such as up-lights, or torchieres, or lights that have a shade. When dealing with too much light — use blinds, sheer curtains, or light filtering curtains. If you have too much light from an artificial source, use lower wattage bulbs, or consider adding a dimmer switch.</p></li><li><p><strong>Use natural light wherever possible. </strong>If you've got natural light, use it to your advantage. Natural light is healthier than artificial light — there's no flicker, and it can provide us with much needed vitamin D. For rooms with small windows, use mirrors to help reflect natural light and fill the room. </p></li><li><p><strong>Quality of Artificial Light Matters. </strong>Wherever possible seek out high quality lighting that is dimmable and flicker-free. Spending a few extra dollars for these products is worth it, and it will result in less fatigue. For regular bulbs, I recommend <a href=\"https://www.homedepot.ca/product/philips-ultradefinition-led-a19-e26-60w-equivalent-light-bulb-dimmable-soft-white-2700k-2-pack/1001664067?eid=PS_GO_140203__ALL_PLA-526641&amp;eid=ds_ads_van_27772_FY24%20%7C%20MS%20%7C%20Always%20on%20%7C%20Google%20Shopping&amp;pid=1001664067&amp;store=7158&amp;utm_source=google&amp;utm_medium=vantage&amp;utm_campaign=25029&amp;utm_content=26766&amp;gad_source=1&amp;gclid=CjwKCAiAxea5BhBeEiwAh4t5K7JuMnZCfX-pH8h00lhpixTdd7IHwLgyH18hfcewKmL6MXn-lSnxUhoCPCUQAvD_BwE#reviews\"><em>Philipps Ultra Definition LED Soft White</em></a>bulbs which have low flicker rates, glass enclosures, high color rendering index, and a relatively inexpensive pricepoint.</p></li><li><p><strong>The best lighting for camera, is not necessarily the best lighting for ergonomics. </strong>When working from home, we spend a lot of time on video calls, and it's natural to want to look our best. Studio lights that attach to our desks, or facing a window outdoor will result in great lighting on camera, but can also cause fatigue. Consider reserving this lighting for calls, or see if generally better room lighting can result in a similar light quality on camera.</p></li><li><p><strong>Even the perfect lighting environment will fatigue you — take breaks, and think beyond lighting! </strong>Having a great lighting environment will help you with stamina, but having good work habits like the 20/20/20 rule, and changing up posture and working environments are important in order to take the best care of your eyes, and your body. Think beyond lighting when considering ergonomics, such as room humidity (to limit dry eye), posture, chair position, and stay moving to keep blood flowing.</p></li></ol></div><div><p><em>It may seem daunting, but I believe that with some small changes it can make a big difference. I hope this gives you new ideas to try, and I'd love to hear what you are doing in your own office as well! Cheers!</em></p></div>","contentLength":7392,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42796950"},{"title":"TabBoo – add random jumpscares to websites you're trying to avoid","url":"https://tabboo.xyz/","date":1737566834,"author":"thatsnotoptimal","guid":229,"unread":true,"content":"<h2>\n          Add  to sites you're\n          trying to avoid\n        </h2><p>\n          You're stuck in an addictive, endless loop, loading the same sites\n          over and over again. Install the extension and let\n           do the rest.\n        </p><a href=\"https://chromewebstore.google.com/detail/tabboo/jjdalbijcodgjpeepgllndclalllbopg\" target=\"_blank\">+ Add to Chrome</a>","contentLength":252,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42795237"},{"title":"Mastercard DNS error went unnoticed for years","url":"https://krebsonsecurity.com/2025/01/mastercard-dns-error-went-unnoticed-for-years/","date":1737559557,"author":"todsacerdoti","guid":228,"unread":true,"content":"<p>The payment card giant  just fixed a glaring error in its domain name server settings that could have allowed anyone to intercept or divert Internet traffic for the company by registering an unused domain name. The misconfiguration persisted for nearly five years until a security researcher spent $300 to register the domain and prevent it from being grabbed by cybercriminals.</p><div><img aria-describedby=\"caption-attachment-70128\" decoding=\"async\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/01/akamne.png\" alt=\"\" width=\"667\" height=\"478\"><p>A DNS lookup on the domain az.mastercard.com on Jan. 14, 2025 shows the mistyped domain name a22-65.akam.ne.</p></div><p>From June 30, 2020 until January 14, 2025, one of the core Internet servers that MasterCard uses to direct traffic for portions of the mastercard.com network was misnamed. MasterCard.com relies on five shared Domain Name System (DNS) servers at the Internet infrastructure provider [DNS acts as a kind of Internet phone book, by translating website names to numeric Internet addresses that are easier for computers to manage].</p><p>All of the Akamai DNS server names that MasterCard uses are supposed to end in “akam.net” but one of them was misconfigured to rely on the domain “.”</p><p>This tiny but potentially critical typo was discovered recently by ,&nbsp;founder of the security consultancy <a href=\"https://www.seralys.com/\" target=\"_blank\" rel=\"noopener\">Seralys</a>. Caturegli said he guessed that nobody had yet registered the domain akam.ne, which is under the purview of the top-level domain authority for the West Africa nation of <a href=\"https://en.wikipedia.org/wiki/Niger\" target=\"_blank\" rel=\"noopener\">Niger</a>.</p><p>Caturegli said it took $300 and nearly three months of waiting to secure the domain with the registry in Niger. After enabling a DNS server on akam.ne, he noticed hundreds of thousands of DNS requests hitting his server each day from locations around the globe. Apparently, MasterCard wasn’t the only organization that had fat-fingered a DNS entry to include “akam.ne,” but they were by far the largest.</p><p>But the researcher said he didn’t attempt to do any of that. Instead, he alerted MasterCard that the domain was theirs if they wanted it, copying this author on his notifications. A few hours later, MasterCard acknowledged the mistake, but said there was never any real threat to the security of its operations.</p><p>“We have looked into the matter and there was not a risk to our systems,” a MasterCard spokesperson wrote. “This typo has now been corrected.”</p><p>Meanwhile, Caturegli received a request submitted through , a program that offers financial rewards and recognition to security researchers who find flaws and work privately with the affected vendor to fix them. The message suggested his public disclosure of the MasterCard DNS error via <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7285038365236682753/\" target=\"_blank\" rel=\"noopener\">a post on LinkedIn</a> (after he’d secured the akam.ne domain) was not aligned with ethical security practices, and passed on a request from MasterCard to have the post removed.</p><div><img aria-describedby=\"caption-attachment-70126\" decoding=\"async\" loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/01/mastercard-response.png\" alt=\"\" width=\"708\" height=\"855\"><p>MasterCard’s request to Caturegli, a.k.a. “Titon” on infosec.exchange.</p></div><p>Caturegli said while he does have an account on Bugcrowd, he has never submitted anything through the Bugcrowd program, and that he reported this issue directly to MasterCard.</p><p>“I did not disclose this issue through Bugcrowd,” Caturegli wrote in reply. “Before making any public disclosure, I ensured that the affected domain was registered to prevent exploitation, mitigating any risk to MasterCard or its customers. This action, which we took at our own expense, demonstrates our commitment to ethical security practices and responsible disclosure.” </p><p>Most organizations have at least two authoritative domain name servers, but some handle so many DNS requests that they need to spread the load over additional DNS server domains. In MasterCard’s case, that number is five, so it stands to reason that if an attacker managed to seize control over just one of those domains they would only be able to see about one-fifth of the overall DNS requests coming in.</p><p>But Caturegli said the reality is that many Internet users are relying at least to some degree on public traffic forwarders or DNS resolvers like  and .</p><p>“So all we need is for one of these resolvers to query our name server and cache the result,” Caturegli said. By setting their DNS server records with a long TTL or “Time To Live” — a setting that can adjust the lifespan of data packets on a network — an attacker’s poisoned instructions for the target domain can be propagated by large cloud providers.</p><p>“With a long TTL, we may reroute a LOT more than just 1/5 of the traffic,” he said.</p><p>The researcher said he’d hoped that the credit card giant might thank him, or at least offer to cover the cost of buying the domain.</p><p>“We obviously disagree with this assessment,” Caturegli wrote in <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7285038365236682753?commentUrn=urn%3Ali%3Acomment%3A%28activity%3A7285038365236682753%2C7285289297706909697%29&amp;dashCommentUrn=urn%3Ali%3Afsd_comment%3A%287285289297706909697%2Curn%3Ali%3Aactivity%3A7285038365236682753%29\" target=\"_blank\" rel=\"noopener\">a follow-up post</a> on LinkedIn regarding MasterCard’s public statement. “But we’ll let you judge— here are some of the DNS lookups we recorded before reporting the issue.”</p><div><img aria-describedby=\"caption-attachment-70125\" decoding=\"async\" loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/01/mastercard-domains.png\" alt=\"\" width=\"790\" height=\"561\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2025/01/mastercard-domains.png 790w, https://krebsonsecurity.com/wp-content/uploads/2025/01/mastercard-domains-768x545.png 768w, https://krebsonsecurity.com/wp-content/uploads/2025/01/mastercard-domains-782x555.png 782w, https://krebsonsecurity.com/wp-content/uploads/2025/01/mastercard-domains-100x70.png 100w\" sizes=\"(max-width: 790px) 100vw, 790px\"><p>Caturegli posted this screenshot of MasterCard domains that were potentially at risk from the misconfigured domain.</p></div><p>As the screenshot above shows, the misconfigured DNS server Caturegli found involved the MasterCard subdomain . It is not clear exactly how this subdomain is used by MasterCard, however their naming conventions suggest the domains correspond to production servers at Microsoft’s  cloud service. Caturegli said the domains all resolve to Internet addresses at Microsoft.</p><p>“Don’t be like Mastercard,” Caturegli concluded in his LinkedIn post. “Don’t dismiss risk, and don’t let your marketing team handle security disclosures.”</p><p>One final note: The domain akam.ne has been registered previously — in December 2016 by someone using the email address um-i-delo@yandex.ru. The Russian search giant Yandex reports this user account belongs to an “Ivan I.” from Moscow. Passive DNS records from <a href=\"https://www.domaintools.com\" target=\"_blank\" rel=\"noopener\">DomainTools.com</a> show that between 2016 and 2018 the domain was connected to an Internet server in Germany, and that the domain was left to expire in 2018.</p><p>This is interesting given <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7285038365236682753?commentUrn=urn%3Ali%3Acomment%3A%28activity%3A7285038365236682753%2C7285221445796835329%29&amp;replyUrn=urn%3Ali%3Acomment%3A%28activity%3A7285038365236682753%2C7285223757982363648%29&amp;dashCommentUrn=urn%3Ali%3Afsd_comment%3A%287285221445796835329%2Curn%3Ali%3Aactivity%3A7285038365236682753%29&amp;dashReplyUrn=urn%3Ali%3Afsd_comment%3A%287285223757982363648%2Curn%3Ali%3Aactivity%3A7285038365236682753%29\" target=\"_blank\" rel=\"noopener\">a comment on Caturegli’s LinkedIn post from an ex-Cloudflare employee</a> who linked to a report he co-authored on a similar typo domain apparently registered in 2017 for organizations that may have mistyped their AWS DNS server as “” instead of “.” DomainTools reports that this typo domain also was registered to a Yandex user (playlotto@yandex.ru), and was hosted at the same German ISP — Team Internet (AS61969).</p>","contentLength":6248,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42793783"},{"title":"Ross Ulbricht granted a full pardon","url":"https://twitter.com/Free_Ross/status/1881851923005165704","date":1737504652,"author":"Ozarkian","guid":227,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42786962"},{"title":"Stargate Project: SoftBank, OpenAI, Oracle, MGX to build data centers","url":"https://apnews.com/article/trump-ai-openai-oracle-softbank-son-altman-ellison-be261f8a8ee07a0623d4170397348c41","date":1737498562,"author":"tedsanders","guid":226,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42785891"},{"title":"Ask HN: Is anyone doing anything cool with tiny language models?","url":"https://news.ycombinator.com/item?id=42784365","date":1737488379,"author":"prettyblocks","guid":225,"unread":true,"content":"<div>I mean anything in the 0.5B-3B range that's available on Ollama (for example). Have you built any cool tooling that uses these models as part of your work flow?</div>","contentLength":160,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42784365"},{"title":"0-click deanonymization attack targeting Signal, Discord, other platforms","url":"https://gist.github.com/hackermondev/45a3cdfa52246f1d1201c1e8cdef6117","date":1737471584,"author":"hackermondev","guid":224,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42780816"},{"title":"Mixxx: GPL DJ Software","url":"https://mixxx.org/","date":1737388411,"author":"brudgers","guid":223,"unread":true,"content":"<p>\nMixxx is free open-source software and entirely community-driven. There is no company behind Mixxx — the development is shouldered by passionate DJs and programmers that dedicate their free time to working on their favorite DJ software. Mixxx is and always will be free!    </p>","contentLength":277,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42769871"},{"title":"DeepSeek-R1","url":"https://github.com/deepseek-ai/DeepSeek-R1","date":1737376678,"author":"meetpateltech","guid":222,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42768072"},{"title":"I Met Paul Graham Once","url":"http://okayfail.com/2025/i-met-pg-once.html","date":1737372002,"author":"DamonHD","guid":221,"unread":true,"content":"<p data-sourcepos=\"1:1-1:346\"><em>Nota bene: I’ve had a rough 2025 so far. I’m worried that people who used to support, or at least tolerate me, will turn against me out of a desire to conform, to show their obeisance, to the current prevailing winds. I found myself writing this essay to explain why I’ve been feeling so miserable. I sent it to Paul before I published it here.</em></p><p data-sourcepos=\"5:1-5:217\">It was the summer of 2015, and we were attending Y Combinator, the premier finishing school for startup founders. It was a long and stressful summer, holed up in our apartment in Mountain View, and a great experience.</p><p data-sourcepos=\"7:1-7:44\">We benefitted immensely from our time there.</p><p data-sourcepos=\"9:1-9:322\">At Y Combinator, there was sort of a curriculum, but they didn’t teach you anything per se. You’re assigned mentors, who you meet weekly, and you are free to book office hours – thirty minutes at a time – with a rotating cast of partners, each and every one of them formidable people, near or at the top of the field.</p><p data-sourcepos=\"11:1-11:74\">The mentors applied a neat and very effective trick: they believed in you.</p><p data-sourcepos=\"13:1-13:250\">Out of thousands of applicants, you had been chosen, plucked from obscurity, and flown out, and now you were here, in the centre of the (software) universe. They had invested in you, you personally, above and beyond your specific idea for a business.</p><p data-sourcepos=\"15:1-15:182\">Now every week you spoke with them, and presented your metrics, and discussed your problems, and, well, you could be doing better, couldn’t you? These results, they were kind of mid.</p><p data-sourcepos=\"17:1-17:299\">They didn’t boss us around, or tell us what to do, but we didn’t want to disappoint teacher. Their approval meant a lot. Doors would open. Success was at our fingertips: the summer culminated in Demo Day, a cattle call where we would be presented to investors, and our future might change forever.</p><p data-sourcepos=\"19:1-19:214\">We worked harder. We learned how to hustle. We swallowed rejection. We doubled our efforts, bent over our desks, working until we could barely see straight, trying to figure out how to <em>make something people want</em>.</p><p data-sourcepos=\"23:1-23:255\">One day, we booked a meeting with pg (Paul Graham). He had just retired from the day to day running of the show, handed the reigns over to sama (Sam Altman), and now roamed the halls as an elder statesmen, a congenial and affable uncle, dispensing advice.</p><p data-sourcepos=\"25:1-25:443\">We were excited. I don’t think he was ever a  of mine, but he certainly had influence, made a big impression on me. I had read his essays eight or nine years earlier, during my undergraduate, hunched over a screen in my university’s computer lab, nodding along. I spent way too much time on hackernews. Lisp was cool, I was special for just taking an interest in startups and software, we could do anything if we worked hard enough.</p><p data-sourcepos=\"27:1-27:142\">We explained our pitch to him: Appcanary monitors your apps and servers, and lets you know when you’re affected by a security vulnerability.</p><p data-sourcepos=\"29:1-29:278\">He thought it was a decent enough idea, but the name, Appcanary, he wasn’t crazy about the name. He was very good at naming companies. He thought about it and told us that, really, we ought to be named Oracle, that would be a great name for us. Descriptive, simple, memorable.</p><p data-sourcepos=\"31:1-31:27\">Shame it was taken, though.</p><p data-sourcepos=\"33:1-33:78\">We nodded and thanked him, and laughed about it later. No one bats a thousand.</p><p data-sourcepos=\"37:1-37:41\">YC had a huge positive impact on my life.</p><p data-sourcepos=\"39:1-39:174\">People took us more seriously now. Before we were randos, misfits even, but now we were Princes of the Universe. We had rubbed shoulders with royalty, or at least sovereigns.</p><p data-sourcepos=\"41:1-41:87\">Someone had believed in us, and pushed us until we understood how to make our own luck.</p><p data-sourcepos=\"43:1-43:360\">We grew a lot that summer, but we didn’t raise that much money. A bit, enough to keep us going. I loved California, I liked San Francisco, but I didn’t feel comfortable trying to live there. I felt gross being part of a monied class in a city rapidly hollowing out. I’d had a precarious childhood and early adulthood, and I craved some kind of stability.</p><p data-sourcepos=\"45:1-45:276\">Back home, we lived in the Best Neighbourhood in the Last Affordable Apartment In West Toronto. We knew it would reduce our chances for success, but it would double our runway. In the winter, I had started dating this most amazing girl, and I wanted to see where it would go.</p><p data-sourcepos=\"47:1-47:423\">Two years later, we realized that everyone thought our product was useful but not  useful. We could get people to pay us hundreds of dollars per month, but not thousands. That’s the death knell of a vc-backed b2b saas sales model. High-touch sales to large companies is not worth it unless you can score thousands of dollars per month. We were too burnt out to pivot to another business idea, and we quietly folded.</p><p data-sourcepos=\"49:1-49:490\">It was good timing: almost immediately after, GitHub announced they were going to provide our startup’s features . We gave them a call, we got them excited. They “acquihired” us as subject matter experts, and paid us a small fee for the intellectual property. We returned something like 40 or 45 cents on the dollar to our investors. Not a great result, but about par for the course. Most startups fail. Some of our Summer 2015 cohort flamed out faster, or more spectacularly.</p><p data-sourcepos=\"51:1-51:95\">One of our investors commended us for our ethical behaviour – not everyone returns the money.</p><p data-sourcepos=\"55:1-55:137\">It’s been almost ten years. After we got hired, Microsoft bought GitHub. I’m still with that amazing girl. We have two kids, a house.</p><p data-sourcepos=\"59:1-59:423\">It turns out that I like women so much I’d like to be one of them. Or as close as I can get. I’m happier now, more joyful. I feel in touch with my body, and how I move through the world, in ways I didn’t before. Up until very recently, very few people would confuse me for a woman. It took me a while to remove my facial hair, I still haven’t trained my voice. That’s OK. What is a woman, exactly? I don’t know.</p><p data-sourcepos=\"61:1-61:258\">I don’t want to make anyone uncomfortable. For that reason, I like to say that I am “non-binary trans femme”. It’s a mouthful, I know. But asking to be called “they” feels less burdensome, less of a polite fiction, than to ask to be called “she”.</p><p data-sourcepos=\"63:1-63:92\">I just want to be treated with respect, and kindness. I don’t think I’m asking for much.</p><p data-sourcepos=\"65:1-65:77\">Why is it wrong for me to have more joy in my life? I’m not hurting anyone.</p><p data-sourcepos=\"69:1-69:65\">A few days ago, Paul Graham published an essay on “Wokeness”.</p><p data-sourcepos=\"71:1-71:436\">I skimmed it. I couldn’t finish reading it, it made me too upset. It came a few days after Mark Zuckerberg announced he was going to increase the hate speech people like me receive. It’s not OK to imply someone has a mental disability – unless it’s because they’re queer. He also quietly removed some trivial accomodations he had made for his transgender employees. stung. That felt personal, targeted.</p><p data-sourcepos=\"75:1-75:93\">I’ve been feeling quite anxious ever since. It feels like the world is crumbling around me.</p><p data-sourcepos=\"77:1-77:352\">I’m still not sure what pg thinks “Wokeness” means. I know for a fact, that for most people – including many of the people he hangs out with – it just means “left-wing thing I dislike”. I got the impression that he thinks it’s bad, and that companies should purge people who are too woke. Maybe I’m being unfair to him.</p><p data-sourcepos=\"81:1-81:255\">The irony is I too dislike nagging, hollow, corporate DEI exercises. In the abstract I was glad they existed but the insincerity was palpable. Are “identity politics” just a status game that economically advantaged elites play? I could be convinced.</p><p data-sourcepos=\"87:1-87:161\">In the 2021 novel “Detransition Baby” the author shares a joke. Transgender women only have one of three jobs: computer programmer, aesthetician, prostitute.</p><p data-sourcepos=\"89:1-89:518\">It’s an old joke. More of an observation, really. The director of “Vestidas de Azul”, <a href=\"https://thefilmstage.com/dressed-in-blue-review-a-long-lost-essential-document-of-spanish-and-lgbtqi-cinema-history-gets-new-life/\">a 1983 documentary about trans women in Madrid</a>, had hoped to make a movie about trans women who were lawyers or held important roles in society. Instead he discovered that most trans women were  to be artists, hair dressers, or sex workers – so that’s who he made his movie about.</p><p data-sourcepos=\"91:1-91:79\">I’m glad I can be a computer programmer; no one gets to be an artist anymore.</p><p data-sourcepos=\"93:1-93:223\">If you haven’t met many trans women, that might sound over-the-top, hyperbolic. But for so long, people like me were strongly discriminated against. Until very recently, we were treated as bywords for freaks, or psycopaths.</p><p data-sourcepos=\"95:1-95:239\">In this vein, the other day I saw a scorching, sizzling hot take on Mastodon that read something like: the reason why conservative women are so mad about trans women is because they don’t want to share washrooms with the sex slave caste.</p><p data-sourcepos=\"99:1-99:255\">The reason why pg’s essay made me so upset, made me feel so dispirited, is because I benefitted directly from his largesse, from a system he set up. His “school” took a chance on me, taught me how to hustle, how to become a Princess of the Universe.</p><p data-sourcepos=\"101:1-101:73\">I’m immensely glad for the opportunity. Would I receive it again today?</p><p data-sourcepos=\"103:1-103:262\">In many people’s imagination, the word “woke” invokes someone exactly like me. I’m the person who is annoying about their pronouns. I’m the person who feels more comfortable using gender neutral bathrooms. I have a passing interest in social justice.</p><p data-sourcepos=\"107:1-107:476\">I’m concerned he, or rather, the people who succeeded him, would take one look at me, and decide that I am “too woke”, whatever that means. I worry that my existence, that my living in joy, in a state of grace, is “too woke” to be worth employing. I’m certain he wouldn’t be rude to my face, but he might quietly discriminate against me, say no thanks. He might not even think of it as discrimination, only that I don’t have what it takes. Whatever that means.</p><p data-sourcepos=\"109:1-109:70\">I think this is why the current turn in the industry is so unsettling.</p><p data-sourcepos=\"111:1-111:635\">It’s mean, and unkind. It’s malicious. Moves like Mark’s, and essays like pg’s, create the permission structure for people to discriminate against me. I’ve already been pushed out of Twitter; the <a href=\"https://www.theguardian.com/technology/article/2024/sep/05/racism-misogyny-lies-how-did-x-become-so-full-of-hatred-and-is-it-ethical-to-keep-using-it\">hate speech</a> and <a href=\"https://www.salon.com/2024/05/24/twitter-considers-cisgender-a-slur-and-moderates-it-over-actual-slurs/\">censorship</a> was too much to deal with. A lot of people feel that treating someone like me with respect is just a trendy moral fashion.</p><p data-sourcepos=\"115:1-115:164\">Will my next promotion be silently denied? Will a coworker try to disrespect me out of spite? Will I be shut out of big tech? Will anyone invest in my next startup?</p><p data-sourcepos=\"117:1-117:117\">I’m better at my job than most. I’d be a better startup founder today than I was in 2015. None of that will matter.</p><p data-sourcepos=\"119:1-119:206\">It feels as if people like pg, or at least people he hangs out with, who once upon a time believed in me, who lifted me up, recognized my talent, would now prefer that I be relegated to the sex slave caste.</p>","contentLength":10313,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42767507"},{"title":"UK's hardware talent is being wasted","url":"https://josef.cn/blog/uk-talent","date":1737330733,"author":"sebg","guid":220,"unread":true,"content":"<p>Imperial, Oxford, and Cambridge produce world-class engineers. Yet post-graduation, their trajectory is an economic tragedy - and a hidden arbitrage opportunity.</p><ul><li data-preset-tag=\"p\"><p>Top London hardware engineer graduates: £30,000-£50,000</p></li><li data-preset-tag=\"p\"><p>Silicon Valley equivalent: $150,000+</p></li></ul><p>The reality for most graduates is even grimmer:</p><ul><li data-preset-tag=\"p\"><p>£25,000 starting salaries at traditional engineering firms</p></li><li data-preset-tag=\"p\"><p>Exodus to consulting or finance just because it's compensated better</p></li></ul><p>Meanwhile computer science graduates land lucrative jobs in big tech or quant trading, often starting at £100,000+</p><p>Examples of wasted potential:</p><ul><li data-preset-tag=\"p\"><p>Sarah: Built a fusion reactor at 16. Now? Debugging fintech payment systems.</p></li><li data-preset-tag=\"p\"><p>James: 3D-printed prosthetic limbs for A-levels. Today? Writing credit risk reports.</p></li><li data-preset-tag=\"p\"><p>Alex: Developed AI drone swarms for disaster relief at 18. Graduated with top honours from Imperial. His job? Tweaking a single button's ergonomics on home appliances.</p></li></ul><p>These aren't outliers. They're a generation of engineering prodigies whose talents are being squandered.</p><p>This isn't just wage disparity. <strong>It's misallocation of human capital on a national scale.</strong></p><p>As a hardware founder in London, I've witnessed this firsthand. We have the talent for groundbreaking innovation, but lack the means to realise it.</p><ol><li data-preset-tag=\"p\"><p>: Unlike lucrative software jobs, hardware engineering demands physical presence.</p></li><li data-preset-tag=\"p\"><p>European VCs, mostly bullish on fintech and SaaS, remain wary of hardware. Result? A feedback loop of underinvestment and missed opportunities.</p></li><li data-preset-tag=\"p\"><p> Traditional engineering firms fail to innovate in talent strategies and match compensation, accelerating brain drain.</p></li></ol><ol><li data-preset-tag=\"p\"><p> We're not just losing salary differences; we're missing out on the next ARM or Tesla.</p></li><li data-preset-tag=\"p\"><p> One successful hardware company can spawn dozens of ancillary businesses. We're losing these compounding effects.</p></li><li data-preset-tag=\"p\"><p><strong>National Security Implications: </strong>In an era where technological edge equals geopolitical power, can we afford to let our best hardware talent languish?</p></li><li data-preset-tag=\"p\"><p><strong>Brain Drain Acceleration: </strong>We risk losing our top talent permanently to overseas markets.</p></li></ol><blockquote><p>\"London's lower living costs justify lower salaries.\"</p></blockquote><p>False. London is around the same as NYC and more expensive than most parts of California and definitely Texas. This also ignores:</p><ul><li data-preset-tag=\"p\"><p>Wealth Creation and Ecosystem Acceleration: High salaries and successful exits compound dramatically over time, that's why the US has so much more VC and angel capital.</p></li><li data-preset-tag=\"p\"><p>Talent attraction: Top jobs draw global talent. Example: Google's entry into London with competitive salaries reshaped the entire tech ecosystem.</p></li></ul><blockquote><p>\"UK's small market limits growth.\"</p></blockquote><p>Outdated thinking. Consider:</p><ul><li data-preset-tag=\"p\"><p>Dyson: From a Wiltshire barn to a global technology powerhouse, now innovating in Singapore and Malaysia.</p></li><li data-preset-tag=\"p\"><p>Ocado: Online grocer turned global automation technology provider, with robotics solutions deployed across Europe and North America.</p></li><li data-preset-tag=\"p\"><p>ARM: Powering 95% of smartphones globally.</p></li></ul><blockquote><p>\"Hardware is riskier than software.\"</p></blockquote><ul><li data-preset-tag=\"p\"><p>Development speed: 3D prints and PCB prototypes now available in 24 hours, rivalling software iteration speeds.</p></li><li data-preset-tag=\"p\"><p>Moat strength: Apple's hardware-software ecosystem is far more defensible than most pure software plays.</p></li><li data-preset-tag=\"p\"><ul><li data-preset-tag=\"p\"><p>ARM: Sold to SoftBank for $32B in 2016, now worth $140B+.</p></li><li data-preset-tag=\"p\"><p>CSR (Cambridge Silicon Radio): Acquired by Qualcomm for $2.5B in 2015.</p></li><li data-preset-tag=\"p\"><p>Dyson: While not an exit, it's valued at over £20B as of 2023.</p></li></ul></li></ul><p>It isn't about costs. It's about ambition.</p><p>While software talent flows freely globally, ambitious UK hardware startups can exclusively tap into a world-class, locally-bound talent pool.</p><ol><li data-preset-tag=\"p\"><p><strong>The Software Brain Drain:</strong></p><ul><li data-preset-tag=\"p\"><p>US tech giants easily poach UK software talent</p></li><li data-preset-tag=\"p\"><p>Remote work erases geographical boundaries</p></li><li data-preset-tag=\"p\"><p>Result: Constant outflow of top software engineers</p></li></ul></li><li data-preset-tag=\"p\"><p><strong>The Hardware Opportunity:</strong></p><ul><li data-preset-tag=\"p\"><p>Physical presence matters - can't build rockets remotely</p></li><li data-preset-tag=\"p\"><p>UK hardware talent largely untapped by global competition</p></li><li data-preset-tag=\"p\"><p>Build something ambitious, attract local engineering superstars</p></li></ul></li><li data-preset-tag=\"p\"><ul><li data-preset-tag=\"p\"><p>Brilliant minds wasting away in soul-crushing corporate jobs</p></li><li data-preset-tag=\"p\"><p>Your future \"10x engineer\" is someone else's bored employee</p></li></ul></li><li data-preset-tag=\"p\"><ul><li data-preset-tag=\"p\"><p>Forget software. Hardware is the new frontier.</p></li><li data-preset-tag=\"p\"><p>Build the next ARM or Dyson, not another fintech app</p></li><li data-preset-tag=\"p\"><p>Leverage UK's world-class research institutions</p></li></ul></li><li data-preset-tag=\"p\"><ul><li data-preset-tag=\"p\"><p>Incumbents are unambitious, startups are few (for now)</p></li><li data-preset-tag=\"p\"><p>Top-tier VCs awakening to UK hardware potential</p></li><li data-preset-tag=\"p\"><p>First movers will have pick of the talent pool</p></li></ul></li></ol><p>This arbitrage won't last forever. As you read this, others are waking up to the opportunity. The first movers will reap the rewards. The followers will wonder why they didn't see it sooner.</p><p><strong>The Hardware Revolution Starts Now</strong></p><p>Wake up, UK. Our engineering talent is our nuclear fusion. Ignite it or lose the future.</p><p>Your next unicorn isn't code. It's cobalt and circuits. Back the tangible.</p><p>Stop fleeing to the US. London can be the hardware capital of the world. We have the talent. We have the creativity. What we need is your audacity.</p><p>Your brain's worth billions. Build empires, not apps.</p><p>While the world obsesses over the next GPT wrapper, we'll forge the next industrial revolution.</p><p>This isn't a pipe dream. It's an imperative.</p>","contentLength":4978,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42763386"},{"title":"It's time to make computing personal again","url":"https://www.vintagecomputing.com/index.php/archives/3292/the-pc-is-dead-its-time-to-make-computing-personal-again","date":1737328282,"author":"mariuz","guid":219,"unread":true,"content":"<p><em>How surveillance capitalism and DRM turned home tech from friend to foe.</em></p><p>For a while—in the ’80s, ’90s, and early 2000s—it <a href=\"https://www2.itif.org/2017-why-so-sad.pdf\">felt like</a> nerds were making the world a better place. Now, it feels like the most successful tech companies are making it worse.</p><p>Internet surveillance, the <a href=\"https://www.npr.org/2022/09/09/1121295499/facebook-twitter-youtube-instagram-tiktok-social-media\">algorithmic polarization</a> of social media, <a href=\"http://<a href=\" https:=\"\" techcrunch.com=\"\" 2018=\"\" 10=\"\" 15=\"\" sneaky-subscriptions-are-plaguing-the-app-store=\"\" \"=\"\">predatory app stores</a>, and extractive business models have eroded the freedoms the personal computer once promised, effectively ending the PC era for most tech consumers.</p><p>The “personal computer” was <a href=\"https://en.wikipedia.org/wiki/Computer_Lib/Dream_Machines\">once a radical idea</a>—a computer an individual could own and control completely. The concept emerged in the early 1970s when microprocessors made it economical and practical for a person to own their very own computer, in contrast to the rise of data processing mainframes in the 1950s and 60s.</p><p>At its core, the PC movement was about a kind of tech liberty—–which I’ll define as the freedom to explore new ideas, control your own creative works, and make mistakes without punishment.</p><p>The personal computer era bloomed in the late 1970s and continued into the 1980s and 90s. But over the past decade in particular, the Internet and <a href=\"https://en.wikipedia.org/wiki/Digital_rights_management\">digital rights management</a> (DRM) have been steadily pulling that control away from us and putting it into the hands of huge corporations. We need to take back control of our digital lives and make computing personal again.</p><p>Don’t get me wrong: I’m not calling the tech industry evil. I’m a huge fan of technology. The industry is full of great people, and this is not a personal attack on anyone. I just think runaway market forces and a handful of <a href=\"https://www.theatlantic.com/technology/archive/2013/03/the-copyright-rule-we-need-to-repeal-if-we-want-to-preserve-our-cultural-heritage/274049/\">poorly-crafted US laws</a> like section 1201 of the DMCA have put all of us onto the wrong track (more on that below).</p><p>To some extent, tech companies were always predatory. To some extent, all companies are predatory. It’s a matter of degrees. But I believe there’s a fundamental truth that we’ve charted a deeply unhealthy path ahead with consumer technology at the moment.</p><p>Tech critic Ed Zitron calls this phenomenon “<a href=\"https://www.wheresyoured.at/the-rot-economy/\">The Rot Economy</a>,” where companies are more obsessed with continuous growth than with providing useful products. “Our economy isn’t one that produces things to be used, but things that increase usage,” Zitron <a href=\"https://www.wheresyoured.at/the-anti-economy/\">wrote</a> in another piece, bringing focus to ideas I’ve been mulling for the past half-decade.</p><p>This post started as a 2022 <a href=\"https://x.com/benjedwards/status/1541029918783311873\">Twitter thread</a>, and I’ve offered to write editorials about my frustrations with increasingly predatory tech business practices since 2020 for my last two employers, but both declined to publish them. I understand why. These are uncomfortable truths to face. But if you love technology like I do, we have to accept what we’re doing wrong if we are going to make it better.</p><p>While consumer and computer tech today is more powerful than ever before—and in some ways far more convenient—some of the structural ways we used to interface with technology companies were arguably healthier in the past.</p><p>Further, what percentage of your income had to go towards annual <a href=\"https://variety.com/2023/digital/news/apple-one-billion-paid-subscriptions-services-earnings-june-2023-1235686807/\">software subscriptions</a> on a 20th century Windows PC (like this Sony VAIO)? You bought an application and you owned an indefinite license to use it. If there was an upgrade, you bought that too. And if you liked an older version of the software, you could keep using it without having it vanish in an automatic update.</p><p>How many Nintendo Entertainment System games sustained themselves with <a href=\"https://appleinsider.com/articles/20/12/13/kid-spends-16k-on-in-app-purchases-for-ipad-game-sonic-forces\">in-app purchases</a> and <a href=\"https://www.reddit.com/r/Games/comments/znpaau/i_worked_in_the_mobile_industry_for_10_years_loot/\">microtransactions</a>? What more did the console ask of you after you bought a cartridge? Maybe to buy another one later if it was fun?</p><p>Which part of this Motorola StarTAC cellular phone kept track of your every move and <a href=\"https://www.zdnet.com/article/us-cell-carriers-selling-access-to-real-time-location-data/\">sold the information</a>, behind your back, to private data brokers? And which part included <a href=\"https://www.consumerreports.org/consumer-rights/people-want-to-get-phones-appliances-fixed-but-often-cant-a1117945195/\">sealed-in batteries</a> that would ruin the entire phone if they went bad?</p><p>Which part of Google in the 1990s and early 2000s blanketed its results with <a href=\"https://www.reddit.com/r/google/comments/yz3e85/google_shows_more_ads_than_results_now/\">deceptive ads</a> or made you <a href=\"https://boingboing.net/2022/01/03/tip-add-reddit-to-search-queries-on-to-get-authentic-human-results-untainted-by-seo.html\">add “Reddit”</a> to every search to get good results that weren’t overwhelmed by SEO-seeking filler content?</p><p>Which part of this VHS tape disappeared or became unplayable if the publisher suddenly <a href=\"https://www.theguardian.com/tv-and-radio/2023/jun/28/why-are-movies-and-tv-shows-disappearing-from-streaming-services\">decided</a> it didn’t like it anymore—or didn’t want to <a href=\"https://www.npr.org/2023/03/17/1164146728/why-are-dozens-of-tv-shows-disappearing-from-streaming-platforms-like-hbo-max\">pay the writers and actors</a> residual fees?</p><p>Americans have allowed runaway business models, empowered by tech, to subvert privacy and individual liberty on the road to making money. Our default tech business model has become extractive, like part of a strip-mining operation. Consumers—and now <a href=\"https://arstechnica.com/information-technology/2022/09/have-ai-image-generators-assimilated-your-art-new-tool-lets-you-check/\">creative works</a> (used for training AI)—are treated as a natural resource to be milked and exploited.</p><p>The extractive model may end up being self-destructive for the tech industry itself. In the physical world, resource extraction needs limits and regulations to be sustainable. It can be wildly profitable until a resource becomes over-harvested, or the harvesting process corrupts the environment that lets the industry exist in the first place.</p><p>There’s also the drive to lock consumers into an ecosystem, powered by DRM. You should buy tech products and get direct value fairly, not unleash a secret vampire to track you, manipulate you, and attempt to extract money from you forever. Just because companies have unlocked this “everything as a service” endless money hack does not mean they should do it.</p><p>And there’s another problem. Very soon, we might be <a href=\"https://www.fastcompany.com/90549441/how-to-prevent-deepfakes\">threatening the continuity of history itself</a> with technologies that pollute the historical record with AI-generated noise. It sounds dramatic, but that could eventually undermine the shared cultural bonds that hold cultural groups together.</p><p>That’s important because history is what makes this type of criticism possible. History is how we know if we’re being abused because we can rely on written records of people who came before (even 15 minutes ago) and make comparisons. If technology takes history away from us, there may be no hope of recovery.</p><h2>How We Can Reclaim Control</h2><p>Every generation <a href=\"https://twitter.com/paulisci/status/1669113362058444800?s=20\">looks back</a> and says, “Things used to be better,” whether they are accurate or not.</p><p>But I’m not suggesting we live in the past. It is possible to learn from history and integrate the best of today’s technology with fair business practices that are more sustainable and healthy for everyone in the long run.</p><p>In the short term, we can do things like support open projects like Linux, support non-predatory and open source software, and run apps and store data locally as much as possible. But some bigger structural changes are necessary if we really want to launch the era of Personal Computer 2.0.</p><p>I’ve shown this editorial to friends, and some people felt that I did not emphasize the benefits of current technology enough. But I argue that my criticism is less about the actual technology and more about how we use it—and how companies make money from it.</p><p>Since I originally wrote my thoughts in a <a href=\"https://x.com/benjedwards/status/1541029918783311873?s=20\">viral Twitter thread</a> in June 2022, others have expanded on these ideas with far more eloquence. Five months after my thread, Cory Doctorow wrote <a href=\"https://doctorow.medium.com/social-quitting-1ce85b67b456\">his first</a> post on “enshittification,” a hallmark piece identifying a tendency for online platforms to decay over time.</p><p>A common thread between many of the issues hinted at above and in both Doctorow and Zitron’s work has been the rise of the ubiquitous Internet, which has allowed content owners and device makers to keep an eye on (and influence) consumer habits remotely, pulling our strings like puppeteers and putting a drip feed on our wallets.</p><p>Additionally, <a href=\"https://en.wikipedia.org/wiki/Anti-circumvention\">section 1201</a> of the <a href=\"https://en.wikipedia.org/wiki/Digital_Millennium_Copyright_Act\">DMCA</a> made it illegal to circumvent DRM, allowing manufacturers to lock down platforms in a way that challenges the traditional concept of ownership, enables predatory app stores, and <a href=\"https://www.theatlantic.com/technology/archive/2013/03/the-copyright-rule-we-need-to-repeal-if-we-want-to-preserve-our-cultural-heritage/274049/\">threatens our cultural history</a>.</p><p>Tech monopolies must be held to account, the outsized influence of some tech billionaires must be held in check, and competition must be allowed to thrive. We may also need to consider the protection of both consumers themselves and human-created works (including our history) as part of a conservation effort before extractive models permanently pollute our shared cultural resources.</p><p>The way the political winds are blowing right now in the US, significant legal reform seems unlikely for now. Things may need to get much worse before they get better. But the kind of extractive lock-in we’re seeing with technology is fundamentally incompatible with freedom in my opinion, so something needs to change if we still value the kind of personal liberty the PC once promised—that freedom to explore, create, and make mistakes without surveillance or punishment.</p><p>Sure, things will never be perfect in the United States. Profits will always be chased, and there will be collateral damage. And yes, some parts of technology today are better than ever (computing power, screen resolutions, and bandwidth to name a few).</p><p>The Internet has brought amazing things, including Wikipedia, The Internet Archive, multiplayer online gaming, , and work-from-home jobs. But the urge to exploit users to the maximum extent through digital locks and surveillance should be held in check so that we can earnestly and honestly make the tech industry a beacon of optimism once more.</p><p>The stakes are higher now than they were in the 1970s. There is no “logging off,” nearly everyone has a smartphone in their pocket, and the digital world increasingly overlaps with every aspect of our lives. That means digital freedom is now equivalent to actual legal and personal freedom, and we must be allowed to control our own destinies.</p><p>Whether through purposeful reform or the eventual collapse of digital strip mining, I believe the personal computer will eventually rise again—–along with our chance to reclaim control of our digital lives.</p><h3>Feedback Update: 01/21/2025</h3><p>Since publishing this piece, last Friday, I’ve seen a lot of positive feedback for this piece, but also some frustration that I didn’t break down more specific personal, individual solutions to these problems.</p><p>As most technically-included people know, we’ve already been enacting those personal solutions for decades. We may store our own data locally on NAS devices instead of the cloud, use open source software, try to preserve privacy with VPNs, etc., but it has not stopped the tide of abuse from the tech industry. And I think that mainstream tech consumers (for example: most of my family members and friends) have no inclination to ever do any of those things.</p><p>That’s why I feel like the problem presented here is systemic and needs deep regulatory reform for things to actually get better in the United States. I think a good parallel may be climate change, where putting the onus on the individual to recycle or use fewer resources is misleading, when the biggest environmental abusers are large corporations and industries in aggregate. That needs deep systemic change too.</p><p>Also, I think that technical people tend to immediately reach for technical solutions, but I don’t think this is a technical problem. Capitalism, when left lightly regulated, will do what it always does: Pursue the accumulation of capital at all costs, even while damaging society at large. But I am not anti-capitalist: It is a potent tiger with great potential benefits, but it needs to be kept properly in a cage, or it will devour all of us. We should not fall into binary positions. We need balanced regulation that maintains healthy profit-driven competition but keeps capitalism’s worst tendencies in check. Achieving that is admittedly very difficult in these highly polarized times.</p><p>So I feel the issues here are ultimately systemic policy problems that need to be fixed with regulation (such as enact national right to repair laws, de-fang the DMCA, implement US national privacy protections, somehow limit the massive seemingly untouchable influence of big tech companies, and probably tax down tech billionaires).</p><p>That’s a big ask that feels insurmountable at this moment, but it’s a movement can start now with people who are fed up with our current de facto abusive tech business models. I think eventually we will get there anyway, because the I am not sure the current extractive model is sustainable without encountering massive social unrest within the next decade. The alternative to change, if taken to an extreme, may be the collapse of personal liberty for everyone.</p><p>In the meantime, while these lofty goals simmer and take shape, you can also continue to take personal steps to preserve your own tech liberty. Support nonprofits <a href=\"https://www.eff.org/\">like the EFF</a> that fight for privacy and user rights, strong encryption, open source, use local storage, and so on. I highly encourage it.</p><p>Ultimately I hope these thoughts can be a starting point for others to pick up the torch and build off of. I will also be thinking of constructive solutions for a future follow-up.</p><p>This is not the end of the conversation—it’s only the beginning. While systemic reform is essential to reclaiming broad personal liberty for  in the digital age, the new Personal Computing movement starts with you. Together, we can push for the regulations and systemic accountability that will restore true personal freedom in technology.</p>","contentLength":13139,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42763095"},{"title":"TikTok says it is restoring service for U.S. users","url":"https://www.nbcnews.com/tech/tech-news/tiktok-says-restoring-service-us-users-rcna188320","date":1737308564,"author":"Leary","guid":218,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42759336"},{"title":"TikTok goes dark in the US","url":"https://techcrunch.com/2025/01/18/tiktok-goes-dark-in-the-u-s/","date":1737258709,"author":"mfiguiere","guid":217,"unread":true,"content":"<p>TikTok went dark in the U.S. on Saturday night as a result of a federal law that bans the popular short-form video app for millions of Americans. However, <a href=\"https://techcrunch.com/2025/01/19/tiktok-says-is-restoring-service-in-the-us/\">the company began restoring service</a> by midday Sunday.</p><p>TikTok users began receiving a message about the ban around 10:30 p.m. ET on Saturday evening, and the app also disappeared from the Apple and Google Play app stores. As of Sunday morning, some users in the U.S. could still access TikTok via the web.</p><p>“Sorry, TikTok isn’t available right now,” the company’s message reads. “A law banning TikTok has been enacted in the U.S. Unfortunately, that means you can’t use TikTok for now.”</p><p>The message also suggested this might only be a temporary disappearance. TikTok credited President-elect Donald Trump for indicating “he will work with us on a solution to reinstate TikTok once he takes office,” with users urged to “stay tuned!”</p><p>The company warned earlier this week the app’s disappearance was imminent, <a href=\"https://techcrunch.com/2025/01/18/tiktok-says-it-will-go-dark-sunday-unless-biden-offers-definitive-statement/\">saying Friday that it would “go dark”</a> unless President Joe Biden’s administration made a “definitive statement” that it wouldn’t enforce the ban.</p><p>The Supreme Court issued a ruling <a href=\"https://techcrunch.com/2025/01/17/supreme-court-upholds-tiktok-ban/\">upholding the law Friday</a>, and the Biden administration seemed inclined to <a href=\"https://techcrunch.com/2025/01/18/tiktok-says-it-will-go-dark-sunday-unless-biden-offers-definitive-statement/\">leave the app’s fate in the hands of the next president</a>. White House Press Secretary Karine Jean-Pierre noted that with the law taking effect right before Trump’s inauguration on Monday, “actions to implement the law simply must fall to the next Administration.” Deputy Attorney General Lisa Monaco issued a similar statement that “the next phase of this effort — implementing and ensuring compliance with the law after it goes into effect on January 19 — will be a process that plays out over time.”</p><p>TikTok, however, suggested this was not enough assurance for “critical service providers” to continue listing or hosting the app in the United States unless the Biden administration made the aforementioned “definitive statement.” Jean-Pierre called TikTok’s response “a stunt” and claimed there’s “no reason for TikTok or other companies to take actions in the next few days before the Trump administration takes office on Monday.”</p><p>As for the app’s long-term prospects, Trump has said he plans to “negotiate a resolution” that would presumably involve a sale or other concessions from ByteDance, which has repeatedly said it’s not interested in selling yet <a href=\"https://techcrunch.com/2025/01/17/tiktok-ceo-responds-to-trump-thanks-him-for-trying-to-solve-us-ban/\">seems optimistic about its prospects under Trump</a>. </p><p>Trump <a href=\"https://www.nbcnews.com/politics/donald-trump/trump-likely-give-tiktok-90-day-extension-avoid-ban-rcna188258\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">reiterated to NBC News</a> on Saturday that he will “most likely” give TikTok a 90-day reprieve from the ban once he takes office Monday.</p><p>“I think that would be, certainly, an option that we look at. The 90-day extension is something that will be most likely done, because it’s appropriate. You know, it’s appropriate. We have to look at it carefully. It’s a very big situation,” Trump told the outlet.</p><p>There was even a report suggesting that the Chinese government was <a href=\"https://techcrunch.com/2025/01/17/tiktok-ceo-responds-to-trump-thanks-him-for-trying-to-solve-us-ban/\">considering a sale to Elon Musk</a> as part of a broader deal with the Trump administration. A TikTok spokesperson called that report “pure fiction.”</p><p><em>This post has been updated to reflect that TikTok is restoring service. It was previously updated to reflect Trump’s statements Sunday morning, as well as the additional apps that have been blocked by the law.</em></p>","contentLength":3340,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42753396"},{"title":"Amazon's AI crawler is making my Git server unstable","url":"https://xeiaso.net/notes/2025/amazon-crawler/","date":1737226131,"author":"OptionOfT","guid":216,"unread":true,"content":"<p>\n        Published on , 319 words, 2 minutes to read\n    </p><p>EDIT(2025-01-18 23:50 UTC):</p><p>I wrote a little proxy that does a proof-of-work check before allowing requests to my Gitea server. It's called Anubis and I'll be writing a blog post about it soon.</p><p>EDIT(2025-01-18 19:00 UTC):</p><p>I give up. I moved the Gitea server back behind my VPN. I'm working on a proof of work reverse proxy to protect my server from bots in the future. I'll have it back up soon.</p><p>EDIT(2025-01-17 17:50 UTC):</p><p>I added this snippet to the ingress config:</p><pre><code></code></pre><p>The bots are still hammering away from a different IP every time. About 10% of the requests do not have the amazonbot user agent. I'm at a loss for what to do next.</p><p>Hi all. This is a different kind of post. This is not informative. This is a cry for help.</p><p>To whoever runs AmazonBot, please add  to your list of blocked domains. If you know anyone at Amazon, please forward this to them and ask them to forward it to the AmazonBot team.</p><p>Should you want to crawl my git server for some reason, please reach out to me so we can arrange for payment for hardware upgrades commensurate to your egregious resource usage.</p><p>I don't want to have to close off my Gitea server to the public, but I will if I have to. It's futile to block AI crawler bots because they lie, change their user agent, use residential IP addresses as proxies, and more. I just want the requests to stop.</p><p>I have already configured the  file to block all bots:</p><p>What else do I need to do?</p><p>Facts and circumstances may have changed since publication. Please contact me before jumping to conclusions if something seems wrong or unclear.</p>","contentLength":1607,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42750420"},{"title":"Supreme Court upholds TikTok ban, but Trump might offer lifeline","url":"https://www.cnbc.com/2025/01/17/supreme-court-rules-to-uphold-tiktok-ban.html","date":1737127438,"author":"kjhughes","guid":215,"unread":true,"content":"<div data-test=\"InlineImage\"><div><div><div>Jaap Arriens | Nurphoto | Getty Images</div></div></div></div><div><p>The <a href=\"https://www.cnbc.com/supreme-court-us/\">Supreme Court</a> on Friday upheld the law requiring China-based ByteDance to divest its ownership of TikTok by Sunday or face <a href=\"https://www.cnbc.com/2024/12/06/tiktok-divestment-law-upheld-by-federal-appeals-court.html\">an effective ban</a> of the popular social video app in the U.S.</p><p>ByteDance has so far refused to sell TikTok, meaning many U.S. users could <a href=\"https://www.cnbc.com/2025/01/15/how-vpns-might-allow-americans-to-continue-using-tiktok-.html\">lose access</a> to the app this weekend. The app may still work for those who already have TikTok on their phones, although ByteDance has also threatened to shut the app down.</p><p>In a unanimous decision, the Supreme Court sided with the Biden administration, upholding&nbsp;the Protecting Americans from Foreign Adversary Controlled Applications Act, which President <a href=\"https://www.cnbc.com/joe-biden/\">Joe Biden</a><a href=\"https://www.cnbc.com/2024/04/24/biden-signs-israel-ukraine-tiktok-bill-into-law.html\">signed</a> in April.</p><p>\"There is no doubt that, for more than 170 million Americans, TikTok offers a distinctive and expansive outlet for expression, means of engagement, and source of community,\" the Supreme Court's opinion said. \"But Congress has determined that divestiture is necessary to address its well-supported national security concerns regarding TikTok's data collection practices and relationship with a foreign adversary.\"</p><p>Supreme Court Justices Sonia Sotomayor and Neil Gorsuch wrote concurrences.</p><p><a href=\"https://www.cnbc.com/2024/11/13/trump-victory-may-provide-tiktok-a-lifeline-to-remain-in-the-us.html\">TikTok's fate</a> in the U.S. now lies in the hands of President-elect <a href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a>, &nbsp;who originally favored a TikTok ban during his first administration, but has since flip-flopped on the matter. In December, Trump <a href=\"https://www.supremecourt.gov/DocketPDF/24/24-656/336151/20241227163400981_2024-12-27%20-%20TikTok%20v.%20Garland%20-%20Amicus%20Brief%20of%20President%20Donald%20J.%20Trump.pdf\" target=\"_blank\">asked</a> the Supreme Court to <a href=\"https://www.nbcnews.com/politics/donald-trump/trump-urges-supreme-court-hit-pause-law-ban-tiktok-us-month-rcna185606\" target=\"_blank\">pause the law's implementation</a> and&nbsp;allow his administration \"the opportunity to pursue a political resolution of the questions at issue in the case.\"</p><p>In a post on his social media app Truth Social, Trump wrote that the decision was expected \"and everyone must respect it.\"</p><p>\"My decision on TikTok will be made in the not too distant future, but I must have time to review the situation. Stay tuned!\" Trump wrote.</p><p>Trump began to speak more favorably of TikTok after he<a href=\"https://www.businessinsider.com/trump-tiktok-comments-meeting-with-billionaire-investor-jeff-yass-2024-3\" target=\"_blank\">&nbsp;met in February</a>&nbsp;with billionaire Republican megadonor Jeff Yass. Yass is a major ByteDance investor who also owns a stake in the owner of&nbsp;<a href=\"https://www.cnbc.com/quotes/DJT/\">Truth Social</a>.</p><p>In a video posted on TikTok, Chew thanked Trump \"for his commitment to work with us to find a solution that keeps TikTok available\" in the U.S. He said use of TikTok is a First Amendment right, adding that over 7 million American businesses use it to make money and find customers.</p><p>\"Rest assured, we will do everything in our power to ensure our platform thrives as your online home for limitless creativity and discovery as well as a source of inspiration and joy for years to come,\" he said.  </p></div><div><p>The nation's highest court said in the opinion that while \"data collection and analysis is a common practice in this digital age,\" the sheer size of TikTok and its \"susceptibility to foreign adversary control, together with the vast swaths of sensitive data the platform collects\" poses a national security concern.</p><p>Under the terms of the law, third-party internet service providers such as  and  will be penalized for supporting&nbsp;a ByteDance-owned&nbsp;TikTok after the Jan. 19 deadline.</p><p>If service providers and app store owners comply, consumers will be unable to install the necessary updates that make the app functional.</p><p>Representatives of TikTok did not immediately respond to requests for comment.</p></div><h2>Users look for alternatives</h2><div><p>White House press secretary Karine Jean-Pierre reiterated Biden's support for the law in a statement, saying \"TikTok should remain available to Americans, but simply under American ownership or other ownership that addresses the national security concerns identified by Congress in developing this law.\"</p><p>\"Given the sheer fact of timing, this Administration recognizes that actions to implement the law simply must fall to the next Administration, which takes office on Monday,\" Pierre said.</p><p>Attorney General Merrick Garland and Lisa Monaco, his deputy, said in a release that the decision \"enables the Justice Department to prevent the Chinese government from weaponizing TikTok to undermine America's national security.\"</p><p>Kate Ruane, the director of the Center for Democracy and Technology nonprofit, criticized the ruling, saying in a statement that it \"harms the free expression of hundreds of millions of TikTok users in this country and around the world.\"</p><p>In December, members of the House Select Committee on the Chinese Communist Party <a href=\"https://www.cnbc.com/2024/12/13/apple-google-instructed-by-house-committee-to-prepare-to-dump-tiktok.html\">sent letters</a> to Apple CEO Tim Cook and Google CEO Sundar Pichai, urging the executives to begin preparing to comply with the law.</p></div><div data-test=\"InlineImage\"><div><div><div>Shou Zi Chew, CEO of TikTok, speaks to reporters outside the office of Sen. John Fetterman (D-PA) at the Russell Senate Office Building on March 14, 2024 in Washington, DC.</div><div>Anna Moneymaker | Getty Images</div></div></div></div><div><p>On Jan. 10, the<a href=\"https://www.cnbc.com/2025/01/09/supreme-court-set-to-hear-oral-arguments-on-challenge-to-tiktok-ban.html\"> Supreme Court heard oral arguments</a> from lawyers representing TikTok, content creators and the U.S. government. TikTok's lead lawyer, Noel Francisco, argued that the law violates the First Amendment rights of the app's 170 million American users. U.S. Solicitor General Elizabeth Prelogar argued that the app's alleged ties to the Chinese government pose a national security threat. &nbsp;</p><p>Many TikTok creators have been telling their fans to find them on competing social platforms such as Google's YouTube and  Facebook and Instagram, CNBC <a href=\"https://www.cnbc.com/2025/01/12/tiktok-creators-ask-followers-to-migrate-ahead-of-ban-to-meta-youtube.html\">reported</a>.&nbsp;Additionally, Instagram leaders scheduled meetings after the Jan. 10 Supreme Court hearing to direct workers to prepare for a wave of users if the court upholds the law.</p><p>Chinese social media app and <a href=\"https://www.cnbc.com/2025/01/13/as-tiktok-faces-us-ban-chinasr-rednote-tops-apple-app-store.html\">TikTok look-alike RedNote rose to the top</a> of Apple's app store Monday, indicating that TikTok's millions of users were seeking alternatives.<p>The Chinese government also weighed a </p><a href=\"https://www.cnbc.com/2025/01/13/china-considers-selling-tiktok-us-operations-to-musk-bloomberg-.html\">contingency plan</a> that would have X owner <a href=\"https://www.cnbc.com/elon-musk/\">Elon Musk</a> acquire TikTok's U.S. operations as part of several options intended to keep the app from its effective ban in the U.S., Bloomberg News <a href=\"https://www.bloomberg.com/news/articles/2025-01-14/china-discusses-sale-of-tiktok-us-to-musk-as-one-possible-option\" target=\"_blank\">reported</a> Monday.</p><p>Should ByteDance decide to sell TikTok to a U.S. company or group of investors, potential buyers may have to pay between <a href=\"https://www.cnbc.com/2025/01/15/tiktoks-us-unit-could-be-worth-as-much-as-50-billion-in-a-sale.html\">$40 billion and $50 billion</a>, according to an estimate by CFRA Research Senior Vice President Angelo Zino.</p></div>","contentLength":5982,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42738464"},{"title":"Canon wants us to pay for using our own camera as a webcam","url":"https://romanzipp.com/blog/no-you-cant-use-your-6299-canon-camera-as-a-webcam","date":1737103845,"author":"romanzipp","guid":214,"unread":true,"content":"<p><em>: Thanks for the feedback and suggestions, looks like many of you feel the same way. Reporting done on this article: <a target=\"_blank\" href=\"https://news.ycombinator.com/item?id=42735393\">Hacker News</a>, <a target=\"_blank\" href=\"https://arstechnica.com/gadgets/2025/01/canon-charges-50-per-year-to-use-a-900-camera-as-a-functional-webcam/\">Ars Technica</a>, <a target=\"_blank\" href=\"https://youtu.be/xYLMZuKWLfE\">Louis Rossmann</a>. Also there's now a <a href=\"https://romanzipp.com/rss\">RSS feed</a> if you want to be updated, I've reached to Canon myself.</em></p><p>Companies squeezing every last penny out of their customers is no news. And <a target=\"_blank\" href=\"https://www.digitalcameraworld.com/features/has-canon-stopped-putting-its-customers-first\">Canon</a><a target=\"_blank\" href=\"https://petapixel.com/2024/07/21/canon-doesnt-win-on-price-technology-or-public-opinion/\">is</a><a target=\"_blank\" href=\"https://petapixel.com/2024/08/13/canon-says-its-not-blocking-third-party-batteries-in-the-r5-ii/\">no</a><a target=\"_blank\" href=\"https://petapixel.com/2022/09/06/canon-confirms-its-going-after-lens-makers-for-patent-infringement/\">stranger</a>.</p><p>Last year, I've bought a Canon G5 X II camera which I wanted to use mainly for taking pictures at concerts. For me, it was the perfect match of focal range () and sensor size () for any compact camera I've compared. </p><p>Because I'm only using this camera for a small range of events, it's just collecting dust in the meantime. </p><p>So, why don't <strong>use it as a webcam with my Macbook</strong>?</p><p>Admittedly, it did not cost me the $6300 from the article's title, much closer to $900. Nonetheless, everything I'm describing translates to every other Canon camera model!</p><h2>Problems Problems Problems</h2><p>I've tried this at first in 2024 with macOS 14, which did not work. I <a target=\"_blank\" href=\"https://romanzipp.com/blog/fujifilm-webcam-x-macos-issues\">had similar experience</a> with FUJIFILM's X Webcam software where either the camera will not get recognized by the software or the camera feed will freeze or simply be not available within other apps.</p><p>As of January 2025 with macOS 15 Sequoia, these issues have been resolved for me.</p><p>Well actually, only if you are able to <strong>download the software at all</strong>. Seems like their Microsoft IIS server is having some issues. The following error page will be presented to you, after they asked you for your full legal name and mail address - without which you can not download the software.</p><p>So I've been really excited when I finally found a downloadable file on the Canon webpage which was not blocked by a faulty newsletter grift and saw the live feed of my camera!</p><p>Well the excitement didn't last long since nearly every single setting is disabled if you're using the software without a paying Canon account.</p><p>No brightness adjustments, no color correction, only 720p. Even in the paid version there doesn't seem to be a white balance adjustment setting.</p><p>Canon will happily take your credit card for you to pay a small monthly price of $4.99 per month or even a discounted $49.99 per year!</p><blockquote><p><em>** The 30-day free trial is valued at $4.99 and can be cancelled at any time during the free trial period through your MyCanon Account Dashboard. After the free trial period, your subscription will automatically be rolled over into the annual or monthly non-refundable, auto-renewable subscription selected upon enrollment in the free trial, which can be cancelled at any time through your MyCanon Account Dashboard. The current available subscription plans are $49.99/year or $4.99/month.</em></p></blockquote><p>In a <a target=\"_blank\" href=\"https://www.usa.canon.com/content/dam/canon-assets/product-assets/Cameras/camera-misc-pages/ewu/pdf/How%20to%20Subscribe.pdf\">support document</a>, Canon lists all differences between the free and paid version. So you can be very gladful, they allow you to even connect the camera.</p><p>Software development isn’t free, and I’m happy to pay for software I use regularly. However, Canon is a hardware company, not a software company, and they should—due to the lack of standards—provide software that allows you to use their cameras as intended. Aside from development costs, there’s no justification for a subscription model, particularly from a company earning nearly <a target=\"_blank\" href=\"https://global.canon/en/ir/finance/highlight.html\">$1.9 billion in profit</a>*.</p><p>So Canon will not allow you to use  camera on  computer with  cables the way you intent to without paying for another subscription.</p><p>* In an earlier version of this article I wrote \"$3 billion in profit\"</p>","contentLength":3409,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42735393"},{"title":"Starship Flight 7","url":"https://www.spacex.com/launches/mission/?missionId=starship-flight-7?submit","date":1737062724,"author":"chinathrow","guid":213,"unread":true,"content":"<p>\n        On its flight to the International Space Station, Dragon executes a series of burns that position the vehicle\n        progressively closer to the station before it performs final docking maneuvers, followed by pressurization of\n        the vestibule, hatch opening, and crew ingress.\n      </p><p>\n        On its flight to the International Space Station, Dragon executed a series of burns that positioned the vehicle\n        progressively closer to the station before it performed final docking maneuvers, followed by pressurization of\n        the vestibule, hatch opening, and crew ingress.\n      </p>","contentLength":601,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42731091"},{"title":"David Lynch has died","url":"https://variety.com/2025/film/news/david-lynch-dead-director-blue-velvet-twin-peaks-1236276106/","date":1737051649,"author":"wut42","guid":212,"unread":true,"content":"<p>\n\tDirector-writer <a href=\"https://variety.com/t/david-lynch/\" data-tag=\"david-lynch\">David Lynch</a>, who radicalized American film with with a dark, surrealistic artistic vision in films like “<a href=\"https://variety.com/t/blue-velvet/\" data-tag=\"blue-velvet\">Blue Velvet</a>” and “Mulholland Drive” and network television with “<a href=\"https://variety.com/t/twin-peaks/\" data-tag=\"twin-peaks\">Twin Peaks</a>,” has died. He was 78.</p><p>\n\tLynch revealed in 2024 that he had been diagnosed with emphysema after a lifetime of smoking, and would likely not be able to leave his house to direct any longer. His family announced his death in a <a href=\"https://www.facebook.com/davidlynchofficial/posts/pfbid04LuZED6SrWevszQ1UZoEED6x95znKc7scJxXFL5B1icBKgCiu4T2qYLHsErFNzELl?rdid=581XjlBlb3GqM8zP#\" rel=\"nofollow\" target=\"_blank\">Facebook post</a>, writing, “There’s a big hole in the world now that he’s no longer with us. But, as he would say, ‘Keep your eye on the donut and not on the hole.'”</p><p>\n\tThe “Twin Peaks” TV show and films such as “Blue Velvet,” “Lost Highway” and “Mulholland Drive” melded elements of horror, film noir, the whodunit and classical European surrealism. Lynch wove tales, not unlike those of his Spanish predecessor Luis Bunuel, which proceeded with their own impenetrable logic.\n\n\t</p><p>\n\tA four-time Oscar nominee, Lynch received an honorary Oscar for lifetime achievement in 2020.</p><p>\n\tAfter years spent as a painter and a maker of short animated and live action films, Lynch burst onto the scene with his 1977 feature debut “Eraserhead,” a horrific, black-humored work that became a disturbing fixture on the midnight movie circuit. His outré and uncompromising style quickly won the attention of the Hollywood and international movie-making establishment.</p><p>\n\tHe was hired by Mel Brooks’ production company to write and direct “The Elephant Man,” a deeply affecting drama about a horrifically deformed sideshow freak in Victorian England who became a national celebrity. The feature captured eight Academy Award nominations, including Lynch’s first for best director.</p><p>\n\tHe found less success with his 1984 adaptation of Frank Herbert’s sprawling science fiction novel “Dune.” The production, made on a budget of $40 million during an arduous three-year shoot, was a colossal box office flop.</p><p>\n\tHowever, Lynch rebounded from the disaster with two films that defined his mature style: “Blue Velvet” (1986), a frightening hellride through the psychosexual underbelly of a small American town, and the sexed-up, violent road movie “Wild at Heart” (1990), which was honored with the Cannes Film Festival’s Palme d’Or.</p><p>\n\tIn 1990, he revolutionized American episodic TV with “Twin Peaks,” a series he created with writer Mark Frost. With action springing from the investigation of a high school girl’s mysterious murder in a Washington lumber mill town, the weekly ABC show plumbed disquieting, theretofore taboo subject matter and made the inexplicable a fixture of modern narrative television.\n\n\t</p><p>\n\tA major hit in its first season, “Twin Peaks” lost its momentum and ultimately its audience in year two. However, it spawned a feature-length prequel, 1992’s over-the-top “Twin Peaks: Fire Walk With Me”; 25 years later, the ongoing affection of a loyal cult of viewers sparked a limited-run third season for Showtime that picked up where the second season left off.</p><p>\n\tLater in his career, in such features as “Lost Highway” (1997), “Mulholland Drive” (which won him the best director award at Cannes in 2001) and “Inland Empire” (2006), Lynch flexed a super-heated style that pivoted on plots emphasizing doubled personalities, unexplained transformations and shocking acts of violence. The quiet yet quirky “The Straight Story” (1999) harkened back to the more reserved emotional pull of “The Elephant Man.”</p><p>\n\tThe director himself was consistently reticent about sorting the meaning of his work for his viewers. In the book-length collection of interviews “Lynch On Lynch” (2005), he addressed the enigmatic core of his work with writer Chris Rodley.</p><p>\n\t“Well,” Lynch said, “imagine if you did find a book of riddles, and you could start unraveling them, but they were really complicated. Mysteries would become apparent and thrill you. We all find this book of riddles and it’s just what’s going on. And you can figure them out. The problem is, you figure them out inside yourself, and even if you told somebody, they wouldn’t believe you or understand it in the same way you do.”</p><p>\n\tIn addition to his honorary Oscar, Lynch’s one-of-a-kind career was acknowledged by a special award (shared with his frequent star Laura Dern) at the 2007 Independent Spirit Awards and a Golden Lion at the 2006 Venice Film Festival.</p><p>\n\tHe was born Jan. 20, 1946, in Missoula, Montana. His father was a research scientist for the Department of Agriculture, and his peripatetic family lived in the plains states, the Pacific Northwest and the Southeast before settling in Alexandria, Virginia, where Lynch attended high school.</p><p>\n\tAn indifferent student, Lynch focused on painting. A one-year stay at the School of the Museum of Fine Arts in Boston and an abortive trip to Europe with his friend Jack Fisk (later a noted Hollywood production designer) were succeeded by his enrollment at Philadelphia’s Pennsylvania Academy of Fine Arts in 1965.\n\n\t</p><p>\n\tLiving in a forbidding Philly neighborhood with his first wife and infant daughter Jennifer (later a director herself), Lynch began to dabble in film, directing the animated shorts “Six Men Getting Sick (Six Times)” and “The Alphabet” (1968).</p><p>\n\t“The Grandmother” (1970), a combination of animation and live action, was filmed with money obtained from a grant by the newly founded American Film Institute. In 1971, Lynch moved to Los Angeles to study filmmaking at the AFI’s Conservatory for Advanced Film Studies, headquartered in the former Doheny mansion in Beverly Hills.</p><p>\n\tBeginning in 1972, Lynch began work on a feature at the AFI. Inspired by his bleak years as a print engraver and struggling artist in Philadelphia, a 21-page initial script began to take shape; Lynch would later say he had no memory of writing it. Over the course of the next five years, he made the film with several collaborators who would remain constants in his career, including sound designer Alan Splet, cinematographer Frederick Elmes and actor Jack Nance.</p><p>\n\tShot laboriously, cheaply and on the fly for five years, “Eraserhead” was released by indie distributor Libra Films International in 1977. The disquieting black-and-white film followed the psychological descent of its maladroit hero Henry Spencer (Nance) after the birth of his monstrously malformed baby.</p><p>\n\tCritics were decidedly alarmed by the picture when it premiered at L.A.’s Filmex in 1977, but it took on a commercial life of its own when Libra opened the picture at midnight screenings in New York, San Francisco and Los Angeles. Lynch would frequently appear at L.A. screenings, admonishing his mystified audiences, “Don’t ask about the baby.”</p><p>\n\tOne enthusiastic viewer at a midnight show at L.A.’s Nuart Theatre was Stuart Cornfeld, a producer at Mel Brooks’ Brooksfilms. He urged Brooks to employ Lynch, and, after viewing “Eraserhead,” Brooks offered the director a job.</p><p>\n\tFor his project, Lynch took on the story of John Merrick, whose sensational life story had already inspired Bernard Pomerance’s hit 1977 play. The film version of “The Elephant Man” was an entirely new enterprise, co-written by Lynch and starring a heavily made-up John Hurt as the sensitive Merrick, Anthony Hopkins as the London Hospital surgeon who became his guardian, and Brooks’ wife Anne Bancroft as a sympathetic West End stage star.\n\n\t</p><p>\n\t“The Elephant Man” had a powerful emotional impact, and became a box office and critical hit; Lynch received Oscar nods as best director and for best adapted screenplay, with the film also taking a nomination for best picture. The triumph led to a multiple-picture deal with Dino Di Laurentiis.</p><p>\n\tThe sprawling space opera “Dune,” about galactic family dynasties warring over possession of a space-travel “spice” mined on a desert planet, had already defeated projected adaptations by Alejandro Jodorowsky and Ridley Scott when Lynch took on the material.</p><p>\n\tFilmed laboriously on Mexican soundstages with an enormous international cast, “Dune” sported an unusual Flash Gordon-meets-Antonio Gaudi production design, a memorable gallery of demented Lynchian villains and the director’s trademark amniotic visuals.</p><p>\n\tThe picture satisfied no one: Both audiences attuned to the boisterous heroics of “Star Wars” and impatient critics rejected Lynch’s contorted, confusing and harshly digested reading of Herbert’s novel, and the film tanked on arrival. Lynch later told Chris Rodley that at the conclusion of the ordeal, “I was almost dead. Almost dead!”</p><p>\n\tHowever, Lynch’s second film for De Laurentiis defined the contours of his mature style. “Blue Velvet” starred Kyle McLachlan, who had played the messianic hero of “Dune,” as a small-town boy who is plunged into a whirlpool of sexual violence, murder and sadomasochism.</p><p>\n\tFeaturing a potent cast that included Isabella Rossellini (with whom Lynch became involved romantically), Laura Dern, Dean Stockwell and, most notably, Dennis Hopper as its deranged, out-of-control villain, “Blue Velvet” polarized critics, but it cemented Lynch’s reputation as a fearless and daring film author. The film was the start of his collaboration with composer Angelo Badalamenti.</p><p>\n\tFour years later, the Lynch style was brought to the small screen with “Twin Peaks.” Starring McLachlan as eccentric FBI agent Dale Cooper, the series used the investigation of the murder of homecoming queen Laura Palmer as a springboard into a swirling narrative vortex involving sexual intrigue, drug addiction, prostitution, madness and demonic possession. TV audiences tuned in to track the mystery and remained for the series’ complexly interwoven characters and perverse, at times supernatural plot twists.\n\n\t</p><p>\n\tThe show’s first season scored 14 Emmy nominations, including nods for Lynch for writing and directing the pilot, but declining ratings after the drawn-out revelation of Palmer’s killer and Lynch’s diminishing participation due to production of a new feature led to a cliffhanging wrap-up at the end of season two.</p><p>\n\tHowever, the “Twin Peaks” saga had legs. Actress Sheryl Lee was brought back from the dead to play Laura Palmer in “Twin Peaks: Fire Walk With Me,” which tracked the fateful last week of Palmer’s life in lurid, screaming detail. And Showtime cable audiences were baffled anew by 2017’s much-belated third season, which reunited McLachlan and several members of the original cast.</p><p>\n\tThe truest legacy of “Twin Peaks” may have been its impact on the development of unusual long-form episodic series. Successors ranging from “Wild Palms” to “True Detective” all bore Lynch’s distinctive stylistic fingerprints.</p><p>\n\tLynch’s first feature after “Twin Peaks,” 1990’s “Wild at Heart,” was an oddball exodus, based on a novel by Barry Gifford, in which an Elvis-fixated ex-con (Nicolas Cage) and his hot-to-trot girlfriend (Laura Dern) are pursued by the murderous minions of the girl’s jealous mother (Dern’s own mother Diane Ladd). Domestic reaction was mixed to the gory, sexually frank mix of “Detour” and “The Wizard of Oz,” but the Cannes jury was wowed.</p><p>\n\tLynch’s association with Gifford continued with “Lost Highway,” for which the two collaborated on an original screenplay. A doppelganger murder mystery that foreshadowed “Mulholland Drive,” the disquieting, brutally effective thriller starred Bill Pullman, Balthazar Getty and Patricia Arquette as the players in a homicidal foursome.</p><p>\n\tAfter spending most of the decade on the far side of narrative coherence, Lynch came back down to earth with “The Straight Story,” the first feature in which he took no hand in writing. In the incongruously Disney-distributed picture, based on a true story, Richard Farnsworth starred as an Iowa man who drives from Iowa to Wisconsin on a power mower to visit his seriously ill brother.</p><p>\n\tThough not a major hit, the film was critically well received, and proved to Lynch’s naysayers that he was capable of bringing life to material that was not extravagantly outrageous. Farnsworth received an Oscar nomination for his performance; the veteran actor and stunt man, who was suffering from terminal prostate cancer during the production of the film, died by suicide in 2000.\n\n\t</p><p>\n\tAn enlarged version of a prospective pilot for a new TV series became what may have been Lynch’s most widely acclaimed film, and a defining summation of the filmmaker’s themes and narrative obsessions.</p><p>\n\t“Mulholland Drive” served a darkly satirical comment on the ways of Hollywood in the story of a young actress (Naomi Watts) whose relationship with an amnesiac stranger (Laura Elena Harring) becomes a hall-of-mirrors story of manipulation, betrayal and suicide. Lynch was nominated for a 2002 best director Oscar.</p><p>\n\tSome of the same themes came to the fore in “Inland Empire,” Lynch’s first film to be shot entirely on digital video, with Laura Dern starring as an on-the-skids actress involved in typical Lynchian psychic disorder. Owing to its format, still a relative rarity theatrically in 2007, the three-hour feature was little seen after its 2007 premiere at the Venice Film Festival.</p><p>\n\tIn 2022, he appeared as John Ford in Steven Spielberg’s “The Fablemans,” and also provided the voice of the mad scientist in “Robot Chicken.”</p><p>\n\tBeyond his work in film and TV, Lynch exhibited his paintings internationally and issued many solo and collaborative albums of music. He contributed a weekly comic strip, “The Angriest Dog in the World,” to the alternative weekly the Los Angeles Reader for eight years. His wry, deadpan weather reports were aired daily on the L.A. rock station Indie 103.1 for several years and continued on social media.</p><p>\n\tA devotee of transcendental meditation from the 1970s on, he established his David Lynch Foundation to promote the Eastern practice, and enlisted such stars as Paul McCartney, Ringo Starr and Donovan for fund-raising concerts.</p><p>\n\tDespite persistent rumors of new feature and TV projects after “Twin Peaks” came to an end in 2017, Lynch focused on making music videos and composing music with collaborators including Christabell. He offered his name to the David Lynch Graduate School of Cinematic Arts at Maharishi University and a line of coffee beans and designed Silencio nightclubs in Paris and New York. </p><p>\n\tLynch was married four times. He is survived by two daughters and two sons.</p><p>\n\tThe first reference to David Lynch in  came in the Dec. 6, 1968, edition of , in a story noting that he had received a $5,000 grant from the American Film Institute for his short film “The Grandmother.” </p>","contentLength":14762,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42728862"},{"title":"No Calls","url":"https://keygen.sh/blog/no-calls/","date":1737037051,"author":"ezekg","guid":211,"unread":true,"content":"<p>When I first started Keygen, I had this idea in my head that I could create a\ncompany where I never had to get on a sales call — or any call. Being an\nintrovert, I absolutely hated calls. They're not only awkward, but a 30 minute\ncall takes up hours of my headspace. I quickly learned that I didn't want to\ndo them, and so I decided that I wouldn't.</p><p>I instituted a bonkers  policy at work.</p><p>(Even I thought I was being crazy.)</p><p>However, as Keygen grew, I wanted to start to move more up-market. I wanted\nlarger customers, because the bigger a customer got, the less support they\ntypically needed, and of course, the more they paid me. And the bigger\nlogos help gain trust in a market.</p><p>The first thing I tried was taking sales calls. I threw up a big \nbutton on my enterprise pricing page — but I obviously hated it.</p><p>(What about for non-enterprise leads? Well, I can't justify a call for $49/mo,\nI'll tell you that much, especially when they may not buy.)</p><p>I felt like I was wasting my time, the lead's time, and I could never close a\nsale. It felt awkward. I tried for months. I never felt prepared. I felt like\nI was constantly talking to the wrong people, slowly climbing the ladder to an\nactual stakeholder, repeating myself over and over every call — and then\nrepeating myself  in a summary email.</p><p><em>\"Couldn't this have all been an email?\"</em></p><p>(Yes, it could — and should — have been.)</p><p><em>\"This would be easier if it was async so I could think about my answer.\"</em></p><p><em>\"This person isn't somebody that has the authority to even close.\"</em></p><p><em>\"Is this person even involved in the project?\"</em></p><p><em>\"How do I talk to engineering?\"</em></p><p><em>\"Why am I talking to this person again?\"</em></p><p>One day, I woke up and out of frustration, I nuked the  button\nfrom my pricing page.</p><p>When the next person asked for a call, I responded with a simple <em>\"No, we don't\ndo calls, but happy to help via email. Feel free to CC any relevant team\nmembers onto this thread.\"</em></p><p>Their response was surprising. They  what I suggested — they CC'd\nthe engineering department onto the email, they asked their questions, and we\nstarted chatting integration strategies.</p><p>Instead of speaking with somebody who was multiple positions removed from the\nproject, I was speaking with the actual people who could champion Keygen within\nthe organization — the people who're directly involved — </p><p>I thought to myself, <em>\"did I just bypass all of the red tape?\"</em></p><p>That month, I closed my first enterprise sale.</p><p>Nearly everybody I sent that to  to skip the calls too. (I've even had\npeople <em>literally say that to me in their response!</em>)</p><p>Sometimes, it didn't work out, and that's okay. I don't expect Keygen to be a\nfit for everybody; and not everybody is a fit for Keygen.</p><p>Am I leaving money on the table?</p><p>But I personally don't  like I am. I feel like I get to wake up every\nmorning and do the kind of work that I love to do. And I feel like I have\nthe freedom to avoid the type of work that I hate to do.</p><p>I think about it like this: I don't provide white-glove integration or\nconsulting services, even though I might be able to earn more money if\nI did. (And lots of people ask for it!)</p><p>But that's not what I want to do. That's not why I built Keygen.</p><p>In the same way, I don't want to do calls.</p><p>So, in enterprise sales, why do calls happen? Enterprises often default to\ncalls for these 4 totally-solvable reasons:</p><ol><li>They don't understand what you offer.</li><li>They don't know how to use it.</li><li>They don't know your price.</li></ol><p>If you want to try , you need to solve these problems.</p><h4>1. They don't understand what you offer</h4><p>This comes down to messaging. If your messaging is vague, people will need to\nget on a call to understand what you actually offer. If your product offering\nis too wide (i.e. <a href=\"https://keygen.sh/blog/good-saas-products-are-like-unix-tools/\">you do too much</a>), people will feel like\nthey need to get on a call just to understand if your product is a good fit\nfor their much more narrow use-case.</p><p>But if you narrow down your focus, and really nail your messaging — make it\nclear what you actually do — you can eliminate the question entirely. Drop the\n taglines and actually sell the product. (And now, it\nmight be easier to see  some companies use these taglines — it's like\na sales call siren song!)</p><h4>2. They don't know how to use it</h4><p>If your product isn't self-serve, and if your onboarding sucks, people will\nfeel like have they to book a call in order to get started.</p><p>If you don't provide enough information on your website to scope a POC or an\nintegration, they're going to need to somehow obtain that information. And\nthat typically requires a call.</p><p>e.g. if you don't have public documentation, you guessed it — call.</p><p>(And why would you not have public documentation?)</p><h4>3. They don't know your price</h4><p>Price is the big one. Enterprises are used to the dance. You book a call, size\neach other up, and then come up with a b.s. price. It's all so tiring. And if\nyou want to skip calls, you have to dip out of the dance.</p><p>You can do this by putting enterprise pricing up front and center. I don't care\nhow large the number is — put it on your pricing page. If you feel like you're\ngiving up too much money, maybe  isn't for you.</p><p>When somebody asks for a call to discuss pricing, all you have to do is say\nsomething simple like, <em>\"Our enterprise pricing is available here. Let me\nknow if you have any questions.\"</em></p><p>Last, but most certainly not least, is trust. If an enterprise doesn't trust\nyou, they will not buy from you —  How do you gain trust? Well, first\noff, <a href=\"https://keygen.sh/blog/dont-die/\">don't die</a>. Trust is a function of time — i.e. the longer you\nexist, the more people will trust that you'll continue to exist.</p><p>But there are other facets of trust as well, and enterprises will send you huge\ntime-consuming questionnaires to alleviate all of their concerns. They might\neven want to jump on a call. All they're trying to do is be compliant, and you\ncan help them be compliant without calls.</p><p>You can do that by clearly articulating how your company handles data, how you\nhandle security, and how you handle incidents. I'm sure SOC2, HIPAA, and PCI\ncertifications would help, too, but we don't hold those yet (but our\ninfrastructure providers do).</p><p>(At Keygen, we have a <a href=\"https://keygen.sh/security/\">security</a> page that outlines all of this, and\nessentially answers the questions that are in most security questionnaires\nwe've seen.)</p><p>It may be controversial (I'm almost sure of it), but here's my philosophy on\nenterprise sales while avoiding sales calls entirely:</p><ul><li>No sales calls, except for a short  if absolutely needed.\nDiscovery calls are just a formality.</li><li>Use email. Ask leads to CC relevant teammates (e.g. engineering).</li><li>Explain your value clearly. Don't muddy the waters by doing too much. Avoid\nvague messaging that prompts more questions.</li><li>Focus on security, and spell it out in public docs.</li><li>Document every problem to avoid repeating answers (i.e. allow them to easily\nfind the answers themselves).</li><li>Use fixed- or transparent-pricing. (If you like calls, ignore this.)</li><li>Make onboarding self-serve.</li></ul><p>I'm sure some people will scoff at some or all of this, but maybe others who are\nlike myself will read this and realize they don't have to do sales like everybody\nelse. Enterprise sales don't have to be crazy.</p><p>If you want to go , maybe try out some of the things above.</p><p>If you want to do calls, do the opposite of all of these things.</p><p><small> some readers have (rightfully) <a href=\"https://news.ycombinator.com/item?id=42725385\">pointed out</a> that we do indeed have\n  a  button on our enterprise pricing page, and so there seems to\n  be a disconnect. I've been practicing a strict  philosophy for years\n  and years and years, and the  button being back is relatively\n  new.</small></p><small><p>  I briefly touched on this in the conclusion, but this call is a short 15 min\n  ,  a sales call. It's essentially a formality to intro\n  each other, make sure we're human, and move onto email for any further\n  discussion. There is no further call.</p><p>  Essentially, over the years of strictly , I discovered that not all\n  enterprises will shoot you a cold email to start the conversation, so this\n  call is to capture those leads, with the end-goal of having all real\n  discussion in email.</p><p>  The point of  is to dip out of the dance, not of all communication.</p><p>  tl;dr: some enterprises will bounce if they don't see a  button.</p></small>","contentLength":8086,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42725385"},{"title":"Nepenthes is a tarpit to catch AI web crawlers","url":"https://zadzmo.org/code/nepenthes/","date":1737035863,"author":"blendergeek","guid":210,"unread":true,"content":"<p>This is a tarpit intended to catch web crawlers. Specifically, it's targetting crawlers that scrape data\nfor LLM's - but really, like the plants it is named after, it'll eat just about anything that finds it's\nway inside.</p><p>It works by generating an endless sequences of pages, each of which with dozens of links, that simply go\nback into a the tarpit. Pages are randomly generated, but in a deterministic way, causing them to appear\nto be flat files that never change. Intentional delay is added to prevent crawlers from bogging down your\nserver, in addition to wasting their time. Lastly, optional Markov-babble can be added to the pages, to\ngive the crawlers something to scrape up and train their LLMs on, hopefully accelerating model collapse.</p><p>THIS IS DELIBERATELY MALICIOUS SOFTWARE INTENDED TO CAUSE HARMFUL ACTIVITY.\nDO NOT DEPLOY IF YOU AREN'T FULLY COMFORTABLE WITH WHAT YOU ARE DOING.</p><p>LLM scrapers are relentless and brutual. You may be able to keep them at bay\nwith this software - but it works by providing them with a neverending stream\nof exactly what they are looking for. YOU ARE LIKELY TO EXPERIENCE SIGNIFICANT\nCONTINUOUS CPU LOAD, ESPECIALLY WITH THE MARKOV MODULE ENABLED.</p><p>There is not currently a way to differentiate between web crawlers that\nare indexing sites for search purposes, vs crawlers that are training\nAI models. ANY SITE THIS SOFTWARE IS APPLIED TO WILL LIKELY DISAPPEAR\nFROM ALL SEARCH RESULTS.</p><p>Expected usage is to hide the tarpit behind nginx or Apache, or whatever else you have implemented your\nsite in. Directly exposing it to the internet is ill advised. We want it to look as innocent and normal\nas possible; in addition HTTP headers are used to configure the tarpit.</p><p>I'll be using nginx configurations for examples. Here's a real world snippet for the demo above:</p><pre><code>    location /nepenthes-demo/ {\n            proxy_pass http://localhost:8893;\n            proxy_set_header X-Prefix '/nepenthes-demo';\n            proxy_set_header X-Forwarded-For $remote_addr;\n            proxy_buffering off;\n    }\n</code></pre><p>You'll see several headers are added here: \"X-Prefix\" tells the tarpit that all links should go to that\npath. Make this match what is in the 'location' directive. X-Forwarded-For is optional, but will make any\nstatistics gathered significantly more useful.</p><p>The proxy_buffering directive is important. LLM crawlers typically disconnect if not given a response within\na few seconds; Nepenthes counters this by drip-feeding a few bytes at a time. Buffering breaks this workaround.</p><p>You can have multiple proxies to an individual Nepenthes instance; simply set the X-Prefix header accordingly.</p><p>You can use Docker, or install manually.</p><p>A Dockerfile and compose.yaml is provided in the <a href=\"https://svn.zadzmo.org/repo/nepenthes/head/docker/\">/docker directory.</a>\nSimply tweak the configuration file to your preferences, 'docker compose up'. You will still need to bootstrap\na Markov corpus if you enable the feature (see next section.)</p><p>For Manual installation, you'll need to install Lua (5.4 preferred), SQLite (if using Markov), and OpenSSL.\nThe following Lua modules need to be installed - if they are all present in your package manager, use that;\notherwise you will need to install <a href=\"https://luarocks.org/\">Luarocks</a> and use it to install the following:</p><p>Create a nepenthes user (you REALLY don't want this running as root.) Let's assume the user's home\ndirectory is also your install directory.</p><pre><code>cd scratch/\ntar -xvzf nepenthes-1.0.tar.gz\n    cp -r nepenthes-1.0/* /home/nepenthes/\n</code></pre><p>Tweak config.yml as you prefer (see below for documentation.) Then you're\nready to start:</p><pre><code>    su -l -u nepenthes /home/nepenthes/nepenthes /home/nepenthes/config.yml\n</code></pre><p>Sending SIGTERM or SIGINT will shut the process down.</p><h2>Bootstrapping the Markov Babbler</h2><p>The Markov feature requires a trained corpus to babble from. One was intentionally omitted because, ideally,\neveryone's tarpits should look different to evade detection. Find a source of text in whatever language you\nprefer; there's lots of research corpuses out there, or possibly pull in some very long Wikipedia articles,\nmaybe grab some books from Project Gutenberg, the Unix fortune file, it really doesn't matter at all. Be creative!</p><p>Training is accomplished by sending data to a POST endpoint. This only needs to be done once. Sending training\ndata more than once cumulatively adds to the existing corpus, allowing you to mix different texts - or train in\nchunks.</p><p>Once you have your body of text, assuming it's called corpus.txt, in your working directory, and you're running\nwith the default port:</p><pre><code>curl -XPOST -d ./@corpus.txt -H'Content-type: text/plain' http://localhost:8893/train\n</code></pre><p>This could take a very, VERY long time - possibly hours. curl may potentially time out. See\n<a href=\"https://svn.zadzmo.org/repo/nepenthes/head/load.sh\">load.sh</a> in the nepenthes distribution for a script that\nincrementally loads training data.</p><p>The Markov module returns an empt string if there is no corpus. Thus, the tarpit will continue to function\nas a tarpit without a corpus loaded. The extra CPU consumed for this check is almost nothing.</p><p>Want to see what prey you've caught? There are several statistics endpoints, all returning JSON. To see everything:</p><pre><code>http://{http_host:http_port}/stats\n</code></pre><p>To see user agent strings only:</p><pre><code>http://{http_host:http_port}/stats/agents\n</code></pre><p>Or IP addresses only:\n3\nhttp://{http_host:http_port}/stats/ips/</p><p>These can get quite big; so it's possible to filter both 'agents' and 'ips', simply add a minimum hit count to the\nURL. For example, to see a list of all IPs that have visted more than 100 times:</p><pre><code>http://{http_host:http_port}/stats/ips/100\n</code></pre><p>Simply curl the URLs, pipe into 'jq' to pretty-print as desired. Script away!</p><h2>Nepenthes used Defensively</h2><p>A link to a Nepenthes location from your site will flood out valid URLs\nwithin your site's domain name, making it unlikely the crawler will access\nreal content.</p><p>In addition, the aggregated statistics will provide a list of IP addresses\nthat are almost certainly crawlers and not real users. Use this list to\ncreate ACLs that block those IPs from reaching your content - either return\n403, 404, or just block at the firewall level.</p><p>Integration with fail2ban or blocklistd (or similar) is a future possibility,\nallowing realtime reactions to crawlers, but not currently implemented.</p><p>Using Nepenthes defensively, it would be ideal to turn off the Markov\nmodule, and set both max_delay and min_delay to something large, as a\nway to conserve your CPU.</p><h2>Nepenthes used Offensively</h2><p>Let's say you've got horsepower and bandwidth to burn, and just want to\nsee these AI models burn. Nepenthes has what you need:</p><p>Don't make any attempt to block crawlers with the IP stats. Put the delay\ntimes as low as you are comfortable with. Train a big Markov corpus and\nleave the Markov module enabled, set the maximum babble size to something\nbig. In short, let them suck down as much bullshit as they have diskspace\nfor and choke on it.</p><p>All possible directives in config.yaml:</p><ul><li>http_host : sets the host that Nepenthes will listen on; default is localhost only.</li><li>http_port : sets the listening port number; default 8893</li><li>prefix: Prefix all generated links should be given. Can be overriden with the X-Prefix HTTP header. Defaults to nothing.</li><li>templates: Path to the template files. This should be the '/templates' directory inside your Nepenthes installation.</li><li>detach: If true, Nepenthes will fork into the background and redirect logging output to Syslog.</li><li>pidfile: Path to drop a pid file after daemonization. If empty, no pid file is created.</li><li>max_wait: Longest amount of delay to add to every request. Increase to slow down crawlers; too slow they might not come back.</li><li>min_wait: The smallest amount of delay to add to every request. A random value is chosen between max_wait and min_wait.</li><li>real_ip_header: Changes the name of the X-Forwarded-For header that communicates the actual client IP address for statistics gathering.</li><li>prefix_header: Changes the name of the X-Prefix header that overrides the prefix configuration variable.</li><li>forget_time: length of time, in seconds, that a given user-agent can go missing before being deleted from the statistics table.</li><li>forget_hits: A user-agent that generates more than this number of requests will not be deleted from the statistics table.</li><li>persist_stats: A path to write a JSON file to, that allows statistics to survive across crashes/restarts, etc</li><li>seed_file: Specifies location of persistent unique instance identifier. This allows two instances with the same corpus to have different looking tarpits.</li><li>words: path to a dictionary file, usually '/usr/share/dict/words', but could vary depending on your OS.</li><li>markov: Path to a SQLite database containing a Markov corpus. If not specified, the Markov feature is disabled.</li><li>markov_min: Minimum number of words to babble on a page.</li><li>markov_max: Maximum number of words to babble on a page. Very large values can cause serious CPU load.</li></ul><p>Version numbers use a simple process: If the only changes are fully backwards\ncompatible, the minor number changes. If the user/administrator needs to change\nanything after or part of the upgrade, the major number changes and the minor\nnumber resets to zero.</p>","contentLength":8996,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42725147"},{"title":"Nintendo announces the Switch 2 [video]","url":"https://www.youtube.com/watch?v=itpcsQQvgAQ","date":1737032894,"author":"HelloUsername","guid":209,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42724621"},{"title":"I ditched the algorithm for RSS","url":"https://joeyehand.com/blog/2025/01/15/i-ditched-the-algorithm-for-rssand-you-should-too/","date":1737029912,"author":"DearNarwhal","guid":208,"unread":true,"content":"<p>I waste too much time scrolling through social media.  It's bad for my health, so why do I keep doing it?  </p><p>Because once in a while, I'll find a post so good that it teaches me something I never knew before, and all the scrolling feels worth it.\nBut I've stumbled upon an old piece of free and open source tech, relatively unknown today, which is THE solution of solving the problems with modern media without sacrificing accessible, good content: RSS. </p><p>Reddit, Facebook, Twitter — platforms built for engagement, not efficiency. Instead of showing you high-quality posts upfront, they pad your feed with memes, spam, and astroturfing. There is only so much 'good' content created in a day. By padding your feed with trash, they make the limited amount of good posts \"last longer\". \nThese sites want you to spend more time scrolling on their website, so they feed you scraps which makes the occasional great post feels like a jackpot.\nThis concept, operant conditioning, was developed by B.F. Skinner — Yes, the mind behind the <a href=\"https://www.simplypsychology.org/what-is-a-skinner-box.html\">Skinnerbox</a>.</p><p>While some sites offer filtering or sorting options, manually settings these options every time you want to access a subreddit is just not doable.  </p><p>You could, of course, stop consuming content from these websites. However, this would mean potentially missing really good content; content you'd learn from, interesting ideas, and more.\nBut it doesn't have to be this way. You can reclaim your attention span while still having access to the same quality content as before.  </p><p>RSS is like your youtube subscription feed in hyperdrive. Subscribe to sites you love and decide what shows up — no exploitative social media algorithm needed. No more ads or algorithms deciding how to keep you doomscrolling. This 1999 tech actually solves a lot of 2025 problems.\nHere's the kicker: Most websites, even social media, quietly support RSS feeds.</p><p>You can filter out keywords, set minimum upvotes or like counts, and much more! Modern RSS clients allow you to make filters using <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_expressions\">Regex</a>, and there are a  of software and services you can use to tune up your filtering to 11.</p><p>TL;DR: Never see noise, and never miss hidden gems again!</p><p>But how do you get started with RSS? It's easier than you think!</p><p>I personally <a href=\"https://en.wikipedia.org/wiki/Self-hosting_(web_services)\">self-host</a> an open source RSS reader: <a href=\"https://tt-rss.org/\">Tiny Tiny RSS</a>\nIf you don't want to host it yourself, you can google for companies offering easy and accessible RSS readers.</p><p>To make it easier, let's differentiate between three levels of ease when it comes to adding a website to RSS: Easy, medium, and hard.\nI'll be going over how to add several popular sites to your feed.</p><p>Want a youtube channel in your RSS feed? Just copy the channel's URL and subscribe to it in your reader. Done.</p><p>If you like games, you might want to subscribe to <a href=\"https://ign.com\">IGN</a>. There's no clear RSS button, so the best course of action would be to google \"IGN RSS\".</p><p>This leads to a nice <a href=\"https://corp.ign.com/feeds\">IGN RSS Feeds</a> page with multiple categorized feeds for you to pick from. If you wanted to subscribe to \"Game Articles\", you'd right-click on the game articles link, press \"copy link\", go to your RSS reader of choice and subscribe to the link you copied.  </p><p>Now all IGN Game Articles will show up in your RSS feed as they are published!</p><div><p>Some websites don't have a dedicated RSS button, but still support RSS. You can discover their RSS urls by adding .rss, atom.xml, feed, etc. at the end of the site's URL, for example <code>https://website.com/atom.xml</code>. Almost all RSS readers support Atom feeds. For more examples, check <a href=\"https://www.reddit.com/r/rss/comments/12782um/comment/jee0lpx/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button\">this</a> Reddit comment.</p></div><p>Some sites like HackerNews have RSS support. However, this RSS can be extremely limited if you want to filter posts so your feed isn't spammed by low effort content. Some people are nice enough to set up a \"middleman\" between your RSS feed and the website, so you can pull the RSS feed through the middleman while doing actions like filtering it.</p><p>For example, if you wanted to subscribe to HackerNews but filter out low upvote count posts, you could subscribe to <a href=\"https://hnrss.github.io/\">HNRSS</a> instead of through HN directly. For example, I filter out posts below 150 upvotes by to this url: <code>https://hnrss.org/newest?points=150</code>\nSometimes these services open-source their code so you can <a href=\"https://github.com/hnrss/hnrss\">self-host</a> the 'middleman'.</p><div><p>When removing the optional search term from a reddit search URL, don't forget to remove the \nWhen removing the sort options\nIf adding more search terms, add a + between them!</p></div><p>I love managing my homelab. I follow <a href=\"https://www.reddit.com/r/homelab/\">/r/homelab</a>. Some posts are really good and teach me a lot.\nHowever, there's a lot of noise posted to that subreddit; I do not want to see memes, and pictures of people's hardware setup gets boring quick. I'm interested in hidden gems, threads where a lot of interesting info is explained, things I can really learn a lot from.</p><h4>Step 1: Filter out picture posts.</h4><p>Reddit hack: Filter out picture posts by searching for 'self:true' in a subreddit. Bonus: You can subscribe to that specific search query as a RSS feed for text posts only.</p><p>So instead of subscribing to a subreddit's RSS directly, you do a search for posts in that subreddit and then subscribe to  RSS feed.\nThe RSS link you should subscribe to should look someting like this:\n<code>https://www.reddit.com/r/homelab/search.rss?q=self%3Atrue&amp;restrict_sr=on</code>\nYou can change 'homelab' to your subreddit of choice.</p><div><p>The  parameter in the URL (probably) means \"Restrict_subreddit\". Removing this from the search will yield results from different subreddits than the one you're searching in. If you think that parameter is redundant, I agree.</p></div><p>There are a  of text-only submissions on /r/homelab. Gems are relatively sparce. Lots of low quality content. It's not the subreddit's fault; this is standard across Reddit.</p><h4>Step 2: Filter for quality</h4><p>Seems easy; let's add a 'minimal upvotes' query to the search, right?\nSadly, Reddit doesn't support that.. a shame, really.<p>\nHowever, a workaround is sorting by 'Top' and asking the search to show us the 'top posts of this week'. Note: 'This week' would mean 'past 7 days' instead of 'posted this week'.</p></p><p>Filtering by 'Top of ...' always returns 25 items. This means that if you sort by 'top of this week', on average of 25/7=3,57 NEW posts get added to your feed each day! This is a great way to only see the highest scoring posts of each day.</p><p>Adding this sort on top of the RSS feed from step 1 results in an URL like this:\n<code>https://www.reddit.com/r/homelab/search.rss?q=self%3Atrue&amp;restrict_sr=on&amp;sort=top&amp;t=year</code></p><div><p>If you don't care about only seeing text posts, removing  does  work for RSS feeds, even though it does work for direct searches. Instead, subscribe to the subreddit's \"top\" RSS and filter by time. For example: <code>https://www.reddit.com/r/homelab/top.rss?t=month</code></p></div><p>For reference, here is how many posts you would get in your RSS feed, depening on your reddit sorting:</p><p>And just like that, we converted a high-noise subreddit to an RSS feed which only gives us the best the subreddit has to offer.</p><div><p>If you wanted to subscribe to all new posts in a subreddit, you would subscribe to an url like <code>https://www.reddit.com/r/SUBREDDIT_NAME/new/.rss?sort=new</code>. For a more extensive Reddit RSS guide, see <a href=\"https://www.reddit.com/r/pathogendavid/comments/tv8m9/pathogendavids_guide_to_rss_and_reddit/\">this post</a></p></div><p>Some sites might not have support for an RSS feed. Sometimes you can get away with a neat google trick:</p><p>Most of the time you'd need something to generate the RSS for you. You could use one of many RSS feed generators available online, or host one yourself. Most of these feed generators have enhanced filtering tools as well.</p><p>I haven't had to do this yet, however I've heard really good things about the open source <a href=\"https://github.com/RSS-Bridge/rss-bridge\">RSS-Bridge</a></p><p>How you'd set up a feed generator depends on the software, so I won't expand upon that here.</p><p>Separating yourself from the algorithmic whims of social media platform is easier than ever. With RSS, you can stay informed, save time, and never miss the content that truly matters.</p><p>To end this post, here is a list of (RSS supported) sites I think are really interesting.\nLinked are excellent articles for first-time readers!</p>","contentLength":7927,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42724284"},{"title":"I have made the decision to disband Hindenburg Research","url":"https://hindenburgresearch.com/gratitude/","date":1736976235,"author":"toomuchtodo","guid":207,"unread":true,"content":"<p>As I’ve shared with family, friends and our team since late last year, I have made the decision to disband Hindenburg Research. The plan has been to wind up after we finished the pipeline of ideas we were working on. And as of the last Ponzi cases we just completed and are sharing with regulators, that day is today.</p><p>I write this from a place of joy. Building this has been a life’s dream.</p><p>I did not know at the outset if it would be possible to find a fulfilling path. This wasn’t an easy option, but I was naïve to the danger and felt drawn to it magnetically.</p><p>When I started this, I doubted I was capable. I didn’t have a traditional finance background. None of my relatives are in this field. I went to a state school. I’m not a slick salesperson. I don’t know any of the right clothes to wear. I can’t play golf. I’m not some superhuman that can function on 4 hours of sleep. In most of my jobs I was a good worker but mostly looked over. I had no money when I started—and after catching 3 lawsuits immediately out of the gate, I quickly had less than no money. I would have failed right at the starting line had it not been for the support of world-class whistleblower lawyer <a href=\"https://www.pugsleywood.com/lawyers/bryan-a-wood/\">Bryan Wood</a>, who took the cases on despite my lack of financial resources. I had a newborn child and was facing eviction at the time. I was terrified, but knew that if I stayed still I would crumble. The only option I had was to keep moving forward.</p><p>It is very easy to succumb to negative thoughts and believe what others think of you, especially when things feel low. But it is possible to shatter all of that. I was passionate about this and I let that carry me forward despite my fears and insecurities.</p><p>And then this slowly started to flourish.</p><p>One at a time, and without a clear plan, we built a team of 11 incredible people. I hired each of them not because we needed workers, but because when our paths crossed and I could see who they were, I realized it was madness not to bring them on.</p><p>They are all smart, focused, and fun to work with. Little to no ego. When you meet them, they are all very nice and polite. But when it comes to this field, they are ruthless assassins, capable of world-class work. Like me, our team didn’t come from traditional finance backgrounds. My first hire often describes himself as a former bartender. We all have a shared view of the world, a mostly calm exterior, and a similar burning underlying intensity. They are all family to me.</p><p>We have all worked extremely hard, with a focus on precision and letting the evidence dictate our words.</p><p>Sometimes this meant taking big swings and taking on fights that are much bigger than any of us as individuals. Fraud, corruption, and negativity often seem overwhelming. Early on, a sense of justice was usually elusive. When it happened, it was tremendously fulfilling. It kept us going when we needed it.</p><p>And boy did we have an impact, eventually—more than I imagined was possible at the outset. Nearly 100 individuals have been charged civilly or criminally by regulators at least in part through our work, including billionaires and oligarchs. We shook some empires that we felt needed shaking.</p><p>Over time, people began to see what I hoped we could show—that having an impact is possible, no matter who you are.</p><p>It has also been rather intense, and at times, all-encompassing. I often wake up from my dreams because I’ve thought of a new investigative thread to pull on in my sleep, or an edit that clarifies a point I didn’t realize I was troubled by during the day. Or from the general pressure of it all. We are not fearless—we just have faith in the truth and hope it leads us down the right path.</p><p>I’m grateful for all of it. We have days of bizarre, hilarious and ridiculous stories and we’ve had a lot of fun amidst the pressure and challenges. It has been the adventure of a lifetime.</p><p>So, why disband now? There is not one specific thing—no particular threat, no health issue, and no big personal issue.</p><p>Someone once told me that at a certain point a successful career becomes a selfish act. Early on, I felt I needed to prove some things to myself. I have now finally found some comfort with myself, probably for the first time in my life. I probably could have had it all along had I let myself, but I needed to put myself through a bit of hell first. The intensity and focus has come at the cost of missing a lot of the rest of the world and the people I care about. I now view Hindenburg as a chapter in my life, not a central thing that defines me.</p><p>Beyond my own desire for relief, it also feels selfish to keep the knowledge we’ve accumulated trapped within our small team. I have more than enough. In the past several years we’ve been flooded with thousands of messages from many of you asking how we do what we do, or whether you can join the team. I read them all and I’ve been trying to figure out how to respond in a way that can answer everyone—so over the next 6 months or so I plan to work on a series of materials and videos to open-source every aspect of our model and how we conduct our investigations.</p><p>My hope is that after we fully share our process, in a couple years I will get an unsolicited message from someone who reads this (maybe you), who embraces the same passion, learns the craft, and finds the confidence to shed some light on a subject that needs it, despite the obstacles in your way. That would make my day, even if I’m off trying to learn music or planting a garden or whatever I end up doing next.</p><p>For now, I will be focused on making sure everyone on our team lands where they want to be next. Some are going to start their own research firm, which I will strongly and publicly encourage, even as I will have no personal involvement. There are others on our team who are now free agents—so feel free to reach out to me if you have a need for anyone who is brilliant, focused, and easy to work with, as they all are.</p><p>It wasn’t always obvious to me, but I now view all of this as a love story. To my wife, you have been so patient with me. It has not been easy, to put it mildly, and I am forever grateful that you have sacrificed so much and pushed forward with me. And now, my dear, we get to enjoy it together for as long as this world will let us.</p><p>To my family and friends, I’m sorry for the times I have ignored you while I let my attention be drawn away. I can’t wait to have more time to share with you together.</p><p>Lastly, I want to express how grateful I am to our readers. Your messages of kindness and encouragement through the years have gone a long way to help give us the strength to continue. And it constantly reminds me that the world is filled with good. Thank you for all of it—I couldn’t ask for more. It is all a blessing.</p><p>With unfathomable levels of gratitude,</p><p>(P.S. If you are chasing something you think you want or need, or are doubting whether you are enough, take a minute and give this a <a href=\"https://www.youtube.com/watch?v=h96MGcsi7GQ\">listen</a>. It had a big impact on me at a pivotal time.)</p>","contentLength":7011,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42717234"},{"title":"TikTok preparing for U.S. shut-off on Sunday","url":"https://www.reuters.com/technology/tiktok-preparing-us-shut-off-sunday-information-reports-2025-01-15/","date":1736945851,"author":"xnhbx","guid":206,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42710339"},{"title":"Nobody cares","url":"https://grantslatton.com/nobody-cares","date":1736914543,"author":"fzliu","guid":205,"unread":true,"content":"<p>N.B. I'm in a mood tonight, so this will be less of a well-considered essay and more of a rant, partially in the vein of <a href=\"https://kieranhealy.org/files/papers/fuck-nuance.pdf\"></a>. Don't take anything here  seriously.</p><p><strong>Why does nobody care about anything?</strong> The world is full of stuff that could be excellent with just 1% more effort. But people don't care.</p><p>Have you been to the DMV? It sucked? There is a human being whose job it is to be in charge of the DMV. They do not care that it sucks.</p><p>Ever used a piece of software that's buggy as hell, looks bad, but still costs money, presumably because the company behind it has found some regulatory capture to justify their existence? The programmer who wrote it probably doesn't care. Their manager definitely doesn't care. The regulators don't care.</p><p>I've met a few people that work for municipal governments. Not politicians, just career bureaucrats deep in the system. I ask them what their favorite part of the job is. They all say \"stability\" or \"job security\" as their #1. It takes 18 months to get the city to permit your shed? They. Do. Not. Care.</p><p>Here's a dumb example. This bike lane ends at the bottom of a hill near me. It merges onto the sidewalk at a crazy sharp angle. Cyclists are coming down this hill at 20mph or so. Tons of people can't make this angle at that speed and hit the vertical curb face, damaging their bike and injuring themselves. If they're unlucky, they go flying into the signpost.</p><p>Why does this ramp suck so much? For literally the exact same effort it took to build, it could have been built 10x better. Make the angle 20 degrees instead of 70. Put the ramp just after the sign instead of just before it. Make the far curb face sloped instead of vertical. Put some visual indication the lane ends 50 feet uphill. Why wasn't this done?</p><p><strong>Because the engineer who designed it and the managers at the department of transportation do not give a shit</strong>.</p><p>This isn't even a pro- or anti-bikes thing. The ramp was getting built by whatever mandate. You're the engineer. Do you make it bad, or do you spend 1% more time thinking about it and make it good for literally the same cost? You make it bad, because you do not care.</p><p>I actually pointed this ramp out to the director of the Seattle Department of Transportation during a walking tour. He made a note of it over a year ago that I assume was promptly forgotten about. He does not care.</p><p>These new lights objectively suck to anyone not driving. If your house is near one, they suck. If you're walking your dog at night (which starts at 5PM for much of the year in Seattle), they  suck.</p><p>But whoever made the decision to switch the lights does not care. It's entirely possible they don't even live in the city, but instead live in a pleasant exurb. Or maybe they don't walk at night and have never considered that other people do.</p><p>White LEDs reduce car crashes by 0.1% and that is measurable, but sleep quality and aesthetics are not measurable. You just have to care about them. And nobody cares.</p><p>But that's enough city stuff. Plenty of people don't care about plenty of other things.</p><p>You put on your turn signal in traffic to merge. The person who could let you in is looking straight ahead, zoned out. Why would they look around to see if they could cooperate with anyone? They're already in the lane they need to be in. They. Do. Not. Care.</p><p>You're at the airport. There's a group in front of you on the escalator taking up the full width, preventing anyone from walking by. They do not care.</p><p>You're on the sidewalk and someone has headphones in, walking in the center of the path. A mom and stroller are behind them. They can't hear her \"excuse me\" to get their attention. They have not even considered the possibility that anyone in the world exists but them. They do not care.</p><p>The McDonald's touch-screen self-order kiosk takes 27 clicks to get a meal. They try to up-sell you 3 times. Just let me pay for my fucking burger, Jesus Christ. The product manager, the programmer, the executives. None of these people care.</p><p>At work the junior engineer sends you some code to review. The code was clearly written in a first draft, and then just iteratively patched until the tests passed, then immediately sent to you to review without any further improvement. They do not care.</p><p>The guy on the hiking trail is playing his shitty EDM on his bluetooth speaker, ruining nature for everyone else. He does not care.</p><p>The doctor misdiagnoses your illness whose symptoms are in the first paragraph of the trivially googleable wikipedia article. He does not care.</p><p>People don't pick up after their dogs. The guy at the gym doesn't re-rack the weights. The lady at the grocery store leaves the cart in the middle of the parking lot. They. Do. Not. Care.</p><p>I could continue in this vein for another few pages, but it would be boring and you get the point. We are surrounded by antisocial bastards.</p><p>Some of them like the people who don't pick up after their dogs are legitimately just assholes.</p><p>Others, like the bureaucrats in the city who mess up our lives in more indirect ways are more victims of The System. But they are still guilty of lacking the personal agency to fight it or leave in protest, and I still — potentially unjustly — condemn them.</p><p>We have examples like Elon who, through sheer force of will, defeats armies of people who don't care. For his many faults, you can't say the man doesn't care.</p><p>When I  my former Big Tech job, everyone cared. Over time, <a href=\"https://blog.sbensu.com/posts/incentives-as-selection-effects/\">incentives attracted</a> a different set of people who didn't care as much. Eventually those people became the majority. It's painful to work with people who don't care if you care a lot, and eventually I left because of it.</p><p>Now, I'm at a small startup full of people who care. Customer bug reports go right to our chatroom. We fix them immediately. I feel guilty I wrote the bugs at all. We reach out to users to see if we can make their lives better. We care.</p><p>I want to live in a community where everyone cares.</p><p>The one place in the world you get this vibe is probably Japan. Most people just . Patrick McKenzie refers to this as <a href=\"https://x.com/search?q=from%3Apatio11+nice+things\"><em>the will to have nice things</em></a>. Japan has it, and the US mostly does not.</p><p>In Japan, you get the impression that everyone takes their job and role in society seriously. The median Japanese 7-11 clerk takes their job more seriously than the median US city bureaucrat. And the result is obvious if you visit both places.</p><p>Is it possible for us to care in the US? To foster the will to have nice things? I think we actually had this in the aftermath of WW2. The country was mostly on the same page about progress, values, the future. But over a few generations, more and more people defect. Living among defectors is demoralizing and causes more defections (much like my own departure from my Big Tech job!). Eventually society is full of defectors.</p><p>But I don't think this is a full explanation. Most people aren't , they merely won't go  to add to the world. And I can feel myself getting pulled in that direction.</p><p>I used to go a lot more out of my way to add to the world. A few years ago, <a href=\"https://x.com/GrantSlatton/status/1742621644022305246\">I installed</a> a bunch of dog bag dispensers on the telephone poles of my neighborhood. I still keep them stocked.</p><p>I was, somewhat naively, hoping that somehow I could get a snowball of care going. I built curb ramps on legacy curbs that lacked them. I lobbied the city to <a href=\"https://maps.app.goo.gl/dGoH7hL9ytXKNXaRA\">open new park space</a>. Improve crosswalks. And much more!</p><p>But the snowball never started. Nobody cares. Rather, there is a tiny minority of activists who care. They spend all their free time doing activist stuff — basically fighting the city to try to make the bureaucrats care about little bits here and there.</p><p>But I've come to accept that I just don't have the disposition to fight all the time. I'm not a fighter. I care  and I just want to live in a place where other people care.</p><p>We're not going to move to Japan, but would absolutely be willing to move within the US.</p><p>Does such a community really exist? Where  cares? Or at least a supermajority? Or does it need to be built?</p>","contentLength":7948,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42707238"},{"title":"I Switched to Firefox and Never Looked Back","url":"https://www.howtogeek.com/why-i-switched-to-firefox-and-never-looked-back/","date":1736854678,"author":"Vinnl","guid":204,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42696081"},{"title":"FFmpeg by Example","url":"https://ffmpegbyexample.com/","date":1736848695,"author":"piyushsthr","guid":203,"unread":true,"content":"<p>If you feel like this example could be improved, you may edit this example <a href=\"https://ffmpegbyexample.com/edit/0484NAFV\">here</a>.</p>","contentLength":80,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=42695547"}]}