{"id":"Y2iXpRRkNSnxtBLmMYZFrnqj4bsEj1XB8agfaptmWsYpB","title":"vladkens.cc","displayTitle":"Dev - vladkens","url":"https://vnotes.pages.dev/atom.xml","feedLink":"https://vladkens.cc/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":1,"items":[{"title":"From iTerm To WezTerm","url":"https://vladkens.cc/from-iterm-to-wezterm/","date":1736380800,"author":"Unknown","guid":700,"unread":true,"content":"<p>For many years, I used <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/gnachman/iTerm2\">iTerm2</a> as my main terminal emulator and probably spent hundreds of hours in it. Overall, I was satisfied with it, despite some strange recent updates like adding AI features, KeyChain integration, and <a rel=\"noopener\" target=\"_blank\" href=\"https://news.ycombinator.com/item?id=42579472\">security vulnerabilities</a>.</p><p>In recent years, new terminal emulators have appeared. I tried using them mainly for testing <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/vladkens/macmon\">macmon</a>. A couple of years ago, I tried switching to <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/kovidgoyal/kitty\">kitty</a>, which was faster due to GPU acceleration. However, it required too much customization and still looked very non-native for macOS. GPU acceleration was added to iTerm as well, so I stayed with it.</p><p>I also tried <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/alacritty/alacritty\">Alacritty</a>, but it is very basic and lacks the features I need. Recently, I tested <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/ghostty-org/ghostty\">Ghostty</a>, which has gained huge attention – it has nice defaults, but its RAM usage is concerning (around 250MB per empty tab). Currently, it also lacks <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/ghostty-org/ghostty/issues/189\">buffer search</a>, which makes the terminal useless for me.</p><p>I heard a lot of positive feedback about <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/wez/wezterm\">WezTerm</a> from <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/bobuk\">bobuk</a>. So I decided to try it out and use it for some time – and I am very satisfied with it.</p><p>The next part of the article will be about how to make WezTerm understandable for iTerm users to try it or switch completely.</p><p>WezTerm can be installed from Homebrew:</p><p>When you first open WezTerm, it looks plain, non-native, and not very functional. But actually, it has everything you need. This is because WezTerm is cross-platform, unlike iTerm2, so the author left minimal default settings, leaving the rest of the configuration to the user. My goal is to achieve a similar experience in WezTerm as I had in iTerm.</p><p>WezTerm does not have a graphical interface for configuration, and the setup is done through a Lua file (this is unusual for me, but Vim users are familiar with it). The configuration file can be located at  or <code>~/.config/wezterm/wezterm.lua</code>. I prefer the second path because it is where <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/fish-shell/fish-shell\">Fish</a> and <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/starship/starship\">starship</a> store configs too.</p><p>Create a configuration file:</p><pre data-lang=\"sh\"><code data-lang=\"sh\"></code></pre><p>And then add the boilerplate code for configuration:</p><pre data-lang=\"lua\"><code data-lang=\"lua\"></code></pre><p>First, I want to change the default font, its size, and disable ligatures (because it's important to see the actual characters in case of some logs).</p><pre data-lang=\"lua\"><code data-lang=\"lua\"></code></pre><p>Save the file, and the changes should be applied immediately (yes, no reload required!).</p><p>Next, I want to change the theme and set it to follow the current system theme automatically. For the past year, I have been using <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/catppuccin/catppuccin\">Catppuccin</a> themes, and I am very happy with them. They rarely have issues where some text colors blend with the background. To make the theme switch automatically based on the current system theme, we need to write a small Lua function (I copied it from the documentation):</p><pre data-lang=\"lua\"><code data-lang=\"lua\"></code></pre><p>I forgot to mention that the Catppuccin theme, like many other popular themes, is pre-installed in WezTerm, so you don't need to install it separately like in iTerm, which is very cool. Of course, you can also set up <a rel=\"noopener\" target=\"_blank\" href=\"https://wezfurlong.org/wezterm/config/appearance.html#defining-your-own-colors\">your own colors</a>.</p><p>The default padding also seems a bit large, so let's make it smaller. I also had a Blinking Line Cursor (I don't remember if this is the default or not in iTerm). Let's set both configurations:</p><pre data-lang=\"lua\"><code data-lang=\"lua\"></code></pre><p>In iTerm, I used the Minimal theme to save vertical space for tabs. We can do the same in WezTerm (the default tabs don't look very good). Also possible to add some transparency and blur to the window. I didn't use this in iTerm, but let's try it now:</p><pre data-lang=\"lua\"><code data-lang=\"lua\"></code></pre><p>In iTerm, I usually set large values for Cols/Rows to make the start window bigger. This approach is a bit outdated, so let's make the window open in full screen when the terminal starts.</p><pre data-lang=\"lua\"><code data-lang=\"lua\"></code></pre><p>Finally, the most important part is setting up hotkeys – it's hard to give up what you've been used to for years. An important thing for me is Split Panels with  / .  should close the current active panel, not the whole tab.  – clear the current screen.  /  for start/end of the line. I think these are all defaults from iTerm, so let's make them the same in WezTerm:</p><pre data-lang=\"lua\"><code data-lang=\"lua\"></code></pre><p>WezTerm also has a Command Execution menu. I haven't used it much yet, but just in case, I bind it to the same keys as in VSCode / Zed – .</p><p><em>Note: In the configuration, the  value is case-sensitive, so  and  are different things (basically  is the same as ). I initially got confused with this.</em></p><p>Overall, I am very satisfied with WezTerm and have fully switched to using it daily. One cool feature I want to mention is the quick connect to servers in Known hosts via SSH (Command Palette → type server name → Enter OR Nav Bar → Shell → Click on server name). WezTerm also has <a rel=\"noopener\" target=\"_blank\" href=\"https://wezfurlong.org/wezterm/recipes/workspaces.html\">Workspaces</a> – an alternative to tmux, but I haven't used it actively yet.</p><p>Here a <a rel=\"noopener\" target=\"_blank\" href=\"https://gist.github.com/vladkens/f2ae7c374c1752c4b1581c5e7dffa900\">gist</a> with the final config from this article.</p>","contentLength":4549,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev"]}